#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PC_Female

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ABP_PC_Female_structs.hpp"
#include "Palia_structs.hpp"
#include "Palia_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PC_Female.ABP_PC_Female_C
// 0x6110 (0x6C10 - 0x0B00)
class UABP_PC_Female_C : public UVAL_ValeriaPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PC_Female::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0B08(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0B18(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0B20(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0B28(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0B48(0x00B8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0C00(0x0128)()
	uint8                                         Pad_4677[0x8];                                     // 0x0D28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_3;                         // 0x0D30(0x0280)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_2;                         // 0x0FB0(0x0280)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1230(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x1250(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x1378(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x14A0(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x15C8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x15E8(0x0128)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1710(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x1758(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x17D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x1800(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1828(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x1848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x1870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x1898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x18C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x18E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x1910(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x1938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x1960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x1988(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x19B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x19D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x1A00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x1A28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x1A50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x1A78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x1AA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x1AC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x1AF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x1B18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x1B40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x1B68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x1B90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x1BB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x1BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x1C08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x1C30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x1C58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x1C80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x1CA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x1CD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x1CF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x1D20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x1D48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x1D70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x1D98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x1DC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x1DE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x1E10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x1E38(0x0028)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_8;           // 0x1E60(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x1F18(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_17;            // 0x1F38(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x1FF8(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_16;            // 0x2018(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x20D8(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_15;            // 0x20F8(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x21B8(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_14;            // 0x21D8(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x2298(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_13;            // 0x22B8(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x2378(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_12;            // 0x2398(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x2458(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_2;                       // 0x2478(0x0120)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_11;            // 0x2598(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x2658(0x0020)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_7;           // 0x2678(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x2730(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_10;            // 0x2750(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x2810(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0x2830(0x0120)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_9;             // 0x2950(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x2A10(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_8;             // 0x2A30(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x2AF0(0x0020)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_6;           // 0x2B10(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x2BC8(0x0020)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_5;           // 0x2BE8(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x2CA0(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x2CC0(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x2DE0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x2E28(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x2EF0(0x0048)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_4;           // 0x2F38(0x00B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x2FF0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x3038(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x3100(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x3148(0x00C8)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_3;           // 0x3210(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x32C8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x32E8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x33B0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x3430(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x34B0(0x0048)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x34F8(0x0110)()
	struct FAnimNode_LookAtBlendSpaceByMapping    AnimGraphNode_LookAtBlendSpaceByMapping;           // 0x3608(0x0140)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x3748(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x3790(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x3880(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x38A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x38F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x3918(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x3940(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x3968(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x3990(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x39B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x39E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x3A08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x3A30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x3A58(0x0028)()
	struct FAnimNode_EvalSequenceByMapping        AnimGraphNode_EvalSequenceByMapping_2;             // 0x3A80(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x3B10(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x3B30(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x3B58(0x0020)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_2;           // 0x3B78(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x3C30(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_7;             // 0x3C50(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x3D10(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x3D30(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x3D58(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x3DA0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x3DE8(0x00F0)()
	struct FAnimNode_EvalSequenceByMapping        AnimGraphNode_EvalSequenceByMapping_1;             // 0x3ED8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x3F68(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x3F88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x3FB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x3FD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x4000(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x4028(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x4050(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x4078(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x40A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x40C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x40F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x4118(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x4140(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x4168(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x4190(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x41B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x41E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x4208(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x4230(0x0028)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_6;             // 0x4258(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x4318(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_5;             // 0x4338(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x43F8(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_4;             // 0x4418(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x44D8(0x0020)()
	struct FAnimNode_RandomSequenceByMapping      AnimGraphNode_RandomSequenceByMapping;             // 0x44F8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x4588(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x45A8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x4670(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_3;             // 0x4690(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x4750(0x0020)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_1;           // 0x4770(0x00B8)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping;             // 0x4828(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x48E0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x4928(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_2;             // 0x4948(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x4A08(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x4A28(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x4A50(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x4A98(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x4AE0(0x00F0)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_1;             // 0x4BD0(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x4C90(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x4CB0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x4CD8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x4D20(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x4D68(0x00F0)()
	struct FAnimNode_EvalSequenceByMapping        AnimGraphNode_EvalSequenceByMapping;               // 0x4E58(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x4EE8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x4F08(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x4F30(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x4F78(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x4FC0(0x00F0)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping;               // 0x50B0(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x5170(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x5190(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x51B8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x5280(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x52A0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x5368(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x53E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x5410(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x5438(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x5500(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x5548(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x5568(0x0020)()
	uint8                                         Pad_4678[0x8];                                     // 0x5588(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_1;                            // 0x5590(0x01F0)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik;                              // 0x5780(0x01F0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x5970(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x5A38(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x5B00(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x5B48(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x5B90(0x00C8)()
	uint8                                         Pad_4679[0x8];                                     // 0x5C58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x5C60(0x0280)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x5EE0(0x0280)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x6160(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x6288(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x63B0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x64D8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x6600(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x6728(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x6850(0x0128)()
	class FString                                 CVar_ClimbingIKEnable;                             // 0x6978(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                HandSocketLocation_Left;                           // 0x6988(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HandSocketLocation_Right;                          // 0x69A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKHandEffector_Left;                               // 0x69B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKHandEffector_Right;                              // 0x69D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHandHittingWall_Left;                            // 0x69E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHandHittingWall_Right;                           // 0x69E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_467A[0x2];                                     // 0x69EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKHandHitLocationMultiplier;                       // 0x69EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        LeftHandIKAlpha;                                   // 0x69F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightHandIKAlpha;                                  // 0x69F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LeftHandIKLock;                                    // 0x6A00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RightHandIKLock;                                   // 0x6A01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_467B[0x6];                                     // 0x6A02(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Lock_Interp_Speed;                                 // 0x6A08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Unlock_Interp_Speed;                               // 0x6A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LeanRotator;                                       // 0x6A18(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FBoxSphereBounds                       LeftHandSphere;                                    // 0x6A30(0x0038)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FBoxSphereBounds                       RightHandSphere;                                   // 0x6A68(0x0038)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsLeftHandHigher;                                  // 0x6AA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsIkEnabledThreaded;                               // 0x6AA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_467C[0x6];                                     // 0x6AA2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RightHandRot;                                      // 0x6AA8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               LeftHandRot;                                       // 0x6AC0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Trace_Out_Normal_Left;                             // 0x6AD8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_Out_Normal_Right;                            // 0x6AF0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x6B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_467D[0x4];                                     // 0x6B0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Foot_IK_L_Offset;                                  // 0x6B10(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Foot_IK_R_Offset;                                  // 0x6B28(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Foot_IK_L_Rotation_Offset;                         // 0x6B40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Foot_IK_R_Rotation_Offset;                         // 0x6B58(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Foot_IK_Pelvis_Offset;                             // 0x6B70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Foot_IK_Pelvis_Offset_Alpha;                       // 0x6B88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_467E[0x4];                                     // 0x6B8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Foot_Ik_R_Target;                                  // 0x6B90(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Foot_Ik_L_Target;                                  // 0x6BA8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootIKStartTraceDistance;                          // 0x6BC0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootIKEndTraceDistance;                            // 0x6BD8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IKFootHeight;                                      // 0x6BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CVar_FootIKEnable;                                 // 0x6BF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          FootIKEnabled;                                     // 0x6C08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_AbilityLockIn();
	void AnimNotify_EnterCatchOnWall();
	void AnimNotify_EnterFallLoop();
	void AnimNotify_EnterJumpLand();
	void AnimNotify_EnterJumpLoop();
	void AnimNotify_EnterJumpPedal();
	void AnimNotify_EnterJumpStart();
	void AnimNotify_FishingDone();
	void AnimNotify_Hide_Fish();
	void AnimNotify_InspirationEnd();
	void AnimNotify_LeftHandClimb();
	void AnimNotify_LeftHandClimbingIK();
	void AnimNotify_LeftHandIKLock();
	void AnimNotify_LeftHandIKUnLock();
	void AnimNotify_NotifyShowArrow();
	void AnimNotify_RightHandClimb();
	void AnimNotify_RightHandClimbingIK();
	void AnimNotify_RightHandIKLock();
	void AnimNotify_RightHandIKUnLock();
