#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Jina_PostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Jina_PostProcess.ABP_Jina_PostProcess_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_Jina_PostProcess_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Jina_PostProcess_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Jina_PostProcess_C_AnimGraph");
static_assert(sizeof(ABP_Jina_PostProcess_C_AnimGraph) == 0x000020, "Wrong size on ABP_Jina_PostProcess_C_AnimGraph");
static_assert(offsetof(ABP_Jina_PostProcess_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_Jina_PostProcess_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_Jina_PostProcess_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'ABP_Jina_PostProcess_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_Jina_PostProcess.ABP_Jina_PostProcess_C.ExecuteUbergraph_ABP_Jina_PostProcess
// 0x0008 (0x0008 - 0x0000)
struct ABP_Jina_PostProcess_C_ExecuteUbergraph_ABP_Jina_PostProcess final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Jina_PostProcess_C_ExecuteUbergraph_ABP_Jina_PostProcess) == 0x000004, "Wrong alignment on ABP_Jina_PostProcess_C_ExecuteUbergraph_ABP_Jina_PostProcess");
static_assert(sizeof(ABP_Jina_PostProcess_C_ExecuteUbergraph_ABP_Jina_PostProcess) == 0x000008, "Wrong size on ABP_Jina_PostProcess_C_ExecuteUbergraph_ABP_Jina_PostProcess");
static_assert(offsetof(ABP_Jina_PostProcess_C_ExecuteUbergraph_ABP_Jina_PostProcess, EntryPoint) == 0x000000, "Member 'ABP_Jina_PostProcess_C_ExecuteUbergraph_ABP_Jina_PostProcess::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Jina_PostProcess_C_ExecuteUbergraph_ABP_Jina_PostProcess, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'ABP_Jina_PostProcess_C_ExecuteUbergraph_ABP_Jina_PostProcess::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");

}

