#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Base_Head

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Base_Head.ABP_Base_Head_C.AnimBlueprintGeneratedConstantData
// 0x0107 (0x0108 - 0x0001)
struct ABP_Base_Head::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_528F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_46;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5290[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_47;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_48;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_49;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_50;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_51;                                 // 0x0022(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5291[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_52;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_53;                                 // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_54;                                 // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_55;                                  // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5292[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_56;                               // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0070(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00F0(0x0018)()
};
static_assert(alignof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Base_Head::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData) == 0x000108, "Wrong size on ABP_Base_Head::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, __NameProperty_46) == 0x000004, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::__NameProperty_46' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, __BlendProfile_47) == 0x000010, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::__BlendProfile_47' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, __CurveFloat_48) == 0x000018, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::__CurveFloat_48' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, __BoolProperty_49) == 0x000020, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::__BoolProperty_49' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, __EnumProperty_50) == 0x000021, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::__EnumProperty_50' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, __EnumProperty_51) == 0x000022, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::__EnumProperty_51' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, __ArrayProperty_52) == 0x000028, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::__ArrayProperty_52' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, __NameProperty_53) == 0x000038, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::__NameProperty_53' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, __NameProperty_54) == 0x000040, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::__NameProperty_54' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, __IntProperty_55) == 0x000048, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::__IntProperty_55' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, __StructProperty_56) == 0x000050, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::__StructProperty_56' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000070, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000F0, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Base_Head.ABP_Base_Head_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_Base_Head::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Base_Head::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_Base_Head::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Base_Head::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_Base_Head::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Base_Head::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_Base_Head::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

