#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Male_Hair_Bun

#include "Basic.hpp"

#include "F_HairMorphAlphas_structs.hpp"
#include "Engine_structs.hpp"
#include "E_HairMorphOptions_structs.hpp"


namespace SDK::Params
{

// Function ABP_Male_Hair_Bun.ABP_Male_Hair_Bun_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Male_Hair_Bun_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Male_Hair_Bun_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Male_Hair_Bun_C_AnimGraph");
static_assert(sizeof(ABP_Male_Hair_Bun_C_AnimGraph) == 0x000010, "Wrong size on ABP_Male_Hair_Bun_C_AnimGraph");
static_assert(offsetof(ABP_Male_Hair_Bun_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_Male_Hair_Bun_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_Male_Hair_Bun.ABP_Male_Hair_Bun_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Male_Hair_Bun_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Male_Hair_Bun_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Male_Hair_Bun_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Male_Hair_Bun_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Male_Hair_Bun_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Male_Hair_Bun_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Male_Hair_Bun_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Male_Hair_Bun.ABP_Male_Hair_Bun_C.ExecuteUbergraph_ABP_Male_Hair_Bun
// 0x00E8 (0x00E8 - 0x0000)
struct ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x000C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_HairMorphOptions                            K2Node_CustomEvent_CurrentMorph;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A7[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMorphTarget_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMorphTarget_ReturnValue_1;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMorphTarget_ReturnValue_2;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A8[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_HairMorphOptions                            Temp_byte_Variable;                                // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_HairMorphOptions                            Temp_byte_Variable_1;                              // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_HairMorphAlphas                     CallFunc_Map_Find_Value;                           // 0x0060(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A9[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_HairMorphOptions                            Temp_byte_Variable_2;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60AA[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60AB[0x1];                                     // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60AC[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item;                           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60AD[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_HairMorphOptions                            K2Node_Select_Default;                             // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60AE[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun) == 0x000008, "Wrong alignment on ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun");
static_assert(sizeof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun) == 0x0000E8, "Wrong size on ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, EntryPoint) == 0x000000, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, Temp_real_Variable) == 0x00000C, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, K2Node_CustomEvent_CurrentMorph) == 0x000014, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::K2Node_CustomEvent_CurrentMorph' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_GetOwningComponent_ReturnValue) == 0x000018, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_GetMorphTarget_ReturnValue) == 0x000020, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_GetMorphTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_GetMorphTarget_ReturnValue_1) == 0x000034, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_GetMorphTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_GetMorphTarget_ReturnValue_2) == 0x000040, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_GetMorphTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, K2Node_MakeArray_Array) == 0x000048, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_Array_Contains_ReturnValue) == 0x00005C, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_Less_IntInt_ReturnValue) == 0x00005D, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, Temp_byte_Variable) == 0x00005E, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, Temp_byte_Variable_1) == 0x00005F, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_Map_Find_Value) == 0x000060, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_Map_Find_ReturnValue) == 0x000098, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000099, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_GetOwningActor_ReturnValue) == 0x0000A0, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, Temp_byte_Variable_2) == 0x0000A8, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_GetOwner_ReturnValue) == 0x0000B0, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_GetPlayerController_ReturnValue) == 0x0000B8, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_IsServer_ReturnValue) == 0x0000C0, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000C1, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_Not_PreBool_ReturnValue) == 0x0000C2, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, Temp_int_Array_Index_Variable) == 0x0000C4, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_BooleanAND_ReturnValue) == 0x0000C8, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_Array_Get_Item) == 0x0000CC, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D0, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x0000D1, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, Temp_bool_True_if_break_was_hit_Variable) == 0x0000D2, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000D3, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_BooleanAND_ReturnValue_2) == 0x0000D4, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, Temp_int_Variable) == 0x0000D8, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, K2Node_Select_Default) == 0x0000DC, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x0000E0, "Member 'ABP_Male_Hair_Bun_C_ExecuteUbergraph_ABP_Male_Hair_Bun::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABP_Male_Hair_Bun.ABP_Male_Hair_Bun_C.SetAlphas
// 0x0001 (0x0001 - 0x0000)
struct ABP_Male_Hair_Bun_C_SetAlphas final
{
public:
	E_HairMorphOptions                            CurrentMorph;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Male_Hair_Bun_C_SetAlphas) == 0x000001, "Wrong alignment on ABP_Male_Hair_Bun_C_SetAlphas");
static_assert(sizeof(ABP_Male_Hair_Bun_C_SetAlphas) == 0x000001, "Wrong size on ABP_Male_Hair_Bun_C_SetAlphas");
static_assert(offsetof(ABP_Male_Hair_Bun_C_SetAlphas, CurrentMorph) == 0x000000, "Member 'ABP_Male_Hair_Bun_C_SetAlphas::CurrentMorph' has a wrong offset!");

}

