#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Valerian

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_Valerian.ABP_Valerian_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Valerian_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Valerian_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Valerian_C_AnimGraph");
static_assert(sizeof(ABP_Valerian_C_AnimGraph) == 0x000010, "Wrong size on ABP_Valerian_C_AnimGraph");
static_assert(offsetof(ABP_Valerian_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_Valerian_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_Valerian.ABP_Valerian_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Valerian_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Valerian_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Valerian_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Valerian_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Valerian_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Valerian_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Valerian_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Valerian.ABP_Valerian_C.CustomEvent_0
// 0x0010 (0x0010 - 0x0000)
struct ABP_Valerian_C_CustomEvent_0 final
{
public:
	class UDialogueComponent*                     Diag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      PlayerParticipant;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Valerian_C_CustomEvent_0) == 0x000008, "Wrong alignment on ABP_Valerian_C_CustomEvent_0");
static_assert(sizeof(ABP_Valerian_C_CustomEvent_0) == 0x000010, "Wrong size on ABP_Valerian_C_CustomEvent_0");
static_assert(offsetof(ABP_Valerian_C_CustomEvent_0, Diag) == 0x000000, "Member 'ABP_Valerian_C_CustomEvent_0::Diag' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_CustomEvent_0, PlayerParticipant) == 0x000008, "Member 'ABP_Valerian_C_CustomEvent_0::PlayerParticipant' has a wrong offset!");

// Function ABP_Valerian.ABP_Valerian_C.CustomEvent_1
// 0x0010 (0x0010 - 0x0000)
struct ABP_Valerian_C_CustomEvent_1 final
{
public:
	class UDialogueComponent*                     Diag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      PlayerParticipant;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Valerian_C_CustomEvent_1) == 0x000008, "Wrong alignment on ABP_Valerian_C_CustomEvent_1");
static_assert(sizeof(ABP_Valerian_C_CustomEvent_1) == 0x000010, "Wrong size on ABP_Valerian_C_CustomEvent_1");
static_assert(offsetof(ABP_Valerian_C_CustomEvent_1, Diag) == 0x000000, "Member 'ABP_Valerian_C_CustomEvent_1::Diag' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_CustomEvent_1, PlayerParticipant) == 0x000008, "Member 'ABP_Valerian_C_CustomEvent_1::PlayerParticipant' has a wrong offset!");

// Function ABP_Valerian.ABP_Valerian_C.ExecuteUbergraph_ABP_Valerian
// 0x0140 (0x0140 - 0x0000)
struct ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C71[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UDialogueComponent* Diag, class AValeriaCharacter* PlayerParticipant)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDialogueComponent* Diag, class AValeriaCharacter* PlayerParticipant)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaMoveablePawn* Pawn, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C72[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaVillagerCharacter*              K2Node_DynamicCast_AsValeria_Villager_Character;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C73[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaMoveablePawn*                   K2Node_CustomEvent_Pawn;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_PrevMovementMode;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_PreviousCustomMode;             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C74[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C75[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSlotMontageGlobalWeight_ReturnValue;   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C76[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogueComponent*                     K2Node_CustomEvent_diag_1;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_CustomEvent_playerParticipant_1;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDialogueComponent*                     CallFunc_GetDialogue_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyEngagedForDialogue_ReturnValue;  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C77[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogueComponent*                     K2Node_CustomEvent_diag;                           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_CustomEvent_playerParticipant;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyEngagedForDialogue_ReturnValue_1; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C78[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C79[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C7A[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C7B[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValeriaTimestampSecs_ReturnValue;      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValeriaTimestampSecs_ReturnValue_1;    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C7C[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPNE_CanFidget_ReturnValue;               // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C7D[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_PassedDeltaTime_ImplicitCast;   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_UpperBodyBlend_ImplicitCast;    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian) == 0x000008, "Wrong alignment on ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian");
static_assert(sizeof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian) == 0x000140, "Wrong size on ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, EntryPoint) == 0x000000, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000004, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000005, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_Event_DeltaTimeX) == 0x000038, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000040, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_DynamicCast_AsValeria_Villager_Character) == 0x000048, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_DynamicCast_AsValeria_Villager_Character' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_CustomEvent_Pawn) == 0x000058, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_CustomEvent_Pawn' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_CustomEvent_PrevMovementMode) == 0x000060, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_CustomEvent_PrevMovementMode' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_CustomEvent_PreviousCustomMode) == 0x000061, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_CustomEvent_PreviousCustomMode' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_IsFalling_ReturnValue) == 0x000062, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_GetVelocity_ReturnValue) == 0x000068, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_VSize_ReturnValue) == 0x000080, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000088, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000089, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_Not_PreBool_ReturnValue) == 0x00008A, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_BooleanAND_ReturnValue) == 0x00008B, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_BooleanAND_ReturnValue_1) == 0x00008C, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_GetSlotMontageGlobalWeight_ReturnValue) == 0x000090, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_GetSlotMontageGlobalWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_CustomEvent_diag_1) == 0x000098, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_CustomEvent_diag_1' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_CustomEvent_playerParticipant_1) == 0x0000A0, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_CustomEvent_playerParticipant_1' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_GetDialogue_ReturnValue) == 0x0000A8, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_GetDialogue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_IsLocallyEngagedForDialogue_ReturnValue) == 0x0000B0, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_IsLocallyEngagedForDialogue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_CustomEvent_diag) == 0x0000B8, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_CustomEvent_diag' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_CustomEvent_playerParticipant) == 0x0000C0, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_CustomEvent_playerParticipant' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_IsLocallyEngagedForDialogue_ReturnValue_1) == 0x0000C8, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_IsLocallyEngagedForDialogue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0000C9, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000CC, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000E0, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000E8, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_RandomFloat_ReturnValue) == 0x0000F0, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_Array_Length_ReturnValue) == 0x0000FC, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_RandomInteger_ReturnValue) == 0x000100, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_GetValeriaTimestampSecs_ReturnValue) == 0x000104, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_GetValeriaTimestampSecs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_GetValeriaTimestampSecs_ReturnValue_1) == 0x000108, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_GetValeriaTimestampSecs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_Subtract_IntInt_ReturnValue) == 0x00010C, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_BooleanOR_ReturnValue) == 0x000110, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000111, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000112, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_BooleanAND_ReturnValue_2) == 0x000113, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_BooleanAND_ReturnValue_3) == 0x000114, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000118, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_Not_PreBool_ReturnValue_2) == 0x00011C, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x00011D, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_BooleanAND_ReturnValue_4) == 0x00011E, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_BooleanAND_ReturnValue_5) == 0x00011F, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000120, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_IsValid_ReturnValue) == 0x000121, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_BPNE_CanFidget_ReturnValue) == 0x000122, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_BPNE_CanFidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_BooleanOR_ReturnValue_1) == 0x000123, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_VariableSet_PassedDeltaTime_ImplicitCast) == 0x000128, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_VariableSet_PassedDeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, K2Node_VariableSet_UpperBodyBlend_ImplicitCast) == 0x000130, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::K2Node_VariableSet_UpperBodyBlend_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000138, "Member 'ABP_Valerian_C_ExecuteUbergraph_ABP_Valerian::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABP_Valerian.ABP_Valerian_C.IsInAir
// 0x0010 (0x0010 - 0x0000)
struct ABP_Valerian_C_IsInAir final
{
public:
	class AValeriaMoveablePawn*                   Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 PrevMovementMode;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Valerian_C_IsInAir) == 0x000008, "Wrong alignment on ABP_Valerian_C_IsInAir");
static_assert(sizeof(ABP_Valerian_C_IsInAir) == 0x000010, "Wrong size on ABP_Valerian_C_IsInAir");
static_assert(offsetof(ABP_Valerian_C_IsInAir, Pawn) == 0x000000, "Member 'ABP_Valerian_C_IsInAir::Pawn' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_IsInAir, PrevMovementMode) == 0x000008, "Member 'ABP_Valerian_C_IsInAir::PrevMovementMode' has a wrong offset!");
static_assert(offsetof(ABP_Valerian_C_IsInAir, PreviousCustomMode) == 0x000009, "Member 'ABP_Valerian_C_IsInAir::PreviousCustomMode' has a wrong offset!");

}

