#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PC_Female

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function ABP_PC_Female.ABP_PC_Female_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PC_Female_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PC_Female_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_PC_Female_C_AnimGraph");
static_assert(sizeof(ABP_PC_Female_C_AnimGraph) == 0x000010, "Wrong size on ABP_PC_Female_C_AnimGraph");
static_assert(offsetof(ABP_PC_Female_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_PC_Female_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_PC_Female.ABP_PC_Female_C.BlueprintThreadSafeUpdateAnimation
// 0x0088 (0x0088 - 0x0000)
struct ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         Param_DeltaTime;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue_1;    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_4;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_5;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_6;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_7;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_2;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_3;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast_1;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast_2;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast_3;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation) == 0x000008, "Wrong alignment on ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation");
static_assert(sizeof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation) == 0x000088, "Wrong size on ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, Param_DeltaTime) == 0x000000, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::Param_DeltaTime' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000004, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_EqualEqual_VectorVector_ReturnValue_1) == 0x000005, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_EqualEqual_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000006, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000007, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000008, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000009, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x00000A, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_EqualEqual_NameName_ReturnValue_4) == 0x00000B, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_EqualEqual_NameName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_EqualEqual_NameName_ReturnValue_5) == 0x00000C, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_EqualEqual_NameName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_EqualEqual_NameName_ReturnValue_6) == 0x00000E, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_EqualEqual_NameName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_BooleanOR_ReturnValue_1) == 0x00000F, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_EqualEqual_NameName_ReturnValue_7) == 0x000010, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_EqualEqual_NameName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_BooleanOR_ReturnValue_2) == 0x000011, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_BooleanOR_ReturnValue_3) == 0x000012, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_BooleanOR_ReturnValue_4) == 0x000013, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_BooleanOR_ReturnValue_5) == 0x000014, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_BooleanOR_ReturnValue_6) == 0x000015, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_BooleanOR_ReturnValue_7) == 0x000016, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_BooleanOR_ReturnValue_8) == 0x000017, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_MapRangeClamped_ReturnValue) == 0x000018, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_FInterpTo_ReturnValue) == 0x000040, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_FInterpTo_ReturnValue_1) == 0x000048, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_FInterpTo_ReturnValue_2) == 0x000050, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_FInterpTo_ReturnValue_3) == 0x000058, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_FInterpTo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x000060, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_FInterpTo_DeltaTime_ImplicitCast_1) == 0x000068, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_FInterpTo_DeltaTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_FInterpTo_DeltaTime_ImplicitCast_2) == 0x000070, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_FInterpTo_DeltaTime_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_FInterpTo_DeltaTime_ImplicitCast_3) == 0x000078, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_FInterpTo_DeltaTime_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000080, "Member 'ABP_PC_Female_C_BlueprintThreadSafeUpdateAnimation::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function ABP_PC_Female.ABP_PC_Female_C.ExecuteUbergraph_ABP_PC_Female
// 0x0370 (0x0370 - 0x0000)
struct ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_2;     // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_3;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_467F[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetHandIKLocation_Hit_Location;           // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHandIKLocation_HasHitWall;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4680[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetHandIKLocation_TraceOutNormal1;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHandIKLocation_Hit_Location_1;         // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHandIKLocation_HasHitWall_1;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4681[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetHandIKLocation_TraceOutNormal1_1;      // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue_1;       // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue_2;       // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue_3;       // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue_4;       // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue_5;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_4;     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_5;     // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_6;     // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_7;     // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue_6;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_8;     // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue_1;         // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_9;     // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_10;    // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_11;    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4682[0x1];                                     // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4683[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4684[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4685[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4686[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4687[0x2];                                     // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_3;                              // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4688[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetClimbDirectionAxisValues_OutX;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetClimbDirectionAxisValues_OutY;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VEase_ReturnValue;                        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4689[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VEase_ReturnValue_1;                      // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_468A[0x6];                                     // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGASComponent*                   CallFunc_GetGAS_ReturnValue;                       // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue;                 // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         CallFunc_GetEquippedItem_ReturnValue;              // 0x0168(0x0050)()
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AEquipViewActor*                        CallFunc_Array_Get_Item;                           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_468B[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Bow_EquipView_C*                    K2Node_DynamicCast_AsBP_Bow_Equip_View;            // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_468C[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFishingComponent*                      CallFunc_GetFishing_ReturnValue;                   // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_468D[0x3];                                     // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_4;                              // 0x01F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x01FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIKEnabled_IsEnabled;                    // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIKEnabled_IsEnabled_1;                  // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_468E[0x2];                                     // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_2;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_468F[0x2];                                     // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x024B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x024E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4690[0x1];                                     // 0x024F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue_1;          // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue_1;             // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AngleBetween_ReturnValue;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4691[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue;      // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AngleBetween_ReturnValue_1;               // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4692[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue_1;    // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x033B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4693[0x2];                                     // 0x033E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_StructMemberSet_ExplicitTime_ImplicitCast;  // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet___FloatProperty_2_ImplicitCast; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet___FloatProperty_1_ImplicitCast; // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast_1;       // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_X_ImplicitCast;             // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Y_ImplicitCast;             // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4694[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_X_ImplicitCast_1;           // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Y_ImplicitCast_1;           // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female) == 0x000008, "Wrong alignment on ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female");
static_assert(sizeof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female) == 0x000370, "Wrong size on ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, EntryPoint) == 0x000000, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000005, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000006, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue_2) == 0x000007, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue_3) == 0x000008, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_BooleanOR_ReturnValue) == 0x000009, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_GetHandIKLocation_Hit_Location) == 0x000010, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_GetHandIKLocation_Hit_Location' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_GetHandIKLocation_HasHitWall) == 0x000028, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_GetHandIKLocation_HasHitWall' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_GetHandIKLocation_TraceOutNormal1) == 0x000030, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_GetHandIKLocation_TraceOutNormal1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_Lerp_ReturnValue) == 0x000048, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_GetHandIKLocation_Hit_Location_1) == 0x000050, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_GetHandIKLocation_Hit_Location_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_GetHandIKLocation_HasHitWall_1) == 0x000068, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_GetHandIKLocation_HasHitWall_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_GetHandIKLocation_TraceOutNormal1_1) == 0x000070, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_GetHandIKLocation_TraceOutNormal1_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x000088, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NotEqual_GameplayTag_ReturnValue_1) == 0x000089, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NotEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_BooleanOR_ReturnValue_1) == 0x00008A, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NotEqual_GameplayTag_ReturnValue_2) == 0x00008B, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NotEqual_GameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NotEqual_GameplayTag_ReturnValue_3) == 0x00008C, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NotEqual_GameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_Not_PreBool_ReturnValue) == 0x00008D, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00008E, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NotEqual_GameplayTag_ReturnValue_4) == 0x00008F, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NotEqual_GameplayTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NotEqual_GameplayTag_ReturnValue_5) == 0x000090, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NotEqual_GameplayTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue_4) == 0x000091, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue_5) == 0x000092, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue_6) == 0x000093, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue_7) == 0x000094, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_BooleanOR_ReturnValue_2) == 0x000095, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000096, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_Not_PreBool_ReturnValue_1) == 0x000097, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NotEqual_GameplayTag_ReturnValue_6) == 0x000098, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NotEqual_GameplayTag_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue_8) == 0x000099, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_BooleanOR_ReturnValue_3) == 0x00009A, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_IsGameplayTagValid_ReturnValue_1) == 0x00009B, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_IsGameplayTagValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_BooleanAND_ReturnValue) == 0x00009C, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue_9) == 0x00009D, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue_10) == 0x00009E, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_BooleanOR_ReturnValue_4) == 0x00009F, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000A0, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000A1, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000A2, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A3, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_EqualEqual_GameplayTag_ReturnValue_11) == 0x0000A4, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_EqualEqual_GameplayTag_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, Temp_bool_Variable) == 0x0000A5, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000A6, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, Temp_name_Variable) == 0x0000A8, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, Temp_name_Variable_1) == 0x0000B4, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000BC, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, Temp_bool_Variable_1) == 0x0000BD, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000BE, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000BF, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x0000C0, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_SelectFloat_ReturnValue) == 0x0000C8, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, Temp_bool_Variable_2) == 0x0000D0, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, Temp_name_Variable_2) == 0x0000D4, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, Temp_bool_Variable_3) == 0x0000DC, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, K2Node_Select_Default) == 0x0000E0, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x0000E8, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, Temp_bool_Variable_4) == 0x0000F0, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000F1, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, Temp_name_Variable_3) == 0x0000F4, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x0000FC, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, K2Node_Select_Default_1) == 0x000100, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_GetClimbDirectionAxisValues_OutX) == 0x000108, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_GetClimbDirectionAxisValues_OutX' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_GetClimbDirectionAxisValues_OutY) == 0x000110, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_GetClimbDirectionAxisValues_OutY' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_VEase_ReturnValue) == 0x000118, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_VEase_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_BooleanOR_ReturnValue_5) == 0x000130, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_Not_PreBool_ReturnValue_4) == 0x000131, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_VEase_ReturnValue_1) == 0x000138, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_VEase_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female, CallFunc_Not_PreBool_ReturnValue_5) == 0x000150, "Member 'ABP_PC_Female_C_ExecuteUbergraph_ABP_PC_Female::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
