#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ak_Continuous

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ak_Continuous.Ak_Continuous_C
// 0x0020 (0x0050 - 0x0030)
class UAk_Continuous_C final : public UAnimNotifyState
{
public:
	class UAkAudioEvent*                          AkEvent_Begin;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Attach_Name;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkActionOnEventType                          Action_Type;                                       // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DE7[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Transition_Duration;                               // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkCurveInterpolation                         Fade_Curve;                                        // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, struct FAnimNotifyEventReference& EventReference, bool CallFunc_IsServer_ReturnValue, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_AkGetComponent_ComponentCreated, class UAkComponent* CallFunc_AkGetComponent_AkComponent, bool CallFunc_IsValid_ReturnValue_2, int32 CallFunc_AkEventComponent_ReturnValue) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, struct FAnimNotifyEventReference& EventReference, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, bool CallFunc_IsServer_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_GetAkNotifyId_ReturnValue, bool CallFunc_IsValid_ReturnValue_1) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ak_Continuous_C">();
	}
	static class UAk_Continuous_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAk_Continuous_C>();
	}
};
static_assert(alignof(UAk_Continuous_C) == 0x000008, "Wrong alignment on UAk_Continuous_C");
static_assert(sizeof(UAk_Continuous_C) == 0x000050, "Wrong size on UAk_Continuous_C");
static_assert(offsetof(UAk_Continuous_C, AkEvent_Begin) == 0x000030, "Member 'UAk_Continuous_C::AkEvent_Begin' has a wrong offset!");
static_assert(offsetof(UAk_Continuous_C, Attach_Name) == 0x000038, "Member 'UAk_Continuous_C::Attach_Name' has a wrong offset!");
static_assert(offsetof(UAk_Continuous_C, Action_Type) == 0x000040, "Member 'UAk_Continuous_C::Action_Type' has a wrong offset!");
static_assert(offsetof(UAk_Continuous_C, Transition_Duration) == 0x000044, "Member 'UAk_Continuous_C::Transition_Duration' has a wrong offset!");
static_assert(offsetof(UAk_Continuous_C, Fade_Curve) == 0x000048, "Member 'UAk_Continuous_C::Fade_Curve' has a wrong offset!");

}

