#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ak_EquippedEffect

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "E_EquippedEvents_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ak_EquippedEffect.Ak_EquippedEffect_C
// 0x0010 (0x0048 - 0x0038)
class UAk_EquippedEffect_C final : public UAnimNotify
{
public:
	E_EquippedEvents                              ToolEvent;                                         // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C29[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Socket;                                            // 0x003C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Follow;                                            // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetNotifyName(const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue) const;
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, struct FAnimNotifyEventReference& EventReference, int32 Temp_int_Array_Index_Variable, class AActor* CallFunc_GetOwner_ReturnValue, class UEquipmentComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FEquipmentItem& CallFunc_GetEquippedItem_ReturnValue, class AActor* CallFunc_Array_Get_Item, class AActor* CallFunc_GetOwner_ReturnValue_1, class ABP_EquipViewActor_C* K2Node_DynamicCast_AsBP_Equip_View_Actor, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct FVector& CallFunc_GetSocketLocation_ReturnValue, int32 Temp_int_Loop_Counter_Variable, class AActor* CallFunc_GetOwner_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, class UAkAudioEvent* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UAkComponent* CallFunc_AkEventSpawnAttached_Ak, int32 CallFunc_AkEventSpawnAttached_Id, class UAkComponent* CallFunc_AkEventLocationWithActor_AkComponent, int32 CallFunc_AkEventLocationWithActor_Playing_ID) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ak_EquippedEffect_C">();
	}
	static class UAk_EquippedEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAk_EquippedEffect_C>();
	}
};
static_assert(alignof(UAk_EquippedEffect_C) == 0x000008, "Wrong alignment on UAk_EquippedEffect_C");
static_assert(sizeof(UAk_EquippedEffect_C) == 0x000048, "Wrong size on UAk_EquippedEffect_C");
static_assert(offsetof(UAk_EquippedEffect_C, ToolEvent) == 0x000038, "Member 'UAk_EquippedEffect_C::ToolEvent' has a wrong offset!");
static_assert(offsetof(UAk_EquippedEffect_C, Socket) == 0x00003C, "Member 'UAk_EquippedEffect_C::Socket' has a wrong offset!");
static_assert(offsetof(UAk_EquippedEffect_C, Follow) == 0x000044, "Member 'UAk_EquippedEffect_C::Follow' has a wrong offset!");

}

