#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ak_EquippedEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Ak_EquippedEffect.Ak_EquippedEffect_C.GetNotifyName
// 0x0030 (0x0030 - 0x0000)
struct Ak_EquippedEffect_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Ak_EquippedEffect_C_GetNotifyName) == 0x000008, "Wrong alignment on Ak_EquippedEffect_C_GetNotifyName");
static_assert(sizeof(Ak_EquippedEffect_C_GetNotifyName) == 0x000030, "Wrong size on Ak_EquippedEffect_C_GetNotifyName");
static_assert(offsetof(Ak_EquippedEffect_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'Ak_EquippedEffect_C_GetNotifyName::ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_GetNotifyName, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'Ak_EquippedEffect_C_GetNotifyName::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_GetNotifyName, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'Ak_EquippedEffect_C_GetNotifyName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function Ak_EquippedEffect.Ak_EquippedEffect_C.Received_Notify
// 0x0140 (0x0140 - 0x0000)
struct Ak_EquippedEffect_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2A[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2B[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentItem                         CallFunc_GetEquippedItem_ReturnValue;              // 0x0060(0x0050)()
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_EquipViewActor_C*                   K2Node_DynamicCast_AsBP_Equip_View_Actor;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2C[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2D[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2E[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2F[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C30[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          CallFunc_Map_Find_Value;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C31[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_AkEventSpawnAttached_Ak;                  // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventSpawnAttached_Id;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C32[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_AkEventLocationWithActor_AkComponent;     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocationWithActor_Playing_ID;      // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ak_EquippedEffect_C_Received_Notify) == 0x000008, "Wrong alignment on Ak_EquippedEffect_C_Received_Notify");
static_assert(sizeof(Ak_EquippedEffect_C_Received_Notify) == 0x000140, "Wrong size on Ak_EquippedEffect_C_Received_Notify");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, MeshComp) == 0x000000, "Member 'Ak_EquippedEffect_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, Animation) == 0x000008, "Member 'Ak_EquippedEffect_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, EventReference) == 0x000010, "Member 'Ak_EquippedEffect_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, ReturnValue) == 0x000040, "Member 'Ak_EquippedEffect_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, Temp_int_Array_Index_Variable) == 0x000044, "Member 'Ak_EquippedEffect_C_Received_Notify::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_GetEquippedItem_ReturnValue) == 0x000060, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_GetEquippedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_GetOwner_ReturnValue_1) == 0x0000B8, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, K2Node_DynamicCast_AsBP_Equip_View_Actor) == 0x0000C0, "Member 'Ak_EquippedEffect_C_Received_Notify::K2Node_DynamicCast_AsBP_Equip_View_Actor' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'Ak_EquippedEffect_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_GetSocketLocation_ReturnValue) == 0x0000D8, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, Temp_int_Loop_Counter_Variable) == 0x0000F0, "Member 'Ak_EquippedEffect_C_Received_Notify::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_GetOwner_ReturnValue_2) == 0x0000F8, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_Add_IntInt_ReturnValue) == 0x000104, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_IsDedicatedServer_ReturnValue) == 0x000108, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_Map_Find_Value) == 0x000110, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_Map_Find_ReturnValue) == 0x000118, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_AkEventSpawnAttached_Ak) == 0x000120, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_AkEventSpawnAttached_Ak' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_AkEventSpawnAttached_Id) == 0x000128, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_AkEventSpawnAttached_Id' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_AkEventLocationWithActor_AkComponent) == 0x000130, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_AkEventLocationWithActor_AkComponent' has a wrong offset!");
static_assert(offsetof(Ak_EquippedEffect_C_Received_Notify, CallFunc_AkEventLocationWithActor_Playing_ID) == 0x000138, "Member 'Ak_EquippedEffect_C_Received_Notify::CallFunc_AkEventLocationWithActor_Playing_ID' has a wrong offset!");

}

