#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ak_OneShot

#include "Basic.hpp"

#include "Ak_OneShot_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ak_OneShot.Ak_OneShot_C
// 0x0018 (0x0060 - 0x0048)
class UAk_OneShot_C final : public UAk_OneShot_Base_C
{
public:
	class FString                                 Attach_Name;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Follow;                                            // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TryCallOnOwner;                                    // 0x0059(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayAudio(class USkeletalMeshComponent* MeshComp, bool* Success, class UAkComponent* Ak, class AActor* Owner, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, int32 CallFunc_AkEventComponent_ReturnValue, int32 CallFunc_AkEventComponent_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, class UAkComponent* CallFunc_AkEventLocationWithActor_AkComponent, int32 CallFunc_AkEventLocationWithActor_Playing_ID, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, class AActor* CallFunc_GetOwner_ReturnValue_1, class FName CallFunc_Conv_StringToName_ReturnValue, bool CallFunc_AkGetComponent_ComponentCreated, class UAkComponent* CallFunc_AkGetComponent_AkComponent, class AActor* CallFunc_GetOwner_ReturnValue_2, class AActor* CallFunc_GetOwner_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_3, class FName CallFunc_Conv_StringToName_ReturnValue_1, bool CallFunc_AkGetComponent_ComponentCreated_1, class UAkComponent* CallFunc_AkGetComponent_AkComponent_1, class FName CallFunc_Conv_StringToName_ReturnValue_2, class AActor* CallFunc_GetOwner_ReturnValue_4, const struct FVector& CallFunc_GetSocketLocation_ReturnValue, class UAkComponent* CallFunc_AkEventLocationWithActor_AkComponent_1, int32 CallFunc_AkEventLocationWithActor_Playing_ID_1) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ak_OneShot_C">();
	}
	static class UAk_OneShot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAk_OneShot_C>();
	}
};
static_assert(alignof(UAk_OneShot_C) == 0x000008, "Wrong alignment on UAk_OneShot_C");
static_assert(sizeof(UAk_OneShot_C) == 0x000060, "Wrong size on UAk_OneShot_C");
static_assert(offsetof(UAk_OneShot_C, Attach_Name) == 0x000048, "Member 'UAk_OneShot_C::Attach_Name' has a wrong offset!");
static_assert(offsetof(UAk_OneShot_C, Follow) == 0x000058, "Member 'UAk_OneShot_C::Follow' has a wrong offset!");
static_assert(offsetof(UAk_OneShot_C, TryCallOnOwner) == 0x000059, "Member 'UAk_OneShot_C::TryCallOnOwner' has a wrong offset!");

}

