#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ak_SurfaceEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"
#include "Struct_Physmat_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_core_Scalability_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function Ak_SurfaceEffect.Ak_SurfaceEffect_C.CheckForWater
// 0x02D8 (0x02D8 - 0x0000)
struct Ak_SurfaceEffect_C_CheckForWater final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4C[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HalfHeightMinusRad;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4D[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaMoveablePawn*                   K2Node_DynamicCast_AsValeria_Moveable_Pawn;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4E[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4F[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMulti_OutHits;                 // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMulti_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A50[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0100(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A51[0x2];                                     // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A52[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A53[0x4];                                     // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ak_SurfaceEffect_C_CheckForWater) == 0x000008, "Wrong alignment on Ak_SurfaceEffect_C_CheckForWater");
static_assert(sizeof(Ak_SurfaceEffect_C_CheckForWater) == 0x0002D8, "Wrong size on Ak_SurfaceEffect_C_CheckForWater");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, Mesh) == 0x000000, "Member 'Ak_SurfaceEffect_C_CheckForWater::Mesh' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, ReturnValue) == 0x000008, "Member 'Ak_SurfaceEffect_C_CheckForWater::ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, Location) == 0x000010, "Member 'Ak_SurfaceEffect_C_CheckForWater::Location' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, HalfHeightMinusRad) == 0x000028, "Member 'Ak_SurfaceEffect_C_CheckForWater::HalfHeightMinusRad' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, Temp_int_Array_Index_Variable) == 0x000030, "Member 'Ak_SurfaceEffect_C_CheckForWater::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, K2Node_DynamicCast_AsValeria_Moveable_Pawn) == 0x000040, "Member 'Ak_SurfaceEffect_C_CheckForWater::K2Node_DynamicCast_AsValeria_Moveable_Pawn' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Ak_SurfaceEffect_C_CheckForWater::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'Ak_SurfaceEffect_C_CheckForWater::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000050, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_MakeVector_ReturnValue) == 0x000078, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, Temp_object_Variable) == 0x0000A8, "Member 'Ak_SurfaceEffect_C_CheckForWater::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_MakeVector_ReturnValue_1) == 0x0000B8, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000D0, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_SphereTraceMulti_OutHits) == 0x0000E8, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_SphereTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_SphereTraceMulti_ReturnValue) == 0x0000F8, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_SphereTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_Array_Get_Item) == 0x000100, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_Array_Length_ReturnValue) == 0x0001E8, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_bBlockingHit) == 0x0001EC, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001ED, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_Time) == 0x0001F0, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_Distance) == 0x0001F4, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_Location) == 0x0001F8, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_ImpactPoint) == 0x000210, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_Normal) == 0x000228, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_ImpactNormal) == 0x000240, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_PhysMat) == 0x000258, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_HitActor) == 0x000260, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_HitComponent) == 0x000268, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_HitBoneName) == 0x000270, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_BoneName) == 0x000278, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_HitItem) == 0x000280, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_ElementIndex) == 0x000284, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_FaceIndex) == 0x000288, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_TraceStart) == 0x000290, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BreakHitResult_TraceEnd) == 0x0002A8, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_Less_IntInt_ReturnValue) == 0x0002C0, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002C1, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0002C2, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_BooleanOR_ReturnValue) == 0x0002C3, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0002C8, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_CheckForWater, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0002D0, "Member 'Ak_SurfaceEffect_C_CheckForWater::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function Ak_SurfaceEffect.Ak_SurfaceEffect_C.GetMaxSpeed
// 0x0078 (0x0078 - 0x0000)
struct Ak_SurfaceEffect_C_GetMaxSpeed final
{
public:
	class UActorComponent*                        Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMovementComponent*                     MovementComp;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 NewLocalVar;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACreatureCharacter*                     K2Node_DynamicCast_AsCreature_Character;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A54[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaCharacterMoveComponent*         K2Node_DynamicCast_AsValeria_Character_Move_Component; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A55[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateMaxSpeed_ReturnValue;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxSpeedAbs_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A56[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxSpeed_ReturnValue;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A57[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_ReturnValue_ImplicitCast_1;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ak_SurfaceEffect_C_GetMaxSpeed) == 0x000008, "Wrong alignment on Ak_SurfaceEffect_C_GetMaxSpeed");
static_assert(sizeof(Ak_SurfaceEffect_C_GetMaxSpeed) == 0x000078, "Wrong size on Ak_SurfaceEffect_C_GetMaxSpeed");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, Target) == 0x000000, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::Target' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, MovementComp) == 0x000008, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::MovementComp' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, ReturnValue) == 0x000010, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, NewLocalVar) == 0x000018, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::NewLocalVar' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, K2Node_DynamicCast_AsCreature_Character) == 0x000028, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::K2Node_DynamicCast_AsCreature_Character' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, K2Node_DynamicCast_AsValeria_Character_Move_Component) == 0x000038, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::K2Node_DynamicCast_AsValeria_Character_Move_Component' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, CallFunc_CalculateMaxSpeed_ReturnValue) == 0x000044, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::CallFunc_CalculateMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, CallFunc_GetMaxSpeedAbs_ReturnValue) == 0x000048, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::CallFunc_GetMaxSpeedAbs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, CallFunc_GetMaxSpeed_ReturnValue) == 0x000050, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::CallFunc_GetMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000060, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, K2Node_FunctionResult_ReturnValue_ImplicitCast_1) == 0x000068, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::K2Node_FunctionResult_ReturnValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetMaxSpeed, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'Ak_SurfaceEffect_C_GetMaxSpeed::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Ak_SurfaceEffect.Ak_SurfaceEffect_C.GetPhysmatEffectData
// 0x0030 (0x0030 - 0x0000)
struct Ak_SurfaceEffect_C_GetPhysmatEffectData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysmatEffect_C*                       PhysmatEffect;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A58[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UComp_CreatureAudio_C*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPhysmatEffect_C*                       CallFunc_FindInCreatureSurfaceMap_Value;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindInCreatureSurfaceMap_Found;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ak_SurfaceEffect_C_GetPhysmatEffectData) == 0x000008, "Wrong alignment on Ak_SurfaceEffect_C_GetPhysmatEffectData");
static_assert(sizeof(Ak_SurfaceEffect_C_GetPhysmatEffectData) == 0x000030, "Wrong size on Ak_SurfaceEffect_C_GetPhysmatEffectData");
static_assert(offsetof(Ak_SurfaceEffect_C_GetPhysmatEffectData, Actor) == 0x000000, "Member 'Ak_SurfaceEffect_C_GetPhysmatEffectData::Actor' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetPhysmatEffectData, PhysmatEffect) == 0x000008, "Member 'Ak_SurfaceEffect_C_GetPhysmatEffectData::PhysmatEffect' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetPhysmatEffectData, CallFunc_NotEqual_NameName_ReturnValue) == 0x000010, "Member 'Ak_SurfaceEffect_C_GetPhysmatEffectData::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetPhysmatEffectData, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'Ak_SurfaceEffect_C_GetPhysmatEffectData::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetPhysmatEffectData, CallFunc_FindInCreatureSurfaceMap_Value) == 0x000020, "Member 'Ak_SurfaceEffect_C_GetPhysmatEffectData::CallFunc_FindInCreatureSurfaceMap_Value' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetPhysmatEffectData, CallFunc_FindInCreatureSurfaceMap_Found) == 0x000028, "Member 'Ak_SurfaceEffect_C_GetPhysmatEffectData::CallFunc_FindInCreatureSurfaceMap_Found' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetPhysmatEffectData, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'Ak_SurfaceEffect_C_GetPhysmatEffectData::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Ak_SurfaceEffect.Ak_SurfaceEffect_C.GetTraceParams
// 0x0158 (0x0158 - 0x0000)
struct Ak_SurfaceEffect_C_GetTraceParams final
{
public:
	class USceneComponent*                        Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        TraceStartOffset;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TraceEndOffset;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AttachLocation;                                    // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ak_SurfaceEffect_C_GetTraceParams) == 0x000008, "Wrong alignment on Ak_SurfaceEffect_C_GetTraceParams");
static_assert(sizeof(Ak_SurfaceEffect_C_GetTraceParams) == 0x000158, "Wrong size on Ak_SurfaceEffect_C_GetTraceParams");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, Mesh) == 0x000000, "Member 'Ak_SurfaceEffect_C_GetTraceParams::Mesh' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, TraceStartOffset) == 0x000008, "Member 'Ak_SurfaceEffect_C_GetTraceParams::TraceStartOffset' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, TraceEndOffset) == 0x000010, "Member 'Ak_SurfaceEffect_C_GetTraceParams::TraceEndOffset' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, Start) == 0x000018, "Member 'Ak_SurfaceEffect_C_GetTraceParams::Start' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, End) == 0x000030, "Member 'Ak_SurfaceEffect_C_GetTraceParams::End' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, AttachLocation) == 0x000048, "Member 'Ak_SurfaceEffect_C_GetTraceParams::AttachLocation' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'Ak_SurfaceEffect_C_GetTraceParams::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, CallFunc_MakeVector_ReturnValue_1) == 0x000078, "Member 'Ak_SurfaceEffect_C_GetTraceParams::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, CallFunc_GetOwner_ReturnValue) == 0x000090, "Member 'Ak_SurfaceEffect_C_GetTraceParams::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, CallFunc_GetActorForwardVector_ReturnValue) == 0x000098, "Member 'Ak_SurfaceEffect_C_GetTraceParams::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B0, "Member 'Ak_SurfaceEffect_C_GetTraceParams::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C8, "Member 'Ak_SurfaceEffect_C_GetTraceParams::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000E0, "Member 'Ak_SurfaceEffect_C_GetTraceParams::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000F8, "Member 'Ak_SurfaceEffect_C_GetTraceParams::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000110, "Member 'Ak_SurfaceEffect_C_GetTraceParams::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000128, "Member 'Ak_SurfaceEffect_C_GetTraceParams::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_GetTraceParams, CallFunc_GetSocketLocation_ReturnValue) == 0x000140, "Member 'Ak_SurfaceEffect_C_GetTraceParams::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");

// Function Ak_SurfaceEffect.Ak_SurfaceEffect_C.PlayerTraceForMaterial
// 0x0510 (0x0510 - 0x0000)
struct Ak_SurfaceEffect_C_PlayerTraceForMaterial final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      Material;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc;                                               // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      PM;                                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0128(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A59[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A5A[0x2];                                     // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A5B[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A5C[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTraceParams_Start;                     // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTraceParams_End;                       // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0340(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0350(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x043A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A5D[0x1];                                     // 0x043B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A5E[0x4];                                     // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A5F[0x4];                                     // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x04F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ak_SurfaceEffect_C_PlayerTraceForMaterial) == 0x000008, "Wrong alignment on Ak_SurfaceEffect_C_PlayerTraceForMaterial");
static_assert(sizeof(Ak_SurfaceEffect_C_PlayerTraceForMaterial) == 0x000510, "Wrong size on Ak_SurfaceEffect_C_PlayerTraceForMaterial");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, Mesh) == 0x000000, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::Mesh' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, Material) == 0x000008, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::Material' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, Loc) == 0x000010, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::Loc' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, Location) == 0x000028, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::Location' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, PM) == 0x000040, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::PM' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_GetSocketLocation_ReturnValue) == 0x000048, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_GetActorForwardVector_ReturnValue) == 0x000068, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000080, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_Add_VectorVector_ReturnValue) == 0x000098, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0000B0, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C8, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_GetOwner_ReturnValue_1) == 0x0000E0, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_SelectVector_ReturnValue) == 0x0000E8, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, K2Node_MakeArray_Array) == 0x000100, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000110, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_SphereTraceSingle_OutHit) == 0x000128, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_SphereTraceSingle_ReturnValue) == 0x000210, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_GetSocketLocation_ReturnValue_3) == 0x000218, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_GetSocketLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_bBlockingHit) == 0x000230, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_bInitialOverlap) == 0x000231, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_Time) == 0x000234, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_Distance) == 0x000238, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_Location) == 0x000240, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_ImpactPoint) == 0x000258, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_Normal) == 0x000270, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_ImpactNormal) == 0x000288, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_PhysMat) == 0x0002A0, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_HitActor) == 0x0002A8, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_HitComponent) == 0x0002B0, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_HitBoneName) == 0x0002B8, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_BoneName) == 0x0002C0, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_HitItem) == 0x0002C8, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_ElementIndex) == 0x0002CC, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_FaceIndex) == 0x0002D0, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_TraceStart) == 0x0002D8, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_TraceEnd) == 0x0002F0, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_GetTraceParams_Start) == 0x000308, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_GetTraceParams_Start' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_GetTraceParams_End) == 0x000320, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_GetTraceParams_End' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_GetOwner_ReturnValue_2) == 0x000338, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, K2Node_MakeArray_Array_1) == 0x000340, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_LineTraceSingle_OutHit) == 0x000350, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_LineTraceSingle_ReturnValue) == 0x000438, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ak_SurfaceEffect_C_PlayerTraceForMaterial, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000439, "Member 'Ak_SurfaceEffect_C_PlayerTraceForMaterial::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
