#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AkAudio

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AkAudio.AkPortalComponent.GetCurrentState
// 0x0001 (0x0001 - 0x0000)
struct AkPortalComponent_GetCurrentState final
{
public:
	EAkAcousticPortalState                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkPortalComponent_GetCurrentState) == 0x000001, "Wrong alignment on AkPortalComponent_GetCurrentState");
static_assert(sizeof(AkPortalComponent_GetCurrentState) == 0x000001, "Wrong size on AkPortalComponent_GetCurrentState");
static_assert(offsetof(AkPortalComponent_GetCurrentState, ReturnValue) == 0x000000, "Member 'AkPortalComponent_GetCurrentState::ReturnValue' has a wrong offset!");

// Function AkAudio.AkPortalComponent.GetPrimitiveParent
// 0x0008 (0x0008 - 0x0000)
struct AkPortalComponent_GetPrimitiveParent final
{
public:
	class UPrimitiveComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkPortalComponent_GetPrimitiveParent) == 0x000008, "Wrong alignment on AkPortalComponent_GetPrimitiveParent");
static_assert(sizeof(AkPortalComponent_GetPrimitiveParent) == 0x000008, "Wrong size on AkPortalComponent_GetPrimitiveParent");
static_assert(offsetof(AkPortalComponent_GetPrimitiveParent, ReturnValue) == 0x000000, "Member 'AkPortalComponent_GetPrimitiveParent::ReturnValue' has a wrong offset!");

// Function AkAudio.AkPortalComponent.PortalPlacementValid
// 0x0001 (0x0001 - 0x0000)
struct AkPortalComponent_PortalPlacementValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkPortalComponent_PortalPlacementValid) == 0x000001, "Wrong alignment on AkPortalComponent_PortalPlacementValid");
static_assert(sizeof(AkPortalComponent_PortalPlacementValid) == 0x000001, "Wrong size on AkPortalComponent_PortalPlacementValid");
static_assert(offsetof(AkPortalComponent_PortalPlacementValid, ReturnValue) == 0x000000, "Member 'AkPortalComponent_PortalPlacementValid::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAcousticPortal.GetCurrentState
// 0x0001 (0x0001 - 0x0000)
struct AkAcousticPortal_GetCurrentState final
{
public:
	EAkAcousticPortalState                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAcousticPortal_GetCurrentState) == 0x000001, "Wrong alignment on AkAcousticPortal_GetCurrentState");
static_assert(sizeof(AkAcousticPortal_GetCurrentState) == 0x000001, "Wrong size on AkAcousticPortal_GetCurrentState");
static_assert(offsetof(AkAcousticPortal_GetCurrentState, ReturnValue) == 0x000000, "Member 'AkAcousticPortal_GetCurrentState::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAndroidInitializationSettings.MigrateMultiCoreRendering
// 0x0001 (0x0001 - 0x0000)
struct AkAndroidInitializationSettings_MigrateMultiCoreRendering final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAndroidInitializationSettings_MigrateMultiCoreRendering) == 0x000001, "Wrong alignment on AkAndroidInitializationSettings_MigrateMultiCoreRendering");
static_assert(sizeof(AkAndroidInitializationSettings_MigrateMultiCoreRendering) == 0x000001, "Wrong size on AkAndroidInitializationSettings_MigrateMultiCoreRendering");
static_assert(offsetof(AkAndroidInitializationSettings_MigrateMultiCoreRendering, NewValue) == 0x000000, "Member 'AkAndroidInitializationSettings_MigrateMultiCoreRendering::NewValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.GetIsInfinite
// 0x0001 (0x0001 - 0x0000)
struct AkAudioEvent_GetIsInfinite final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAudioEvent_GetIsInfinite) == 0x000001, "Wrong alignment on AkAudioEvent_GetIsInfinite");
static_assert(sizeof(AkAudioEvent_GetIsInfinite) == 0x000001, "Wrong size on AkAudioEvent_GetIsInfinite");
static_assert(offsetof(AkAudioEvent_GetIsInfinite, ReturnValue) == 0x000000, "Member 'AkAudioEvent_GetIsInfinite::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.GetMaxAttenuationRadius
// 0x0004 (0x0004 - 0x0000)
struct AkAudioEvent_GetMaxAttenuationRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAudioEvent_GetMaxAttenuationRadius) == 0x000004, "Wrong alignment on AkAudioEvent_GetMaxAttenuationRadius");
static_assert(sizeof(AkAudioEvent_GetMaxAttenuationRadius) == 0x000004, "Wrong size on AkAudioEvent_GetMaxAttenuationRadius");
static_assert(offsetof(AkAudioEvent_GetMaxAttenuationRadius, ReturnValue) == 0x000000, "Member 'AkAudioEvent_GetMaxAttenuationRadius::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.GetMaximumDuration
// 0x0004 (0x0004 - 0x0000)
struct AkAudioEvent_GetMaximumDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAudioEvent_GetMaximumDuration) == 0x000004, "Wrong alignment on AkAudioEvent_GetMaximumDuration");
static_assert(sizeof(AkAudioEvent_GetMaximumDuration) == 0x000004, "Wrong size on AkAudioEvent_GetMaximumDuration");
static_assert(offsetof(AkAudioEvent_GetMaximumDuration, ReturnValue) == 0x000000, "Member 'AkAudioEvent_GetMaximumDuration::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.GetMinimumDuration
// 0x0004 (0x0004 - 0x0000)
struct AkAudioEvent_GetMinimumDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAudioEvent_GetMinimumDuration) == 0x000004, "Wrong alignment on AkAudioEvent_GetMinimumDuration");
static_assert(sizeof(AkAudioEvent_GetMinimumDuration) == 0x000004, "Wrong size on AkAudioEvent_GetMinimumDuration");
static_assert(offsetof(AkAudioEvent_GetMinimumDuration, ReturnValue) == 0x000000, "Member 'AkAudioEvent_GetMinimumDuration::ReturnValue' has a wrong offset!");

// Function AkAudio.AkGameObject.PostAkEvent
// 0x0048 (0x0048 - 0x0000)
struct AkGameObject_PostAkEvent final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallbackMask;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> PostEventCallback;                                 // 0x000C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19F1[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          ExternalSources;                                   // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	class FString                                 In_EventName;                                      // 0x0030(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19F2[0x4];                                     // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkGameObject_PostAkEvent) == 0x000008, "Wrong alignment on AkGameObject_PostAkEvent");
static_assert(sizeof(AkGameObject_PostAkEvent) == 0x000048, "Wrong size on AkGameObject_PostAkEvent");
static_assert(offsetof(AkGameObject_PostAkEvent, AkEvent) == 0x000000, "Member 'AkGameObject_PostAkEvent::AkEvent' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEvent, CallbackMask) == 0x000008, "Member 'AkGameObject_PostAkEvent::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEvent, PostEventCallback) == 0x00000C, "Member 'AkGameObject_PostAkEvent::PostEventCallback' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEvent, ExternalSources) == 0x000020, "Member 'AkGameObject_PostAkEvent::ExternalSources' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEvent, In_EventName) == 0x000030, "Member 'AkGameObject_PostAkEvent::In_EventName' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEvent, ReturnValue) == 0x000040, "Member 'AkGameObject_PostAkEvent::ReturnValue' has a wrong offset!");

// Function AkAudio.AkGameObject.PostAkEventAsync
// 0x0050 (0x0050 - 0x0000)
struct AkGameObject_PostAkEventAsync final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkEvent;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayingID;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallbackMask;                                      // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> PostEventCallback;                                 // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAkExternalSourceInfo>          ExternalSources;                                   // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0038(0x0018)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkGameObject_PostAkEventAsync) == 0x000008, "Wrong alignment on AkGameObject_PostAkEventAsync");
static_assert(sizeof(AkGameObject_PostAkEventAsync) == 0x000050, "Wrong size on AkGameObject_PostAkEventAsync");
static_assert(offsetof(AkGameObject_PostAkEventAsync, WorldContextObject) == 0x000000, "Member 'AkGameObject_PostAkEventAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEventAsync, AkEvent) == 0x000008, "Member 'AkGameObject_PostAkEventAsync::AkEvent' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEventAsync, PlayingID) == 0x000010, "Member 'AkGameObject_PostAkEventAsync::PlayingID' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEventAsync, CallbackMask) == 0x000014, "Member 'AkGameObject_PostAkEventAsync::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEventAsync, PostEventCallback) == 0x000018, "Member 'AkGameObject_PostAkEventAsync::PostEventCallback' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEventAsync, ExternalSources) == 0x000028, "Member 'AkGameObject_PostAkEventAsync::ExternalSources' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEventAsync, LatentInfo) == 0x000038, "Member 'AkGameObject_PostAkEventAsync::LatentInfo' has a wrong offset!");

// Function AkAudio.AkGameObject.PostAssociatedAkEvent
// 0x0030 (0x0030 - 0x0000)
struct AkGameObject_PostAssociatedAkEvent final
{
public:
	int32                                         CallbackMask;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> PostEventCallback;                                 // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19F3[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          ExternalSources;                                   // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19F4[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkGameObject_PostAssociatedAkEvent) == 0x000008, "Wrong alignment on AkGameObject_PostAssociatedAkEvent");
static_assert(sizeof(AkGameObject_PostAssociatedAkEvent) == 0x000030, "Wrong size on AkGameObject_PostAssociatedAkEvent");
static_assert(offsetof(AkGameObject_PostAssociatedAkEvent, CallbackMask) == 0x000000, "Member 'AkGameObject_PostAssociatedAkEvent::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEvent, PostEventCallback) == 0x000004, "Member 'AkGameObject_PostAssociatedAkEvent::PostEventCallback' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEvent, ExternalSources) == 0x000018, "Member 'AkGameObject_PostAssociatedAkEvent::ExternalSources' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEvent, ReturnValue) == 0x000028, "Member 'AkGameObject_PostAssociatedAkEvent::ReturnValue' has a wrong offset!");

// Function AkAudio.AkGameObject.PostAssociatedAkEventAsync
// 0x0050 (0x0050 - 0x0000)
struct AkGameObject_PostAssociatedAkEventAsync final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallbackMask;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> PostEventCallback;                                 // 0x000C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19F5[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          ExternalSources;                                   // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0030(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         PlayingID;                                         // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19F6[0x4];                                     // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkGameObject_PostAssociatedAkEventAsync) == 0x000008, "Wrong alignment on AkGameObject_PostAssociatedAkEventAsync");
static_assert(sizeof(AkGameObject_PostAssociatedAkEventAsync) == 0x000050, "Wrong size on AkGameObject_PostAssociatedAkEventAsync");
static_assert(offsetof(AkGameObject_PostAssociatedAkEventAsync, WorldContextObject) == 0x000000, "Member 'AkGameObject_PostAssociatedAkEventAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEventAsync, CallbackMask) == 0x000008, "Member 'AkGameObject_PostAssociatedAkEventAsync::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEventAsync, PostEventCallback) == 0x00000C, "Member 'AkGameObject_PostAssociatedAkEventAsync::PostEventCallback' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEventAsync, ExternalSources) == 0x000020, "Member 'AkGameObject_PostAssociatedAkEventAsync::ExternalSources' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEventAsync, LatentInfo) == 0x000030, "Member 'AkGameObject_PostAssociatedAkEventAsync::LatentInfo' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEventAsync, PlayingID) == 0x000048, "Member 'AkGameObject_PostAssociatedAkEventAsync::PlayingID' has a wrong offset!");

// Function AkAudio.AkGameObject.GetRTPCValue
// 0x0030 (0x0030 - 0x0000)
struct AkGameObject_GetRTPCValue final
{
public:
	class UAkRtpc*                                RTPCValue;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERTPCValueType                                InputValueType;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19F7[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERTPCValueType                                OutputValueType;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19F8[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Rtpc;                                              // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayingID;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19F9[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkGameObject_GetRTPCValue) == 0x000008, "Wrong alignment on AkGameObject_GetRTPCValue");
static_assert(sizeof(AkGameObject_GetRTPCValue) == 0x000030, "Wrong size on AkGameObject_GetRTPCValue");
static_assert(offsetof(AkGameObject_GetRTPCValue, RTPCValue) == 0x000000, "Member 'AkGameObject_GetRTPCValue::RTPCValue' has a wrong offset!");
static_assert(offsetof(AkGameObject_GetRTPCValue, InputValueType) == 0x000008, "Member 'AkGameObject_GetRTPCValue::InputValueType' has a wrong offset!");
static_assert(offsetof(AkGameObject_GetRTPCValue, Value) == 0x00000C, "Member 'AkGameObject_GetRTPCValue::Value' has a wrong offset!");
static_assert(offsetof(AkGameObject_GetRTPCValue, OutputValueType) == 0x000010, "Member 'AkGameObject_GetRTPCValue::OutputValueType' has a wrong offset!");
static_assert(offsetof(AkGameObject_GetRTPCValue, Rtpc) == 0x000018, "Member 'AkGameObject_GetRTPCValue::Rtpc' has a wrong offset!");
static_assert(offsetof(AkGameObject_GetRTPCValue, PlayingID) == 0x000028, "Member 'AkGameObject_GetRTPCValue::PlayingID' has a wrong offset!");

// Function AkAudio.AkGameObject.SetRTPCValue
// 0x0020 (0x0020 - 0x0000)
struct AkGameObject_SetRTPCValue final
{
public:
	class UAkRtpc*                                RTPCValue;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InterpolationTimeMs;                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Rtpc;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkGameObject_SetRTPCValue) == 0x000008, "Wrong alignment on AkGameObject_SetRTPCValue");
static_assert(sizeof(AkGameObject_SetRTPCValue) == 0x000020, "Wrong size on AkGameObject_SetRTPCValue");
static_assert(offsetof(AkGameObject_SetRTPCValue, RTPCValue) == 0x000000, "Member 'AkGameObject_SetRTPCValue::RTPCValue' has a wrong offset!");
static_assert(offsetof(AkGameObject_SetRTPCValue, Value) == 0x000008, "Member 'AkGameObject_SetRTPCValue::Value' has a wrong offset!");
static_assert(offsetof(AkGameObject_SetRTPCValue, InterpolationTimeMs) == 0x00000C, "Member 'AkGameObject_SetRTPCValue::InterpolationTimeMs' has a wrong offset!");
static_assert(offsetof(AkGameObject_SetRTPCValue, Rtpc) == 0x000010, "Member 'AkGameObject_SetRTPCValue::Rtpc' has a wrong offset!");

// Function AkAudio.AkComponent.GetAutoDestroy
// 0x0001 (0x0001 - 0x0000)
struct AkComponent_GetAutoDestroy final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_GetAutoDestroy) == 0x000001, "Wrong alignment on AkComponent_GetAutoDestroy");
static_assert(sizeof(AkComponent_GetAutoDestroy) == 0x000001, "Wrong size on AkComponent_GetAutoDestroy");
static_assert(offsetof(AkComponent_GetAutoDestroy, ReturnValue) == 0x000000, "Member 'AkComponent_GetAutoDestroy::ReturnValue' has a wrong offset!");

// Function AkAudio.AkComponent.PostAkEventAndWaitForEnd
// 0x0048 (0x0048 - 0x0000)
struct AkComponent_PostAkEventAndWaitForEnd final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 In_EventName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAkExternalSourceInfo>          ExternalSources;                                   // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0028(0x0018)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19FF[0x4];                                     // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkComponent_PostAkEventAndWaitForEnd) == 0x000008, "Wrong alignment on AkComponent_PostAkEventAndWaitForEnd");
static_assert(sizeof(AkComponent_PostAkEventAndWaitForEnd) == 0x000048, "Wrong size on AkComponent_PostAkEventAndWaitForEnd");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEnd, AkEvent) == 0x000000, "Member 'AkComponent_PostAkEventAndWaitForEnd::AkEvent' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEnd, In_EventName) == 0x000008, "Member 'AkComponent_PostAkEventAndWaitForEnd::In_EventName' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEnd, ExternalSources) == 0x000018, "Member 'AkComponent_PostAkEventAndWaitForEnd::ExternalSources' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEnd, LatentInfo) == 0x000028, "Member 'AkComponent_PostAkEventAndWaitForEnd::LatentInfo' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEnd, ReturnValue) == 0x000040, "Member 'AkComponent_PostAkEventAndWaitForEnd::ReturnValue' has a wrong offset!");

// Function AkAudio.AkComponent.PostAkEventAndWaitForEndAsync
// 0x0038 (0x0038 - 0x0000)
struct AkComponent_PostAkEventAndWaitForEndAsync final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayingID;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A00[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          ExternalSources;                                   // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0020(0x0018)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_PostAkEventAndWaitForEndAsync) == 0x000008, "Wrong alignment on AkComponent_PostAkEventAndWaitForEndAsync");
static_assert(sizeof(AkComponent_PostAkEventAndWaitForEndAsync) == 0x000038, "Wrong size on AkComponent_PostAkEventAndWaitForEndAsync");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEndAsync, AkEvent) == 0x000000, "Member 'AkComponent_PostAkEventAndWaitForEndAsync::AkEvent' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEndAsync, PlayingID) == 0x000008, "Member 'AkComponent_PostAkEventAndWaitForEndAsync::PlayingID' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEndAsync, ExternalSources) == 0x000010, "Member 'AkComponent_PostAkEventAndWaitForEndAsync::ExternalSources' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEndAsync, LatentInfo) == 0x000020, "Member 'AkComponent_PostAkEventAndWaitForEndAsync::LatentInfo' has a wrong offset!");

// Function AkAudio.AkComponent.PostAkEventByName
// 0x0018 (0x0018 - 0x0000)
struct AkComponent_PostAkEventByName final
{
public:
	class FString                                 In_EventName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A01[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkComponent_PostAkEventByName) == 0x000008, "Wrong alignment on AkComponent_PostAkEventByName");
static_assert(sizeof(AkComponent_PostAkEventByName) == 0x000018, "Wrong size on AkComponent_PostAkEventByName");
static_assert(offsetof(AkComponent_PostAkEventByName, In_EventName) == 0x000000, "Member 'AkComponent_PostAkEventByName::In_EventName' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAkEventByName, ReturnValue) == 0x000010, "Member 'AkComponent_PostAkEventByName::ReturnValue' has a wrong offset!");

// Function AkAudio.AkComponent.PostAssociatedAkEventAndWaitForEnd
// 0x0030 (0x0030 - 0x0000)
struct AkComponent_PostAssociatedAkEventAndWaitForEnd final
{
public:
	TArray<struct FAkExternalSourceInfo>          ExternalSources;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0010(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A02[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkComponent_PostAssociatedAkEventAndWaitForEnd) == 0x000008, "Wrong alignment on AkComponent_PostAssociatedAkEventAndWaitForEnd");
static_assert(sizeof(AkComponent_PostAssociatedAkEventAndWaitForEnd) == 0x000030, "Wrong size on AkComponent_PostAssociatedAkEventAndWaitForEnd");
static_assert(offsetof(AkComponent_PostAssociatedAkEventAndWaitForEnd, ExternalSources) == 0x000000, "Member 'AkComponent_PostAssociatedAkEventAndWaitForEnd::ExternalSources' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAssociatedAkEventAndWaitForEnd, LatentInfo) == 0x000010, "Member 'AkComponent_PostAssociatedAkEventAndWaitForEnd::LatentInfo' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAssociatedAkEventAndWaitForEnd, ReturnValue) == 0x000028, "Member 'AkComponent_PostAssociatedAkEventAndWaitForEnd::ReturnValue' has a wrong offset!");

// Function AkAudio.AkComponent.PostAssociatedAkEventAndWaitForEndAsync
// 0x0030 (0x0030 - 0x0000)
struct AkComponent_PostAssociatedAkEventAndWaitForEndAsync final
{
public:
	int32                                         PlayingID;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A03[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          ExternalSources;                                   // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0018(0x0018)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_PostAssociatedAkEventAndWaitForEndAsync) == 0x000008, "Wrong alignment on AkComponent_PostAssociatedAkEventAndWaitForEndAsync");
static_assert(sizeof(AkComponent_PostAssociatedAkEventAndWaitForEndAsync) == 0x000030, "Wrong size on AkComponent_PostAssociatedAkEventAndWaitForEndAsync");
static_assert(offsetof(AkComponent_PostAssociatedAkEventAndWaitForEndAsync, PlayingID) == 0x000000, "Member 'AkComponent_PostAssociatedAkEventAndWaitForEndAsync::PlayingID' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAssociatedAkEventAndWaitForEndAsync, ExternalSources) == 0x000008, "Member 'AkComponent_PostAssociatedAkEventAndWaitForEndAsync::ExternalSources' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAssociatedAkEventAndWaitForEndAsync, LatentInfo) == 0x000018, "Member 'AkComponent_PostAssociatedAkEventAndWaitForEndAsync::LatentInfo' has a wrong offset!");

// Function AkAudio.AkComponent.PostTrigger
// 0x0018 (0x0018 - 0x0000)
struct AkComponent_PostTrigger final
{
public:
	class UAkTrigger*                             TriggerValue;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Trigger;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_PostTrigger) == 0x000008, "Wrong alignment on AkComponent_PostTrigger");
static_assert(sizeof(AkComponent_PostTrigger) == 0x000018, "Wrong size on AkComponent_PostTrigger");
static_assert(offsetof(AkComponent_PostTrigger, TriggerValue) == 0x000000, "Member 'AkComponent_PostTrigger::TriggerValue' has a wrong offset!");
static_assert(offsetof(AkComponent_PostTrigger, Trigger) == 0x000008, "Member 'AkComponent_PostTrigger::Trigger' has a wrong offset!");

// Function AkAudio.AkComponent.SetAttenuationScalingFactor
// 0x0004 (0x0004 - 0x0000)
struct AkComponent_SetAttenuationScalingFactor final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_SetAttenuationScalingFactor) == 0x000004, "Wrong alignment on AkComponent_SetAttenuationScalingFactor");
static_assert(sizeof(AkComponent_SetAttenuationScalingFactor) == 0x000004, "Wrong size on AkComponent_SetAttenuationScalingFactor");
static_assert(offsetof(AkComponent_SetAttenuationScalingFactor, Value) == 0x000000, "Member 'AkComponent_SetAttenuationScalingFactor::Value' has a wrong offset!");

// Function AkAudio.AkComponent.SetEarlyReflectionsAuxBus
// 0x0010 (0x0010 - 0x0000)
struct AkComponent_SetEarlyReflectionsAuxBus final
{
public:
	class FString                                 AuxBusName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_SetEarlyReflectionsAuxBus) == 0x000008, "Wrong alignment on AkComponent_SetEarlyReflectionsAuxBus");
static_assert(sizeof(AkComponent_SetEarlyReflectionsAuxBus) == 0x000010, "Wrong size on AkComponent_SetEarlyReflectionsAuxBus");
static_assert(offsetof(AkComponent_SetEarlyReflectionsAuxBus, AuxBusName) == 0x000000, "Member 'AkComponent_SetEarlyReflectionsAuxBus::AuxBusName' has a wrong offset!");

// Function AkAudio.AkComponent.SetEarlyReflectionsVolume
// 0x0004 (0x0004 - 0x0000)
struct AkComponent_SetEarlyReflectionsVolume final
{
public:
	float                                         SendVolume;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_SetEarlyReflectionsVolume) == 0x000004, "Wrong alignment on AkComponent_SetEarlyReflectionsVolume");
static_assert(sizeof(AkComponent_SetEarlyReflectionsVolume) == 0x000004, "Wrong size on AkComponent_SetEarlyReflectionsVolume");
static_assert(offsetof(AkComponent_SetEarlyReflectionsVolume, SendVolume) == 0x000000, "Member 'AkComponent_SetEarlyReflectionsVolume::SendVolume' has a wrong offset!");

// Function AkAudio.AkComponent.SetGameObjectRadius
// 0x0008 (0x0008 - 0x0000)
struct AkComponent_SetGameObjectRadius final
{
public:
	float                                         In_outerRadius;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         In_innerRadius;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_SetGameObjectRadius) == 0x000004, "Wrong alignment on AkComponent_SetGameObjectRadius");
static_assert(sizeof(AkComponent_SetGameObjectRadius) == 0x000008, "Wrong size on AkComponent_SetGameObjectRadius");
static_assert(offsetof(AkComponent_SetGameObjectRadius, In_outerRadius) == 0x000000, "Member 'AkComponent_SetGameObjectRadius::In_outerRadius' has a wrong offset!");
static_assert(offsetof(AkComponent_SetGameObjectRadius, In_innerRadius) == 0x000004, "Member 'AkComponent_SetGameObjectRadius::In_innerRadius' has a wrong offset!");

// Function AkAudio.AkComponent.SetListeners
// 0x0010 (0x0010 - 0x0000)
struct AkComponent_SetListeners final
{
public:
	TArray<class UAkComponent*>                   Listeners;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_SetListeners) == 0x000008, "Wrong alignment on AkComponent_SetListeners");
static_assert(sizeof(AkComponent_SetListeners) == 0x000010, "Wrong size on AkComponent_SetListeners");
static_assert(offsetof(AkComponent_SetListeners, Listeners) == 0x000000, "Member 'AkComponent_SetListeners::Listeners' has a wrong offset!");

// Function AkAudio.AkComponent.SetOutputBusVolume
// 0x0004 (0x0004 - 0x0000)
struct AkComponent_SetOutputBusVolume final
{
public:
	float                                         BusVolume;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_SetOutputBusVolume) == 0x000004, "Wrong alignment on AkComponent_SetOutputBusVolume");
static_assert(sizeof(AkComponent_SetOutputBusVolume) == 0x000004, "Wrong size on AkComponent_SetOutputBusVolume");
static_assert(offsetof(AkComponent_SetOutputBusVolume, BusVolume) == 0x000000, "Member 'AkComponent_SetOutputBusVolume::BusVolume' has a wrong offset!");

// Function AkAudio.AkComponent.SetStopWhenOwnerDestroyed
// 0x0001 (0x0001 - 0x0000)
struct AkComponent_SetStopWhenOwnerDestroyed final
{
public:
	bool                                          bStopWhenOwnerDestroyed;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_SetStopWhenOwnerDestroyed) == 0x000001, "Wrong alignment on AkComponent_SetStopWhenOwnerDestroyed");
static_assert(sizeof(AkComponent_SetStopWhenOwnerDestroyed) == 0x000001, "Wrong size on AkComponent_SetStopWhenOwnerDestroyed");
static_assert(offsetof(AkComponent_SetStopWhenOwnerDestroyed, bStopWhenOwnerDestroyed) == 0x000000, "Member 'AkComponent_SetStopWhenOwnerDestroyed::bStopWhenOwnerDestroyed' has a wrong offset!");

// Function AkAudio.AkComponent.SetSwitch
// 0x0028 (0x0028 - 0x0000)
struct AkComponent_SetSwitch final
{
public:
	class UAkSwitchValue*                         SwitchValue;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SwitchGroup;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SwitchState;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_SetSwitch) == 0x000008, "Wrong alignment on AkComponent_SetSwitch");
static_assert(sizeof(AkComponent_SetSwitch) == 0x000028, "Wrong size on AkComponent_SetSwitch");
static_assert(offsetof(AkComponent_SetSwitch, SwitchValue) == 0x000000, "Member 'AkComponent_SetSwitch::SwitchValue' has a wrong offset!");
static_assert(offsetof(AkComponent_SetSwitch, SwitchGroup) == 0x000008, "Member 'AkComponent_SetSwitch::SwitchGroup' has a wrong offset!");
static_assert(offsetof(AkComponent_SetSwitch, SwitchState) == 0x000018, "Member 'AkComponent_SetSwitch::SwitchState' has a wrong offset!");

// Function AkAudio.AkComponent.UseEarlyReflections
// 0x0028 (0x0028 - 0x0000)
struct AkComponent_UseEarlyReflections final
{
public:
	class UAkAuxBus*                              AuxBus;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Order;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BusSendGain;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPathLength;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SpotReflectors;                                    // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A04[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AuxBusName;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_UseEarlyReflections) == 0x000008, "Wrong alignment on AkComponent_UseEarlyReflections");
static_assert(sizeof(AkComponent_UseEarlyReflections) == 0x000028, "Wrong size on AkComponent_UseEarlyReflections");
static_assert(offsetof(AkComponent_UseEarlyReflections, AuxBus) == 0x000000, "Member 'AkComponent_UseEarlyReflections::AuxBus' has a wrong offset!");
static_assert(offsetof(AkComponent_UseEarlyReflections, Order) == 0x000008, "Member 'AkComponent_UseEarlyReflections::Order' has a wrong offset!");
static_assert(offsetof(AkComponent_UseEarlyReflections, BusSendGain) == 0x00000C, "Member 'AkComponent_UseEarlyReflections::BusSendGain' has a wrong offset!");
static_assert(offsetof(AkComponent_UseEarlyReflections, MaxPathLength) == 0x000010, "Member 'AkComponent_UseEarlyReflections::MaxPathLength' has a wrong offset!");
static_assert(offsetof(AkComponent_UseEarlyReflections, SpotReflectors) == 0x000014, "Member 'AkComponent_UseEarlyReflections::SpotReflectors' has a wrong offset!");
static_assert(offsetof(AkComponent_UseEarlyReflections, AuxBusName) == 0x000018, "Member 'AkComponent_UseEarlyReflections::AuxBusName' has a wrong offset!");

// Function AkAudio.AkComponent.UseReverbVolumes
// 0x0001 (0x0001 - 0x0000)
struct AkComponent_UseReverbVolumes final
{
public:
	bool                                          InUseReverbVolumes;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_UseReverbVolumes) == 0x000001, "Wrong alignment on AkComponent_UseReverbVolumes");
static_assert(sizeof(AkComponent_UseReverbVolumes) == 0x000001, "Wrong size on AkComponent_UseReverbVolumes");
static_assert(offsetof(AkComponent_UseReverbVolumes, InUseReverbVolumes) == 0x000000, "Member 'AkComponent_UseReverbVolumes::InUseReverbVolumes' has a wrong offset!");

// Function AkAudio.AkComponent.GetAttenuationRadius
// 0x0004 (0x0004 - 0x0000)
struct AkComponent_GetAttenuationRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_GetAttenuationRadius) == 0x000004, "Wrong alignment on AkComponent_GetAttenuationRadius");
static_assert(sizeof(AkComponent_GetAttenuationRadius) == 0x000004, "Wrong size on AkComponent_GetAttenuationRadius");
static_assert(offsetof(AkComponent_GetAttenuationRadius, ReturnValue) == 0x000000, "Member 'AkComponent_GetAttenuationRadius::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioInputComponent.PostAssociatedAudioInputEvent
// 0x0004 (0x0004 - 0x0000)
struct AkAudioInputComponent_PostAssociatedAudioInputEvent final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAudioInputComponent_PostAssociatedAudioInputEvent) == 0x000004, "Wrong alignment on AkAudioInputComponent_PostAssociatedAudioInputEvent");
static_assert(sizeof(AkAudioInputComponent_PostAssociatedAudioInputEvent) == 0x000004, "Wrong size on AkAudioInputComponent_PostAssociatedAudioInputEvent");
static_assert(offsetof(AkAudioInputComponent_PostAssociatedAudioInputEvent, ReturnValue) == 0x000000, "Member 'AkAudioInputComponent_PostAssociatedAudioInputEvent::ReturnValue' has a wrong offset!");

// Function AkAudio.AkCheckBox.SetAkBoolProperty
// 0x0010 (0x0010 - 0x0000)
struct AkCheckBox_SetAkBoolProperty final
{
public:
	class FString                                 ItemProperty;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkCheckBox_SetAkBoolProperty) == 0x000008, "Wrong alignment on AkCheckBox_SetAkBoolProperty");
static_assert(sizeof(AkCheckBox_SetAkBoolProperty) == 0x000010, "Wrong size on AkCheckBox_SetAkBoolProperty");
static_assert(offsetof(AkCheckBox_SetAkBoolProperty, ItemProperty) == 0x000000, "Member 'AkCheckBox_SetAkBoolProperty::ItemProperty' has a wrong offset!");

// Function AkAudio.AkCheckBox.SetAkItemId
// 0x0010 (0x0010 - 0x0000)
struct AkCheckBox_SetAkItemId final
{
public:
	struct FGuid                                  ItemId;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkCheckBox_SetAkItemId) == 0x000004, "Wrong alignment on AkCheckBox_SetAkItemId");
static_assert(sizeof(AkCheckBox_SetAkItemId) == 0x000010, "Wrong size on AkCheckBox_SetAkItemId");
static_assert(offsetof(AkCheckBox_SetAkItemId, ItemId) == 0x000000, "Member 'AkCheckBox_SetAkItemId::ItemId' has a wrong offset!");

// Function AkAudio.AkCheckBox.SetCheckedState
// 0x0001 (0x0001 - 0x0000)
struct AkCheckBox_SetCheckedState final
{
public:
	ECheckBoxState                                InCheckedState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkCheckBox_SetCheckedState) == 0x000001, "Wrong alignment on AkCheckBox_SetCheckedState");
static_assert(sizeof(AkCheckBox_SetCheckedState) == 0x000001, "Wrong size on AkCheckBox_SetCheckedState");
static_assert(offsetof(AkCheckBox_SetCheckedState, InCheckedState) == 0x000000, "Member 'AkCheckBox_SetCheckedState::InCheckedState' has a wrong offset!");

// Function AkAudio.AkCheckBox.SetIsChecked
// 0x0001 (0x0001 - 0x0000)
struct AkCheckBox_SetIsChecked final
{
public:
	bool                                          InIsChecked;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkCheckBox_SetIsChecked) == 0x000001, "Wrong alignment on AkCheckBox_SetIsChecked");
static_assert(sizeof(AkCheckBox_SetIsChecked) == 0x000001, "Wrong size on AkCheckBox_SetIsChecked");
static_assert(offsetof(AkCheckBox_SetIsChecked, InIsChecked) == 0x000000, "Member 'AkCheckBox_SetIsChecked::InIsChecked' has a wrong offset!");

// Function AkAudio.AkCheckBox.GetAkItemId
// 0x0010 (0x0010 - 0x0000)
struct AkCheckBox_GetAkItemId final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkCheckBox_GetAkItemId) == 0x000004, "Wrong alignment on AkCheckBox_GetAkItemId");
static_assert(sizeof(AkCheckBox_GetAkItemId) == 0x000010, "Wrong size on AkCheckBox_GetAkItemId");
static_assert(offsetof(AkCheckBox_GetAkItemId, ReturnValue) == 0x000000, "Member 'AkCheckBox_GetAkItemId::ReturnValue' has a wrong offset!");

// Function AkAudio.AkCheckBox.GetAkProperty
// 0x0010 (0x0010 - 0x0000)
struct AkCheckBox_GetAkProperty final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkCheckBox_GetAkProperty) == 0x000008, "Wrong alignment on AkCheckBox_GetAkProperty");
static_assert(sizeof(AkCheckBox_GetAkProperty) == 0x000010, "Wrong size on AkCheckBox_GetAkProperty");
static_assert(offsetof(AkCheckBox_GetAkProperty, ReturnValue) == 0x000000, "Member 'AkCheckBox_GetAkProperty::ReturnValue' has a wrong offset!");

// Function AkAudio.AkCheckBox.GetCheckedState
// 0x0001 (0x0001 - 0x0000)
struct AkCheckBox_GetCheckedState final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkCheckBox_GetCheckedState) == 0x000001, "Wrong alignment on AkCheckBox_GetCheckedState");
static_assert(sizeof(AkCheckBox_GetCheckedState) == 0x000001, "Wrong size on AkCheckBox_GetCheckedState");
static_assert(offsetof(AkCheckBox_GetCheckedState, ReturnValue) == 0x000000, "Member 'AkCheckBox_GetCheckedState::ReturnValue' has a wrong offset!");

// Function AkAudio.AkCheckBox.IsChecked
// 0x0001 (0x0001 - 0x0000)
struct AkCheckBox_IsChecked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkCheckBox_IsChecked) == 0x000001, "Wrong alignment on AkCheckBox_IsChecked");
static_assert(sizeof(AkCheckBox_IsChecked) == 0x000001, "Wrong size on AkCheckBox_IsChecked");
static_assert(offsetof(AkCheckBox_IsChecked, ReturnValue) == 0x000000, "Member 'AkCheckBox_IsChecked::ReturnValue' has a wrong offset!");

// Function AkAudio.AkCheckBox.IsPressed
// 0x0001 (0x0001 - 0x0000)
struct AkCheckBox_IsPressed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkCheckBox_IsPressed) == 0x000001, "Wrong alignment on AkCheckBox_IsPressed");
static_assert(sizeof(AkCheckBox_IsPressed) == 0x000001, "Wrong size on AkCheckBox_IsPressed");
static_assert(offsetof(AkCheckBox_IsPressed, ReturnValue) == 0x000000, "Member 'AkCheckBox_IsPressed::ReturnValue' has a wrong offset!");

// Function AkAudio.AkGameplayStatics.AddOutputCaptureMarker
// 0x0010 (0x0010 - 0x0000)
struct AkGameplayStatics_AddOutputCaptureMarker final
{
public:
	class FString                                 MarkerText;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkGameplayStatics_AddOutputCaptureMarker) == 0x000008, "Wrong alignment on AkGameplayStatics_AddOutputCaptureMarker");
static_assert(sizeof(AkGameplayStatics_AddOutputCaptureMarker) == 0x000010, "Wrong size on AkGameplayStatics_AddOutputCaptureMarker");
static_assert(offsetof(AkGameplayStatics_AddOutputCaptureMarker, MarkerText) == 0x000000, "Member 'AkGameplayStatics_AddOutputCaptureMarker::MarkerText' has a wrong offset!");

// Function AkAudio.AkGameplayStatics.CancelEventCallback
// 0x0010 (0x0010 - 0x0000)
struct AkGameplayStatics_CancelEventCallback final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> PostEventCallback;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkGameplayStatics_CancelEventCallback) == 0x000004, "Wrong alignment on AkGameplayStatics_CancelEventCallback");
static_assert(sizeof(AkGameplayStatics_CancelEventCallback) == 0x000010, "Wrong size on AkGameplayStatics_CancelEventCallback");
static_assert(offsetof(AkGameplayStatics_CancelEventCallback, PostEventCallback) == 0x000000, "Member 'AkGameplayStatics_CancelEventCallback::PostEventCallback' has a wrong offset!");

// Function AkAudio.AkGameplayStatics.ExecuteActionOnEvent
// 0x0028 (0x0028 - 0x0000)
struct AkGameplayStatics_ExecuteActionOnEvent final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkActionOnEventType                          ActionType;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A0C[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TransitionDuration;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkCurveInterpolation                         FadeCurve;                                         // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A0D[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayingID;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A0E[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkGameplayStatics_ExecuteActionOnEvent) == 0x000008, "Wrong alignment on AkGameplayStatics_ExecuteActionOnEvent");
static_assert(sizeof(AkGameplayStatics_ExecuteActionOnEvent) == 0x000028, "Wrong size on AkGameplayStatics_ExecuteActionOnEvent");
static_assert(offsetof(AkGameplayStatics_ExecuteActionOnEvent, AkEvent) == 0x000000, "Member 'AkGameplayStatics_ExecuteActionOnEvent::AkEvent' has a wrong offset!");
static_assert(offsetof(AkGameplayStatics_ExecuteActionOnEvent, ActionType) == 0x000008, "Member 'AkGameplayStatics_ExecuteActionOnEvent::ActionType' has a wrong offset!");
static_assert(offsetof(AkGameplayStatics_ExecuteActionOnEvent, Actor) == 0x000010, "Member 'AkGameplayStatics_ExecuteActionOnEvent::Actor' has a wrong offset!");
static_assert(offsetof(AkGameplayStatics_ExecuteActionOnEvent, TransitionDuration) == 0x000018, "Member 'AkGameplayStatics_ExecuteActionOnEvent::TransitionDuration' has a wrong offset!");
static_assert(offsetof(AkGameplayStatics_ExecuteActionOnEvent, FadeCurve) == 0x00001C, "Member 'AkGameplayStatics_ExecuteActionOnEvent::FadeCurve' has a wrong offset!");
static_assert(offsetof(AkGameplayStatics_ExecuteActionOnEvent, PlayingID) == 0x000020, "Member 'AkGameplayStatics_ExecuteActionOnEvent::PlayingID' has a wrong offset!");

// Function AkAudio.AkGameplayStatics.ExecuteActionOnPlayingID
// 0x0010 (0x0010 - 0x0000)
struct AkGameplayStatics_ExecuteActionOnPlayingID final
{
public:
	EAkActionOnEventType                          ActionType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A0F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayingID;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TransitionDuration;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
