#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimationBudgetAllocator

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct AnimationBudgetAllocator.AnimationBudgetAllocatorParameters
// 0x0058 (0x0058 - 0x0000)
struct FAnimationBudgetAllocatorParameters final
{
public:
	float                                         BudgetInMs;                                        // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinQuality;                                        // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxTickRate;                                       // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorkUnitSmoothingSpeed;                            // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AlwaysTickFalloffAggression;                       // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolationFalloffAggression;                    // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InterpolationMaxRate;                              // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxInterpolatedComponents;                         // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolationTickMultiplier;                       // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialEstimatedWorkUnitTimeMs;                    // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxTickedOffsreenComponents;                       // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StateChangeThrottleInFrames;                       // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BudgetFactorBeforeReducedWork;                     // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BudgetFactorBeforeReducedWorkEpsilon;              // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BudgetPressureSmoothingSpeed;                      // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReducedWorkThrottleMinInFrames;                    // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReducedWorkThrottleMaxInFrames;                    // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BudgetFactorBeforeAggressiveReducedWork;           // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReducedWorkThrottleMaxPerFrame;                    // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BudgetPressureBeforeEmergencyReducedWork;          // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AutoCalculatedSignificanceMaxDistance;             // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1ED9[0x4];                                     // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimationBudgetAllocatorParameters) == 0x000004, "Wrong alignment on FAnimationBudgetAllocatorParameters");
static_assert(sizeof(FAnimationBudgetAllocatorParameters) == 0x000058, "Wrong size on FAnimationBudgetAllocatorParameters");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, BudgetInMs) == 0x000000, "Member 'FAnimationBudgetAllocatorParameters::BudgetInMs' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, MinQuality) == 0x000004, "Member 'FAnimationBudgetAllocatorParameters::MinQuality' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, MaxTickRate) == 0x000008, "Member 'FAnimationBudgetAllocatorParameters::MaxTickRate' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, WorkUnitSmoothingSpeed) == 0x00000C, "Member 'FAnimationBudgetAllocatorParameters::WorkUnitSmoothingSpeed' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, AlwaysTickFalloffAggression) == 0x000010, "Member 'FAnimationBudgetAllocatorParameters::AlwaysTickFalloffAggression' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, InterpolationFalloffAggression) == 0x000014, "Member 'FAnimationBudgetAllocatorParameters::InterpolationFalloffAggression' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, InterpolationMaxRate) == 0x000018, "Member 'FAnimationBudgetAllocatorParameters::InterpolationMaxRate' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, MaxInterpolatedComponents) == 0x00001C, "Member 'FAnimationBudgetAllocatorParameters::MaxInterpolatedComponents' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, InterpolationTickMultiplier) == 0x000020, "Member 'FAnimationBudgetAllocatorParameters::InterpolationTickMultiplier' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, InitialEstimatedWorkUnitTimeMs) == 0x000024, "Member 'FAnimationBudgetAllocatorParameters::InitialEstimatedWorkUnitTimeMs' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, MaxTickedOffsreenComponents) == 0x000028, "Member 'FAnimationBudgetAllocatorParameters::MaxTickedOffsreenComponents' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, StateChangeThrottleInFrames) == 0x00002C, "Member 'FAnimationBudgetAllocatorParameters::StateChangeThrottleInFrames' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, BudgetFactorBeforeReducedWork) == 0x000030, "Member 'FAnimationBudgetAllocatorParameters::BudgetFactorBeforeReducedWork' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, BudgetFactorBeforeReducedWorkEpsilon) == 0x000034, "Member 'FAnimationBudgetAllocatorParameters::BudgetFactorBeforeReducedWorkEpsilon' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, BudgetPressureSmoothingSpeed) == 0x000038, "Member 'FAnimationBudgetAllocatorParameters::BudgetPressureSmoothingSpeed' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, ReducedWorkThrottleMinInFrames) == 0x00003C, "Member 'FAnimationBudgetAllocatorParameters::ReducedWorkThrottleMinInFrames' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, ReducedWorkThrottleMaxInFrames) == 0x000040, "Member 'FAnimationBudgetAllocatorParameters::ReducedWorkThrottleMaxInFrames' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, BudgetFactorBeforeAggressiveReducedWork) == 0x000044, "Member 'FAnimationBudgetAllocatorParameters::BudgetFactorBeforeAggressiveReducedWork' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, ReducedWorkThrottleMaxPerFrame) == 0x000048, "Member 'FAnimationBudgetAllocatorParameters::ReducedWorkThrottleMaxPerFrame' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, BudgetPressureBeforeEmergencyReducedWork) == 0x00004C, "Member 'FAnimationBudgetAllocatorParameters::BudgetPressureBeforeEmergencyReducedWork' has a wrong offset!");
static_assert(offsetof(FAnimationBudgetAllocatorParameters, AutoCalculatedSignificanceMaxDistance) == 0x000050, "Member 'FAnimationBudgetAllocatorParameters::AutoCalculatedSignificanceMaxDistance' has a wrong offset!");

}

