#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioPool_OneShot

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AudioPool_OneShot.BP_AudioPool_OneShot_C.AudioDebugFoliage
// 0x0001 (0x0001 - 0x0000)
struct BP_AudioPool_OneShot_C_AudioDebugFoliage final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioPool_OneShot_C_AudioDebugFoliage) == 0x000001, "Wrong alignment on BP_AudioPool_OneShot_C_AudioDebugFoliage");
static_assert(sizeof(BP_AudioPool_OneShot_C_AudioDebugFoliage) == 0x000001, "Wrong size on BP_AudioPool_OneShot_C_AudioDebugFoliage");
static_assert(offsetof(BP_AudioPool_OneShot_C_AudioDebugFoliage, On) == 0x000000, "Member 'BP_AudioPool_OneShot_C_AudioDebugFoliage::On' has a wrong offset!");

// Function BP_AudioPool_OneShot.BP_AudioPool_OneShot_C.EndEventCallback
// 0x0010 (0x0010 - 0x0000)
struct BP_AudioPool_OneShot_C_EndEventCallback final
{
public:
	EAkCallbackType                               CallbackType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45E9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        CallbackInfo;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioPool_OneShot_C_EndEventCallback) == 0x000008, "Wrong alignment on BP_AudioPool_OneShot_C_EndEventCallback");
static_assert(sizeof(BP_AudioPool_OneShot_C_EndEventCallback) == 0x000010, "Wrong size on BP_AudioPool_OneShot_C_EndEventCallback");
static_assert(offsetof(BP_AudioPool_OneShot_C_EndEventCallback, CallbackType) == 0x000000, "Member 'BP_AudioPool_OneShot_C_EndEventCallback::CallbackType' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_EndEventCallback, CallbackInfo) == 0x000008, "Member 'BP_AudioPool_OneShot_C_EndEventCallback::CallbackInfo' has a wrong offset!");

// Function BP_AudioPool_OneShot.BP_AudioPool_OneShot_C.ExecuteUbergraph_BP_AudioPool_OneShot
// 0x02A8 (0x02A8 - 0x0000)
struct BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45EA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Env_Audio_Pool_Base_C*>      CallFunc_GetCritterValidFoliage_CritterValidFoliage; // 0x0018(0x0010)(ReferenceParm)
	class ABP_Env_Audio_Pool_Base_C*              CallFunc_Array_Random_OutItem;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45EB[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45EC[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAkCallbackType                               K2Node_CustomEvent_CallbackType;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45ED[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        K2Node_CustomEvent_CallbackInfo;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInfinite_ReturnValue;                // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45EE[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValeriaAudioListenerPosition_OutLocation; // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValeriaAudioListenerPosition_OutFrontDir; // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValeriaAudioListenerPosition_OutRightDir; // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45EF[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x01F8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On;                             // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithinAttenuation_Within;               // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45F0[0x2];                                     // 0x0222(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0224(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45F1[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0248(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetTimelineLength_NewLength_ImplicitCast; // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot) == 0x000008, "Wrong alignment on BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot");
static_assert(sizeof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot) == 0x0002A8, "Wrong size on BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, EntryPoint) == 0x000000, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_GetCritterValidFoliage_CritterValidFoliage) == 0x000018, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_GetCritterValidFoliage_CritterValidFoliage' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Array_Random_OutItem) == 0x000028, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Array_Random_OutIndex) == 0x000030, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Array_Length_ReturnValue_1) == 0x00003C, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, K2Node_CustomEvent_CallbackType) == 0x000054, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::K2Node_CustomEvent_CallbackType' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, K2Node_CustomEvent_CallbackInfo) == 0x000058, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::K2Node_CustomEvent_CallbackInfo' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000060, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000148, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_GetIsInfinite_ReturnValue) == 0x000149, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_GetIsInfinite_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000150, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000158, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_GetValeriaAudioListenerPosition_OutLocation) == 0x000160, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_GetValeriaAudioListenerPosition_OutLocation' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_GetValeriaAudioListenerPosition_OutFrontDir) == 0x000178, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_GetValeriaAudioListenerPosition_OutFrontDir' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_GetValeriaAudioListenerPosition_OutRightDir) == 0x000190, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_GetValeriaAudioListenerPosition_OutRightDir' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001A8, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_SelectColor_ReturnValue) == 0x0001C0, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_GetDisplayName_ReturnValue) == 0x0001D0, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_IsValid_ReturnValue) == 0x0001E0, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_SelectString_ReturnValue) == 0x0001E8, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, Temp_struct_Variable) == 0x0001F8, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_PostEvent_ReturnValue) == 0x000208, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x00020C, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000210, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, K2Node_CustomEvent_On) == 0x000220, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::K2Node_CustomEvent_On' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_IsWithinAttenuation_Within) == 0x000221, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_IsWithinAttenuation_Within' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000224, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_SelectString_ReturnValue_1) == 0x000238, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000248, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Concat_StrStr_ReturnValue) == 0x000250, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000260, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000270, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000280, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, K2Node_Event_DeltaSeconds) == 0x000290, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000294, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_SetTimelineLength_NewLength_ImplicitCast) == 0x000298, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_SetTimelineLength_NewLength_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x00029C, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x0002A0, "Member 'BP_AudioPool_OneShot_C_ExecuteUbergraph_BP_AudioPool_OneShot::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");

// Function BP_AudioPool_OneShot.BP_AudioPool_OneShot_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AudioPool_OneShot_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioPool_OneShot_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AudioPool_OneShot_C_ReceiveTick");
static_assert(sizeof(BP_AudioPool_OneShot_C_ReceiveTick) == 0x000004, "Wrong size on BP_AudioPool_OneShot_C_ReceiveTick");
static_assert(offsetof(BP_AudioPool_OneShot_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AudioPool_OneShot_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

