#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioPool_StaticLoop

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AudioPool_StaticLoop.BP_AudioPool_StaticLoop_C.SoundStopped__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AudioPool_StaticLoop_C_SoundStopped__DelegateSignature final
{
public:
	class ABP_AudioPool_StaticLoop_C*             PoolObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioPool_StaticLoop_C_SoundStopped__DelegateSignature) == 0x000008, "Wrong alignment on BP_AudioPool_StaticLoop_C_SoundStopped__DelegateSignature");
static_assert(sizeof(BP_AudioPool_StaticLoop_C_SoundStopped__DelegateSignature) == 0x000008, "Wrong size on BP_AudioPool_StaticLoop_C_SoundStopped__DelegateSignature");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_SoundStopped__DelegateSignature, PoolObject) == 0x000000, "Member 'BP_AudioPool_StaticLoop_C_SoundStopped__DelegateSignature::PoolObject' has a wrong offset!");

// Function BP_AudioPool_StaticLoop.BP_AudioPool_StaticLoop_C.AudioDebugFoliage
// 0x0001 (0x0001 - 0x0000)
struct BP_AudioPool_StaticLoop_C_AudioDebugFoliage final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioPool_StaticLoop_C_AudioDebugFoliage) == 0x000001, "Wrong alignment on BP_AudioPool_StaticLoop_C_AudioDebugFoliage");
static_assert(sizeof(BP_AudioPool_StaticLoop_C_AudioDebugFoliage) == 0x000001, "Wrong size on BP_AudioPool_StaticLoop_C_AudioDebugFoliage");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_AudioDebugFoliage, On) == 0x000000, "Member 'BP_AudioPool_StaticLoop_C_AudioDebugFoliage::On' has a wrong offset!");

// Function BP_AudioPool_StaticLoop.BP_AudioPool_StaticLoop_C.DebugLine
// 0x0060 (0x0060 - 0x0000)
struct BP_AudioPool_StaticLoop_C_DebugLine final
{
public:
	struct FVector                                CallFunc_GetValeriaAudioListenerPosition_OutLocation; // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValeriaAudioListenerPosition_OutFrontDir; // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValeriaAudioListenerPosition_OutRightDir; // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioPool_StaticLoop_C_DebugLine) == 0x000008, "Wrong alignment on BP_AudioPool_StaticLoop_C_DebugLine");
static_assert(sizeof(BP_AudioPool_StaticLoop_C_DebugLine) == 0x000060, "Wrong size on BP_AudioPool_StaticLoop_C_DebugLine");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_DebugLine, CallFunc_GetValeriaAudioListenerPosition_OutLocation) == 0x000000, "Member 'BP_AudioPool_StaticLoop_C_DebugLine::CallFunc_GetValeriaAudioListenerPosition_OutLocation' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_DebugLine, CallFunc_GetValeriaAudioListenerPosition_OutFrontDir) == 0x000018, "Member 'BP_AudioPool_StaticLoop_C_DebugLine::CallFunc_GetValeriaAudioListenerPosition_OutFrontDir' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_DebugLine, CallFunc_GetValeriaAudioListenerPosition_OutRightDir) == 0x000030, "Member 'BP_AudioPool_StaticLoop_C_DebugLine::CallFunc_GetValeriaAudioListenerPosition_OutRightDir' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_DebugLine, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_AudioPool_StaticLoop_C_DebugLine::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_AudioPool_StaticLoop.BP_AudioPool_StaticLoop_C.ExecuteUbergraph_BP_AudioPool_StaticLoop
// 0x0180 (0x0180 - 0x0000)
struct BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4630[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_Immediately;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4631[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4632[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Env_Audio_Pool_Base_C*              K2Node_CustomEvent_PoolObject;                     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4633[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x015C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On;                             // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4634[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawDebugSphere_Duration_ImplicitCast;    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop) == 0x000008, "Wrong alignment on BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop");
static_assert(sizeof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop) == 0x000180, "Wrong size on BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, EntryPoint) == 0x000000, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, Temp_struct_Variable) == 0x000008, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, K2Node_CustomEvent_Immediately) == 0x000018, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::K2Node_CustomEvent_Immediately' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_Greater_IntInt_ReturnValue) == 0x00001B, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000038, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000120, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, K2Node_CustomEvent_PoolObject) == 0x000128, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::K2Node_CustomEvent_PoolObject' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_IsValid_ReturnValue_1) == 0x000130, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_IsValid_ReturnValue_2) == 0x000131, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000138, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000140, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, K2Node_Event_DeltaSeconds) == 0x000158, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, Temp_delegate_Variable) == 0x00015C, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, K2Node_CustomEvent_On) == 0x00016C, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::K2Node_CustomEvent_On' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000170, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_Delay_Duration_ImplicitCast) == 0x000174, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop, CallFunc_DrawDebugSphere_Duration_ImplicitCast) == 0x000178, "Member 'BP_AudioPool_StaticLoop_C_ExecuteUbergraph_BP_AudioPool_StaticLoop::CallFunc_DrawDebugSphere_Duration_ImplicitCast' has a wrong offset!");

// Function BP_AudioPool_StaticLoop.BP_AudioPool_StaticLoop_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AudioPool_StaticLoop_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioPool_StaticLoop_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AudioPool_StaticLoop_C_ReceiveTick");
static_assert(sizeof(BP_AudioPool_StaticLoop_C_ReceiveTick) == 0x000004, "Wrong size on BP_AudioPool_StaticLoop_C_ReceiveTick");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AudioPool_StaticLoop_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AudioPool_StaticLoop.BP_AudioPool_StaticLoop_C.StartSound
// 0x0008 (0x0008 - 0x0000)
struct BP_AudioPool_StaticLoop_C_StartSound final
{
public:
	class ABP_Env_Audio_Pool_Base_C*              PoolObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioPool_StaticLoop_C_StartSound) == 0x000008, "Wrong alignment on BP_AudioPool_StaticLoop_C_StartSound");
static_assert(sizeof(BP_AudioPool_StaticLoop_C_StartSound) == 0x000008, "Wrong size on BP_AudioPool_StaticLoop_C_StartSound");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_StartSound, PoolObject) == 0x000000, "Member 'BP_AudioPool_StaticLoop_C_StartSound::PoolObject' has a wrong offset!");

// Function BP_AudioPool_StaticLoop.BP_AudioPool_StaticLoop_C.StopSound
// 0x0001 (0x0001 - 0x0000)
struct BP_AudioPool_StaticLoop_C_StopSound final
{
public:
	bool                                          Immediately;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioPool_StaticLoop_C_StopSound) == 0x000001, "Wrong alignment on BP_AudioPool_StaticLoop_C_StopSound");
static_assert(sizeof(BP_AudioPool_StaticLoop_C_StopSound) == 0x000001, "Wrong size on BP_AudioPool_StaticLoop_C_StopSound");
static_assert(offsetof(BP_AudioPool_StaticLoop_C_StopSound, Immediately) == 0x000000, "Member 'BP_AudioPool_StaticLoop_C_StopSound::Immediately' has a wrong offset!");

}

