#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_arrow_fireworkA_BoomMe

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_arrow_fireworkA_BoomMe.BP_arrow_fireworkA_BoomMe_C
// 0x0060 (0x0308 - 0x02A8)
class ABP_arrow_fireworkA_BoomMe_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NS_exp;                                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      MyNS_exp;                                          // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_primary;                                     // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           Color_secondary;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Dur_explosion;                                     // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9E[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          ExplosionSound;                                    // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         SelectedColor;                                     // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FGameplayTag                           ActorLimitTag;                                     // 0x02FC(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void Event_explode_me();
	void ExecuteUbergraph_BP_arrow_fireworkA_BoomMe(int32 EntryPoint, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsServer_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class APawn* CallFunc_GetInstigator_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, double CallFunc_SelectFloat_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class UAkComponent* CallFunc_SpawnAkComponentAtLocation_ReturnValue, int32 CallFunc_AkEventComponent_ReturnValue, EEndPlayReason K2Node_Event_EndPlayReason, bool CallFunc_IsValid_ReturnValue_2, float CallFunc_SetAttenuationScalingFactor_Value_ImplicitCast);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_arrow_fireworkA_BoomMe_C">();
	}
	static class ABP_arrow_fireworkA_BoomMe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_arrow_fireworkA_BoomMe_C>();
	}
};
static_assert(alignof(ABP_arrow_fireworkA_BoomMe_C) == 0x000008, "Wrong alignment on ABP_arrow_fireworkA_BoomMe_C");
static_assert(sizeof(ABP_arrow_fireworkA_BoomMe_C) == 0x000308, "Wrong size on ABP_arrow_fireworkA_BoomMe_C");
static_assert(offsetof(ABP_arrow_fireworkA_BoomMe_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_arrow_fireworkA_BoomMe_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_arrow_fireworkA_BoomMe_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_arrow_fireworkA_BoomMe_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_arrow_fireworkA_BoomMe_C, NS_exp) == 0x0002B8, "Member 'ABP_arrow_fireworkA_BoomMe_C::NS_exp' has a wrong offset!");
static_assert(offsetof(ABP_arrow_fireworkA_BoomMe_C, MyNS_exp) == 0x0002C0, "Member 'ABP_arrow_fireworkA_BoomMe_C::MyNS_exp' has a wrong offset!");
static_assert(offsetof(ABP_arrow_fireworkA_BoomMe_C, Color_primary) == 0x0002C8, "Member 'ABP_arrow_fireworkA_BoomMe_C::Color_primary' has a wrong offset!");
static_assert(offsetof(ABP_arrow_fireworkA_BoomMe_C, Color_secondary) == 0x0002D8, "Member 'ABP_arrow_fireworkA_BoomMe_C::Color_secondary' has a wrong offset!");
static_assert(offsetof(ABP_arrow_fireworkA_BoomMe_C, Dur_explosion) == 0x0002E8, "Member 'ABP_arrow_fireworkA_BoomMe_C::Dur_explosion' has a wrong offset!");
static_assert(offsetof(ABP_arrow_fireworkA_BoomMe_C, ExplosionSound) == 0x0002F0, "Member 'ABP_arrow_fireworkA_BoomMe_C::ExplosionSound' has a wrong offset!");
static_assert(offsetof(ABP_arrow_fireworkA_BoomMe_C, SelectedColor) == 0x0002F8, "Member 'ABP_arrow_fireworkA_BoomMe_C::SelectedColor' has a wrong offset!");
static_assert(offsetof(ABP_arrow_fireworkA_BoomMe_C, ActorLimitTag) == 0x0002FC, "Member 'ABP_arrow_fireworkA_BoomMe_C::ActorLimitTag' has a wrong offset!");

}

