#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bow_EquipView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Bow_EquipView.BP_Bow_EquipView_C.ExecuteUbergraph_BP_Bow_EquipView
// 0x0270 (0x0270 - 0x0000)
struct BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4506[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4507[0xF];                                     // 0x0031(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DummyArrowAttachment_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4508[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectileFiringComponent*             CallFunc_GetFiringComponent_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    K2Node_CustomEvent_Inventory;                      // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_1;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4509[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectileFiringComponent*             CallFunc_GetFiringComponent_ReturnValue_1;         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue_1;               // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue_1;               // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, const struct FEquipmentItem& Item)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           K2Node_CustomEvent_Ammo;                           // 0x0128(0x0060)()
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, bool bHidden)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    K2Node_CustomEvent_EquipmentComponent_1;           // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHidden;                        // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_450A[0x6];                                     // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentComponent*                    K2Node_CustomEvent_EquipmentComponent;             // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         K2Node_CustomEvent_Item;                           // 0x01B0(0x0050)()
	TDelegate<void(const struct FValeriaItem& Ammo)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         CallFunc_GetEquippedItem_ReturnValue;              // 0x0210(0x0050)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView) == 0x000010, "Wrong alignment on BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView");
static_assert(sizeof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView) == 0x000270, "Wrong size on BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, EntryPoint) == 0x000000, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_IsServer_ReturnValue) == 0x000014, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_Event_EndPlayReason) == 0x000015, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000040, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_GetOwner_ReturnValue) == 0x0000A8, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B0, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_DynamicCast_AsValeria_Character) == 0x0000B8, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_GetFiringComponent_ReturnValue) == 0x0000C8, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_GetFiringComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_GetEquipment_ReturnValue) == 0x0000D0, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_GetInventory_ReturnValue) == 0x0000D8, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_CustomEvent_Inventory) == 0x0000E0, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_CustomEvent_Inventory' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_GetOwner_ReturnValue_1) == 0x0000E8, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_DynamicCast_AsValeria_Character_1) == 0x0000F0, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_DynamicCast_AsValeria_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_GetFiringComponent_ReturnValue_1) == 0x000100, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_GetFiringComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_GetEquipment_ReturnValue_1) == 0x000108, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_GetEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_GetInventory_ReturnValue_1) == 0x000110, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_GetInventory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_CreateDelegate_OutputDelegate_1) == 0x000118, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_CustomEvent_Ammo) == 0x000128, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_CustomEvent_Ammo' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_CreateDelegate_OutputDelegate_2) == 0x000188, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_CustomEvent_EquipmentComponent_1) == 0x000198, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_CustomEvent_EquipmentComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_CustomEvent_bHidden) == 0x0001A0, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_CustomEvent_bHidden' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0001A1, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_CustomEvent_EquipmentComponent) == 0x0001A8, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_CustomEvent_EquipmentComponent' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_CustomEvent_Item) == 0x0001B0, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, K2Node_CreateDelegate_OutputDelegate_3) == 0x000200, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_GetEquippedItem_ReturnValue) == 0x000210, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_GetEquippedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000260, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView, CallFunc_Not_PreBool_ReturnValue) == 0x000261, "Member 'BP_Bow_EquipView_C_ExecuteUbergraph_BP_Bow_EquipView::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_Bow_EquipView.BP_Bow_EquipView_C.Get Arrow Ak
// 0x0028 (0x0028 - 0x0000)
struct BP_Bow_EquipView_C_Get_Arrow_Ak final
{
public:
	class UAkComponent*                           Param_Ak;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AkGetComponent_ComponentCreated;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_450B[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_AkGetComponent_AkComponent;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bow_EquipView_C_Get_Arrow_Ak) == 0x000008, "Wrong alignment on BP_Bow_EquipView_C_Get_Arrow_Ak");
static_assert(sizeof(BP_Bow_EquipView_C_Get_Arrow_Ak) == 0x000028, "Wrong size on BP_Bow_EquipView_C_Get_Arrow_Ak");
static_assert(offsetof(BP_Bow_EquipView_C_Get_Arrow_Ak, Param_Ak) == 0x000000, "Member 'BP_Bow_EquipView_C_Get_Arrow_Ak::Param_Ak' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_Get_Arrow_Ak, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Bow_EquipView_C_Get_Arrow_Ak::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_Get_Arrow_Ak, K2Node_DynamicCast_AsValeria_Character) == 0x000010, "Member 'BP_Bow_EquipView_C_Get_Arrow_Ak::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_Get_Arrow_Ak, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Bow_EquipView_C_Get_Arrow_Ak::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_Get_Arrow_Ak, CallFunc_AkGetComponent_ComponentCreated) == 0x000019, "Member 'BP_Bow_EquipView_C_Get_Arrow_Ak::CallFunc_AkGetComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_Get_Arrow_Ak, CallFunc_AkGetComponent_AkComponent) == 0x000020, "Member 'BP_Bow_EquipView_C_Get_Arrow_Ak::CallFunc_AkGetComponent_AkComponent' has a wrong offset!");

// Function BP_Bow_EquipView.BP_Bow_EquipView_C.HandleEquipmentChanged
// 0x0058 (0x0058 - 0x0000)
struct BP_Bow_EquipView_C_HandleEquipmentChanged final
{
public:
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         Item;                                              // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_Bow_EquipView_C_HandleEquipmentChanged) == 0x000008, "Wrong alignment on BP_Bow_EquipView_C_HandleEquipmentChanged");
static_assert(sizeof(BP_Bow_EquipView_C_HandleEquipmentChanged) == 0x000058, "Wrong size on BP_Bow_EquipView_C_HandleEquipmentChanged");
static_assert(offsetof(BP_Bow_EquipView_C_HandleEquipmentChanged, EquipmentComponent) == 0x000000, "Member 'BP_Bow_EquipView_C_HandleEquipmentChanged::EquipmentComponent' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_HandleEquipmentChanged, Item) == 0x000008, "Member 'BP_Bow_EquipView_C_HandleEquipmentChanged::Item' has a wrong offset!");

// Function BP_Bow_EquipView.BP_Bow_EquipView_C.HandleInventoryChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_Bow_EquipView_C_HandleInventoryChanged final
{
public:
	class UInventoryComponent*                    Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bow_EquipView_C_HandleInventoryChanged) == 0x000008, "Wrong alignment on BP_Bow_EquipView_C_HandleInventoryChanged");
static_assert(sizeof(BP_Bow_EquipView_C_HandleInventoryChanged) == 0x000008, "Wrong size on BP_Bow_EquipView_C_HandleInventoryChanged");
static_assert(offsetof(BP_Bow_EquipView_C_HandleInventoryChanged, Inventory) == 0x000000, "Member 'BP_Bow_EquipView_C_HandleInventoryChanged::Inventory' has a wrong offset!");

// Function BP_Bow_EquipView.BP_Bow_EquipView_C.HandleSelectedAmmo
// 0x0060 (0x0060 - 0x0000)
struct BP_Bow_EquipView_C_HandleSelectedAmmo final
{
public:
	struct FValeriaItem                           Ammo;                                              // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_Bow_EquipView_C_HandleSelectedAmmo) == 0x000008, "Wrong alignment on BP_Bow_EquipView_C_HandleSelectedAmmo");
static_assert(sizeof(BP_Bow_EquipView_C_HandleSelectedAmmo) == 0x000060, "Wrong size on BP_Bow_EquipView_C_HandleSelectedAmmo");
static_assert(offsetof(BP_Bow_EquipView_C_HandleSelectedAmmo, Ammo) == 0x000000, "Member 'BP_Bow_EquipView_C_HandleSelectedAmmo::Ammo' has a wrong offset!");

// Function BP_Bow_EquipView.BP_Bow_EquipView_C.HandleVisibilityChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_Bow_EquipView_C_HandleVisibilityChanged final
{
public:
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_bHidden;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bow_EquipView_C_HandleVisibilityChanged) == 0x000008, "Wrong alignment on BP_Bow_EquipView_C_HandleVisibilityChanged");
static_assert(sizeof(BP_Bow_EquipView_C_HandleVisibilityChanged) == 0x000010, "Wrong size on BP_Bow_EquipView_C_HandleVisibilityChanged");
static_assert(offsetof(BP_Bow_EquipView_C_HandleVisibilityChanged, EquipmentComponent) == 0x000000, "Member 'BP_Bow_EquipView_C_HandleVisibilityChanged::EquipmentComponent' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_HandleVisibilityChanged, Param_bHidden) == 0x000008, "Member 'BP_Bow_EquipView_C_HandleVisibilityChanged::Param_bHidden' has a wrong offset!");

// Function BP_Bow_EquipView.BP_Bow_EquipView_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Bow_EquipView_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bow_EquipView_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Bow_EquipView_C_ReceiveEndPlay");
static_assert(sizeof(BP_Bow_EquipView_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Bow_EquipView_C_ReceiveEndPlay");
static_assert(offsetof(BP_Bow_EquipView_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Bow_EquipView_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Bow_EquipView.BP_Bow_EquipView_C.UpdateArrowVisuals
// 0x00F8 (0x00F8 - 0x0000)
struct BP_Bow_EquipView_C_UpdateArrowVisuals final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_450C[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_Get_Arrow_Ak_Ak;                          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_Get_Arrow_Ak_Ak_1;                        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_450D[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectileFiringComponent*             CallFunc_GetFiringComponent_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UVAL_ItemTypeDefinitionAsset*     CallFunc_GEtSelectedAmmoType_ReturnValue;          // 0x0078(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_450E[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_1;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_450F[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_2;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_3;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4510[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4511[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_4;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh_1;                // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUsableAmmoEquipped_ReturnValue;        // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bow_EquipView_C_UpdateArrowVisuals) == 0x000008, "Wrong alignment on BP_Bow_EquipView_C_UpdateArrowVisuals");
static_assert(sizeof(BP_Bow_EquipView_C_UpdateArrowVisuals) == 0x0000F8, "Wrong size on BP_Bow_EquipView_C_UpdateArrowVisuals");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000001, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_GetDisplayName_ReturnValue_1) == 0x000028, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000038, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_Get_Arrow_Ak_Ak) == 0x000048, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_Get_Arrow_Ak_Ak' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_Get_Arrow_Ak_Ak_1) == 0x000050, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_Get_Arrow_Ak_Ak_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_AsValeria_Character) == 0x000060, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_GetFiringComponent_ReturnValue) == 0x000070, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_GetFiringComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_GEtSelectedAmmoType_ReturnValue) == 0x000078, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_GEtSelectedAmmoType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000080, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000088, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_AsMaterial_Interface) == 0x000090, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_AsMaterial_Interface_1) == 0x0000A0, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_AsMaterial_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_LoadAsset_Blocking_ReturnValue_2) == 0x0000B0, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_LoadAsset_Blocking_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_LoadAsset_Blocking_ReturnValue_3) == 0x0000B8, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_LoadAsset_Blocking_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_AsStatic_Mesh) == 0x0000C0, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_AsNiagara_System) == 0x0000D0, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_bSuccess_4) == 0x0000D8, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_LoadAsset_Blocking_ReturnValue_4) == 0x0000E0, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_LoadAsset_Blocking_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_AsStatic_Mesh_1) == 0x0000E8, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_AsStatic_Mesh_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, K2Node_DynamicCast_bSuccess_5) == 0x0000F0, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_IsValid_ReturnValue_1) == 0x0000F1, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateArrowVisuals, CallFunc_HasUsableAmmoEquipped_ReturnValue) == 0x0000F2, "Member 'BP_Bow_EquipView_C_UpdateArrowVisuals::CallFunc_HasUsableAmmoEquipped_ReturnValue' has a wrong offset!");

// Function BP_Bow_EquipView.BP_Bow_EquipView_C.UpdateDummyArrowVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_Bow_EquipView_C_UpdateDummyArrowVisibility final
{
public:
	bool                                          bNewHidden;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bow_EquipView_C_UpdateDummyArrowVisibility) == 0x000001, "Wrong alignment on BP_Bow_EquipView_C_UpdateDummyArrowVisibility");
static_assert(sizeof(BP_Bow_EquipView_C_UpdateDummyArrowVisibility) == 0x000001, "Wrong size on BP_Bow_EquipView_C_UpdateDummyArrowVisibility");
static_assert(offsetof(BP_Bow_EquipView_C_UpdateDummyArrowVisibility, bNewHidden) == 0x000000, "Member 'BP_Bow_EquipView_C_UpdateDummyArrowVisibility::bNewHidden' has a wrong offset!");

}

