#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bobber

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Bobber.BP_Bobber_C.AttachCableLineEndTo
// 0x0008 (0x0008 - 0x0000)
struct BP_Bobber_C_AttachCableLineEndTo final
{
public:
	class AActor*                                 AttachTo;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bobber_C_AttachCableLineEndTo) == 0x000008, "Wrong alignment on BP_Bobber_C_AttachCableLineEndTo");
static_assert(sizeof(BP_Bobber_C_AttachCableLineEndTo) == 0x000008, "Wrong size on BP_Bobber_C_AttachCableLineEndTo");
static_assert(offsetof(BP_Bobber_C_AttachCableLineEndTo, AttachTo) == 0x000000, "Member 'BP_Bobber_C_AttachCableLineEndTo::AttachTo' has a wrong offset!");

// Function BP_Bobber.BP_Bobber_C.ExecuteUbergraph_BP_Bobber
// 0x0C00 (0x0C00 - 0x0000)
struct BP_Bobber_C_ExecuteUbergraph_BP_Bobber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_AttachTo;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439E[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439F[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0120(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A0[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Ak_Object_Velocity_Set_Previous_Location; // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Ak_Object_Velocity_VectorLength;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Ak_Object_Velocity_VectorLengthClamped;   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventComponent_ReturnValue;             // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A1[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_FishingViewComponent_C*             K2Node_CustomEvent_FishingView;                    // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFishingMiniGameViewState              CallFunc_GetViewState_ReturnValue;                 // 0x0270(0x0120)()
	bool                                          CallFunc_Is_Bobber_in_Water__IsInWater;            // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A2[0x1];                                     // 0x0393(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_fishNumber;                     // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A3[0x3];                                     // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventComponent_ReturnValue_1;           // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x03D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A4[0x7];                                     // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x04D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x05C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x06A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x06C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A5[0x7];                                     // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x06D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFishingComponent*                      CallFunc_GetFishing_ReturnValue;                   // 0x06D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x06E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldCurrentFishStruggle_ReturnValue;    // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFishingSafeTier                              CallFunc_GetCurrentSafetyTier_ReturnValue;         // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A6[0x6];                                     // 0x06EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x06F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x06F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x06FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A7[0x5];                                     // 0x06FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_spin;                           // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_stretch;                        // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0718(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0730(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0818(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0838(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0920(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isBiting;                       // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A8[0x7];                                     // 0x0939(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x0940(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0A28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_AkEventSpawnAttached_Ak;                  // 0x0A30(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventSpawnAttached_Id;                  // 0x0A38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A9[0x4];                                     // 0x0A3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x0A40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent;              // 0x0A58(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID;               // 0x0A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43AA[0x4];                                     // 0x0A64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_5;    // 0x0A68(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0A80(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43AB[0x7];                                     // 0x0A89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFishingMiniGameViewState              CallFunc_GetViewState_ReturnValue_1;               // 0x0A90(0x0120)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0BB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0BB1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43AC[0x2];                                     // 0x0BB2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventActor_ReturnValue;                 // 0x0BB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Should_Struggle_Should_Struggle;          // 0x0BB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Should_Struggle_Should_Struggle_1;        // 0x0BB9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Should_Struggle_Should_Struggle_2;        // 0x0BBA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0BBB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43AD[0x4];                                     // 0x0BBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_update_bobberStruggle_spin_ImplicitCast;  // 0x0BC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_update_bobberStruggle_stretch_ImplicitCast; // 0x0BC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Ak_Object_Velocity_Delta_Time_ImplicitCast; // 0x0BD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_update_bobberStruggle_spin_ImplicitCast_1; // 0x0BD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_update_bobberStruggle_stretch_ImplicitCast_1; // 0x0BE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0BEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0BF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber) == 0x000010, "Wrong alignment on BP_Bobber_C_ExecuteUbergraph_BP_Bobber");
static_assert(sizeof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber) == 0x000C00, "Wrong size on BP_Bobber_C_ExecuteUbergraph_BP_Bobber");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, EntryPoint) == 0x000000, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_IsLocallyControlled_ReturnValue) == 0x000004, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, K2Node_CustomEvent_AttachTo) == 0x000008, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::K2Node_CustomEvent_AttachTo' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000038, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000120, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, K2Node_Event_DeltaSeconds) == 0x000208, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Ak_Object_Velocity_Set_Previous_Location) == 0x000210, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Ak_Object_Velocity_Set_Previous_Location' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Ak_Object_Velocity_VectorLength) == 0x000228, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Ak_Object_Velocity_VectorLength' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Ak_Object_Velocity_VectorLengthClamped) == 0x000230, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Ak_Object_Velocity_VectorLengthClamped' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_AkEventComponent_ReturnValue) == 0x000238, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_AkEventComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000240, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000258, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, K2Node_CustomEvent_FishingView) == 0x000268, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::K2Node_CustomEvent_FishingView' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_GetViewState_ReturnValue) == 0x000270, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_GetViewState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Is_Bobber_in_Water__IsInWater) == 0x000390, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Is_Bobber_in_Water__IsInWater' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000391, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000392, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, K2Node_CustomEvent_fishNumber) == 0x000394, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::K2Node_CustomEvent_fishNumber' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000398, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_AkEventComponent_ReturnValue_1) == 0x00039C, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_AkEventComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0003A0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0003A8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0003C0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0003C8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0003D0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x0004B8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_IsValid_ReturnValue_1) == 0x0004C0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0004C8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0004D0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0004D8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x0005C0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0006A8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, K2Node_DynamicCast_AsValeria_Character) == 0x0006C0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, K2Node_DynamicCast_bSuccess) == 0x0006C8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0006D0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_GetFishing_ReturnValue) == 0x0006D8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_GetFishing_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_GetController_ReturnValue) == 0x0006E0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_ShouldCurrentFishStruggle_ReturnValue) == 0x0006E8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_ShouldCurrentFishStruggle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_GetCurrentSafetyTier_ReturnValue) == 0x0006E9, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_GetCurrentSafetyTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_GetPlayerController_ReturnValue) == 0x0006F0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, K2Node_SwitchEnum_CmpSuccess) == 0x0006F8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0006F9, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0006FA, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, K2Node_CustomEvent_spin) == 0x000700, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::K2Node_CustomEvent_spin' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, K2Node_CustomEvent_stretch) == 0x000708, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::K2Node_CustomEvent_stretch' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Lerp_ReturnValue) == 0x000710, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_MakeRotator_ReturnValue) == 0x000718, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x000730, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000818, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Lerp_ReturnValue_1) == 0x000830, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000838, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_MakeVector_ReturnValue) == 0x000920, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, K2Node_CustomEvent_isBiting) == 0x000938, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::K2Node_CustomEvent_isBiting' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x000940, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000A28, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_AkEventSpawnAttached_Ak) == 0x000A30, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_AkEventSpawnAttached_Ak' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_AkEventSpawnAttached_Id) == 0x000A38, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_AkEventSpawnAttached_Id' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_GetComponentLocation_ReturnValue_4) == 0x000A40, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_GetComponentLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_AkEventLocation_AkComponent) == 0x000A58, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_AkEventLocation_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_AkEventLocation_Playing_ID) == 0x000A60, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_AkEventLocation_Playing_ID' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_GetComponentLocation_ReturnValue_5) == 0x000A68, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_GetComponentLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000A80, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_IsValid_ReturnValue_2) == 0x000A88, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_GetViewState_ReturnValue_1) == 0x000A90, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_GetViewState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000BB0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x000BB1, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_AkEventActor_ReturnValue) == 0x000BB4, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_AkEventActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Should_Struggle_Should_Struggle) == 0x000BB8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Should_Struggle_Should_Struggle' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Should_Struggle_Should_Struggle_1) == 0x000BB9, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Should_Struggle_Should_Struggle_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Should_Struggle_Should_Struggle_2) == 0x000BBA, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Should_Struggle_Should_Struggle_2' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000BBB, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_update_bobberStruggle_spin_ImplicitCast) == 0x000BC0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_update_bobberStruggle_spin_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_update_bobberStruggle_stretch_ImplicitCast) == 0x000BC8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_update_bobberStruggle_stretch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_Ak_Object_Velocity_Delta_Time_ImplicitCast) == 0x000BD0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_Ak_Object_Velocity_Delta_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_update_bobberStruggle_spin_ImplicitCast_1) == 0x000BD8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_update_bobberStruggle_spin_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_update_bobberStruggle_stretch_ImplicitCast_1) == 0x000BE0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_update_bobberStruggle_stretch_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000BE8, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000BEC, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_ExecuteUbergraph_BP_Bobber, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000BF0, "Member 'BP_Bobber_C_ExecuteUbergraph_BP_Bobber::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_Bobber.BP_Bobber_C.OnFishIsBitingChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Bobber_C_OnFishIsBitingChanged final
{
public:
	bool                                          IsBiting;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bobber_C_OnFishIsBitingChanged) == 0x000001, "Wrong alignment on BP_Bobber_C_OnFishIsBitingChanged");
static_assert(sizeof(BP_Bobber_C_OnFishIsBitingChanged) == 0x000001, "Wrong size on BP_Bobber_C_OnFishIsBitingChanged");
static_assert(offsetof(BP_Bobber_C_OnFishIsBitingChanged, IsBiting) == 0x000000, "Member 'BP_Bobber_C_OnFishIsBitingChanged::IsBiting' has a wrong offset!");

// Function BP_Bobber.BP_Bobber_C.OnNibbled
// 0x0004 (0x0004 - 0x0000)
struct BP_Bobber_C_OnNibbled final
{
public:
	int32                                         FishNumber;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bobber_C_OnNibbled) == 0x000004, "Wrong alignment on BP_Bobber_C_OnNibbled");
static_assert(sizeof(BP_Bobber_C_OnNibbled) == 0x000004, "Wrong size on BP_Bobber_C_OnNibbled");
static_assert(offsetof(BP_Bobber_C_OnNibbled, FishNumber) == 0x000000, "Member 'BP_Bobber_C_OnNibbled::FishNumber' has a wrong offset!");

// Function BP_Bobber.BP_Bobber_C.OnViewWasUpdated
// 0x0008 (0x0008 - 0x0000)
struct BP_Bobber_C_OnViewWasUpdated final
{
public:
	class UBP_FishingViewComponent_C*             Param_FishingView;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bobber_C_OnViewWasUpdated) == 0x000008, "Wrong alignment on BP_Bobber_C_OnViewWasUpdated");
static_assert(sizeof(BP_Bobber_C_OnViewWasUpdated) == 0x000008, "Wrong size on BP_Bobber_C_OnViewWasUpdated");
static_assert(offsetof(BP_Bobber_C_OnViewWasUpdated, Param_FishingView) == 0x000000, "Member 'BP_Bobber_C_OnViewWasUpdated::Param_FishingView' has a wrong offset!");

// Function BP_Bobber.BP_Bobber_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Bobber_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bobber_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Bobber_C_ReceiveTick");
static_assert(sizeof(BP_Bobber_C_ReceiveTick) == 0x000004, "Wrong size on BP_Bobber_C_ReceiveTick");
static_assert(offsetof(BP_Bobber_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Bobber_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Bobber.BP_Bobber_C.SetRelativeRotation
// 0x0150 (0x0150 - 0x0000)
struct BP_Bobber_C_SetRelativeRotation final
{
public:
	double                                        RotationScale;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RotationScale2;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue_1;    // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast_1; // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bobber_C_SetRelativeRotation) == 0x000008, "Wrong alignment on BP_Bobber_C_SetRelativeRotation");
static_assert(sizeof(BP_Bobber_C_SetRelativeRotation) == 0x000150, "Wrong size on BP_Bobber_C_SetRelativeRotation");
static_assert(offsetof(BP_Bobber_C_SetRelativeRotation, RotationScale) == 0x000000, "Member 'BP_Bobber_C_SetRelativeRotation::RotationScale' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_SetRelativeRotation, RotationScale2) == 0x000008, "Member 'BP_Bobber_C_SetRelativeRotation::RotationScale2' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_SetRelativeRotation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Bobber_C_SetRelativeRotation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_SetRelativeRotation, CallFunc_RotatorFromAxisAndAngle_ReturnValue) == 0x000018, "Member 'BP_Bobber_C_SetRelativeRotation::CallFunc_RotatorFromAxisAndAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_SetRelativeRotation, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000030, "Member 'BP_Bobber_C_SetRelativeRotation::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_SetRelativeRotation, CallFunc_RotatorFromAxisAndAngle_ReturnValue_1) == 0x000048, "Member 'BP_Bobber_C_SetRelativeRotation::CallFunc_RotatorFromAxisAndAngle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_SetRelativeRotation, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000060, "Member 'BP_Bobber_C_SetRelativeRotation::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_SetRelativeRotation, CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast) == 0x000148, "Member 'BP_Bobber_C_SetRelativeRotation::CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_SetRelativeRotation, CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast_1) == 0x00014C, "Member 'BP_Bobber_C_SetRelativeRotation::CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast_1' has a wrong offset!");

// Function BP_Bobber.BP_Bobber_C.Should Struggle
// 0x0140 (0x0140 - 0x0000)
struct BP_Bobber_C_Should_Struggle final
{
public:
	bool                                          Param_Should_Struggle;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43AE[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFishingMiniGameViewState              CallFunc_GetViewState_ReturnValue;                 // 0x0010(0x0120)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bobber_C_Should_Struggle) == 0x000010, "Wrong alignment on BP_Bobber_C_Should_Struggle");
static_assert(sizeof(BP_Bobber_C_Should_Struggle) == 0x000140, "Wrong size on BP_Bobber_C_Should_Struggle");
static_assert(offsetof(BP_Bobber_C_Should_Struggle, Param_Should_Struggle) == 0x000000, "Member 'BP_Bobber_C_Should_Struggle::Param_Should_Struggle' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_Should_Struggle, CallFunc_GetViewState_ReturnValue) == 0x000010, "Member 'BP_Bobber_C_Should_Struggle::CallFunc_GetViewState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_Should_Struggle, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'BP_Bobber_C_Should_Struggle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Bobber.BP_Bobber_C.update_bobberStruggle
// 0x0010 (0x0010 - 0x0000)
struct BP_Bobber_C_Update_bobberStruggle final
{
public:
	double                                        Spin;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stretch;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bobber_C_Update_bobberStruggle) == 0x000008, "Wrong alignment on BP_Bobber_C_Update_bobberStruggle");
static_assert(sizeof(BP_Bobber_C_Update_bobberStruggle) == 0x000010, "Wrong size on BP_Bobber_C_Update_bobberStruggle");
static_assert(offsetof(BP_Bobber_C_Update_bobberStruggle, Spin) == 0x000000, "Member 'BP_Bobber_C_Update_bobberStruggle::Spin' has a wrong offset!");
static_assert(offsetof(BP_Bobber_C_Update_bobberStruggle, Stretch) == 0x000008, "Member 'BP_Bobber_C_Update_bobberStruggle::Stretch' has a wrong offset!");

}

