#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cinematic_CharSelect_BodyRevealFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Cinematic_CharSelect_BodyRevealFX.BP_Cinematic_CharSelect_BodyRevealFX_C.ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX
// 0x0220 (0x0220 - 0x0000)
struct BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B3E[0x9];                                     // 0x0007(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B3F[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Cinematic_Intro_BodyRevealFX_C*     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B40[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x00C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B41[0x5];                                     // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B42[0x1];                                     // 0x01C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x01C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B43[0x2];                                     // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B44[0x2];                                     // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_CustomEvent_Character;                      // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          K2Node_CustomEvent_EssenceEffect;                  // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX) == 0x000010, "Wrong alignment on BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX");
static_assert(sizeof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX) == 0x000220, "Wrong size on BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, EntryPoint) == 0x000000, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_3) == 0x000078, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_Lerp_ReturnValue) == 0x000088, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, K2Node_MakeStruct_LinearColor) == 0x000090, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_Lerp_ReturnValue_1) == 0x0000A0, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_MakeVector_ReturnValue) == 0x0000A8, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_4) == 0x0000C0, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x0000C8, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_5) == 0x0001B0, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_6) == 0x0001B1, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_7) == 0x0001B2, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001B8, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0001C0, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_8) == 0x0001C1, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_9) == 0x0001C2, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, K2Node_MakeStruct_LinearColor_1) == 0x0001C4, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_10) == 0x0001D4, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_11) == 0x0001D5, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0001D8, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_12) == 0x0001E0, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_13) == 0x0001E1, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_14) == 0x0001E2, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_15) == 0x0001E3, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, K2Node_Event_EndPlayReason) == 0x0001E4, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_IsValid_ReturnValue_16) == 0x0001E5, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_IsValid_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, K2Node_CustomEvent_Character) == 0x0001E8, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, K2Node_CustomEvent_EssenceEffect) == 0x0001F0, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::K2Node_CustomEvent_EssenceEffect' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0001F8, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000200, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_AkEventGlobal_ReturnValue) == 0x000208, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_AkEventGlobal_ReturnValue_1) == 0x00020C, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000210, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000218, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ExecuteUbergraph_BP_Cinematic_CharSelect_BodyRevealFX::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");

// Function BP_Cinematic_CharSelect_BodyRevealFX.BP_Cinematic_CharSelect_BodyRevealFX_C.Initialize_Actor
// 0x0010 (0x0010 - 0x0000)
struct BP_Cinematic_CharSelect_BodyRevealFX_C_Initialize_Actor final
{
public:
	class AValeriaCharacter*                      Param_Character;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          EssenceEffect;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cinematic_CharSelect_BodyRevealFX_C_Initialize_Actor) == 0x000008, "Wrong alignment on BP_Cinematic_CharSelect_BodyRevealFX_C_Initialize_Actor");
static_assert(sizeof(BP_Cinematic_CharSelect_BodyRevealFX_C_Initialize_Actor) == 0x000010, "Wrong size on BP_Cinematic_CharSelect_BodyRevealFX_C_Initialize_Actor");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_Initialize_Actor, Param_Character) == 0x000000, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_Initialize_Actor::Param_Character' has a wrong offset!");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_Initialize_Actor, EssenceEffect) == 0x000008, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_Initialize_Actor::EssenceEffect' has a wrong offset!");

// Function BP_Cinematic_CharSelect_BodyRevealFX.BP_Cinematic_CharSelect_BodyRevealFX_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Cinematic_CharSelect_BodyRevealFX_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Cinematic_CharSelect_BodyRevealFX_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Cinematic_CharSelect_BodyRevealFX_C_ReceiveEndPlay");
static_assert(sizeof(BP_Cinematic_CharSelect_BodyRevealFX_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Cinematic_CharSelect_BodyRevealFX_C_ReceiveEndPlay");
static_assert(offsetof(BP_Cinematic_CharSelect_BodyRevealFX_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Cinematic_CharSelect_BodyRevealFX_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

