#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cinematic_Intro_BodyRevealFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Cinematic_Intro_BodyRevealFX.BP_Cinematic_Intro_BodyRevealFX_C
// 0x0080 (0x0328 - 0x02A8)
class ABP_Cinematic_Intro_BodyRevealFX_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Hat;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hair;                                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Legs;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Torso;                                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Root_Mesh;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_For_Full_Bounds;                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Editor_Icon;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 FacialHair;                                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 FaceMask;                                          // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      PlayerCharacter;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RevealMaterialInstance;                            // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 RootSkeletonComponentToCopy;                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RevealMaterialParent;                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Cinematic_Intro_BodyRevealFX(int32 EntryPoint, TScriptInterface<class IVAL_CustomizableCharacterInterface> CallFunc_GetHatMeshComponent_self_CastInput, class USkeletalMeshComponent* CallFunc_GetHatMeshComponent_ReturnValue, TScriptInterface<class IVAL_CustomizableCharacterInterface> CallFunc_GetFacialHairMeshComponent_self_CastInput, class USkeletalMeshComponent* CallFunc_GetFacialHairMeshComponent_ReturnValue, TScriptInterface<class IVAL_CustomizableCharacterInterface> CallFunc_GetFaceMaskMeshComponent_self_CastInput, class USkeletalMeshComponent* CallFunc_GetFaceMaskMeshComponent_ReturnValue, TScriptInterface<class IVAL_CustomizableCharacterInterface> CallFunc_GetLegsMeshComponent_self_CastInput, class USkeletalMeshComponent* CallFunc_GetLegsMeshComponent_ReturnValue, TScriptInterface<class IVAL_CustomizableCharacterInterface> CallFunc_GetHairMeshComponent_self_CastInput, class USkeletalMeshComponent* CallFunc_GetHairMeshComponent_ReturnValue, TScriptInterface<class IVAL_CustomizableCharacterInterface> CallFunc_GetHeadMeshComponent_self_CastInput, class USkeletalMeshComponent* CallFunc_GetHeadMeshComponent_ReturnValue, TScriptInterface<class IVAL_CustomizableCharacterInterface> CallFunc_GetTorsoMeshComponent_self_CastInput, class USkeletalMeshComponent* CallFunc_GetTorsoMeshComponent_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, bool CallFunc_GetPreviewActor_FoundValidPreview, bool CallFunc_IsServer_ReturnValue, class APawn* CallFunc_GetPlayerPawn_ReturnValue, bool CallFunc_IsCaptureInProgress_ReturnValue, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue);
	void GetPreviewActor(bool* FoundValidPreview, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class ABP_ValeriaCharacter_C*>& CallFunc_GetAllActorsOfClass_OutActors, bool CallFunc_IsEditor_ReturnValue, class ABP_ValeriaCharacter_C* CallFunc_Array_Get_Item, const class FString& CallFunc_GetDisplayName_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Contains_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Contains_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue);
	void Initialize_Actor();
	void InitializeFXComponents(class USkinnedMeshComponent* CopyFromComponent, class USkinnedMeshComponent* CopyToComponent, const TArray<struct FSkeletalMaterial>& OverrideMaterialArray, int32 CallFunc_GetNumMaterials_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 Temp_int_Variable, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class USkinnedAsset* CallFunc_GetSkinnedAsset_ReturnValue);
	void ReceiveBeginPlay();
	void UserConstructionScript(bool CallFunc_IsValid_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Cinematic_Intro_BodyRevealFX_C">();
	}
	static class ABP_Cinematic_Intro_BodyRevealFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Cinematic_Intro_BodyRevealFX_C>();
	}
};
static_assert(alignof(ABP_Cinematic_Intro_BodyRevealFX_C) == 0x000008, "Wrong alignment on ABP_Cinematic_Intro_BodyRevealFX_C");
static_assert(sizeof(ABP_Cinematic_Intro_BodyRevealFX_C) == 0x000328, "Wrong size on ABP_Cinematic_Intro_BodyRevealFX_C");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, Hat) == 0x0002B0, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::Hat' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, Hair) == 0x0002B8, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::Hair' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, Legs) == 0x0002C0, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::Legs' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, Torso) == 0x0002C8, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::Torso' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, Root_Mesh) == 0x0002D0, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::Root_Mesh' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, Scene) == 0x0002D8, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, Mesh_For_Full_Bounds) == 0x0002E0, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::Mesh_For_Full_Bounds' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, Editor_Icon) == 0x0002E8, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::Editor_Icon' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, FacialHair) == 0x0002F0, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::FacialHair' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, FaceMask) == 0x0002F8, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::FaceMask' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, Head) == 0x000300, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::Head' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, PlayerCharacter) == 0x000308, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, RevealMaterialInstance) == 0x000310, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::RevealMaterialInstance' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, RootSkeletonComponentToCopy) == 0x000318, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::RootSkeletonComponentToCopy' has a wrong offset!");
static_assert(offsetof(ABP_Cinematic_Intro_BodyRevealFX_C, RevealMaterialParent) == 0x000320, "Member 'ABP_Cinematic_Intro_BodyRevealFX_C::RevealMaterialParent' has a wrong offset!");

}

