#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterPreview

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "ValeriaDTOs_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterPreview.BP_CharacterPreview_C.SetRotation
// 0x0130 (0x0130 - 0x0000)
struct BP_CharacterPreview_C_SetRotation final
{
public:
	struct FRotator                               DeltaRotation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0048(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_CharacterPreview_C_SetRotation) == 0x000008, "Wrong alignment on BP_CharacterPreview_C_SetRotation");
static_assert(sizeof(BP_CharacterPreview_C_SetRotation) == 0x000130, "Wrong size on BP_CharacterPreview_C_SetRotation");
static_assert(offsetof(BP_CharacterPreview_C_SetRotation, DeltaRotation) == 0x000000, "Member 'BP_CharacterPreview_C_SetRotation::DeltaRotation' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_SetRotation, CallFunc_ComposeRotators_ReturnValue) == 0x000018, "Member 'BP_CharacterPreview_C_SetRotation::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_SetRotation, CallFunc_ComposeRotators_ReturnValue_1) == 0x000030, "Member 'BP_CharacterPreview_C_SetRotation::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_SetRotation, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000048, "Member 'BP_CharacterPreview_C_SetRotation::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function BP_CharacterPreview.BP_CharacterPreview_C.SetCharacterMetadata
// 0x0778 (0x0778 - 0x0000)
struct BP_CharacterPreview_C_SetCharacterMetadata final
{
public:
	struct FVALDTOS_MetaCharacterFormat           NewMetaCharacterData;                              // 0x0000(0x0778)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_CharacterPreview_C_SetCharacterMetadata) == 0x000008, "Wrong alignment on BP_CharacterPreview_C_SetCharacterMetadata");
static_assert(sizeof(BP_CharacterPreview_C_SetCharacterMetadata) == 0x000778, "Wrong size on BP_CharacterPreview_C_SetCharacterMetadata");
static_assert(offsetof(BP_CharacterPreview_C_SetCharacterMetadata, NewMetaCharacterData) == 0x000000, "Member 'BP_CharacterPreview_C_SetCharacterMetadata::NewMetaCharacterData' has a wrong offset!");

// Function BP_CharacterPreview.BP_CharacterPreview_C.GetValeriaCharacter
// 0x0018 (0x0018 - 0x0000)
struct BP_CharacterPreview_C_GetValeriaCharacter final
{
public:
	class AValeriaCharacter*                      Character;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterPreview_C_GetValeriaCharacter) == 0x000008, "Wrong alignment on BP_CharacterPreview_C_GetValeriaCharacter");
static_assert(sizeof(BP_CharacterPreview_C_GetValeriaCharacter) == 0x000018, "Wrong size on BP_CharacterPreview_C_GetValeriaCharacter");
static_assert(offsetof(BP_CharacterPreview_C_GetValeriaCharacter, Character) == 0x000000, "Member 'BP_CharacterPreview_C_GetValeriaCharacter::Character' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_GetValeriaCharacter, K2Node_DynamicCast_AsValeria_Character) == 0x000008, "Member 'BP_CharacterPreview_C_GetValeriaCharacter::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_GetValeriaCharacter, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_CharacterPreview_C_GetValeriaCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_CharacterPreview.BP_CharacterPreview_C.ExecuteUbergraph_BP_CharacterPreview
// 0x10E0 (0x10E0 - 0x0000)
struct BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FE9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_Character;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVALDTOS_MetaCharacterFormat           K2Node_CustomEvent_NewMetaCharacterData;           // 0x0048(0x0778)()
	struct FVAL_CharacterCustomizationLoadout     CallFunc_PersistenceDTOsToLoadout_ReturnValue;     // 0x07C0(0x0900)()
	class UVAL_ApplyCustomizationsToActorProxy*   CallFunc_ApplyCustomizationsToActor_ReturnValue;   // 0x10C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x10C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x10D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview) == 0x000008, "Wrong alignment on BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview");
static_assert(sizeof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview) == 0x0010E0, "Wrong size on BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview");
static_assert(offsetof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview, EntryPoint) == 0x000000, "Member 'BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview, CallFunc_GetValeriaCharacter_Character) == 0x000008, "Member 'BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview::CallFunc_GetValeriaCharacter_Character' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview, CallFunc_GetCharacterCustomizationComponent_ReturnValue) == 0x000010, "Member 'BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview::CallFunc_GetCharacterCustomizationComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview, K2Node_CustomEvent_NewMetaCharacterData) == 0x000048, "Member 'BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview::K2Node_CustomEvent_NewMetaCharacterData' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview, CallFunc_PersistenceDTOsToLoadout_ReturnValue) == 0x0007C0, "Member 'BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview::CallFunc_PersistenceDTOsToLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview, CallFunc_ApplyCustomizationsToActor_ReturnValue) == 0x0010C0, "Member 'BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview::CallFunc_ApplyCustomizationsToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview, K2Node_CreateDelegate_OutputDelegate_3) == 0x0010C8, "Member 'BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview, CallFunc_IsValid_ReturnValue) == 0x0010D8, "Member 'BP_CharacterPreview_C_ExecuteUbergraph_BP_CharacterPreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CharacterPreview.BP_CharacterPreview_C.GetPreviewCharacter
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterPreview_C_GetPreviewCharacter final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterPreview_C_GetPreviewCharacter) == 0x000008, "Wrong alignment on BP_CharacterPreview_C_GetPreviewCharacter");
static_assert(sizeof(BP_CharacterPreview_C_GetPreviewCharacter) == 0x000008, "Wrong size on BP_CharacterPreview_C_GetPreviewCharacter");
static_assert(offsetof(BP_CharacterPreview_C_GetPreviewCharacter, ReturnValue) == 0x000000, "Member 'BP_CharacterPreview_C_GetPreviewCharacter::ReturnValue' has a wrong offset!");

}

