#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterCustomization_WardrobeButtonInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BP_CharacterCustomization_WardrobeButtonInfo.BP_CharacterCustomization_WardrobeButtonInfo
// 0x0030 (0x0030 - 0x0000)
struct FBP_CharacterCustomization_WardrobeButtonInfo final
{
public:
	class FName                                   Name_8_6770AF9743F6F7EBC89FB8A3EDED85BF;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayName_7_60CF7ED049F172EEC18A16B2C91A805A;    // 0x0008(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             Icon_11_FD99D80042057B439670889D56BE4077;          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Content_2_0950E35C41F787CF250DB78F07D10100;        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBP_CharacterCustomization_WardrobeButtonInfo) == 0x000008, "Wrong alignment on FBP_CharacterCustomization_WardrobeButtonInfo");
static_assert(sizeof(FBP_CharacterCustomization_WardrobeButtonInfo) == 0x000030, "Wrong size on FBP_CharacterCustomization_WardrobeButtonInfo");
static_assert(offsetof(FBP_CharacterCustomization_WardrobeButtonInfo, Name_8_6770AF9743F6F7EBC89FB8A3EDED85BF) == 0x000000, "Member 'FBP_CharacterCustomization_WardrobeButtonInfo::Name_8_6770AF9743F6F7EBC89FB8A3EDED85BF' has a wrong offset!");
static_assert(offsetof(FBP_CharacterCustomization_WardrobeButtonInfo, DisplayName_7_60CF7ED049F172EEC18A16B2C91A805A) == 0x000008, "Member 'FBP_CharacterCustomization_WardrobeButtonInfo::DisplayName_7_60CF7ED049F172EEC18A16B2C91A805A' has a wrong offset!");
static_assert(offsetof(FBP_CharacterCustomization_WardrobeButtonInfo, Icon_11_FD99D80042057B439670889D56BE4077) == 0x000020, "Member 'FBP_CharacterCustomization_WardrobeButtonInfo::Icon_11_FD99D80042057B439670889D56BE4077' has a wrong offset!");
static_assert(offsetof(FBP_CharacterCustomization_WardrobeButtonInfo, Content_2_0950E35C41F787CF250DB78F07D10100) == 0x000028, "Member 'FBP_CharacterCustomization_WardrobeButtonInfo::Content_2_0950E35C41F787CF250DB78F07D10100' has a wrong offset!");

}

