#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CrafterInWorldPlateWidgetComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "BP_PlateWidgetComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CrafterInWorldPlateWidgetComponent.BP_CrafterInWorldPlateWidgetComponent_C
// 0x0020 (0x09C0 - 0x09A0)
class UBP_CrafterInWorldPlateWidgetComponent_C final : public UBP_PlateWidgetComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CrafterInWorldPlateWidgetComponent_C; // 0x0998(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          InteractableWantsVisible;                          // 0x09A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60EF[0x7];                                     // 0x09A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrafterComponent*                      CrafterComp;                                       // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InteractComp;                                      // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	bool ShouldPlateBeVisible(class APlayerController* CallFunc_GetPlayerControllerFromID_ReturnValue, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class UCrafterComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsPlateVisible_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void On_Widget_Created();
	void HandleOnHighlightToggled(class UInteractableComponent* Interactable, bool IsHighlighted, class AValeriaPlayerController* Player);
	void ExecuteUbergraph_BP_CrafterInWorldPlateWidgetComponent(int32 EntryPoint, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class AActor* CallFunc_GetOwner_ReturnValue, EEndPlayReason K2Node_Event_EndPlayReason, class UCrafterComponent* CallFunc_GetComponentByClass_ReturnValue, class UUserWidget* CallFunc_GetUserWidgetObject_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, TScriptInterface<class IBPI_CrafterPlate_C> K2Node_DynamicCast_AsBPI_Crafter_Plate, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_DoesImplementInterface_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, class UInteractableComponent* CallFunc_GetComponentByClass_ReturnValue_1, class UInteractableComponent* K2Node_CustomEvent_Interactable, bool K2Node_CustomEvent_IsHighlighted, class AValeriaPlayerController* K2Node_CustomEvent_player, class USphereComponent* CallFunc_K2_FindClosestInteractableLocation_ReturnValue, class UObject* CallFunc_GetInteractable_ReturnValue, class UCrafterComponent* K2Node_DynamicCast_AsCrafter_Component, bool K2Node_DynamicCast_bSuccess_1, TDelegate<void(class UInteractableComponent* InteractableComponent, bool IsHighlighted, class AValeriaPlayerController* Player)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(class UInteractableComponent* InteractableComponent, bool IsHighlighted, class AValeriaPlayerController* Player)> K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UUserWidget* CallFunc_GetUserWidgetObject_ReturnValue_1, TScriptInterface<class IBPI_CrafterPlate_C> K2Node_DynamicCast_AsBPI_Crafter_Plate_1, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_DoesImplementInterface_ReturnValue_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CrafterInWorldPlateWidgetComponent_C">();
	}
	static class UBP_CrafterInWorldPlateWidgetComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CrafterInWorldPlateWidgetComponent_C>();
	}
};
static_assert(alignof(UBP_CrafterInWorldPlateWidgetComponent_C) == 0x000010, "Wrong alignment on UBP_CrafterInWorldPlateWidgetComponent_C");
static_assert(sizeof(UBP_CrafterInWorldPlateWidgetComponent_C) == 0x0009C0, "Wrong size on UBP_CrafterInWorldPlateWidgetComponent_C");
static_assert(offsetof(UBP_CrafterInWorldPlateWidgetComponent_C, UberGraphFrame_BP_CrafterInWorldPlateWidgetComponent_C) == 0x000998, "Member 'UBP_CrafterInWorldPlateWidgetComponent_C::UberGraphFrame_BP_CrafterInWorldPlateWidgetComponent_C' has a wrong offset!");
static_assert(offsetof(UBP_CrafterInWorldPlateWidgetComponent_C, InteractableWantsVisible) == 0x0009A0, "Member 'UBP_CrafterInWorldPlateWidgetComponent_C::InteractableWantsVisible' has a wrong offset!");
static_assert(offsetof(UBP_CrafterInWorldPlateWidgetComponent_C, CrafterComp) == 0x0009A8, "Member 'UBP_CrafterInWorldPlateWidgetComponent_C::CrafterComp' has a wrong offset!");
static_assert(offsetof(UBP_CrafterInWorldPlateWidgetComponent_C, InteractComp) == 0x0009B0, "Member 'UBP_CrafterInWorldPlateWidgetComponent_C::InteractComp' has a wrong offset!");

}

