#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraFadeScenery

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CameraFadeScenery.BP_CameraFadeScenery_C
// 0x0178 (0x0218 - 0x00A0)
class UBP_CameraFadeScenery_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSet<class AActor*>                           FadedActors;                                       // 0x00A8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UCameraComponent*                       Camera;                                            // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterial*>                      Material;                                          // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class AActor*, class UMaterialInterface*> BaseMaterials;                                     // 0x0118(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class AActor*, class UMaterialInstanceDynamic*> DynamicMaterials;                                  // 0x0168(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FLinearColor                           Color;                                             // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, struct FTimerHandle>      Timers;                                            // 0x01C8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_CameraFadeScenery(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, class AActor* K2Node_CustomEvent_actor, TArray<class AActor*>& CallFunc_GetAllChildActors_ChildActors, class AActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void FilterPrimitive(class UPrimitiveComponent* Primitive, TArray<class FString>& FilterList, bool FilterPawns, bool* Matches, const TArray<class FString>& ListToCheck, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, const class FString& CallFunc_Array_Get_Item, class FName CallFunc_Conv_StringToName_ReturnValue, int32 Temp_int_Array_Index_Variable_2, class AActor* CallFunc_GetOwner_ReturnValue, class APawn* K2Node_DynamicCast_AsPawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_ComponentHasTag_ReturnValue, const class FString& CallFunc_GetPathName_ReturnValue, const class FString& CallFunc_Array_Get_Item_1, const class FString& CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_1, const class FString& CallFunc_GetCleanFilename_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Contains_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, const class FString& CallFunc_GetPathName_ReturnValue_1, class UStaticMeshComponent* K2Node_DynamicCast_AsStatic_Mesh_Component, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_Array_AddUnique_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 CallFunc_Array_AddUnique_ReturnValue_1);
	void OnActorSpawned(class AActor* Actor);
	void ReceiveBeginPlay();
	void SetActorPrimitiveFadeOut(class UPrimitiveComponent* Primitive, bool* Set, int32 MaterialIndex, bool SetFilter, const TArray<class FString>& TransparencyFilterStrings, TArray<class FString>& K2Node_MakeArray_Array);
	void SetActorSeeThrough(class AActor*& Actor, bool PrimitiveFiltered, bool CheckFilter, const TArray<class FString>& FilterInStrings, int32 Temp_int_Array_Index_Variable, TArray<class FString>& K2Node_MakeArray_Array, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class FName Temp_name_Variable, TArray<class UPrimitiveComponent*>& CallFunc_K2_GetComponentsByClass_ReturnValue, class UPrimitiveComponent* CallFunc_Array_Get_Item, int32 CallFunc_Array_AddUnique_ReturnValue, bool CallFunc_SetActorPrimitiveFadeOut_Set, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_FilterPrimitive_matches);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CameraFadeScenery_C">();
	}
	static class UBP_CameraFadeScenery_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CameraFadeScenery_C>();
	}
};
static_assert(alignof(UBP_CameraFadeScenery_C) == 0x000008, "Wrong alignment on UBP_CameraFadeScenery_C");
static_assert(sizeof(UBP_CameraFadeScenery_C) == 0x000218, "Wrong size on UBP_CameraFadeScenery_C");
static_assert(offsetof(UBP_CameraFadeScenery_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_CameraFadeScenery_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CameraFadeScenery_C, FadedActors) == 0x0000A8, "Member 'UBP_CameraFadeScenery_C::FadedActors' has a wrong offset!");
static_assert(offsetof(UBP_CameraFadeScenery_C, Camera) == 0x0000F8, "Member 'UBP_CameraFadeScenery_C::Camera' has a wrong offset!");
static_assert(offsetof(UBP_CameraFadeScenery_C, Capsule) == 0x000100, "Member 'UBP_CameraFadeScenery_C::Capsule' has a wrong offset!");
static_assert(offsetof(UBP_CameraFadeScenery_C, Material) == 0x000108, "Member 'UBP_CameraFadeScenery_C::Material' has a wrong offset!");
static_assert(offsetof(UBP_CameraFadeScenery_C, BaseMaterials) == 0x000118, "Member 'UBP_CameraFadeScenery_C::BaseMaterials' has a wrong offset!");
static_assert(offsetof(UBP_CameraFadeScenery_C, DynamicMaterials) == 0x000168, "Member 'UBP_CameraFadeScenery_C::DynamicMaterials' has a wrong offset!");
static_assert(offsetof(UBP_CameraFadeScenery_C, Color) == 0x0001B8, "Member 'UBP_CameraFadeScenery_C::Color' has a wrong offset!");
static_assert(offsetof(UBP_CameraFadeScenery_C, Timers) == 0x0001C8, "Member 'UBP_CameraFadeScenery_C::Timers' has a wrong offset!");

}

