#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CtrlModeTriggerVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CtrlModeTriggerVolume.BP_CtrlModeTriggerVolume_C
// 0x0018 (0x02C0 - 0x02A8)
class ABP_CtrlModeTriggerVolume_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CtrlModeTriggerVolume(int32 EntryPoint, class AActor* K2Node_Event_OtherActor);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CtrlModeTriggerVolume_C">();
	}
	static class ABP_CtrlModeTriggerVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CtrlModeTriggerVolume_C>();
	}
};
static_assert(alignof(ABP_CtrlModeTriggerVolume_C) == 0x000008, "Wrong alignment on ABP_CtrlModeTriggerVolume_C");
static_assert(sizeof(ABP_CtrlModeTriggerVolume_C) == 0x0002C0, "Wrong size on ABP_CtrlModeTriggerVolume_C");
static_assert(offsetof(ABP_CtrlModeTriggerVolume_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_CtrlModeTriggerVolume_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CtrlModeTriggerVolume_C, Box) == 0x0002B0, "Member 'ABP_CtrlModeTriggerVolume_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_CtrlModeTriggerVolume_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_CtrlModeTriggerVolume_C::DefaultSceneRoot' has a wrong offset!");

}

