#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterCustomizationComponent

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterCustomizationComponent.BP_CharacterCustomizationComponent_C.ApplyBodyDataToAnimInstance
// 0x0080 (0x0080 - 0x0000)
struct BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance final
{
public:
	float                                         Height_Scalar;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Thickness_Scalar;                                  // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Gender_Scalar;                                     // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Fitness_Scalar;                                    // 0x000C(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_PC_Female_C*                       CallFunc_GetABPFromOwningCharacter_ABP;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3064[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CharacterCustomization_ThicknessAlpha_ImplicitCast; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CharacterCustomization_GenderAlpha_ImplicitCast; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CharacterCustomization_FitnessAlpha_ImplicitCast; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance) == 0x000008, "Wrong alignment on BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance");
static_assert(sizeof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance) == 0x000080, "Wrong size on BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, Height_Scalar) == 0x000000, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::Height_Scalar' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, Thickness_Scalar) == 0x000004, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::Thickness_Scalar' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, Gender_Scalar) == 0x000008, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::Gender_Scalar' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, Fitness_Scalar) == 0x00000C, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::Fitness_Scalar' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_GetABPFromOwningCharacter_ABP) == 0x000010, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_GetABPFromOwningCharacter_ABP' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000019, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00001A, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000060, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, K2Node_VariableSet_CharacterCustomization_ThicknessAlpha_ImplicitCast) == 0x000068, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::K2Node_VariableSet_CharacterCustomization_ThicknessAlpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, K2Node_VariableSet_CharacterCustomization_GenderAlpha_ImplicitCast) == 0x000070, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::K2Node_VariableSet_CharacterCustomization_GenderAlpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance, K2Node_VariableSet_CharacterCustomization_FitnessAlpha_ImplicitCast) == 0x000078, "Member 'BP_CharacterCustomizationComponent_C_ApplyBodyDataToAnimInstance::K2Node_VariableSet_CharacterCustomization_FitnessAlpha_ImplicitCast' has a wrong offset!");

// Function BP_CharacterCustomizationComponent.BP_CharacterCustomizationComponent_C.ApplyIdleAnimWidthToAnimInstance
// 0x0030 (0x0030 - 0x0000)
struct BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance final
{
public:
	float                                         WidthScaler;                                       // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3065[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_PC_Female_C*                       CachedABP;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3066[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_PC_Female_C*                       CallFunc_GetABPFromOwningCharacter_ABP;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance) == 0x000008, "Wrong alignment on BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance");
static_assert(sizeof(BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance) == 0x000030, "Wrong size on BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance, WidthScaler) == 0x000000, "Member 'BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance::WidthScaler' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance, CachedABP) == 0x000008, "Member 'BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance::CachedABP' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000011, "Member 'BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance, CallFunc_GetABPFromOwningCharacter_ABP) == 0x000018, "Member 'BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance::CallFunc_GetABPFromOwningCharacter_ABP' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'BP_CharacterCustomizationComponent_C_ApplyIdleAnimWidthToAnimInstance::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_CharacterCustomizationComponent.BP_CharacterCustomizationComponent_C.ClearIdleAnimWidthFromAnimInstance
// 0x0018 (0x0018 - 0x0000)
struct BP_CharacterCustomizationComponent_C_ClearIdleAnimWidthFromAnimInstance final
{
public:
	class UABP_PC_Female_C*                       CachedABP;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3067[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_PC_Female_C*                       CallFunc_GetABPFromOwningCharacter_ABP;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationComponent_C_ClearIdleAnimWidthFromAnimInstance) == 0x000008, "Wrong alignment on BP_CharacterCustomizationComponent_C_ClearIdleAnimWidthFromAnimInstance");
static_assert(sizeof(BP_CharacterCustomizationComponent_C_ClearIdleAnimWidthFromAnimInstance) == 0x000018, "Wrong size on BP_CharacterCustomizationComponent_C_ClearIdleAnimWidthFromAnimInstance");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ClearIdleAnimWidthFromAnimInstance, CachedABP) == 0x000000, "Member 'BP_CharacterCustomizationComponent_C_ClearIdleAnimWidthFromAnimInstance::CachedABP' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ClearIdleAnimWidthFromAnimInstance, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_CharacterCustomizationComponent_C_ClearIdleAnimWidthFromAnimInstance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ClearIdleAnimWidthFromAnimInstance, CallFunc_GetABPFromOwningCharacter_ABP) == 0x000010, "Member 'BP_CharacterCustomizationComponent_C_ClearIdleAnimWidthFromAnimInstance::CallFunc_GetABPFromOwningCharacter_ABP' has a wrong offset!");

// Function BP_CharacterCustomizationComponent.BP_CharacterCustomizationComponent_C.Completed_0917B935427A43D1084B4EAC3501F636
// 0x0050 (0x0050 - 0x0000)
struct BP_CharacterCustomizationComponent_C_Completed_0917B935427A43D1084B4EAC3501F636 final
{
public:
	TSet<class UVAL_CharacterCustomizationItemBase*> LoadedItems;                                       // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_CharacterCustomizationComponent_C_Completed_0917B935427A43D1084B4EAC3501F636) == 0x000008, "Wrong alignment on BP_CharacterCustomizationComponent_C_Completed_0917B935427A43D1084B4EAC3501F636");
static_assert(sizeof(BP_CharacterCustomizationComponent_C_Completed_0917B935427A43D1084B4EAC3501F636) == 0x000050, "Wrong size on BP_CharacterCustomizationComponent_C_Completed_0917B935427A43D1084B4EAC3501F636");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_Completed_0917B935427A43D1084B4EAC3501F636, LoadedItems) == 0x000000, "Member 'BP_CharacterCustomizationComponent_C_Completed_0917B935427A43D1084B4EAC3501F636::LoadedItems' has a wrong offset!");

// Function BP_CharacterCustomizationComponent.BP_CharacterCustomizationComponent_C.DestroyLastSpawnedPet
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterCustomizationComponent_C_DestroyLastSpawnedPet final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationComponent_C_DestroyLastSpawnedPet) == 0x000001, "Wrong alignment on BP_CharacterCustomizationComponent_C_DestroyLastSpawnedPet");
static_assert(sizeof(BP_CharacterCustomizationComponent_C_DestroyLastSpawnedPet) == 0x000001, "Wrong size on BP_CharacterCustomizationComponent_C_DestroyLastSpawnedPet");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_DestroyLastSpawnedPet, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_CharacterCustomizationComponent_C_DestroyLastSpawnedPet::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CharacterCustomizationComponent.BP_CharacterCustomizationComponent_C.ExecuteUbergraph_BP_CharacterCustomizationComponent
// 0x2870 (0x2870 - 0x0000)
struct BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TSet<class UVAL_CharacterCustomizationItemBase*>& LoadedItems)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_SoftObjectReference_ReturnValue; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3068[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UVAL_CharacterCustomizationItemBase*> Temp_object_Variable;                              // 0x0018(0x0050)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3069[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVAL_CharacterCustomizationItemBase*> CallFunc_Set_ToArray_Result;                       // 0x0070(0x0010)(ReferenceParm)
	class UVAL_CharacterCustomizationItemBase*    CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_306A[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationItem_Pet*    K2Node_DynamicCast_AsVAL_Character_Customization_Item_Pet; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_306B[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharacterCustomizationItem_Pet_PerBodyTypeConfig CallFunc_TryGetBodyTypeSpecificConfig_Pet_OutBodyTypeSpecificConfig; // 0x00A0(0x00B8)()
	bool                                          CallFunc_TryGetBodyTypeSpecificConfig_Pet_ReturnValue; // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_306C[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EVAL_ApplyCustomizationToActorContext         K2Node_Event_Context_1;                            // 0x01B0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_306D[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharacterCustomizationLoadout     K2Node_Event_OldLoadout_1;                         // 0x01B8(0x0900)(ConstParm)
	struct FVAL_CharacterCustomizationLoadout     K2Node_Event_NewLoadout_1;                         // 0x0AB8(0x0900)(ConstParm)
	EVAL_ApplyCustomizationToActorContext         K2Node_Event_Context;                              // 0x13B8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_306E[0x7];                                     // 0x13B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharacterCustomizationLoadout     K2Node_Event_OldLoadout;                           // 0x13C0(0x0900)(ConstParm)
	struct FVAL_CharacterCustomizationLoadout     K2Node_Event_NewLoadout;                           // 0x1CC0(0x0900)(ConstParm)
	float                                         K2Node_Event_HeightScalar;                         // 0x25C0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ThicknessScalar;                      // 0x25C4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_GenderScalar;                         // 0x25C8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FitnessScalar;                        // 0x25CC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_WidthScaler;                          // 0x25D0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_306F[0x4];                                     // 0x25D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_UpdateSpawnedPetPayload           K2Node_Event_payload;                              // 0x25D8(0x0038)(ConstParm)
	struct FVAL_UpdateSpawnedPetPayload           K2Node_CustomEvent_Payload;                        // 0x2610(0x0038)()
	TSet<class UVAL_CharacterCustomizationItemBase*> K2Node_CustomEvent_LoadedItems;                    // 0x2648(0x0050)()
	struct FVector                                CallFunc_GetPetSpawnLocation_ValidSpawnLocation;   // 0x2698(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x26B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x2710(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsValeria_Moveable_Pawn;   // 0x2718(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x2720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3070[0x7];                                     // 0x2721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TSoftObjectPtr<class UVAL_CharacterCustomizationItemBase>> K2Node_MakeSet_Set;                                // 0x2728(0x0050)(ConstParm)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x2778(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_AsyncAction_LoadCharacterCustomizationItems* CallFunc_LoadCharacterCustomizationItems_ReturnValue; // 0x2780(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaMoveablePawn*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x2788(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x2790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x2791(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3071[0x6];                                     // 0x2792(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x2798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x27A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3072[0x7];                                     // 0x27A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x27A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x27B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x27B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3073[0x3];                                     // 0x27B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaCharacter* InValeriaCharacter, ETeleportTravelType TeleportTravelType, TSoftObjectPtr<class UPrivateSpaceConfig> PrivateSpaceConfig)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x27BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3074[0x4];                                     // 0x27CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaCharacterTeleportComponent*     CallFunc_GetTeleportComponent_ReturnValue;         // 0x27D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x27D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x27D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3075[0x6];                                     // 0x27DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x27E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bCinematicMode)>          K2Node_CreateDelegate_OutputDelegate_2;            // 0x27E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x27F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult_1;   // 0x27F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3076[0x6];                                     // 0x27FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue_1; // 0x2800(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x2808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3077[0x3];                                     // 0x2809(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bCinematicMode)>          K2Node_CreateDelegate_OutputDelegate_3;            // 0x280C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<class AEquipViewActor*>& Props)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x281C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3078[0x4];                                     // 0x282C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEquipViewActor*>                K2Node_CustomEvent_Props;                          // 0x2830(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x2840(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_1;          // 0x2848(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x2850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3079[0x3];                                     // 0x2851(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<class AEquipViewActor*>& Props)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x2854(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent) == 0x000010, "Wrong alignment on BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent");
static_assert(sizeof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent) == 0x002870, "Wrong size on BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, EntryPoint) == 0x000000, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_NotEqual_SoftObjectReference_ReturnValue) == 0x000014, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_NotEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000015, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, Temp_object_Variable) == 0x000018, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_BooleanOR_ReturnValue) == 0x000068, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_Set_ToArray_Result) == 0x000070, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000088, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_DynamicCast_AsVAL_Character_Customization_Item_Pet) == 0x000090, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_DynamicCast_AsVAL_Character_Customization_Item_Pet' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_TryGetBodyTypeSpecificConfig_Pet_OutBodyTypeSpecificConfig) == 0x0000A0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_TryGetBodyTypeSpecificConfig_Pet_OutBodyTypeSpecificConfig' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_TryGetBodyTypeSpecificConfig_Pet_ReturnValue) == 0x000158, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_TryGetBodyTypeSpecificConfig_Pet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetOwner_ReturnValue) == 0x000160, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000168, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000170, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000188, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0001A0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0001A8, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_Context_1) == 0x0001B0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_Context_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_OldLoadout_1) == 0x0001B8, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_OldLoadout_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_NewLoadout_1) == 0x000AB8, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_NewLoadout_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_Context) == 0x0013B8, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_OldLoadout) == 0x0013C0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_OldLoadout' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_NewLoadout) == 0x001CC0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_NewLoadout' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_HeightScalar) == 0x0025C0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_HeightScalar' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_ThicknessScalar) == 0x0025C4, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_ThicknessScalar' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_GenderScalar) == 0x0025C8, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_GenderScalar' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_FitnessScalar) == 0x0025CC, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_FitnessScalar' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_WidthScaler) == 0x0025D0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_WidthScaler' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_payload) == 0x0025D8, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_payload' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_CustomEvent_Payload) == 0x002610, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_CustomEvent_LoadedItems) == 0x002648, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_CustomEvent_LoadedItems' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetPetSpawnLocation_ValidSpawnLocation) == 0x002698, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetPetSpawnLocation_ValidSpawnLocation' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x0026B0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x002710, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_ClassDynamicCast_AsValeria_Moveable_Pawn) == 0x002718, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_ClassDynamicCast_AsValeria_Moveable_Pawn' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_ClassDynamicCast_bSuccess) == 0x002720, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_MakeSet_Set) == 0x002728, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_MakeSet_Set' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x002778, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_LoadCharacterCustomizationItems_ReturnValue) == 0x002780, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_LoadCharacterCustomizationItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_FinishSpawningActor_ReturnValue) == 0x002788, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_IsValid_ReturnValue) == 0x002790, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x002791, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetOwner_ReturnValue_2) == 0x002798, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_HasAuthority_ReturnValue) == 0x0027A0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetOwner_ReturnValue_3) == 0x0027A8, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_DynamicCast_AsValeria_Character) == 0x0027B0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_DynamicCast_bSuccess_1) == 0x0027B8, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0027BC, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetTeleportComponent_ReturnValue) == 0x0027D0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetTeleportComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_Event_EndPlayReason) == 0x0027D8, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetValeriaPlayerController_OutResult) == 0x0027D9, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x0027E0, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x0027E8, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_SwitchEnum_CmpSuccess) == 0x0027F8, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetValeriaPlayerController_OutResult_1) == 0x0027F9, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetValeriaPlayerController_OutResult_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetValeriaPlayerController_ReturnValue_1) == 0x002800, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetValeriaPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_SwitchEnum_CmpSuccess_1) == 0x002808, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x00280C, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x00281C, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_CustomEvent_Props) == 0x002830, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_CustomEvent_Props' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, CallFunc_GetOwner_ReturnValue_4) == 0x002840, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_DynamicCast_AsValeria_Character_1) == 0x002848, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_DynamicCast_AsValeria_Character_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_DynamicCast_bSuccess_2) == 0x002850, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent, K2Node_CreateDelegate_OutputDelegate_5) == 0x002854, "Member 'BP_CharacterCustomizationComponent_C_ExecuteUbergraph_BP_CharacterCustomizationComponent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function BP_CharacterCustomizationComponent.BP_CharacterCustomizationComponent_C.GetABPFromOwningCharacter
// 0x0068 (0x0068 - 0x0000)
struct BP_CharacterCustomizationComponent_C_GetABPFromOwningCharacter final
{
public:
	class UABP_PC_Female_C*                       ABP;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307A[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_PC_Female_C*                       K2Node_DynamicCast_AsABP_PC_Female;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307B[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307C[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVAL_CustomizableCharacterInterface> K2Node_DynamicCast_AsVAL_Customizable_Character_Interface; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307D[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetRootSkeletonMeshComponent_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationComponent_C_GetABPFromOwningCharacter) == 0x000008, "Wrong alignment on BP_CharacterCustomizationComponent_C_GetABPFromOwningCharacter");
static_assert(sizeof(BP_CharacterCustomizationComponent_C_GetABPFromOwningCharacter) == 0x000068, "Wrong size on BP_CharacterCustomizationComponent_C_GetABPFromOwningCharacter");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_GetABPFromOwningCharacter, ABP) == 0x000000, "Member 'BP_CharacterCustomizationComponent_C_GetABPFromOwningCharacter::ABP' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationComponent_C_GetABPFromOwningCharacter, Temp_object_Variable) == 0x000008, "Member 'BP_CharacterCustomizationComponent_C_GetABPFromOwningCharacter::Temp_object_Variable' has a wrong offset!");
