#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterCustomizationScript_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterCustomizationScript_Base.BP_CharacterCustomizationScript_Base_C.ExecuteUbergraph_BP_CharacterCustomizationScript_Base
// 0x0110 (0x0110 - 0x0000)
struct BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsMoving, bool bIsSprinting)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsGliding)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsJumping)>              K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4271[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   K2Node_Event_component_1;                          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationItemBase*    K2Node_Event_Item;                                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FGuid>               K2Node_Event_VariantSelections;                    // 0x0050(0x0050)(ConstParm)
	class UABP_PC_Female_C*                       K2Node_DynamicCast_AsABP_PC_Female;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4272[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isClimbing;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4273[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsMoving;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsSprinting;                   // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isGliding;                      // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsJumping;                     // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4274[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_PC_Female_C*                       K2Node_DynamicCast_AsABP_PC_Female_1;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4275[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsClimbing)>              K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4276[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationComponent*   K2Node_Event_component;                            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base) == 0x000008, "Wrong alignment on BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base");
static_assert(sizeof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base) == 0x000110, "Wrong size on BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, EntryPoint) == 0x000000, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, CallFunc_GetAnimInstance_ReturnValue) == 0x000038, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_Event_component_1) == 0x000040, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_Event_component_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_Event_Item) == 0x000048, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_Event_VariantSelections) == 0x000050, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_Event_VariantSelections' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_DynamicCast_AsABP_PC_Female) == 0x0000A0, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_DynamicCast_AsABP_PC_Female' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, CallFunc_GetOwner_ReturnValue) == 0x0000B0, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_CustomEvent_isClimbing) == 0x0000B8, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_CustomEvent_isClimbing' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_DynamicCast_AsValeria_Character) == 0x0000C0, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_CustomEvent_bIsMoving) == 0x0000C9, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_CustomEvent_bIsMoving' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_CustomEvent_bIsSprinting) == 0x0000CA, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_CustomEvent_bIsSprinting' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_CustomEvent_isGliding) == 0x0000CB, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_CustomEvent_isGliding' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_CustomEvent_bIsJumping) == 0x0000CC, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_CustomEvent_bIsJumping' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, CallFunc_GetAnimInstance_ReturnValue_1) == 0x0000D0, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_DynamicCast_AsABP_PC_Female_1) == 0x0000D8, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_DynamicCast_AsABP_PC_Female_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E4, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, K2Node_Event_component) == 0x0000F8, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::K2Node_Event_component' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000100, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base, CallFunc_IsValid_ReturnValue_1) == 0x000108, "Member 'BP_CharacterCustomizationScript_Base_C_ExecuteUbergraph_BP_CharacterCustomizationScript_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_CharacterCustomizationScript_Base.BP_CharacterCustomizationScript_Base_C.OnApply
// 0x0060 (0x0060 - 0x0000)
struct BP_CharacterCustomizationScript_Base_C_OnApply final
{
public:
	class UVAL_CharacterCustomizationComponent*   Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationItemBase*    Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FGuid>               VariantSelections;                                 // 0x0010(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_CharacterCustomizationScript_Base_C_OnApply) == 0x000008, "Wrong alignment on BP_CharacterCustomizationScript_Base_C_OnApply");
static_assert(sizeof(BP_CharacterCustomizationScript_Base_C_OnApply) == 0x000060, "Wrong size on BP_CharacterCustomizationScript_Base_C_OnApply");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_OnApply, Component) == 0x000000, "Member 'BP_CharacterCustomizationScript_Base_C_OnApply::Component' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_OnApply, Item) == 0x000008, "Member 'BP_CharacterCustomizationScript_Base_C_OnApply::Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_OnApply, VariantSelections) == 0x000010, "Member 'BP_CharacterCustomizationScript_Base_C_OnApply::VariantSelections' has a wrong offset!");

// Function BP_CharacterCustomizationScript_Base.BP_CharacterCustomizationScript_Base_C.OnClimbingChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterCustomizationScript_Base_C_OnClimbingChanged final
{
public:
	bool                                          IsClimbing;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationScript_Base_C_OnClimbingChanged) == 0x000001, "Wrong alignment on BP_CharacterCustomizationScript_Base_C_OnClimbingChanged");
static_assert(sizeof(BP_CharacterCustomizationScript_Base_C_OnClimbingChanged) == 0x000001, "Wrong size on BP_CharacterCustomizationScript_Base_C_OnClimbingChanged");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_OnClimbingChanged, IsClimbing) == 0x000000, "Member 'BP_CharacterCustomizationScript_Base_C_OnClimbingChanged::IsClimbing' has a wrong offset!");

// Function BP_CharacterCustomizationScript_Base.BP_CharacterCustomizationScript_Base_C.OnGlidingChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterCustomizationScript_Base_C_OnGlidingChanged final
{
public:
	bool                                          IsGliding;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationScript_Base_C_OnGlidingChanged) == 0x000001, "Wrong alignment on BP_CharacterCustomizationScript_Base_C_OnGlidingChanged");
static_assert(sizeof(BP_CharacterCustomizationScript_Base_C_OnGlidingChanged) == 0x000001, "Wrong size on BP_CharacterCustomizationScript_Base_C_OnGlidingChanged");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_OnGlidingChanged, IsGliding) == 0x000000, "Member 'BP_CharacterCustomizationScript_Base_C_OnGlidingChanged::IsGliding' has a wrong offset!");

// Function BP_CharacterCustomizationScript_Base.BP_CharacterCustomizationScript_Base_C.OnJumpingChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterCustomizationScript_Base_C_OnJumpingChanged final
{
public:
	bool                                          bIsJumping;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationScript_Base_C_OnJumpingChanged) == 0x000001, "Wrong alignment on BP_CharacterCustomizationScript_Base_C_OnJumpingChanged");
static_assert(sizeof(BP_CharacterCustomizationScript_Base_C_OnJumpingChanged) == 0x000001, "Wrong size on BP_CharacterCustomizationScript_Base_C_OnJumpingChanged");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_OnJumpingChanged, bIsJumping) == 0x000000, "Member 'BP_CharacterCustomizationScript_Base_C_OnJumpingChanged::bIsJumping' has a wrong offset!");

// Function BP_CharacterCustomizationScript_Base.BP_CharacterCustomizationScript_Base_C.OnMovingChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_CharacterCustomizationScript_Base_C_OnMovingChanged final
{
public:
	bool                                          bIsMoving;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSprinting;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationScript_Base_C_OnMovingChanged) == 0x000001, "Wrong alignment on BP_CharacterCustomizationScript_Base_C_OnMovingChanged");
static_assert(sizeof(BP_CharacterCustomizationScript_Base_C_OnMovingChanged) == 0x000002, "Wrong size on BP_CharacterCustomizationScript_Base_C_OnMovingChanged");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_OnMovingChanged, bIsMoving) == 0x000000, "Member 'BP_CharacterCustomizationScript_Base_C_OnMovingChanged::bIsMoving' has a wrong offset!");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_OnMovingChanged, bIsSprinting) == 0x000001, "Member 'BP_CharacterCustomizationScript_Base_C_OnMovingChanged::bIsSprinting' has a wrong offset!");

// Function BP_CharacterCustomizationScript_Base.BP_CharacterCustomizationScript_Base_C.OnRemove
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterCustomizationScript_Base_C_OnRemove final
{
public:
	class UVAL_CharacterCustomizationComponent*   Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationScript_Base_C_OnRemove) == 0x000008, "Wrong alignment on BP_CharacterCustomizationScript_Base_C_OnRemove");
static_assert(sizeof(BP_CharacterCustomizationScript_Base_C_OnRemove) == 0x000008, "Wrong size on BP_CharacterCustomizationScript_Base_C_OnRemove");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_OnRemove, Component) == 0x000000, "Member 'BP_CharacterCustomizationScript_Base_C_OnRemove::Component' has a wrong offset!");

// Function BP_CharacterCustomizationScript_Base.BP_CharacterCustomizationScript_Base_C.ShouldInstantiate
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterCustomizationScript_Base_C_ShouldInstantiate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterCustomizationScript_Base_C_ShouldInstantiate) == 0x000001, "Wrong alignment on BP_CharacterCustomizationScript_Base_C_ShouldInstantiate");
static_assert(sizeof(BP_CharacterCustomizationScript_Base_C_ShouldInstantiate) == 0x000001, "Wrong size on BP_CharacterCustomizationScript_Base_C_ShouldInstantiate");
static_assert(offsetof(BP_CharacterCustomizationScript_Base_C_ShouldInstantiate, ReturnValue) == 0x000000, "Member 'BP_CharacterCustomizationScript_Base_C_ShouldInstantiate::ReturnValue' has a wrong offset!");

}

