#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterCustomizationComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "Palia_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterCustomizationComponent.BP_CharacterCustomizationComponent_C
// 0x0140 (0x19F0 - 0x18B0)
class UBP_CharacterCustomizationComponent_C final : public UVAL_CharacterCustomizationComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x18B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      IdleSystem;                                        // 0x18B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Loadout_Slot_Names;                                // 0x18C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AValeriaMoveablePawn*                   LastSpawnedPet;                                    // 0x18D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Pet> LastSpawnedPetItem;                                // 0x18D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationItem_Pet_PerBodyTypeConfig Selected_Pet_Config;                               // 0x1900(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Pet> Pet_Item;                                          // 0x19B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AValeriaCharacter*                      Character;                                         // 0x19E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EVAL_UpdateSpawnedPetContext                  Context;                                           // 0x19E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyBodyDataToAnimInstance(float Height_Scalar, float Thickness_Scalar, float Gender_Scalar, float Fitness_Scalar, class UABP_PC_Female_C* CallFunc_GetABPFromOwningCharacter_ABP, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue_1, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast, double CallFunc_Divide_DoubleDouble_A_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast, double CallFunc_Less_DoubleDouble_A_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast_1, double K2Node_VariableSet_CharacterCustomization_ThicknessAlpha_ImplicitCast, double K2Node_VariableSet_CharacterCustomization_GenderAlpha_ImplicitCast, double K2Node_VariableSet_CharacterCustomization_FitnessAlpha_ImplicitCast);
	void ApplyIdleAnimWidthToAnimInstance(float WidthScaler, class UABP_PC_Female_C* CachedABP, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, class UABP_PC_Female_C* CallFunc_GetABPFromOwningCharacter_ABP, double CallFunc_Greater_DoubleDouble_B_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast);
	void ClearIdleAnimWidthFromAnimInstance(class UABP_PC_Female_C* CachedABP, bool CallFunc_IsValid_ReturnValue, class UABP_PC_Female_C* CallFunc_GetABPFromOwningCharacter_ABP);
	void Completed_0917B935427A43D1084B4EAC3501F636(const TSet<class UVAL_CharacterCustomizationItemBase*>& LoadedItems);
	void DestroyLastSpawnedPet(bool CallFunc_IsValid_ReturnValue);
	void ExecuteUbergraph_BP_CharacterCustomizationComponent(int32 EntryPoint, TDelegate<void(const TSet<class UVAL_CharacterCustomizationItemBase*>& LoadedItems)> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_NotEqual_SoftObjectReference_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, const TSet<class UVAL_CharacterCustomizationItemBase*>& Temp_object_Variable, bool CallFunc_BooleanOR_ReturnValue, TArray<class UVAL_CharacterCustomizationItemBase*>& CallFunc_Set_ToArray_Result, class UVAL_CharacterCustomizationItemBase* CallFunc_Array_Get_Item, bool CallFunc_GetConsoleVariableBoolValue_ReturnValue, class UVAL_CharacterCustomizationItem_Pet* K2Node_DynamicCast_AsVAL_Character_Customization_Item_Pet, bool K2Node_DynamicCast_bSuccess, const struct FVAL_CharacterCustomizationItem_Pet_PerBodyTypeConfig& CallFunc_TryGetBodyTypeSpecificConfig_Pet_OutBodyTypeSpecificConfig, bool CallFunc_TryGetBodyTypeSpecificConfig_Pet_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue_1, EVAL_ApplyCustomizationToActorContext K2Node_Event_Context_1, struct FVAL_CharacterCustomizationLoadout& K2Node_Event_OldLoadout_1, struct FVAL_CharacterCustomizationLoadout& K2Node_Event_NewLoadout_1, EVAL_ApplyCustomizationToActorContext K2Node_Event_Context, struct FVAL_CharacterCustomizationLoadout& K2Node_Event_OldLoadout, struct FVAL_CharacterCustomizationLoadout& K2Node_Event_NewLoadout, float K2Node_Event_HeightScalar, float K2Node_Event_ThicknessScalar, float K2Node_Event_GenderScalar, float K2Node_Event_FitnessScalar, float K2Node_Event_WidthScaler, struct FVAL_UpdateSpawnedPetPayload& K2Node_Event_payload, const struct FVAL_UpdateSpawnedPetPayload& K2Node_CustomEvent_Payload, const TSet<class UVAL_CharacterCustomizationItemBase*>& K2Node_CustomEvent_LoadedItems, const struct FVector& CallFunc_GetPetSpawnLocation_ValidSpawnLocation, const struct FTransform& CallFunc_Conv_VectorToTransform_ReturnValue, TSubclassOf<class UObject> CallFunc_Conv_SoftClassReferenceToClass_ReturnValue, class UClass* K2Node_ClassDynamicCast_AsValeria_Moveable_Pawn, bool K2Node_ClassDynamicCast_bSuccess, TSet<TSoftObjectPtr<class UVAL_CharacterCustomizationItemBase>>& K2Node_MakeSet_Set, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class UVAL_AsyncAction_LoadCharacterCustomizationItems* CallFunc_LoadCharacterCustomizationItems_ReturnValue, class AValeriaMoveablePawn* CallFunc_FinishSpawningActor_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValidSoftObjectReference_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_2, bool CallFunc_HasAuthority_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_3, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess_1, TDelegate<void(class AValeriaCharacter* InValeriaCharacter, ETeleportTravelType TeleportTravelType, TSoftObjectPtr<class UPrivateSpaceConfig> PrivateSpaceConfig)> K2Node_CreateDelegate_OutputDelegate_1, class UValeriaCharacterTeleportComponent* CallFunc_GetTeleportComponent_ReturnValue, EEndPlayReason K2Node_Event_EndPlayReason, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, TDelegate<void(bool bCinematicMode)> K2Node_CreateDelegate_OutputDelegate_2, bool K2Node_SwitchEnum_CmpSuccess, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult_1, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1, TDelegate<void(bool bCinematicMode)> K2Node_CreateDelegate_OutputDelegate_3, TDelegate<void(TArray<class AEquipViewActor*>& Props)> K2Node_CreateDelegate_OutputDelegate_4, TArray<class AEquipViewActor*>& K2Node_CustomEvent_Props, class AActor* CallFunc_GetOwner_ReturnValue_4, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character_1, bool K2Node_DynamicCast_bSuccess_2, TDelegate<void(TArray<class AEquipViewActor*>& Props)> K2Node_CreateDelegate_OutputDelegate_5);
	void GetABPFromOwningCharacter(class UABP_PC_Female_C** ABP, class USkeletalMeshComponent* Temp_object_Variable, bool CallFunc_IsValid_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UABP_PC_Female_C* K2Node_DynamicCast_AsABP_PC_Female, bool K2Node_DynamicCast_bSuccess, class AActor* CallFunc_GetOwner_ReturnValue, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess_1, TScriptInterface<class IVAL_CustomizableCharacterInterface> K2Node_DynamicCast_AsVAL_Customizable_Character_Interface, bool K2Node_DynamicCast_bSuccess_2, class USkeletalMeshComponent* CallFunc_GetRootSkeletonMeshComponent_ReturnValue);
	void GetPetSpawnLocation(struct FVector* ValidSpawnLocation, bool GroundTraceBlockingHit, bool SphereTraceBlockingHit, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class AActor*>& Temp_object_Variable, class AActor* CallFunc_GetOwner_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, TArray<struct FVector>& CallFunc_GetPointsFromCircle_PointsOnCircle, const struct FVector& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const struct FHitResult& CallFunc_SphereTraceSingle_OutHit, bool CallFunc_SphereTraceSingle_ReturnValue);
	void Handle_On_Cinematic_Mode_Set(bool bCinematicMode, bool CallFunc_Not_PreBool_ReturnValue);
	void HandleApplyBodyDataToAnimInstance(float HeightScalar, float ThicknessScalar, float GenderScalar, float FitnessScalar);
	void HandleApplyIdleAnimWidthToAnimInstance(float WidthScaler);
	void HandleClearIdleAnimwidthFromAnimInstance();
	void HandleOnTeleportComplete(class AValeriaCharacter* InValeriaCharacter, ETeleportTravelType TeleportTravelType, TSoftObjectPtr<class UPrivateSpaceConfig> PrivateSpaceConfig, EVAL_UpdateSpawnedPetContext Temp_byte_Variable, class UVAL_CharacterCustomizationComponent* CallFunc_GetCharacterCustomizationComponent_ReturnValue);
	void HandlePropSpawned(TArray<class AEquipViewActor*>& Props, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UNiagaraSystem* CallFunc_GetGliderTrailNiagaraSystem_ReturnValue, bool CallFunc_ApplyAdditionalGliderCustomizations_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class AEquipViewActor* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class AVAL_GliderBase* K2Node_DynamicCast_AsVAL_Glider_Base, bool K2Node_DynamicCast_bSuccess);
	void HandleUpdateSpawnedPet(const struct FVAL_UpdateSpawnedPetPayload& Payload);
	void Hide_Last_Spawned_Pet(bool CallFunc_IsValid_ReturnValue);
	void InitVariablesFromPetSpawnPayload(struct FVAL_UpdateSpawnedPetPayload& Payload);
	void OnLoadoutTransitionEnded(EVAL_ApplyCustomizationToActorContext& Param_Context, struct FVAL_CharacterCustomizationLoadout& OldLoadout, struct FVAL_CharacterCustomizationLoadout& NewLoadout);
	void OnLoadoutTransitionStarted(EVAL_ApplyCustomizationToActorContext& Param_Context, struct FVAL_CharacterCustomizationLoadout& OldLoadout, struct FVAL_CharacterCustomizationLoadout& NewLoadout);
	void OnPropsSpawned(TArray<class AEquipViewActor*>& Props);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	bool ShouldPlayTransition(EVAL_ApplyCustomizationToActorContext& Param_Context, struct FVAL_CharacterCustomizationLoadout& OldLoadout, struct FVAL_CharacterCustomizationLoadout& NewLoadout, bool CallFunc_GetConsoleVariableBoolValue_ReturnValue, TArray<class FName>& CallFunc_GetDifferencesBetweenLoadouts_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_NotEqual_IntInt_ReturnValue);
	void UpdateSpawnedPet(struct FVAL_UpdateSpawnedPetPayload& Payload);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CharacterCustomizationComponent_C">();
	}
	static class UBP_CharacterCustomizationComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CharacterCustomizationComponent_C>();
	}
};
static_assert(alignof(UBP_CharacterCustomizationComponent_C) == 0x000008, "Wrong alignment on UBP_CharacterCustomizationComponent_C");
static_assert(sizeof(UBP_CharacterCustomizationComponent_C) == 0x0019F0, "Wrong size on UBP_CharacterCustomizationComponent_C");
static_assert(offsetof(UBP_CharacterCustomizationComponent_C, UberGraphFrame) == 0x0018B0, "Member 'UBP_CharacterCustomizationComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CharacterCustomizationComponent_C, IdleSystem) == 0x0018B8, "Member 'UBP_CharacterCustomizationComponent_C::IdleSystem' has a wrong offset!");
static_assert(offsetof(UBP_CharacterCustomizationComponent_C, Loadout_Slot_Names) == 0x0018C0, "Member 'UBP_CharacterCustomizationComponent_C::Loadout_Slot_Names' has a wrong offset!");
static_assert(offsetof(UBP_CharacterCustomizationComponent_C, LastSpawnedPet) == 0x0018D0, "Member 'UBP_CharacterCustomizationComponent_C::LastSpawnedPet' has a wrong offset!");
static_assert(offsetof(UBP_CharacterCustomizationComponent_C, LastSpawnedPetItem) == 0x0018D8, "Member 'UBP_CharacterCustomizationComponent_C::LastSpawnedPetItem' has a wrong offset!");
static_assert(offsetof(UBP_CharacterCustomizationComponent_C, Selected_Pet_Config) == 0x001900, "Member 'UBP_CharacterCustomizationComponent_C::Selected_Pet_Config' has a wrong offset!");
static_assert(offsetof(UBP_CharacterCustomizationComponent_C, Pet_Item) == 0x0019B8, "Member 'UBP_CharacterCustomizationComponent_C::Pet_Item' has a wrong offset!");
static_assert(offsetof(UBP_CharacterCustomizationComponent_C, Character) == 0x0019E0, "Member 'UBP_CharacterCustomizationComponent_C::Character' has a wrong offset!");
static_assert(offsetof(UBP_CharacterCustomizationComponent_C, Context) == 0x0019E8, "Member 'UBP_CharacterCustomizationComponent_C::Context' has a wrong offset!");

}

