#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChatCmd_Report

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ChatCmd_Report.BP_ChatCmd_Report_C.OpenCommandModalDialogue
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ChatCmd_Report_C_OpenCommandModalDialogue final
{
public:
	const class UUserWidget*                      CommandModalDialogue;                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UWBP_ReportPlayerModalDialog_PF_C*      K2Node_DynamicCast_AsWBP_Report_Player_Modal_Dialog_PF; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F32[0x7];                                      // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_DynamicCast_AsWidget;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F33[0x7];                                      // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportPlayerModalDialog_CM_C*      K2Node_DynamicCast_AsWBP_Report_Player_Modal_Dialog_CM; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F34[0x7];                                      // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue_1;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_DynamicCast_AsWidget_1;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F35[0x7];                                      // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ChatCmd_Report_C_OpenCommandModalDialogue) == 0x000008, "Wrong alignment on BP_ChatCmd_Report_C_OpenCommandModalDialogue");
static_assert(sizeof(BP_ChatCmd_Report_C_OpenCommandModalDialogue) == 0x0000B0, "Wrong size on BP_ChatCmd_Report_C_OpenCommandModalDialogue");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, CommandModalDialogue) == 0x000000, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::CommandModalDialogue' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, UserId) == 0x000008, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::UserId' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, K2Node_DynamicCast_AsWBP_Report_Player_Modal_Dialog_PF) == 0x000038, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::K2Node_DynamicCast_AsWBP_Report_Player_Modal_Dialog_PF' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, CallFunc_GetOuterObject_ReturnValue) == 0x000048, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, K2Node_DynamicCast_AsWidget) == 0x000050, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::K2Node_DynamicCast_AsWidget' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, K2Node_DynamicCast_AsWBP_Report_Player_Modal_Dialog_CM) == 0x000068, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::K2Node_DynamicCast_AsWBP_Report_Player_Modal_Dialog_CM' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000078, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, CallFunc_GetOuterObject_ReturnValue_1) == 0x000080, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::CallFunc_GetOuterObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, K2Node_DynamicCast_AsWidget_1) == 0x000088, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::K2Node_DynamicCast_AsWidget_1' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000098, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, CallFunc_GetUIManagerWidget_ReturnValue_1) == 0x0000A0, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::CallFunc_GetUIManagerWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, CallFunc_IsConsole_ReturnValue) == 0x0000A8, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ChatCmd_Report_C_OpenCommandModalDialogue, CallFunc_IsDesktop_ReturnValue) == 0x0000A9, "Member 'BP_ChatCmd_Report_C_OpenCommandModalDialogue::CallFunc_IsDesktop_ReturnValue' has a wrong offset!");

}

