#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogueRoom

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DialogueRoom.BP_DialogueRoom_C.ExecuteUbergraph_BP_DialogueRoom
// 0x0010 (0x0010 - 0x0000)
struct BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4712[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom) == 0x000004, "Wrong alignment on BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom");
static_assert(sizeof(BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom) == 0x000010, "Wrong size on BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom");
static_assert(offsetof(BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom, EntryPoint) == 0x000000, "Member 'BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom, CallFunc_AkEventGlobal_ReturnValue) == 0x000008, "Member 'BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom, CallFunc_AkEventGlobal_ReturnValue_1) == 0x00000C, "Member 'BP_DialogueRoom_C_ExecuteUbergraph_BP_DialogueRoom::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");

// Function BP_DialogueRoom.BP_DialogueRoom_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_DialogueRoom_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DialogueRoom_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_DialogueRoom_C_ReceiveEndPlay");
static_assert(sizeof(BP_DialogueRoom_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_DialogueRoom_C_ReceiveEndPlay");
static_assert(offsetof(BP_DialogueRoom_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_DialogueRoom_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

