#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogueRoom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DialogueRoom.BP_DialogueRoom_C
// 0x0030 (0x0348 - 0x0318)
class ABP_DialogueRoom_C final : public AVAL_DialogueRoom
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkLateReverbComponent*                 AkLateReverb;                                      // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkRoomComponent*                       AkRoom;                                            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          AudioRoom;                                         // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BackgroundWallMesh2;                               // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BackgroundWallMesh1;                               // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DialogueRoom(int32 EntryPoint, EEndPlayReason K2Node_Event_EndPlayReason, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DialogueRoom_C">();
	}
	static class ABP_DialogueRoom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DialogueRoom_C>();
	}
};
static_assert(alignof(ABP_DialogueRoom_C) == 0x000008, "Wrong alignment on ABP_DialogueRoom_C");
static_assert(sizeof(ABP_DialogueRoom_C) == 0x000348, "Wrong size on ABP_DialogueRoom_C");
static_assert(offsetof(ABP_DialogueRoom_C, UberGraphFrame) == 0x000318, "Member 'ABP_DialogueRoom_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DialogueRoom_C, AkLateReverb) == 0x000320, "Member 'ABP_DialogueRoom_C::AkLateReverb' has a wrong offset!");
static_assert(offsetof(ABP_DialogueRoom_C, AkRoom) == 0x000328, "Member 'ABP_DialogueRoom_C::AkRoom' has a wrong offset!");
static_assert(offsetof(ABP_DialogueRoom_C, AudioRoom) == 0x000330, "Member 'ABP_DialogueRoom_C::AudioRoom' has a wrong offset!");
static_assert(offsetof(ABP_DialogueRoom_C, BackgroundWallMesh2) == 0x000338, "Member 'ABP_DialogueRoom_C::BackgroundWallMesh2' has a wrong offset!");
static_assert(offsetof(ABP_DialogueRoom_C, BackgroundWallMesh1) == 0x000340, "Member 'ABP_DialogueRoom_C::BackgroundWallMesh1' has a wrong offset!");

}

