#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EmoteItemObject_CM

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EmoteItemObject_CM.BP_EmoteItemObject_CM_C
// 0x0038 (0x0060 - 0x0028)
class UBP_EmoteItemObject_CM_C final : public UObject
{
public:
	class UWBP_EmoteCollection_Circular_C*        EmoteCollection;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftObjectPtr<class UEmoteDataAsset>         EmoteDataAsset;                                    // 0x0030(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_EmoteEntry_CM_C*                   EmotyEntryWidget;                                  // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EmoteItemObject_CM_C">();
	}
	static class UBP_EmoteItemObject_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EmoteItemObject_CM_C>();
	}
};
static_assert(alignof(UBP_EmoteItemObject_CM_C) == 0x000008, "Wrong alignment on UBP_EmoteItemObject_CM_C");
static_assert(sizeof(UBP_EmoteItemObject_CM_C) == 0x000060, "Wrong size on UBP_EmoteItemObject_CM_C");
static_assert(offsetof(UBP_EmoteItemObject_CM_C, EmoteCollection) == 0x000028, "Member 'UBP_EmoteItemObject_CM_C::EmoteCollection' has a wrong offset!");
static_assert(offsetof(UBP_EmoteItemObject_CM_C, EmoteDataAsset) == 0x000030, "Member 'UBP_EmoteItemObject_CM_C::EmoteDataAsset' has a wrong offset!");
static_assert(offsetof(UBP_EmoteItemObject_CM_C, EmotyEntryWidget) == 0x000058, "Member 'UBP_EmoteItemObject_CM_C::EmotyEntryWidget' has a wrong offset!");

}

