#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnvironmentManager

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "S_WindRanges_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_WindStates_structs.hpp"
#include "Engine_structs.hpp"
#include "S6Core_structs.hpp"


namespace SDK::Params
{

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.UpdateIntensityOfWind
// 0x0050 (0x0050 - 0x0000)
struct BP_EnvironmentManager_C_UpdateIntensityOfWind final
{
public:
	double                                        WindDelta;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimelineComponent*                     Timeline;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bSkipWindIntensityUpdate;                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_602D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WindScale;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxWindSpeed;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinWindSpeed;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreviousWindY;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreviousWindX;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindOffsetUpdateFreq;                              // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_UpdateIntensityOfWind) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_UpdateIntensityOfWind");
static_assert(sizeof(BP_EnvironmentManager_C_UpdateIntensityOfWind) == 0x000050, "Wrong size on BP_EnvironmentManager_C_UpdateIntensityOfWind");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateIntensityOfWind, WindDelta) == 0x000000, "Member 'BP_EnvironmentManager_C_UpdateIntensityOfWind::WindDelta' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateIntensityOfWind, Timeline) == 0x000008, "Member 'BP_EnvironmentManager_C_UpdateIntensityOfWind::Timeline' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateIntensityOfWind, bSkipWindIntensityUpdate) == 0x000010, "Member 'BP_EnvironmentManager_C_UpdateIntensityOfWind::bSkipWindIntensityUpdate' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateIntensityOfWind, WindScale) == 0x000018, "Member 'BP_EnvironmentManager_C_UpdateIntensityOfWind::WindScale' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateIntensityOfWind, MaxWindSpeed) == 0x000020, "Member 'BP_EnvironmentManager_C_UpdateIntensityOfWind::MaxWindSpeed' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateIntensityOfWind, MinWindSpeed) == 0x000028, "Member 'BP_EnvironmentManager_C_UpdateIntensityOfWind::MinWindSpeed' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateIntensityOfWind, PreviousWindY) == 0x000030, "Member 'BP_EnvironmentManager_C_UpdateIntensityOfWind::PreviousWindY' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateIntensityOfWind, PreviousWindX) == 0x000038, "Member 'BP_EnvironmentManager_C_UpdateIntensityOfWind::PreviousWindX' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateIntensityOfWind, WindOffsetUpdateFreq) == 0x000040, "Member 'BP_EnvironmentManager_C_UpdateIntensityOfWind::WindOffsetUpdateFreq' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateIntensityOfWind, CallFunc_Lerp_ReturnValue) == 0x000048, "Member 'BP_EnvironmentManager_C_UpdateIntensityOfWind::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.WeatherPendingChange
// 0x0030 (0x0030 - 0x0000)
struct BP_EnvironmentManager_C_WeatherPendingChange final
{
public:
	struct FWeatherStateProperties                PendingState;                                      // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CountdownTime;                                     // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_WeatherPendingChange) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_WeatherPendingChange");
static_assert(sizeof(BP_EnvironmentManager_C_WeatherPendingChange) == 0x000030, "Wrong size on BP_EnvironmentManager_C_WeatherPendingChange");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherPendingChange, PendingState) == 0x000000, "Member 'BP_EnvironmentManager_C_WeatherPendingChange::PendingState' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherPendingChange, CountdownTime) == 0x000028, "Member 'BP_EnvironmentManager_C_WeatherPendingChange::CountdownTime' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.WeatherChangeEvent
// 0x00B0 (0x00B0 - 0x0000)
struct BP_EnvironmentManager_C_WeatherChangeEvent final
{
public:
	struct FWeatherStateProperties                PendingState;                                      // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	double                                        Time;                                              // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentWeatherStateName;                           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OverrideName;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TransitionTime;                                    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_602E[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValeriaWeather*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTagContainer_CmpSuccess; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_602F[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetWeatherStateOverride_ReturnValue;      // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6030[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6031[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaWeather*                        CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWeatherStateProperties                CallFunc_GetCurrentWorldWeatherState_ReturnValue;  // 0x0088(0x0028)()
};
static_assert(alignof(BP_EnvironmentManager_C_WeatherChangeEvent) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_WeatherChangeEvent");
static_assert(sizeof(BP_EnvironmentManager_C_WeatherChangeEvent) == 0x0000B0, "Wrong size on BP_EnvironmentManager_C_WeatherChangeEvent");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, PendingState) == 0x000000, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::PendingState' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, Time) == 0x000028, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::Time' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, CurrentWeatherStateName) == 0x000030, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::CurrentWeatherStateName' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, OverrideName) == 0x000038, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::OverrideName' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, TransitionTime) == 0x000040, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::TransitionTime' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, K2Node_SwitchName_CmpSuccess) == 0x000048, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, CallFunc_NotEqual_NameName_ReturnValue) == 0x000049, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000058, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, GameplayTagsK2Node_SwitchGameplayTagContainer_CmpSuccess) == 0x000060, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::GameplayTagsK2Node_SwitchGameplayTagContainer_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, CallFunc_GetWeatherStateOverride_ReturnValue) == 0x000064, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::CallFunc_GetWeatherStateOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000078, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000080, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_WeatherChangeEvent, CallFunc_GetCurrentWorldWeatherState_ReturnValue) == 0x000088, "Member 'BP_EnvironmentManager_C_WeatherChangeEvent::CallFunc_GetCurrentWorldWeatherState_ReturnValue' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.UserConstructionScript
// 0x0003 (0x0003 - 0x0000)
struct BP_EnvironmentManager_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_EnvironmentManager_C_UserConstructionScript");
static_assert(sizeof(BP_EnvironmentManager_C_UserConstructionScript) == 0x000003, "Wrong size on BP_EnvironmentManager_C_UserConstructionScript");
static_assert(offsetof(BP_EnvironmentManager_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_EnvironmentManager_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_EnvironmentManager_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'BP_EnvironmentManager_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.UpdateWindUVTargets
// 0x00D0 (0x00D0 - 0x0000)
struct BP_EnvironmentManager_C_UpdateWindUVTargets final
{
public:
	bool                                          bTargetIsZero;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6032[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WindSpeedMax;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindSpeedMin;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6033[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6034[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue_1;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue_1;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6035[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue_1;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_UpdateWindUVTargets) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_UpdateWindUVTargets");
static_assert(sizeof(BP_EnvironmentManager_C_UpdateWindUVTargets) == 0x0000D0, "Wrong size on BP_EnvironmentManager_C_UpdateWindUVTargets");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, bTargetIsZero) == 0x000000, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::bTargetIsZero' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, WindSpeedMax) == 0x000008, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::WindSpeedMax' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, WindSpeedMin) == 0x000010, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::WindSpeedMin' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x000018, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001D, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x000020, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000024, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_BooleanOR_ReturnValue) == 0x000025, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_BooleanOR_ReturnValue_1) == 0x000026, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Blueprint_GetSizeY_ReturnValue_1) == 0x000028, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Blueprint_GetSizeY_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Blueprint_GetSizeX_ReturnValue_1) == 0x00002C, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Blueprint_GetSizeX_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000038, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000040, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Lerp_ReturnValue) == 0x000048, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000058, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000068, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_BreakVector_X) == 0x000080, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_BreakVector_Y) == 0x000088, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_BreakVector_Z) == 0x000090, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000098, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Percent_FloatFloat_ReturnValue) == 0x0000B8, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Percent_FloatFloat_ReturnValue_1) == 0x0000C0, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Percent_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVTargets, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0000C8, "Member 'BP_EnvironmentManager_C_UpdateWindUVTargets::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.UpdateWindUVOffsets
// 0x0070 (0x0070 - 0x0000)
struct BP_EnvironmentManager_C_UpdateWindUVOffsets final
{
public:
	float                                         InputPin;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6036[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraParameterCollectionInstance*    CallFunc_GetNiagaraParameterCollection_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_UpdateWindUVOffsets) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_UpdateWindUVOffsets");
static_assert(sizeof(BP_EnvironmentManager_C_UpdateWindUVOffsets) == 0x000070, "Wrong size on BP_EnvironmentManager_C_UpdateWindUVOffsets");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVOffsets, InputPin) == 0x000000, "Member 'BP_EnvironmentManager_C_UpdateWindUVOffsets::InputPin' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVOffsets, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000004, "Member 'BP_EnvironmentManager_C_UpdateWindUVOffsets::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVOffsets, CallFunc_GetNiagaraParameterCollection_ReturnValue) == 0x000018, "Member 'BP_EnvironmentManager_C_UpdateWindUVOffsets::CallFunc_GetNiagaraParameterCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVOffsets, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000020, "Member 'BP_EnvironmentManager_C_UpdateWindUVOffsets::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVOffsets, CallFunc_Lerp_ReturnValue) == 0x000038, "Member 'BP_EnvironmentManager_C_UpdateWindUVOffsets::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVOffsets, CallFunc_Lerp_ReturnValue_1) == 0x000040, "Member 'BP_EnvironmentManager_C_UpdateWindUVOffsets::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVOffsets, CallFunc_MakeVector2D_ReturnValue) == 0x000048, "Member 'BP_EnvironmentManager_C_UpdateWindUVOffsets::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVOffsets, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000058, "Member 'BP_EnvironmentManager_C_UpdateWindUVOffsets::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVOffsets, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000060, "Member 'BP_EnvironmentManager_C_UpdateWindUVOffsets::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVOffsets, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000068, "Member 'BP_EnvironmentManager_C_UpdateWindUVOffsets::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindUVOffsets, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x00006C, "Member 'BP_EnvironmentManager_C_UpdateWindUVOffsets::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.UpdateWindState
// 0x0001 (0x0001 - 0x0000)
struct BP_EnvironmentManager_C_UpdateWindState final
{
public:
	E_WindStates                                  CallFunc_GetWindStateRandomWeighted_ReturnValue;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_UpdateWindState) == 0x000001, "Wrong alignment on BP_EnvironmentManager_C_UpdateWindState");
static_assert(sizeof(BP_EnvironmentManager_C_UpdateWindState) == 0x000001, "Wrong size on BP_EnvironmentManager_C_UpdateWindState");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateWindState, CallFunc_GetWindStateRandomWeighted_ReturnValue) == 0x000000, "Member 'BP_EnvironmentManager_C_UpdateWindState::CallFunc_GetWindStateRandomWeighted_ReturnValue' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.UpdateEnvMPC
// 0x00D8 (0x00D8 - 0x0000)
struct BP_EnvironmentManager_C_UpdateEnvMPC final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6037[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue;                // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6038[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_UpdateEnvMPC) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_UpdateEnvMPC");
static_assert(sizeof(BP_EnvironmentManager_C_UpdateEnvMPC) == 0x0000D8, "Wrong size on BP_EnvironmentManager_C_UpdateEnvMPC");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, Time) == 0x000000, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::Time' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, CallFunc_GetForwardVector_ReturnValue) == 0x000020, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000038, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000050, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000068, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000078, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, CallFunc_GetLightColor_ReturnValue) == 0x000094, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::CallFunc_GetLightColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, CallFunc_SelectVector_ReturnValue) == 0x0000A8, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x0000C0, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvMPC, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x0000D0, "Member 'BP_EnvironmentManager_C_UpdateEnvMPC::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.UpdateEnvAudio
// 0x0020 (0x0020 - 0x0000)
struct BP_EnvironmentManager_C_UpdateEnvAudio final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindStrength;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AudioTimeScale;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_UpdateEnvAudio) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_UpdateEnvAudio");
static_assert(sizeof(BP_EnvironmentManager_C_UpdateEnvAudio) == 0x000020, "Wrong size on BP_EnvironmentManager_C_UpdateEnvAudio");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvAudio, Time) == 0x000000, "Member 'BP_EnvironmentManager_C_UpdateEnvAudio::Time' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvAudio, WindStrength) == 0x000008, "Member 'BP_EnvironmentManager_C_UpdateEnvAudio::WindStrength' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvAudio, AudioTimeScale) == 0x000010, "Member 'BP_EnvironmentManager_C_UpdateEnvAudio::AudioTimeScale' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_UpdateEnvAudio, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_EnvironmentManager_C_UpdateEnvAudio::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.SetWindIntensity
// 0x0018 (0x0018 - 0x0000)
struct BP_EnvironmentManager_C_SetWindIntensity final
{
public:
	double                                        NewIntensity;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraParameterCollectionInstance*    CallFunc_GetNiagaraParameterCollection_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InValue_ImplicitCast;   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_SetWindIntensity) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_SetWindIntensity");
static_assert(sizeof(BP_EnvironmentManager_C_SetWindIntensity) == 0x000018, "Wrong size on BP_EnvironmentManager_C_SetWindIntensity");
static_assert(offsetof(BP_EnvironmentManager_C_SetWindIntensity, NewIntensity) == 0x000000, "Member 'BP_EnvironmentManager_C_SetWindIntensity::NewIntensity' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_SetWindIntensity, CallFunc_GetNiagaraParameterCollection_ReturnValue) == 0x000008, "Member 'BP_EnvironmentManager_C_SetWindIntensity::CallFunc_GetNiagaraParameterCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_SetWindIntensity, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000010, "Member 'BP_EnvironmentManager_C_SetWindIntensity::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_SetWindIntensity, CallFunc_SetFloatParameter_InValue_ImplicitCast) == 0x000014, "Member 'BP_EnvironmentManager_C_SetWindIntensity::CallFunc_SetFloatParameter_InValue_ImplicitCast' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.SetInitialMusic
// 0x0030 (0x0030 - 0x0000)
struct BP_EnvironmentManager_C_SetInitialMusic final
{
public:
	class UBP_MusicManager_C*                     CallFunc_GetMusicManager_AsBP_Music_Manager;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaTimeManager*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimeOfDayFilter                       K2Node_MakeStruct_TimeOfDayFilter;                 // 0x0010(0x0018)(NoDestructor)
	bool                                          CallFunc_IsWithinTimeOfDayFilter_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_SetInitialMusic) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_SetInitialMusic");
static_assert(sizeof(BP_EnvironmentManager_C_SetInitialMusic) == 0x000030, "Wrong size on BP_EnvironmentManager_C_SetInitialMusic");
static_assert(offsetof(BP_EnvironmentManager_C_SetInitialMusic, CallFunc_GetMusicManager_AsBP_Music_Manager) == 0x000000, "Member 'BP_EnvironmentManager_C_SetInitialMusic::CallFunc_GetMusicManager_AsBP_Music_Manager' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_SetInitialMusic, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_EnvironmentManager_C_SetInitialMusic::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_SetInitialMusic, K2Node_MakeStruct_TimeOfDayFilter) == 0x000010, "Member 'BP_EnvironmentManager_C_SetInitialMusic::K2Node_MakeStruct_TimeOfDayFilter' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_SetInitialMusic, CallFunc_IsWithinTimeOfDayFilter_ReturnValue) == 0x000028, "Member 'BP_EnvironmentManager_C_SetInitialMusic::CallFunc_IsWithinTimeOfDayFilter_ReturnValue' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.RotatePlanetMeshes
// 0x0008 (0x0008 - 0x0000)
struct BP_EnvironmentManager_C_RotatePlanetMeshes final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_RotatePlanetMeshes) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_RotatePlanetMeshes");
static_assert(sizeof(BP_EnvironmentManager_C_RotatePlanetMeshes) == 0x000008, "Wrong size on BP_EnvironmentManager_C_RotatePlanetMeshes");
static_assert(offsetof(BP_EnvironmentManager_C_RotatePlanetMeshes, Time) == 0x000000, "Member 'BP_EnvironmentManager_C_RotatePlanetMeshes::Time' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.RefreshWindParams
// 0x0028 (0x0028 - 0x0000)
struct BP_EnvironmentManager_C_RefreshWindParams final
{
public:
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6039[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Get_Wind_State_Value_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_RefreshWindParams) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_RefreshWindParams");
static_assert(sizeof(BP_EnvironmentManager_C_RefreshWindParams) == 0x000028, "Wrong size on BP_EnvironmentManager_C_RefreshWindParams");
static_assert(offsetof(BP_EnvironmentManager_C_RefreshWindParams, CallFunc_GetTimelineLength_ReturnValue) == 0x000000, "Member 'BP_EnvironmentManager_C_RefreshWindParams::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_RefreshWindParams, CallFunc_Get_Wind_State_Value_ReturnValue) == 0x000008, "Member 'BP_EnvironmentManager_C_RefreshWindParams::CallFunc_Get_Wind_State_Value_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_RefreshWindParams, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_EnvironmentManager_C_RefreshWindParams::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_RefreshWindParams, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'BP_EnvironmentManager_C_RefreshWindParams::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_RefreshWindParams, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000020, "Member 'BP_EnvironmentManager_C_RefreshWindParams::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EnvironmentManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EnvironmentManager_C_ReceiveTick");
static_assert(sizeof(BP_EnvironmentManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_EnvironmentManager_C_ReceiveTick");
static_assert(offsetof(BP_EnvironmentManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EnvironmentManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.OverrideWindIntensity
// 0x0008 (0x0008 - 0x0000)
struct BP_EnvironmentManager_C_OverrideWindIntensity final
{
public:
	double                                        Intensity;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_OverrideWindIntensity) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_OverrideWindIntensity");
static_assert(sizeof(BP_EnvironmentManager_C_OverrideWindIntensity) == 0x000008, "Wrong size on BP_EnvironmentManager_C_OverrideWindIntensity");
static_assert(offsetof(BP_EnvironmentManager_C_OverrideWindIntensity, Intensity) == 0x000000, "Member 'BP_EnvironmentManager_C_OverrideWindIntensity::Intensity' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.OvercastWeather2
// 0x0010 (0x0010 - 0x0000)
struct BP_EnvironmentManager_C_OvercastWeather2 final
{
public:
	double                                        TransitionTime;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Amount;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_OvercastWeather2) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_OvercastWeather2");
static_assert(sizeof(BP_EnvironmentManager_C_OvercastWeather2) == 0x000010, "Wrong size on BP_EnvironmentManager_C_OvercastWeather2");
static_assert(offsetof(BP_EnvironmentManager_C_OvercastWeather2, TransitionTime) == 0x000000, "Member 'BP_EnvironmentManager_C_OvercastWeather2::TransitionTime' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_OvercastWeather2, Amount) == 0x000008, "Member 'BP_EnvironmentManager_C_OvercastWeather2::Amount' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.MusicCallback
// 0x0010 (0x0010 - 0x0000)
struct BP_EnvironmentManager_C_MusicCallback final
{
public:
	class FString                                 UserCueName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_MusicCallback) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_MusicCallback");
static_assert(sizeof(BP_EnvironmentManager_C_MusicCallback) == 0x000010, "Wrong size on BP_EnvironmentManager_C_MusicCallback");
static_assert(offsetof(BP_EnvironmentManager_C_MusicCallback, UserCueName) == 0x000000, "Member 'BP_EnvironmentManager_C_MusicCallback::UserCueName' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.InitializeEnvAudio
// 0x0020 (0x0020 - 0x0000)
struct BP_EnvironmentManager_C_InitializeEnvAudio final
{
public:
	TDelegate<void(const class FString& UserCueName)> DayNightMusicCallback;                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UBP_MusicManager_C*                     CallFunc_GetMusicManager_AsBP_Music_Manager;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_InitializeEnvAudio) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_InitializeEnvAudio");
static_assert(sizeof(BP_EnvironmentManager_C_InitializeEnvAudio) == 0x000020, "Wrong size on BP_EnvironmentManager_C_InitializeEnvAudio");
static_assert(offsetof(BP_EnvironmentManager_C_InitializeEnvAudio, DayNightMusicCallback) == 0x000000, "Member 'BP_EnvironmentManager_C_InitializeEnvAudio::DayNightMusicCallback' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_InitializeEnvAudio, CallFunc_GetMusicManager_AsBP_Music_Manager) == 0x000010, "Member 'BP_EnvironmentManager_C_InitializeEnvAudio::CallFunc_GetMusicManager_AsBP_Music_Manager' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_InitializeEnvAudio, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_EnvironmentManager_C_InitializeEnvAudio::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.IgnoreMusTransition
// 0x0018 (0x0018 - 0x0000)
struct BP_EnvironmentManager_C_IgnoreMusTransition final
{
public:
	bool                                          IgnoreDayNightTransition;                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_603A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MusicManager_C*                     CallFunc_GetMusicManager_AsBP_Music_Manager;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvironmentManager_C_IgnoreMusTransition) == 0x000008, "Wrong alignment on BP_EnvironmentManager_C_IgnoreMusTransition");
static_assert(sizeof(BP_EnvironmentManager_C_IgnoreMusTransition) == 0x000018, "Wrong size on BP_EnvironmentManager_C_IgnoreMusTransition");
static_assert(offsetof(BP_EnvironmentManager_C_IgnoreMusTransition, IgnoreDayNightTransition) == 0x000000, "Member 'BP_EnvironmentManager_C_IgnoreMusTransition::IgnoreDayNightTransition' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_IgnoreMusTransition, CallFunc_GetMusicManager_AsBP_Music_Manager) == 0x000008, "Member 'BP_EnvironmentManager_C_IgnoreMusTransition::CallFunc_GetMusicManager_AsBP_Music_Manager' has a wrong offset!");
static_assert(offsetof(BP_EnvironmentManager_C_IgnoreMusTransition, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_EnvironmentManager_C_IgnoreMusTransition::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EnvironmentManager.BP_EnvironmentManager_C.GetWindStateRandomWeighted
// 0x0068 (0x0068 - 0x0000)
struct BP_EnvironmentManager_C_GetWindStateRandomWeighted final
{
public:
	E_WindStates                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_603B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentWeight;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_603C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Rand;                                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WindStates                                  Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WindStates                                  Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WindStates                                  Temp_byte_Variable_2;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_603D[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
