#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FoliageOnPlot_Junk_Sign

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FoliageOnPlot_Junk_Sign.BP_FoliageOnPlot_Junk_Sign_C.ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign
// 0x0058 (0x0058 - 0x0000)
struct BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C6[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_WaitForValeriaCharacter_valeriaCharacter; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C7[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCinematicMode_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C8[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCinematicManagerComponent*             CallFunc_GetCinematicManager_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C9[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign) == 0x000008, "Wrong alignment on BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign");
static_assert(sizeof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign) == 0x000058, "Wrong size on BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign, EntryPoint) == 0x000000, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign, CallFunc_WaitForValeriaCharacter_valeriaCharacter) == 0x000018, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign::CallFunc_WaitForValeriaCharacter_valeriaCharacter' has a wrong offset!");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000028, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign, CallFunc_IsInCinematicMode_ReturnValue) == 0x000030, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign::CallFunc_IsInCinematicMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign, CallFunc_GetCinematicManager_ReturnValue) == 0x000038, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign::CallFunc_GetCinematicManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign, CallFunc_HasAuthority_ReturnValue) == 0x000040, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000041, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000042, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ExecuteUbergraph_BP_FoliageOnPlot_Junk_Sign::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_FoliageOnPlot_Junk_Sign.BP_FoliageOnPlot_Junk_Sign_C.ShouldUseISM
// 0x0001 (0x0001 - 0x0000)
struct BP_FoliageOnPlot_Junk_Sign_C_ShouldUseISM final
{
public:
	bool                                          Param_ShouldUseISM;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoliageOnPlot_Junk_Sign_C_ShouldUseISM) == 0x000001, "Wrong alignment on BP_FoliageOnPlot_Junk_Sign_C_ShouldUseISM");
static_assert(sizeof(BP_FoliageOnPlot_Junk_Sign_C_ShouldUseISM) == 0x000001, "Wrong size on BP_FoliageOnPlot_Junk_Sign_C_ShouldUseISM");
static_assert(offsetof(BP_FoliageOnPlot_Junk_Sign_C_ShouldUseISM, Param_ShouldUseISM) == 0x000000, "Member 'BP_FoliageOnPlot_Junk_Sign_C_ShouldUseISM::Param_ShouldUseISM' has a wrong offset!");

}

