#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FoliageOnPlot_Mining

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ValeriaGatherableLoot_Mining_SingleHarvest_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FoliageOnPlot_Mining.BP_FoliageOnPlot_Mining_C
// 0x0030 (0x0440 - 0x0410)
class ABP_FoliageOnPlot_Mining_C : public ABP_ValeriaGatherableLoot_Mining_SingleHarvest_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FoliageOnPlot_Mining_C;          // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      QuestHighlightFX;                                  // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPersistComponent*                      Persist;                                           // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuestActivityPrereq                   QuestHighlightReq;                                 // 0x0428(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_6112[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           HighlightCheckTimer;                               // 0x0438(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FoliageOnPlot_Mining(int32 EntryPoint, bool CallFunc_HasAuthority_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Greater_IntInt_ReturnValue, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool CallFunc_IsAtHome_ReturnValue, EEndPlayReason K2Node_Event_EndPlayReason, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_DoesCharacterSatisfyQuestActivityPrereq_ReturnValue, bool CallFunc_IsActive_ReturnValue, bool CallFunc_IsActive_ReturnValue_1);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void TryHighlight();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FoliageOnPlot_Mining_C">();
	}
	static class ABP_FoliageOnPlot_Mining_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FoliageOnPlot_Mining_C>();
	}
};
static_assert(alignof(ABP_FoliageOnPlot_Mining_C) == 0x000008, "Wrong alignment on ABP_FoliageOnPlot_Mining_C");
static_assert(sizeof(ABP_FoliageOnPlot_Mining_C) == 0x000440, "Wrong size on ABP_FoliageOnPlot_Mining_C");
static_assert(offsetof(ABP_FoliageOnPlot_Mining_C, UberGraphFrame_BP_FoliageOnPlot_Mining_C) == 0x000410, "Member 'ABP_FoliageOnPlot_Mining_C::UberGraphFrame_BP_FoliageOnPlot_Mining_C' has a wrong offset!");
static_assert(offsetof(ABP_FoliageOnPlot_Mining_C, QuestHighlightFX) == 0x000418, "Member 'ABP_FoliageOnPlot_Mining_C::QuestHighlightFX' has a wrong offset!");
static_assert(offsetof(ABP_FoliageOnPlot_Mining_C, Persist) == 0x000420, "Member 'ABP_FoliageOnPlot_Mining_C::Persist' has a wrong offset!");
static_assert(offsetof(ABP_FoliageOnPlot_Mining_C, QuestHighlightReq) == 0x000428, "Member 'ABP_FoliageOnPlot_Mining_C::QuestHighlightReq' has a wrong offset!");
static_assert(offsetof(ABP_FoliageOnPlot_Mining_C, HighlightCheckTimer) == 0x000438, "Member 'ABP_FoliageOnPlot_Mining_C::HighlightCheckTimer' has a wrong offset!");

}

