#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FoliageOnPlot_Trees

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "BP_ValeriaGatherableLoot_Lumber_Tree_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FoliageOnPlot_Trees.BP_FoliageOnPlot_Trees_C
// 0x0030 (0x0708 - 0x06D8)
class ABP_FoliageOnPlot_Trees_C : public ABP_ValeriaGatherableLoot_Lumber_Tree_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FoliageOnPlot_Trees_C;           // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      QuestHighlightFX;                                  // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPersistComponent*                      Persist;                                           // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HighlightCheckTimer;                               // 0x06F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FQuestActivityPrereq                   QuestHighlightReq;                                 // 0x06F8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_FoliageOnPlot_Trees(int32 EntryPoint, bool CallFunc_HasAuthority_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Greater_IntInt_ReturnValue, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool CallFunc_IsAtHome_ReturnValue, EEndPlayReason K2Node_Event_EndPlayReason, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_IsActive_ReturnValue, bool CallFunc_IsActive_ReturnValue_1, class AActor* K2Node_Event_Instigator, bool CallFunc_DoesCharacterSatisfyQuestActivityPrereq_ReturnValue, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue);
	void OnGatherableDestroyed(class AActor* Param_Instigator);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void TryHighlight();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FoliageOnPlot_Trees_C">();
	}
	static class ABP_FoliageOnPlot_Trees_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FoliageOnPlot_Trees_C>();
	}
};
static_assert(alignof(ABP_FoliageOnPlot_Trees_C) == 0x000008, "Wrong alignment on ABP_FoliageOnPlot_Trees_C");
static_assert(sizeof(ABP_FoliageOnPlot_Trees_C) == 0x000708, "Wrong size on ABP_FoliageOnPlot_Trees_C");
static_assert(offsetof(ABP_FoliageOnPlot_Trees_C, UberGraphFrame_BP_FoliageOnPlot_Trees_C) == 0x0006D8, "Member 'ABP_FoliageOnPlot_Trees_C::UberGraphFrame_BP_FoliageOnPlot_Trees_C' has a wrong offset!");
static_assert(offsetof(ABP_FoliageOnPlot_Trees_C, QuestHighlightFX) == 0x0006E0, "Member 'ABP_FoliageOnPlot_Trees_C::QuestHighlightFX' has a wrong offset!");
static_assert(offsetof(ABP_FoliageOnPlot_Trees_C, Persist) == 0x0006E8, "Member 'ABP_FoliageOnPlot_Trees_C::Persist' has a wrong offset!");
static_assert(offsetof(ABP_FoliageOnPlot_Trees_C, HighlightCheckTimer) == 0x0006F0, "Member 'ABP_FoliageOnPlot_Trees_C::HighlightCheckTimer' has a wrong offset!");
static_assert(offsetof(ABP_FoliageOnPlot_Trees_C, QuestHighlightReq) == 0x0006F8, "Member 'ABP_FoliageOnPlot_Trees_C::QuestHighlightReq' has a wrong offset!");

}

