#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FishingCastIndicatorActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FishingCastIndicatorActor.BP_FishingCastIndicatorActor_C.event_amIGoodBoy
// 0x0001 (0x0001 - 0x0000)
struct BP_FishingCastIndicatorActor_C_Event_amIGoodBoy final
{
public:
	bool                                          YesIAM;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FishingCastIndicatorActor_C_Event_amIGoodBoy) == 0x000001, "Wrong alignment on BP_FishingCastIndicatorActor_C_Event_amIGoodBoy");
static_assert(sizeof(BP_FishingCastIndicatorActor_C_Event_amIGoodBoy) == 0x000001, "Wrong size on BP_FishingCastIndicatorActor_C_Event_amIGoodBoy");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_Event_amIGoodBoy, YesIAM) == 0x000000, "Member 'BP_FishingCastIndicatorActor_C_Event_amIGoodBoy::YesIAM' has a wrong offset!");

// Function BP_FishingCastIndicatorActor.BP_FishingCastIndicatorActor_C.event_decalMe
// 0x0008 (0x0008 - 0x0000)
struct BP_FishingCastIndicatorActor_C_Event_decalMe final
{
public:
	double                                        EndExtend;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FishingCastIndicatorActor_C_Event_decalMe) == 0x000008, "Wrong alignment on BP_FishingCastIndicatorActor_C_Event_decalMe");
static_assert(sizeof(BP_FishingCastIndicatorActor_C_Event_decalMe) == 0x000008, "Wrong size on BP_FishingCastIndicatorActor_C_Event_decalMe");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_Event_decalMe, EndExtend) == 0x000000, "Member 'BP_FishingCastIndicatorActor_C_Event_decalMe::EndExtend' has a wrong offset!");

// Function BP_FishingCastIndicatorActor.BP_FishingCastIndicatorActor_C.ExecuteUbergraph_BP_FishingCastIndicatorActor
// 0x0900 (0x0900 - 0x0000)
struct BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_yesIAM;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4166[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_pos_mid;                        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_pos_end;                        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4167[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_endExtend;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4168[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue; // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0110(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue_1; // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0228(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4169[0x3];                                     // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_endPoint;                             // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFishingCastIndicatorStatus                   K2Node_Event_status;                               // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_416A[0x6];                                     // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0370(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x04B0(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x04C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x04D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_416B[0x7];                                     // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x05C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x05E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x06C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_416C[0x2];                                     // 0x06CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_416D[0x4];                                     // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x06D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x06F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0708(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0720(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0748(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_416E[0x4];                                     // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0770(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0788(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x07A0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_416F[0x7];                                     // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0808(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_2;     // 0x0810(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor) == 0x000010, "Wrong alignment on BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor");
static_assert(sizeof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor) == 0x000900, "Wrong size on BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, EntryPoint) == 0x000000, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, K2Node_CustomEvent_yesIAM) == 0x000004, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::K2Node_CustomEvent_yesIAM' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000008, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000018, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000028, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000060, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, K2Node_CustomEvent_pos_mid) == 0x000078, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::K2Node_CustomEvent_pos_mid' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, K2Node_CustomEvent_pos_end) == 0x000090, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::K2Node_CustomEvent_pos_end' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, Temp_int_Variable) == 0x0000A8, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, K2Node_CustomEvent_endExtend) == 0x0000B0, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::K2Node_CustomEvent_endExtend' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue) == 0x0000C8, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_MakeVector_ReturnValue) == 0x0000E0, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x0000F8, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000110, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_MakeVector_ReturnValue_1) == 0x0001F8, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue_1) == 0x000210, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000228, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x000310, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000328, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Add_IntInt_ReturnValue_1) == 0x00032C, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, K2Node_Event_endPoint) == 0x000330, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::K2Node_Event_endPoint' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, K2Node_Event_status) == 0x000348, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::K2Node_Event_status' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, K2Node_SwitchEnum_CmpSuccess) == 0x000349, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000350, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Vector_Distance2D_ReturnValue) == 0x000368, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000370, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000458, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000460, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_MakeVector_ReturnValue_2) == 0x000468, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000480, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000498, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, Temp_object_Variable) == 0x0004B0, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0004C0, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_LineTraceSingle_OutHit) == 0x0004D8, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_LineTraceSingle_ReturnValue) == 0x0005C0, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0005C8, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0005E0, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_bBlockingHit) == 0x0006C8, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_bInitialOverlap) == 0x0006C9, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_Time) == 0x0006CC, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_Distance) == 0x0006D0, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_Location) == 0x0006D8, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_ImpactPoint) == 0x0006F0, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_Normal) == 0x000708, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_ImpactNormal) == 0x000720, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_PhysMat) == 0x000738, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_HitActor) == 0x000740, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_HitComponent) == 0x000748, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_HitBoneName) == 0x000750, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_BoneName) == 0x000758, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_HitItem) == 0x000760, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_ElementIndex) == 0x000764, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_FaceIndex) == 0x000768, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_TraceStart) == 0x000770, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_BreakHitResult_TraceEnd) == 0x000788, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, Temp_struct_Variable) == 0x0007A0, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, K2Node_SwitchEnum_CmpSuccess_1) == 0x000800, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_AddComponent_ReturnValue) == 0x000808, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor, CallFunc_K2_SetWorldLocation_SweepHitResult_2) == 0x000810, "Member 'BP_FishingCastIndicatorActor_C_ExecuteUbergraph_BP_FishingCastIndicatorActor::CallFunc_K2_SetWorldLocation_SweepHitResult_2' has a wrong offset!");

// Function BP_FishingCastIndicatorActor.BP_FishingCastIndicatorActor_C.OnCastIndicatorChanged
// 0x0020 (0x0020 - 0x0000)
struct BP_FishingCastIndicatorActor_C_OnCastIndicatorChanged final
{
public:
	struct FVector                                Endpoint;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFishingCastIndicatorStatus                   Status;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FishingCastIndicatorActor_C_OnCastIndicatorChanged) == 0x000008, "Wrong alignment on BP_FishingCastIndicatorActor_C_OnCastIndicatorChanged");
static_assert(sizeof(BP_FishingCastIndicatorActor_C_OnCastIndicatorChanged) == 0x000020, "Wrong size on BP_FishingCastIndicatorActor_C_OnCastIndicatorChanged");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_OnCastIndicatorChanged, Endpoint) == 0x000000, "Member 'BP_FishingCastIndicatorActor_C_OnCastIndicatorChanged::Endpoint' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_OnCastIndicatorChanged, Status) == 0x000018, "Member 'BP_FishingCastIndicatorActor_C_OnCastIndicatorChanged::Status' has a wrong offset!");

// Function BP_FishingCastIndicatorActor.BP_FishingCastIndicatorActor_C.update_splineStuff
// 0x0030 (0x0030 - 0x0000)
struct BP_FishingCastIndicatorActor_C_Update_splineStuff final
{
public:
	struct FVector                                Pos_mid;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pos_end;                                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FishingCastIndicatorActor_C_Update_splineStuff) == 0x000008, "Wrong alignment on BP_FishingCastIndicatorActor_C_Update_splineStuff");
static_assert(sizeof(BP_FishingCastIndicatorActor_C_Update_splineStuff) == 0x000030, "Wrong size on BP_FishingCastIndicatorActor_C_Update_splineStuff");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_Update_splineStuff, Pos_mid) == 0x000000, "Member 'BP_FishingCastIndicatorActor_C_Update_splineStuff::Pos_mid' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_Update_splineStuff, Pos_end) == 0x000018, "Member 'BP_FishingCastIndicatorActor_C_Update_splineStuff::Pos_end' has a wrong offset!");

// Function BP_FishingCastIndicatorActor.BP_FishingCastIndicatorActor_C.UserConstructionScript
// 0x0078 (0x0078 - 0x0000)
struct BP_FishingCastIndicatorActor_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_2;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FishingCastIndicatorActor_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_FishingCastIndicatorActor_C_UserConstructionScript");
static_assert(sizeof(BP_FishingCastIndicatorActor_C_UserConstructionScript) == 0x000078, "Wrong size on BP_FishingCastIndicatorActor_C_UserConstructionScript");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'BP_FishingCastIndicatorActor_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishingCastIndicatorActor_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_FishingCastIndicatorActor_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
