#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GearUtils_CM

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BP_GearUtils_CM.BP_GearUtils_CM_C.UnequipGear
// 0x00F0 (0x00F0 - 0x0000)
struct BP_GearUtils_CM_C_UnequipGear final
{
public:
	class APlayerController*                      OwningPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGearComponent*                         GearComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGearSlotTypeConfig*                    SlotType;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBagSlotLocation                       DesiredSlot;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         IndexWithinType;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50F8[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Widget;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PopUpWidget;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Template_Button_CM_C*>      Buttons;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50F9[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UCommonInputSubsystem*            CallFunc_GetCommonInputSystem_ReturnValue;         // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50FA[0x5];                                     // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0088(0x0018)(ConstParm)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50FB[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PinRemoveConfirmModal_CM_C*        CallFunc_Create_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_2;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EGearChangeResult                             CallFunc_CanRemoveGearBySlotType_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50FC[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SimpleModalDialog_PF_C*            CallFunc_Create_ReturnValue_1;                     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50FD[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SimpleModalDialog_CM_C*            CallFunc_Create_ReturnValue_2;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x00D8(0x0018)(ConstParm)
};
static_assert(alignof(BP_GearUtils_CM_C_UnequipGear) == 0x000008, "Wrong alignment on BP_GearUtils_CM_C_UnequipGear");
static_assert(sizeof(BP_GearUtils_CM_C_UnequipGear) == 0x0000F0, "Wrong size on BP_GearUtils_CM_C_UnequipGear");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, OwningPlayer) == 0x000000, "Member 'BP_GearUtils_CM_C_UnequipGear::OwningPlayer' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, GearComponent) == 0x000008, "Member 'BP_GearUtils_CM_C_UnequipGear::GearComponent' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, SlotType) == 0x000010, "Member 'BP_GearUtils_CM_C_UnequipGear::SlotType' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, DesiredSlot) == 0x000018, "Member 'BP_GearUtils_CM_C_UnequipGear::DesiredSlot' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, IndexWithinType) == 0x000020, "Member 'BP_GearUtils_CM_C_UnequipGear::IndexWithinType' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, __WorldContext) == 0x000028, "Member 'BP_GearUtils_CM_C_UnequipGear::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, Widget) == 0x000030, "Member 'BP_GearUtils_CM_C_UnequipGear::Widget' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, PopUpWidget) == 0x000038, "Member 'BP_GearUtils_CM_C_UnequipGear::PopUpWidget' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, Buttons) == 0x000040, "Member 'BP_GearUtils_CM_C_UnequipGear::Buttons' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_GetValeriaCharacter_OutResult) == 0x000050, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000058, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_GetCommonInputSystem_ReturnValue) == 0x000060, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_GetCommonInputSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_GetInventory_ReturnValue) == 0x000068, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_GetCurrentInputType_ReturnValue) == 0x000070, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'BP_GearUtils_CM_C_UnequipGear::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, K2Node_SwitchEnum_CmpSuccess_1) == 0x000072, "Member 'BP_GearUtils_CM_C_UnequipGear::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000078, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_GetUIManagerWidget_ReturnValue_1) == 0x000080, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_GetUIManagerWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, Temp_text_Variable) == 0x000088, "Member 'BP_GearUtils_CM_C_UnequipGear::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A0, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_Create_ReturnValue) == 0x0000A8, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_GetUIManagerWidget_ReturnValue_2) == 0x0000B0, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_GetUIManagerWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_CanRemoveGearBySlotType_ReturnValue) == 0x0000B8, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_CanRemoveGearBySlotType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_Create_ReturnValue_1) == 0x0000C0, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000C8, "Member 'BP_GearUtils_CM_C_UnequipGear::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, CallFunc_Create_ReturnValue_2) == 0x0000D0, "Member 'BP_GearUtils_CM_C_UnequipGear::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GearUtils_CM_C_UnequipGear, Temp_text_Variable_1) == 0x0000D8, "Member 'BP_GearUtils_CM_C_UnequipGear::Temp_text_Variable_1' has a wrong offset!");

}

