#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Garden3x3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Garden3x3.BP_Garden3x3_C
// 0x0108 (0x03B0 - 0x02A8)
class ABP_Garden3x3_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_FireFlies;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PlacementCollision;                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlateWidgetComponent_C*             WBP_HarvestingFTUE;                                // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlateWidgetComponent_C*             WBP_WateringFTUE;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Plot_Big_Placement;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Plot_Big;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal_Plot;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Plot_root;                                         // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_plotSpawnDraw02;                                // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_plotSpawnDraw01;                                // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Spawn_spinRoot;                                    // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Vfx_root;                                          // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GrassMask;                                         // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_border;                                         // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SelectitemHitbox;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGatherableComponent*                   Gatherable;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPersistComponent*                      Persist;                                           // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGardenComponent*                       Garden;                                            // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_plotSpawn_spin_11982493419DAE7B483383BEB84C563B; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_plotSpawn_growth_11982493419DAE7B483383BEB84C563B; // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_plotSpawn_size_11982493419DAE7B483383BEB84C563B; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_plotSpawn_drop_11982493419DAE7B483383BEB84C563B; // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_plotSpawn__Direction_11982493419DAE7B483383BEB84C563B; // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3040[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_plotSpawn;                                      // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3041[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Time_appearStart;                                  // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time_appearFull;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time_disappearStart;                               // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time_disappearGone;                                // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_plotDecal;                                      // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          PlotSpawnSound;                                    // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          PlotPickupSound;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Event_fireFly();
	void Event_plotPickUp();
	void Event_plotSetup();
	void Event_plotSpawn();
	void Event_setupFireflies();
	void Event_shiftPlot();
	void ExecuteUbergraph_BP_Garden3x3(int32 EntryPoint, TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_2, TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_3, TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_4, TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_5, class FName Temp_name_Variable, double CallFunc_RandomFloatInRange_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FHitResult& CallFunc_K2_SetRelativeLocation_SweepHitResult, EEndPlayReason K2Node_Event_EndPlayReason, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, float K2Node_Event_DeltaSeconds, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_1, class UMaterialInterface* CallFunc_GetDecalMaterial_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue_1, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_6, TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_7, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, int32 CallFunc_AkEventActor_ReturnValue, class UAkComponent* CallFunc_AkEventLocation_AkComponent, int32 CallFunc_AkEventLocation_Playing_ID, bool CallFunc_IsNewlySpawned_ReturnValue, class AValeriaCharacter* K2Node_CustomEvent_actorInstigator_9, int32 K2Node_CustomEvent_tileIndex_9, class AValeriaCharacter* K2Node_CustomEvent_actorInstigator_8, int32 K2Node_CustomEvent_tileIndex_8, class AValeriaCharacter* K2Node_CustomEvent_actorInstigator_7, int32 K2Node_CustomEvent_tileIndex_7, class AValeriaCharacter* K2Node_CustomEvent_actorInstigator_6, int32 K2Node_CustomEvent_tileIndex_6, class AValeriaCharacter* K2Node_CustomEvent_actorInstigator_5, int32 K2Node_CustomEvent_tileIndex_5, class AValeriaCharacter* K2Node_CustomEvent_actorInstigator_4, int32 K2Node_CustomEvent_tileIndex_4, class AActor* K2Node_CustomEvent_instigator_4, class AActor* K2Node_CustomEvent_instigator_3, int32 CallFunc_AkEventActor_ReturnValue_1, int32 CallFunc_AkEventActor_ReturnValue_2, class AActor* K2Node_CustomEvent_actor, class AActor* K2Node_CustomEvent_instigator_2, int32 CallFunc_AkEventActor_ReturnValue_3, int32 CallFunc_AkEventActor_ReturnValue_4, class AActor* K2Node_CustomEvent_instigator_1, class AActor* K2Node_CustomEvent_instigator, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_AkEventActor_ReturnValue_5, int32 CallFunc_AkEventActor_ReturnValue_6, class AValeriaCharacter* K2Node_CustomEvent_actorInstigator_3, int32 K2Node_CustomEvent_tileIndex_3, class AValeriaCharacter* K2Node_CustomEvent_actorInstigator_2, int32 K2Node_CustomEvent_tileIndex_2, class AValeriaCharacter* K2Node_CustomEvent_actorInstigator_1, int32 K2Node_CustomEvent_tileIndex_1, class AValeriaCharacter* K2Node_CustomEvent_actorInstigator, int32 K2Node_CustomEvent_tileIndex, class AValeriaCharacter* K2Node_CustomEvent_Character, float CallFunc_PlayAnimMontage_ReturnValue, class UGardenPlantingComponent* CallFunc_GetGardenPlanting_ReturnValue, bool CallFunc_IsServer_ReturnValue, bool CallFunc_IsServer_ReturnValue_1, bool CallFunc_IsServer_ReturnValue_2);
	void OnFertilizerAdded_Event(class AValeriaCharacter* ActorInstigator, int32 TileIndex);
	void OnFertilizerAdded_Multicast(class AActor* Param_Instigator);
	void OnLootGathered_Event(class AValeriaCharacter* ActorInstigator, int32 TileIndex);
	void OnLootGathered_Multicast(class AActor* Actor);
	void OnLootUncovered_Event(class AValeriaCharacter* ActorInstigator, int32 TileIndex);
	void OnLootUncovered_Multicast(class AActor* Param_Instigator);
	void OnSeeded_Event(class AValeriaCharacter* ActorInstigator, int32 TileIndex);
	void OnSeeded_Multicast(class AValeriaCharacter* ActorInstigator, int32 TileIndex);
	void OnTilled_Event(class AValeriaCharacter* ActorInstigator, int32 TileIndex);
	void OnTilled_Multicast(class AActor* Param_Instigator);
	void OnWaterAdded(class AValeriaCharacter* ActorInstigator, int32 TileIndex, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable, TArray<struct FAkExternalSourceInfo>& Temp_struct_Variable, float CallFunc_GetWateredPercent_ReturnValue, const struct FVector& CallFunc_GetTileWorldLocation_ReturnValue, bool CallFunc_IsWatered_ReturnValue, class UAkComponent* CallFunc_SpawnAkComponentAtLocation_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_PostAkEvent_ReturnValue, bool CallFunc_IsPlanted_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void OnWaterAdded_Event(class AValeriaCharacter* ActorInstigator, int32 TileIndex);
	void OnWaterAdded_Multicast(class AValeriaCharacter* ActorInstigator, int32 TileIndex);
	void OnWatered_Event(class AValeriaCharacter* ActorInstigator, int32 TileIndex);
	void OnWateredEvent_Multicast(class AActor* Param_Instigator);
	void OnWeedRemoved_Event(class AValeriaCharacter* ActorInstigator, int32 TileIndex);
	void OnWeedRemoved_Multicast(class AActor* Param_Instigator);
	void PlotPickupSFX();
	void PlotSpawnSFX();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void Set_Visibility_Harvesting_FTUE(bool Visibility);
	void Set_Visibility_Watering_FTUE(bool Visibility);
	void TL_plotSpawn__FinishedFunc();
	void TL_plotSpawn__UpdateFunc();
	void TL_plotSpawn__vfx_burst__EventFunc();
	void WeedRemovalAnimation(class AValeriaCharacter* Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Garden3x3_C">();
	}
	static class ABP_Garden3x3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Garden3x3_C>();
	}
};
static_assert(alignof(ABP_Garden3x3_C) == 0x000008, "Wrong alignment on ABP_Garden3x3_C");
static_assert(sizeof(ABP_Garden3x3_C) == 0x0003B0, "Wrong size on ABP_Garden3x3_C");
static_assert(offsetof(ABP_Garden3x3_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_Garden3x3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, NS_FireFlies) == 0x0002B0, "Member 'ABP_Garden3x3_C::NS_FireFlies' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, PlacementCollision) == 0x0002B8, "Member 'ABP_Garden3x3_C::PlacementCollision' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, WBP_HarvestingFTUE) == 0x0002C0, "Member 'ABP_Garden3x3_C::WBP_HarvestingFTUE' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, WBP_WateringFTUE) == 0x0002C8, "Member 'ABP_Garden3x3_C::WBP_WateringFTUE' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, S_Plot_Big_Placement) == 0x0002D0, "Member 'ABP_Garden3x3_C::S_Plot_Big_Placement' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Interactable) == 0x0002D8, "Member 'ABP_Garden3x3_C::Interactable' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, S_Plot_Big) == 0x0002E0, "Member 'ABP_Garden3x3_C::S_Plot_Big' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Decal_Plot) == 0x0002E8, "Member 'ABP_Garden3x3_C::Decal_Plot' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Plot_root) == 0x0002F0, "Member 'ABP_Garden3x3_C::Plot_root' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, NS_plotSpawnDraw02) == 0x0002F8, "Member 'ABP_Garden3x3_C::NS_plotSpawnDraw02' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, NS_plotSpawnDraw01) == 0x000300, "Member 'ABP_Garden3x3_C::NS_plotSpawnDraw01' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Spawn_spinRoot) == 0x000308, "Member 'ABP_Garden3x3_C::Spawn_spinRoot' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Vfx_root) == 0x000310, "Member 'ABP_Garden3x3_C::Vfx_root' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, GrassMask) == 0x000318, "Member 'ABP_Garden3x3_C::GrassMask' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, SM_border) == 0x000320, "Member 'ABP_Garden3x3_C::SM_border' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, SelectitemHitbox) == 0x000328, "Member 'ABP_Garden3x3_C::SelectitemHitbox' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Gatherable) == 0x000330, "Member 'ABP_Garden3x3_C::Gatherable' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Persist) == 0x000338, "Member 'ABP_Garden3x3_C::Persist' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Garden) == 0x000340, "Member 'ABP_Garden3x3_C::Garden' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, DefaultSceneRoot) == 0x000348, "Member 'ABP_Garden3x3_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, TL_plotSpawn_spin_11982493419DAE7B483383BEB84C563B) == 0x000350, "Member 'ABP_Garden3x3_C::TL_plotSpawn_spin_11982493419DAE7B483383BEB84C563B' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, TL_plotSpawn_growth_11982493419DAE7B483383BEB84C563B) == 0x000354, "Member 'ABP_Garden3x3_C::TL_plotSpawn_growth_11982493419DAE7B483383BEB84C563B' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, TL_plotSpawn_size_11982493419DAE7B483383BEB84C563B) == 0x000358, "Member 'ABP_Garden3x3_C::TL_plotSpawn_size_11982493419DAE7B483383BEB84C563B' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, TL_plotSpawn_drop_11982493419DAE7B483383BEB84C563B) == 0x00035C, "Member 'ABP_Garden3x3_C::TL_plotSpawn_drop_11982493419DAE7B483383BEB84C563B' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, TL_plotSpawn__Direction_11982493419DAE7B483383BEB84C563B) == 0x000360, "Member 'ABP_Garden3x3_C::TL_plotSpawn__Direction_11982493419DAE7B483383BEB84C563B' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, TL_plotSpawn) == 0x000368, "Member 'ABP_Garden3x3_C::TL_plotSpawn' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Debug) == 0x000370, "Member 'ABP_Garden3x3_C::Debug' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Time_appearStart) == 0x000378, "Member 'ABP_Garden3x3_C::Time_appearStart' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Time_appearFull) == 0x000380, "Member 'ABP_Garden3x3_C::Time_appearFull' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Time_disappearStart) == 0x000388, "Member 'ABP_Garden3x3_C::Time_disappearStart' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, Time_disappearGone) == 0x000390, "Member 'ABP_Garden3x3_C::Time_disappearGone' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, MI_plotDecal) == 0x000398, "Member 'ABP_Garden3x3_C::MI_plotDecal' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, PlotSpawnSound) == 0x0003A0, "Member 'ABP_Garden3x3_C::PlotSpawnSound' has a wrong offset!");
static_assert(offsetof(ABP_Garden3x3_C, PlotPickupSound) == 0x0003A8, "Member 'ABP_Garden3x3_C::PlotPickupSound' has a wrong offset!");

}

