#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GardenTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BP_GardenTile.BP_GardenTile_C.BeginSeedingSFX
// 0x0008 (0x0008 - 0x0000)
struct BP_GardenTile_C_BeginSeedingSFX final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GardenTile_C_BeginSeedingSFX) == 0x000008, "Wrong alignment on BP_GardenTile_C_BeginSeedingSFX");
static_assert(sizeof(BP_GardenTile_C_BeginSeedingSFX) == 0x000008, "Wrong size on BP_GardenTile_C_BeginSeedingSFX");
static_assert(offsetof(BP_GardenTile_C_BeginSeedingSFX, Param_Instigator) == 0x000000, "Member 'BP_GardenTile_C_BeginSeedingSFX::Param_Instigator' has a wrong offset!");

// Function BP_GardenTile.BP_GardenTile_C.CanBuffPlateBeVisible
// 0x0006 (0x0006 - 0x0000)
struct BP_GardenTile_C_CanBuffPlateBeVisible final
{
public:
	bool                                          PlateVisible;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlanted_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlantMaster_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidGardenData_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GardenTile_C_CanBuffPlateBeVisible) == 0x000001, "Wrong alignment on BP_GardenTile_C_CanBuffPlateBeVisible");
static_assert(sizeof(BP_GardenTile_C_CanBuffPlateBeVisible) == 0x000006, "Wrong size on BP_GardenTile_C_CanBuffPlateBeVisible");
static_assert(offsetof(BP_GardenTile_C_CanBuffPlateBeVisible, PlateVisible) == 0x000000, "Member 'BP_GardenTile_C_CanBuffPlateBeVisible::PlateVisible' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_CanBuffPlateBeVisible, CallFunc_IsPlanted_ReturnValue) == 0x000001, "Member 'BP_GardenTile_C_CanBuffPlateBeVisible::CallFunc_IsPlanted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_CanBuffPlateBeVisible, CallFunc_IsPlantMaster_ReturnValue) == 0x000002, "Member 'BP_GardenTile_C_CanBuffPlateBeVisible::CallFunc_IsPlantMaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_CanBuffPlateBeVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_GardenTile_C_CanBuffPlateBeVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_CanBuffPlateBeVisible, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'BP_GardenTile_C_CanBuffPlateBeVisible::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_CanBuffPlateBeVisible, CallFunc_HasValidGardenData_ReturnValue) == 0x000005, "Member 'BP_GardenTile_C_CanBuffPlateBeVisible::CallFunc_HasValidGardenData_ReturnValue' has a wrong offset!");

// Function BP_GardenTile.BP_GardenTile_C.Check and Set Plate Offset
// 0x0158 (0x0158 - 0x0000)
struct BP_GardenTile_C_Check_and_Set_Plate_Offset final
{
public:
	struct FVector2D                              CallFunc_GetPlantCenter_OutLocation;               // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0070(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_GardenTile_C_Check_and_Set_Plate_Offset) == 0x000008, "Wrong alignment on BP_GardenTile_C_Check_and_Set_Plate_Offset");
static_assert(sizeof(BP_GardenTile_C_Check_and_Set_Plate_Offset) == 0x000158, "Wrong size on BP_GardenTile_C_Check_and_Set_Plate_Offset");
static_assert(offsetof(BP_GardenTile_C_Check_and_Set_Plate_Offset, CallFunc_GetPlantCenter_OutLocation) == 0x000000, "Member 'BP_GardenTile_C_Check_and_Set_Plate_Offset::CallFunc_GetPlantCenter_OutLocation' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_Check_and_Set_Plate_Offset, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BP_GardenTile_C_Check_and_Set_Plate_Offset::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_Check_and_Set_Plate_Offset, CallFunc_BreakVector2D_X) == 0x000028, "Member 'BP_GardenTile_C_Check_and_Set_Plate_Offset::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_Check_and_Set_Plate_Offset, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'BP_GardenTile_C_Check_and_Set_Plate_Offset::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_Check_and_Set_Plate_Offset, CallFunc_BreakVector_X) == 0x000038, "Member 'BP_GardenTile_C_Check_and_Set_Plate_Offset::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_Check_and_Set_Plate_Offset, CallFunc_BreakVector_Y) == 0x000040, "Member 'BP_GardenTile_C_Check_and_Set_Plate_Offset::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_Check_and_Set_Plate_Offset, CallFunc_BreakVector_Z) == 0x000048, "Member 'BP_GardenTile_C_Check_and_Set_Plate_Offset::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_Check_and_Set_Plate_Offset, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_GardenTile_C_Check_and_Set_Plate_Offset::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_Check_and_Set_Plate_Offset, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_GardenTile_C_Check_and_Set_Plate_Offset::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_Check_and_Set_Plate_Offset, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000070, "Member 'BP_GardenTile_C_Check_and_Set_Plate_Offset::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_GardenTile.BP_GardenTile_C.Client_HandleHealthChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_GardenTile_C_Client_HandleHealthChanged final
{
public:
	class AActor*                                 InstigatingPlayer;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         HealthChange;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewHealth;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GardenTile_C_Client_HandleHealthChanged) == 0x000008, "Wrong alignment on BP_GardenTile_C_Client_HandleHealthChanged");
static_assert(sizeof(BP_GardenTile_C_Client_HandleHealthChanged) == 0x000010, "Wrong size on BP_GardenTile_C_Client_HandleHealthChanged");
static_assert(offsetof(BP_GardenTile_C_Client_HandleHealthChanged, InstigatingPlayer) == 0x000000, "Member 'BP_GardenTile_C_Client_HandleHealthChanged::InstigatingPlayer' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_Client_HandleHealthChanged, HealthChange) == 0x000008, "Member 'BP_GardenTile_C_Client_HandleHealthChanged::HealthChange' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_Client_HandleHealthChanged, NewHealth) == 0x00000C, "Member 'BP_GardenTile_C_Client_HandleHealthChanged::NewHealth' has a wrong offset!");

// Function BP_GardenTile.BP_GardenTile_C.DebugTick
// 0x0010 (0x0010 - 0x0000)
struct BP_GardenTile_C_DebugTick final
{
public:
	double                                        ChildZOffset;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasChanged;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BuildIsShipping_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GardenTile_C_DebugTick) == 0x000008, "Wrong alignment on BP_GardenTile_C_DebugTick");
static_assert(sizeof(BP_GardenTile_C_DebugTick) == 0x000010, "Wrong size on BP_GardenTile_C_DebugTick");
static_assert(offsetof(BP_GardenTile_C_DebugTick, ChildZOffset) == 0x000000, "Member 'BP_GardenTile_C_DebugTick::ChildZOffset' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_DebugTick, WasChanged) == 0x000008, "Member 'BP_GardenTile_C_DebugTick::WasChanged' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_DebugTick, CallFunc_BuildIsShipping_ReturnValue) == 0x000009, "Member 'BP_GardenTile_C_DebugTick::CallFunc_BuildIsShipping_ReturnValue' has a wrong offset!");

// Function BP_GardenTile.BP_GardenTile_C.event_plotSelection_changeState
// 0x0001 (0x0001 - 0x0000)
struct BP_GardenTile_C_Event_plotSelection_changeState final
{
public:
	EPlantingState                                PlantState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GardenTile_C_Event_plotSelection_changeState) == 0x000001, "Wrong alignment on BP_GardenTile_C_Event_plotSelection_changeState");
static_assert(sizeof(BP_GardenTile_C_Event_plotSelection_changeState) == 0x000001, "Wrong size on BP_GardenTile_C_Event_plotSelection_changeState");
static_assert(offsetof(BP_GardenTile_C_Event_plotSelection_changeState, PlantState) == 0x000000, "Member 'BP_GardenTile_C_Event_plotSelection_changeState::PlantState' has a wrong offset!");

// Function BP_GardenTile.BP_GardenTile_C.EventOnFullyWatered
// 0x0008 (0x0008 - 0x0000)
struct BP_GardenTile_C_EventOnFullyWatered final
{
public:
	class AGardenTile*                            GardenTile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GardenTile_C_EventOnFullyWatered) == 0x000008, "Wrong alignment on BP_GardenTile_C_EventOnFullyWatered");
static_assert(sizeof(BP_GardenTile_C_EventOnFullyWatered) == 0x000008, "Wrong size on BP_GardenTile_C_EventOnFullyWatered");
static_assert(offsetof(BP_GardenTile_C_EventOnFullyWatered, GardenTile) == 0x000000, "Member 'BP_GardenTile_C_EventOnFullyWatered::GardenTile' has a wrong offset!");

// Function BP_GardenTile.BP_GardenTile_C.EventOnWaterChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_GardenTile_C_EventOnWaterChanged final
{
public:
	class AGardenTile*                            GardenTile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GardenTile_C_EventOnWaterChanged) == 0x000008, "Wrong alignment on BP_GardenTile_C_EventOnWaterChanged");
static_assert(sizeof(BP_GardenTile_C_EventOnWaterChanged) == 0x000008, "Wrong size on BP_GardenTile_C_EventOnWaterChanged");
static_assert(offsetof(BP_GardenTile_C_EventOnWaterChanged, GardenTile) == 0x000000, "Member 'BP_GardenTile_C_EventOnWaterChanged::GardenTile' has a wrong offset!");

// Function BP_GardenTile.BP_GardenTile_C.ExecuteUbergraph_BP_GardenTile
// 0x05D8 (0x05D8 - 0x0000)
struct BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51A9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class AValeriaCharacter*                K2Node_Event_actor_1;                              // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UVAL_ItemTypeDefinitionAsset*     K2Node_Event_SeedItemType_1;                       // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_2;        // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class AValeriaCharacter*                K2Node_Event_actor;                                // 0x01A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UVAL_ItemTypeDefinitionAsset*     K2Node_Event_FertilizedItemType_1;                 // 0x01B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AA[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin_1;              // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_1;           // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_1;        // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AB[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AC[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_3;        // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlantingState                                K2Node_CustomEvent_NewState;                       // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AD[0x5];                                     // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_instigator;                     // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPlantingState                                K2Node_CustomEvent_plantState;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AE[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventActor_ReturnValue;                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsAvailable;                    // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51AF[0x2];                                     // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventActor_ReturnValue_1;               // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventActor_ReturnValue_2;               // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTilling_ReturnValue;                // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x029E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B0[0x1];                                     // 0x029F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWateredPercent_ReturnValue;            // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B1[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_4;        // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidGardenData_ReturnValue;           // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B2[0x2];                                     // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMinigameState                                K2Node_CustomEvent_state;                          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B3[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVAL_ItemTypeDefinitionAsset*     K2Node_Event_FertilizedItemType;                   // 0x02C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UVAL_ItemTypeDefinitionAsset*     K2Node_Event_SeedItemType;                         // 0x02C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGardenTile*                            K2Node_CustomEvent_gardenTile_1;                   // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_ItemTypeDefinitionAsset* PlantItemType, bool OutRepeatHarvest)> K2Node_CreateDelegate_OutputDelegate;              // 0x02D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGardenTile* GardenTile)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UVAL_ItemTypeDefinitionAsset*     K2Node_Event_PlantItemType;                        // 0x02F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_RepeatHarvest;                        // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B4[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0308(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0358(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0368(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0390(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGardenTile*                            K2Node_CustomEvent_gardenTile;                     // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayPersistSoundLoop_ReturnValue;         // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B5[0x4];                                     // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVAL_ItemTypeDefinitionAsset*     K2Node_CustomEvent_PlantItemType;                  // 0x03B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_outRepeatHarvest;               // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B6[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x03C8(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B7[0x7];                                     // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0420(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0430(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class AGardenTile* GardenTile)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0458(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B8[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin_2;              // 0x0470(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_2;           // 0x0488(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_2;        // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadyToHarvest_ReturnValue;             // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B9[0x2];                                     // 0x04A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x04A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x04B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InstigatingPlayer;                    // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_HealthChange;                         // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewHealth;                            // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BA[0x7];                                     // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent;              // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID;               // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BB[0x4];                                     // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVitalsChangeContext                   K2Node_MakeStruct_VitalsChangeContext;             // 0x04E8(0x0030)()
	TDelegate<void(EMinigameState State)>         K2Node_CreateDelegate_OutputDelegate_5;            // 0x0518(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0528(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GardenPlotActor_WeedStatusPlate_C* K2Node_DynamicCast_AsWBP_Garden_Plot_Actor_Weed_Status_Plate; // 0x0530(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BC[0x3];                                     // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPlantingState NewState)>      K2Node_CreateDelegate_OutputDelegate_6;            // 0x053C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BD[0x3];                                     // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       CallFunc_GetVitals_ReturnValue;                    // 0x0558(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVital_ReturnValue;                     // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVitalsChange                          K2Node_MakeStruct_VitalsChange;                    // 0x0568(0x0040)()
	int32                                         CallFunc_GetVital_ReturnValue_1;                   // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryVitalChange_ReturnValue;               // 0x05AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x05AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x05AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x05AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_3;                   // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51BE[0x7];                                     // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateMaterialInstanceValue_ParamValue_ImplicitCast; // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateMaterialInstanceValue_ParamValue_ImplicitCast_1; // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ManageHiddenLoot_DeltaTime_ImplicitCast;  // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateMaterialInstanceValue_ParamValue_ImplicitCast_2; // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile) == 0x000008, "Wrong alignment on BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile");
static_assert(sizeof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile) == 0x0005D8, "Wrong size on BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, EntryPoint) == 0x000000, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000020, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_actor_1) == 0x000028, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_SeedItemType_1) == 0x000030, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_SeedItemType_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x000038, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_BreakVector_X) == 0x000058, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_BreakVector_Y) == 0x000060, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_BreakVector_Z) == 0x000068, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000070, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_BreakVector_X_1) == 0x000088, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_BreakVector_Y_1) == 0x000090, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_BreakVector_Z_1) == 0x000098, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_MakeVector_ReturnValue) == 0x0000A0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000B8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_SpawnSystemAttached_ReturnValue_2) == 0x0001A0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_SpawnSystemAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_actor) == 0x0001A8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_FertilizedItemType_1) == 0x0001B0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_FertilizedItemType_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0001B8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetComponentBounds_Origin) == 0x0001D0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetComponentBounds_BoxExtent) == 0x0001E8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetComponentBounds_SphereRadius) == 0x000200, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000208, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000210, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetComponentBounds_Origin_1) == 0x000228, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetComponentBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetComponentBounds_BoxExtent_1) == 0x000240, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetComponentBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetComponentBounds_SphereRadius_1) == 0x000258, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetComponentBounds_SphereRadius_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000260, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_IsValid_ReturnValue) == 0x000268, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_SpawnSystemAttached_ReturnValue_3) == 0x000270, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_SpawnSystemAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_IsValid_ReturnValue_1) == 0x000278, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CustomEvent_NewState) == 0x000279, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_SetStaticMesh_ReturnValue) == 0x00027A, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CustomEvent_instigator) == 0x000280, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CustomEvent_instigator' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CustomEvent_plantState) == 0x000288, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CustomEvent_plantState' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_AkEventActor_ReturnValue) == 0x00028C, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_AkEventActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_SwitchEnum_CmpSuccess) == 0x000290, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CustomEvent_IsAvailable) == 0x000291, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CustomEvent_IsAvailable' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_AkEventActor_ReturnValue_1) == 0x000294, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_AkEventActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_AkEventActor_ReturnValue_2) == 0x000298, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_AkEventActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_HasAnyTilling_ReturnValue) == 0x00029C, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_HasAnyTilling_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_Not_PreBool_ReturnValue) == 0x00029D, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_BooleanAND_ReturnValue) == 0x00029E, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetWateredPercent_ReturnValue) == 0x0002A0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetWateredPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_SpawnSystemAttached_ReturnValue_4) == 0x0002A8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_SpawnSystemAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_HasValidGardenData_ReturnValue) == 0x0002B0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_HasValidGardenData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_SetStaticMesh_ReturnValue_1) == 0x0002B1, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_DeltaSeconds) == 0x0002B4, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CustomEvent_state) == 0x0002B8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CustomEvent_state' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_FertilizedItemType) == 0x0002C0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_FertilizedItemType' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_SeedItemType) == 0x0002C8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_SeedItemType' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CustomEvent_gardenTile_1) == 0x0002D0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CustomEvent_gardenTile_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CreateDelegate_OutputDelegate) == 0x0002D8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002E8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_PlantItemType) == 0x0002F8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_PlantItemType' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_RepeatHarvest) == 0x000300, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_RepeatHarvest' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_MakeStruct_FormatArgumentData) == 0x000308, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_MakeArray_Array) == 0x000358, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_Format_ReturnValue) == 0x000368, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_Conv_TextToString_ReturnValue) == 0x000380, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CreateDelegate_OutputDelegate_2) == 0x000390, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0003A0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CustomEvent_gardenTile) == 0x0003A8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CustomEvent_gardenTile' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_PlayPersistSoundLoop_ReturnValue) == 0x0003B0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_PlayPersistSoundLoop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CustomEvent_PlantItemType) == 0x0003B8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CustomEvent_PlantItemType' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CustomEvent_outRepeatHarvest) == 0x0003C0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CustomEvent_outRepeatHarvest' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_MakeStruct_FormatArgumentData_1) == 0x0003C8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_Not_PreBool_ReturnValue_1) == 0x000418, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_MakeArray_Array_1) == 0x000420, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_Format_ReturnValue_1) == 0x000430, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000448, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CreateDelegate_OutputDelegate_3) == 0x000458, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_IsValid_ReturnValue_2) == 0x000468, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetComponentBounds_Origin_2) == 0x000470, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetComponentBounds_Origin_2' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetComponentBounds_BoxExtent_2) == 0x000488, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetComponentBounds_BoxExtent_2' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetComponentBounds_SphereRadius_2) == 0x0004A0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetComponentBounds_SphereRadius_2' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_IsReadyToHarvest_ReturnValue) == 0x0004A4, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_IsReadyToHarvest_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_BooleanAND_ReturnValue_1) == 0x0004A5, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CreateDelegate_OutputDelegate_4) == 0x0004A8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0004B8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_InstigatingPlayer) == 0x0004C0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_InstigatingPlayer' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_HealthChange) == 0x0004C8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_HealthChange' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_Event_NewHealth) == 0x0004CC, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_Event_NewHealth' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_Less_IntInt_ReturnValue) == 0x0004D0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_AkEventLocation_AkComponent) == 0x0004D8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_AkEventLocation_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_AkEventLocation_Playing_ID) == 0x0004E0, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_AkEventLocation_Playing_ID' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_MakeStruct_VitalsChangeContext) == 0x0004E8, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_MakeStruct_VitalsChangeContext' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CreateDelegate_OutputDelegate_5) == 0x000518, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000528, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_DynamicCast_AsWBP_Garden_Plot_Actor_Weed_Status_Plate) == 0x000530, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_DynamicCast_AsWBP_Garden_Plot_Actor_Weed_Status_Plate' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_DynamicCast_bSuccess) == 0x000538, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, K2Node_CreateDelegate_OutputDelegate_6) == 0x00053C, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_IsServer_ReturnValue) == 0x00054C, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000550, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile, CallFunc_GetVitals_ReturnValue) == 0x000558, "Member 'BP_GardenTile_C_ExecuteUbergraph_BP_GardenTile::CallFunc_GetVitals_ReturnValue' has a wrong offset!");
