#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Glider_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Glider_Base.BP_Glider_Base_C
// 0x0010 (0x02D0 - 0x02C0)
class ABP_Glider_Base_C final : public AVAL_GliderBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         GliderTrail_limit;                                 // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_glideTrailVFX;                                 // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Glider_Base(int32 EntryPoint);
	void InitParticles(bool CallFunc_IsServer_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void ReceiveBeginPlay();
	void Set_Show_Glider_Trail_VFX(bool ShowGliderTrail);
	void ShowDebugTrails(bool bShowDebugTrails);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Glider_Base_C">();
	}
	static class ABP_Glider_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Glider_Base_C>();
	}
};
static_assert(alignof(ABP_Glider_Base_C) == 0x000008, "Wrong alignment on ABP_Glider_Base_C");
static_assert(sizeof(ABP_Glider_Base_C) == 0x0002D0, "Wrong size on ABP_Glider_Base_C");
static_assert(offsetof(ABP_Glider_Base_C, UberGraphFrame) == 0x0002C0, "Member 'ABP_Glider_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Glider_Base_C, GliderTrail_limit) == 0x0002C8, "Member 'ABP_Glider_Base_C::GliderTrail_limit' has a wrong offset!");
static_assert(offsetof(ABP_Glider_Base_C, Add_glideTrailVFX) == 0x0002CC, "Member 'ABP_Glider_Base_C::Add_glideTrailVFX' has a wrong offset!");

}

