#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Garden_FullPlot

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BP_Garden_FullPlot.BP_Garden_FullPlot_C.ExecuteUbergraph_BP_Garden_FullPlot
// 0x0128 (0x0128 - 0x0000)
struct BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BE0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGardenTile* GardenTile)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_ItemTypeDefinitionAsset* PlantItemType, bool OutRepeatHarvest)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGardenTile*                            K2Node_CustomEvent_gardenTile_2;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetGardenPatchOwner_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Garden3x3_C*                        K2Node_DynamicCast_AsBP_Garden_3x_3;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_Client_GetFirstPlayerController_OutResult; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BE1[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_Client_GetFirstPlayerController_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BE2[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGardenPlantingComponent*               CallFunc_GetGardenPlanting_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGardenTile*                            K2Node_CustomEvent_gardenTile_1;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BE3[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetGardenPatchOwner_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Garden3x3_C*                        K2Node_DynamicCast_AsBP_Garden_3x_3_1;             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BE4[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGardenTile*                            K2Node_CustomEvent_gardenTile;                     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGardenTile* GardenTile)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetGardenPatchOwner_ReturnValue_2;        // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Garden3x3_C*                        K2Node_DynamicCast_AsBP_Garden_3x_3_2;             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWatered_ReturnValue;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BE5[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVAL_ItemTypeDefinitionAsset*     K2Node_CustomEvent_PlantItemType;                  // 0x00D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_outRepeatHarvest;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BE6[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_2; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue_1;    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BE7[0x6];                                     // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_3; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGardenTile* GardenTile)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot) == 0x000008, "Wrong alignment on BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot");
static_assert(sizeof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot) == 0x000128, "Wrong size on BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, EntryPoint) == 0x000000, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000010, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_CustomEvent_gardenTile_2) == 0x000038, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_CustomEvent_gardenTile_2' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetGardenPatchOwner_ReturnValue) == 0x000040, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetGardenPatchOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_DynamicCast_AsBP_Garden_3x_3) == 0x000048, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_DynamicCast_AsBP_Garden_3x_3' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_Client_GetFirstPlayerController_OutResult) == 0x000051, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_Client_GetFirstPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_Client_GetFirstPlayerController_ReturnValue) == 0x000058, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_Client_GetFirstPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000060, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetGardenPlanting_ReturnValue) == 0x000070, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetGardenPlanting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_CustomEvent_gardenTile_1) == 0x000078, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_CustomEvent_gardenTile_1' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_IsDedicatedServer_ReturnValue) == 0x000080, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetGardenPatchOwner_ReturnValue_1) == 0x000088, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetGardenPatchOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_DynamicCast_AsBP_Garden_3x_3_1) == 0x000090, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_DynamicCast_AsBP_Garden_3x_3_1' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_CustomEvent_gardenTile) == 0x0000A0, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_CustomEvent_gardenTile' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetGardenPatchOwner_ReturnValue_2) == 0x0000B8, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetGardenPatchOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_DynamicCast_AsBP_Garden_3x_3_2) == 0x0000C0, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_DynamicCast_AsBP_Garden_3x_3_2' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_IsWatered_ReturnValue) == 0x0000C9, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_IsWatered_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_CustomEvent_PlantItemType) == 0x0000D0, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_CustomEvent_PlantItemType' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_CustomEvent_outRepeatHarvest) == 0x0000D8, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_CustomEvent_outRepeatHarvest' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000E0, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000E8, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1) == 0x0000F0, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_2) == 0x0000F8, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_CanStartTutorialForFlag_ReturnValue) == 0x000100, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_CanStartTutorialForFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_CanStartTutorialForFlag_ReturnValue_1) == 0x000101, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_CanStartTutorialForFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetPlayerController_ReturnValue_3) == 0x000108, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_3) == 0x000110, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot, K2Node_CreateDelegate_OutputDelegate_3) == 0x000118, "Member 'BP_Garden_FullPlot_C_ExecuteUbergraph_BP_Garden_FullPlot::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function BP_Garden_FullPlot.BP_Garden_FullPlot_C.On Harvested
// 0x0010 (0x0010 - 0x0000)
struct BP_Garden_FullPlot_C_On_Harvested final
{
public:
	const class UVAL_ItemTypeDefinitionAsset*     PlantItemType;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          OutRepeatHarvest;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden_FullPlot_C_On_Harvested) == 0x000008, "Wrong alignment on BP_Garden_FullPlot_C_On_Harvested");
static_assert(sizeof(BP_Garden_FullPlot_C_On_Harvested) == 0x000010, "Wrong size on BP_Garden_FullPlot_C_On_Harvested");
static_assert(offsetof(BP_Garden_FullPlot_C_On_Harvested, PlantItemType) == 0x000000, "Member 'BP_Garden_FullPlot_C_On_Harvested::PlantItemType' has a wrong offset!");
static_assert(offsetof(BP_Garden_FullPlot_C_On_Harvested, OutRepeatHarvest) == 0x000008, "Member 'BP_Garden_FullPlot_C_On_Harvested::OutRepeatHarvest' has a wrong offset!");

// Function BP_Garden_FullPlot.BP_Garden_FullPlot_C.OnHasHarvestablePlant
// 0x0008 (0x0008 - 0x0000)
struct BP_Garden_FullPlot_C_OnHasHarvestablePlant final
{
public:
	class AGardenTile*                            GardenTile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden_FullPlot_C_OnHasHarvestablePlant) == 0x000008, "Wrong alignment on BP_Garden_FullPlot_C_OnHasHarvestablePlant");
static_assert(sizeof(BP_Garden_FullPlot_C_OnHasHarvestablePlant) == 0x000008, "Wrong size on BP_Garden_FullPlot_C_OnHasHarvestablePlant");
static_assert(offsetof(BP_Garden_FullPlot_C_OnHasHarvestablePlant, GardenTile) == 0x000000, "Member 'BP_Garden_FullPlot_C_OnHasHarvestablePlant::GardenTile' has a wrong offset!");

// Function BP_Garden_FullPlot.BP_Garden_FullPlot_C.OnHasUnwateredPlant
// 0x0008 (0x0008 - 0x0000)
struct BP_Garden_FullPlot_C_OnHasUnwateredPlant final
{
public:
	class AGardenTile*                            GardenTile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden_FullPlot_C_OnHasUnwateredPlant) == 0x000008, "Wrong alignment on BP_Garden_FullPlot_C_OnHasUnwateredPlant");
static_assert(sizeof(BP_Garden_FullPlot_C_OnHasUnwateredPlant) == 0x000008, "Wrong size on BP_Garden_FullPlot_C_OnHasUnwateredPlant");
static_assert(offsetof(BP_Garden_FullPlot_C_OnHasUnwateredPlant, GardenTile) == 0x000000, "Member 'BP_Garden_FullPlot_C_OnHasUnwateredPlant::GardenTile' has a wrong offset!");

// Function BP_Garden_FullPlot.BP_Garden_FullPlot_C.OnWaterChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_Garden_FullPlot_C_OnWaterChanged final
{
public:
	class AGardenTile*                            GardenTile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden_FullPlot_C_OnWaterChanged) == 0x000008, "Wrong alignment on BP_Garden_FullPlot_C_OnWaterChanged");
static_assert(sizeof(BP_Garden_FullPlot_C_OnWaterChanged) == 0x000008, "Wrong size on BP_Garden_FullPlot_C_OnWaterChanged");
static_assert(offsetof(BP_Garden_FullPlot_C_OnWaterChanged, GardenTile) == 0x000000, "Member 'BP_Garden_FullPlot_C_OnWaterChanged::GardenTile' has a wrong offset!");

}

