#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Glider_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Glider_Base.BP_Glider_Base_C.ExecuteUbergraph_BP_Glider_Base
// 0x0004 (0x0004 - 0x0000)
struct BP_Glider_Base_C_ExecuteUbergraph_BP_Glider_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Glider_Base_C_ExecuteUbergraph_BP_Glider_Base) == 0x000004, "Wrong alignment on BP_Glider_Base_C_ExecuteUbergraph_BP_Glider_Base");
static_assert(sizeof(BP_Glider_Base_C_ExecuteUbergraph_BP_Glider_Base) == 0x000004, "Wrong size on BP_Glider_Base_C_ExecuteUbergraph_BP_Glider_Base");
static_assert(offsetof(BP_Glider_Base_C_ExecuteUbergraph_BP_Glider_Base, EntryPoint) == 0x000000, "Member 'BP_Glider_Base_C_ExecuteUbergraph_BP_Glider_Base::EntryPoint' has a wrong offset!");

// Function BP_Glider_Base.BP_Glider_Base_C.InitParticles
// 0x0002 (0x0002 - 0x0000)
struct BP_Glider_Base_C_InitParticles final
{
public:
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Glider_Base_C_InitParticles) == 0x000001, "Wrong alignment on BP_Glider_Base_C_InitParticles");
static_assert(sizeof(BP_Glider_Base_C_InitParticles) == 0x000002, "Wrong size on BP_Glider_Base_C_InitParticles");
static_assert(offsetof(BP_Glider_Base_C_InitParticles, CallFunc_IsServer_ReturnValue) == 0x000000, "Member 'BP_Glider_Base_C_InitParticles::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Glider_Base_C_InitParticles, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_Glider_Base_C_InitParticles::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_Glider_Base.BP_Glider_Base_C.Set Show Glider Trail VFX
// 0x0001 (0x0001 - 0x0000)
struct BP_Glider_Base_C_Set_Show_Glider_Trail_VFX final
{
public:
	bool                                          ShowGliderTrail;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Glider_Base_C_Set_Show_Glider_Trail_VFX) == 0x000001, "Wrong alignment on BP_Glider_Base_C_Set_Show_Glider_Trail_VFX");
static_assert(sizeof(BP_Glider_Base_C_Set_Show_Glider_Trail_VFX) == 0x000001, "Wrong size on BP_Glider_Base_C_Set_Show_Glider_Trail_VFX");
static_assert(offsetof(BP_Glider_Base_C_Set_Show_Glider_Trail_VFX, ShowGliderTrail) == 0x000000, "Member 'BP_Glider_Base_C_Set_Show_Glider_Trail_VFX::ShowGliderTrail' has a wrong offset!");

// Function BP_Glider_Base.BP_Glider_Base_C.ShowDebugTrails
// 0x0001 (0x0001 - 0x0000)
struct BP_Glider_Base_C_ShowDebugTrails final
{
public:
	bool                                          bShowDebugTrails;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Glider_Base_C_ShowDebugTrails) == 0x000001, "Wrong alignment on BP_Glider_Base_C_ShowDebugTrails");
static_assert(sizeof(BP_Glider_Base_C_ShowDebugTrails) == 0x000001, "Wrong size on BP_Glider_Base_C_ShowDebugTrails");
static_assert(offsetof(BP_Glider_Base_C_ShowDebugTrails, bShowDebugTrails) == 0x000000, "Member 'BP_Glider_Base_C_ShowDebugTrails::bShowDebugTrails' has a wrong offset!");

}

