#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GliderScript_Basic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GliderScript_Basic.BP_GliderScript_Basic_C.ExecuteUbergraph_BP_GliderScript_Basic
// 0x0138 (0x0138 - 0x0000)
struct BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationComponent*   K2Node_Event_component_1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationItemBase*    K2Node_Event_Item;                                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FGuid>               K2Node_Event_VariantSelections;                    // 0x0018(0x0050)(ConstParm)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   K2Node_Event_component;                            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_InvalidateTimerHandle_ReturnValue;     // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF6[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF7[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AVAL_GliderBase*                  K2Node_CustomEvent_Glider_1;                       // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue_2; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class AVAL_GliderBase*                  K2Node_CustomEvent_Glider;                         // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue_3; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_GliderBase* Glider)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_GliderBase* Glider)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF8[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue_4; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue_5; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_GliderBase* Glider)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_GliderBase* Glider)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic) == 0x000008, "Wrong alignment on BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic");
static_assert(sizeof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic) == 0x000138, "Wrong size on BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, EntryPoint) == 0x000000, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, K2Node_Event_component_1) == 0x000008, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::K2Node_Event_component_1' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, K2Node_Event_Item) == 0x000010, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, K2Node_Event_VariantSelections) == 0x000018, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::K2Node_Event_VariantSelections' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_GetMovementComponent_ReturnValue) == 0x000068, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, K2Node_Event_component) == 0x000070, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::K2Node_Event_component' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_K2_InvalidateTimerHandle_ReturnValue) == 0x000078, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_K2_InvalidateTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_GetCharacterCustomizationComponent_ReturnValue) == 0x000080, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_GetCharacterCustomizationComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_GetCharacterCustomizationComponent_ReturnValue_1) == 0x000090, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_GetCharacterCustomizationComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, K2Node_CustomEvent_Glider_1) == 0x0000A0, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::K2Node_CustomEvent_Glider_1' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_GetCharacterCustomizationComponent_ReturnValue_2) == 0x0000A8, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_GetCharacterCustomizationComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, K2Node_CustomEvent_Glider) == 0x0000B0, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::K2Node_CustomEvent_Glider' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C8, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_GetCharacterCustomizationComponent_ReturnValue_3) == 0x0000D0, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_GetCharacterCustomizationComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E8, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0000F8, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x0000F9, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_GetCharacterCustomizationComponent_ReturnValue_4) == 0x000100, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_GetCharacterCustomizationComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_GetCharacterCustomizationComponent_ReturnValue_5) == 0x000108, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_GetCharacterCustomizationComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, K2Node_CreateDelegate_OutputDelegate_3) == 0x000110, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, K2Node_CreateDelegate_OutputDelegate_4) == 0x000120, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic, CallFunc_IsServer_ReturnValue) == 0x000130, "Member 'BP_GliderScript_Basic_C_ExecuteUbergraph_BP_GliderScript_Basic::CallFunc_IsServer_ReturnValue' has a wrong offset!");

// Function BP_GliderScript_Basic.BP_GliderScript_Basic_C.GliderRemoved
// 0x0008 (0x0008 - 0x0000)
struct BP_GliderScript_Basic_C_GliderRemoved final
{
public:
	const class AVAL_GliderBase*                  Glider;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GliderScript_Basic_C_GliderRemoved) == 0x000008, "Wrong alignment on BP_GliderScript_Basic_C_GliderRemoved");
static_assert(sizeof(BP_GliderScript_Basic_C_GliderRemoved) == 0x000008, "Wrong size on BP_GliderScript_Basic_C_GliderRemoved");
static_assert(offsetof(BP_GliderScript_Basic_C_GliderRemoved, Glider) == 0x000000, "Member 'BP_GliderScript_Basic_C_GliderRemoved::Glider' has a wrong offset!");

// Function BP_GliderScript_Basic.BP_GliderScript_Basic_C.GliderSpawned
// 0x0008 (0x0008 - 0x0000)
struct BP_GliderScript_Basic_C_GliderSpawned final
{
public:
	const class AVAL_GliderBase*                  Glider;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GliderScript_Basic_C_GliderSpawned) == 0x000008, "Wrong alignment on BP_GliderScript_Basic_C_GliderSpawned");
static_assert(sizeof(BP_GliderScript_Basic_C_GliderSpawned) == 0x000008, "Wrong size on BP_GliderScript_Basic_C_GliderSpawned");
static_assert(offsetof(BP_GliderScript_Basic_C_GliderSpawned, Glider) == 0x000000, "Member 'BP_GliderScript_Basic_C_GliderSpawned::Glider' has a wrong offset!");

// Function BP_GliderScript_Basic.BP_GliderScript_Basic_C.OnApply
// 0x0060 (0x0060 - 0x0000)
struct BP_GliderScript_Basic_C_OnApply final
{
public:
	class UVAL_CharacterCustomizationComponent*   Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationItemBase*    Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FGuid>               VariantSelections;                                 // 0x0010(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_GliderScript_Basic_C_OnApply) == 0x000008, "Wrong alignment on BP_GliderScript_Basic_C_OnApply");
static_assert(sizeof(BP_GliderScript_Basic_C_OnApply) == 0x000060, "Wrong size on BP_GliderScript_Basic_C_OnApply");
static_assert(offsetof(BP_GliderScript_Basic_C_OnApply, Component) == 0x000000, "Member 'BP_GliderScript_Basic_C_OnApply::Component' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_OnApply, Item) == 0x000008, "Member 'BP_GliderScript_Basic_C_OnApply::Item' has a wrong offset!");
static_assert(offsetof(BP_GliderScript_Basic_C_OnApply, VariantSelections) == 0x000010, "Member 'BP_GliderScript_Basic_C_OnApply::VariantSelections' has a wrong offset!");

// Function BP_GliderScript_Basic.BP_GliderScript_Basic_C.OnUninitialize
// 0x0008 (0x0008 - 0x0000)
struct BP_GliderScript_Basic_C_OnUninitialize final
{
public:
	class UVAL_CharacterCustomizationComponent*   Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GliderScript_Basic_C_OnUninitialize) == 0x000008, "Wrong alignment on BP_GliderScript_Basic_C_OnUninitialize");
static_assert(sizeof(BP_GliderScript_Basic_C_OnUninitialize) == 0x000008, "Wrong size on BP_GliderScript_Basic_C_OnUninitialize");
static_assert(offsetof(BP_GliderScript_Basic_C_OnUninitialize, Component) == 0x000000, "Member 'BP_GliderScript_Basic_C_OnUninitialize::Component' has a wrong offset!");

}

