#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Garden3x3

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Garden3x3.BP_Garden3x3_C.ExecuteUbergraph_BP_Garden3x3
// 0x0340 (0x0340 - 0x0000)
struct BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0064(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3042[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0090(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3043[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3044[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetDecalMaterial_ReturnValue;             // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x01D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* ActorInstigator, int32 TileIndex)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x01E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventActor_ReturnValue;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3045[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent;              // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewlySpawned_ReturnValue;               // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3046[0x3];                                     // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class AValeriaCharacter*                K2Node_CustomEvent_actorInstigator_9;              // 0x0228(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_tileIndex_9;                    // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3047[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AValeriaCharacter*                K2Node_CustomEvent_actorInstigator_8;              // 0x0238(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_tileIndex_8;                    // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3048[0x4];                                     // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AValeriaCharacter*                K2Node_CustomEvent_actorInstigator_7;              // 0x0248(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_tileIndex_7;                    // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3049[0x4];                                     // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AValeriaCharacter*                K2Node_CustomEvent_actorInstigator_6;              // 0x0258(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_tileIndex_6;                    // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304A[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AValeriaCharacter*                K2Node_CustomEvent_actorInstigator_5;              // 0x0268(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_tileIndex_5;                    // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304B[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AValeriaCharacter*                K2Node_CustomEvent_actorInstigator_4;              // 0x0278(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_tileIndex_4;                    // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304C[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_instigator_4;                   // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_instigator_3;                   // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventActor_ReturnValue_1;               // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventActor_ReturnValue_2;               // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_actor;                          // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_instigator_2;                   // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventActor_ReturnValue_3;               // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventActor_ReturnValue_4;               // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_instigator_1;                   // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_instigator;                     // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304D[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventActor_ReturnValue_5;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventActor_ReturnValue_6;               // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304E[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AValeriaCharacter*                K2Node_CustomEvent_actorInstigator_3;              // 0x02E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_tileIndex_3;                    // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304F[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AValeriaCharacter*                K2Node_CustomEvent_actorInstigator_2;              // 0x02F0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_tileIndex_2;                    // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3050[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AValeriaCharacter*                K2Node_CustomEvent_actorInstigator_1;              // 0x0300(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_tileIndex_1;                    // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3051[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AValeriaCharacter*                K2Node_CustomEvent_actorInstigator;                // 0x0310(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_tileIndex;                      // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3052[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_CustomEvent_Character;                      // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3053[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGardenPlantingComponent*               CallFunc_GetGardenPlanting_ReturnValue;            // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3) == 0x000008, "Wrong alignment on BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3");
static_assert(sizeof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3) == 0x000340, "Wrong size on BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, EntryPoint) == 0x000000, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CreateDelegate_OutputDelegate_5) == 0x000054, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, Temp_name_Variable) == 0x000064, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_RandomFloatInRange_ReturnValue) == 0x000070, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_MakeVector_ReturnValue) == 0x000078, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000090, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_Event_EndPlayReason) == 0x000178, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000180, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_Event_DeltaSeconds) == 0x000198, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0001A0, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001A8, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_GetDecalMaterial_ReturnValue) == 0x0001C0, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_GetDecalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0001C8, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001D0, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001D8, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001E8, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001F8, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_AkEventActor_ReturnValue) == 0x000210, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_AkEventActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_AkEventLocation_AkComponent) == 0x000218, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_AkEventLocation_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_AkEventLocation_Playing_ID) == 0x000220, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_AkEventLocation_Playing_ID' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_IsNewlySpawned_ReturnValue) == 0x000224, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_IsNewlySpawned_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_actorInstigator_9) == 0x000228, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_actorInstigator_9' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_tileIndex_9) == 0x000230, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_tileIndex_9' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_actorInstigator_8) == 0x000238, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_actorInstigator_8' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_tileIndex_8) == 0x000240, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_tileIndex_8' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_actorInstigator_7) == 0x000248, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_actorInstigator_7' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_tileIndex_7) == 0x000250, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_tileIndex_7' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_actorInstigator_6) == 0x000258, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_actorInstigator_6' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_tileIndex_6) == 0x000260, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_tileIndex_6' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_actorInstigator_5) == 0x000268, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_actorInstigator_5' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_tileIndex_5) == 0x000270, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_tileIndex_5' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_actorInstigator_4) == 0x000278, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_actorInstigator_4' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_tileIndex_4) == 0x000280, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_tileIndex_4' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_instigator_4) == 0x000288, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_instigator_4' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_instigator_3) == 0x000290, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_instigator_3' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_AkEventActor_ReturnValue_1) == 0x000298, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_AkEventActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_AkEventActor_ReturnValue_2) == 0x00029C, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_AkEventActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_actor) == 0x0002A0, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_actor' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_instigator_2) == 0x0002A8, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_instigator_2' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_AkEventActor_ReturnValue_3) == 0x0002B0, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_AkEventActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_AkEventActor_ReturnValue_4) == 0x0002B4, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_AkEventActor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_instigator_1) == 0x0002B8, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_instigator_1' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_instigator) == 0x0002C0, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_instigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_DynamicCast_AsValeria_Character) == 0x0002C8, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_DynamicCast_bSuccess) == 0x0002D0, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_AkEventActor_ReturnValue_5) == 0x0002D4, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_AkEventActor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_AkEventActor_ReturnValue_6) == 0x0002D8, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_AkEventActor_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_actorInstigator_3) == 0x0002E0, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_actorInstigator_3' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_tileIndex_3) == 0x0002E8, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_tileIndex_3' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_actorInstigator_2) == 0x0002F0, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_actorInstigator_2' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_tileIndex_2) == 0x0002F8, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_tileIndex_2' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_actorInstigator_1) == 0x000300, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_actorInstigator_1' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_tileIndex_1) == 0x000308, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_tileIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_actorInstigator) == 0x000310, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_actorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_tileIndex) == 0x000318, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_tileIndex' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, K2Node_CustomEvent_Character) == 0x000320, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_PlayAnimMontage_ReturnValue) == 0x000328, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_GetGardenPlanting_ReturnValue) == 0x000330, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_GetGardenPlanting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_IsServer_ReturnValue) == 0x000338, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_IsServer_ReturnValue_1) == 0x000339, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3, CallFunc_IsServer_ReturnValue_2) == 0x00033A, "Member 'BP_Garden3x3_C_ExecuteUbergraph_BP_Garden3x3::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnFertilizerAdded_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Garden3x3_C_OnFertilizerAdded_Event final
{
public:
	const class AValeriaCharacter*                ActorInstigator;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TileIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnFertilizerAdded_Event) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnFertilizerAdded_Event");
static_assert(sizeof(BP_Garden3x3_C_OnFertilizerAdded_Event) == 0x000010, "Wrong size on BP_Garden3x3_C_OnFertilizerAdded_Event");
static_assert(offsetof(BP_Garden3x3_C_OnFertilizerAdded_Event, ActorInstigator) == 0x000000, "Member 'BP_Garden3x3_C_OnFertilizerAdded_Event::ActorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnFertilizerAdded_Event, TileIndex) == 0x000008, "Member 'BP_Garden3x3_C_OnFertilizerAdded_Event::TileIndex' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnFertilizerAdded_Multicast
// 0x0008 (0x0008 - 0x0000)
struct BP_Garden3x3_C_OnFertilizerAdded_Multicast final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnFertilizerAdded_Multicast) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnFertilizerAdded_Multicast");
static_assert(sizeof(BP_Garden3x3_C_OnFertilizerAdded_Multicast) == 0x000008, "Wrong size on BP_Garden3x3_C_OnFertilizerAdded_Multicast");
static_assert(offsetof(BP_Garden3x3_C_OnFertilizerAdded_Multicast, Param_Instigator) == 0x000000, "Member 'BP_Garden3x3_C_OnFertilizerAdded_Multicast::Param_Instigator' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnLootGathered_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Garden3x3_C_OnLootGathered_Event final
{
public:
	const class AValeriaCharacter*                ActorInstigator;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TileIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnLootGathered_Event) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnLootGathered_Event");
static_assert(sizeof(BP_Garden3x3_C_OnLootGathered_Event) == 0x000010, "Wrong size on BP_Garden3x3_C_OnLootGathered_Event");
static_assert(offsetof(BP_Garden3x3_C_OnLootGathered_Event, ActorInstigator) == 0x000000, "Member 'BP_Garden3x3_C_OnLootGathered_Event::ActorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnLootGathered_Event, TileIndex) == 0x000008, "Member 'BP_Garden3x3_C_OnLootGathered_Event::TileIndex' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnLootGathered_Multicast
// 0x0008 (0x0008 - 0x0000)
struct BP_Garden3x3_C_OnLootGathered_Multicast final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnLootGathered_Multicast) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnLootGathered_Multicast");
static_assert(sizeof(BP_Garden3x3_C_OnLootGathered_Multicast) == 0x000008, "Wrong size on BP_Garden3x3_C_OnLootGathered_Multicast");
static_assert(offsetof(BP_Garden3x3_C_OnLootGathered_Multicast, Actor) == 0x000000, "Member 'BP_Garden3x3_C_OnLootGathered_Multicast::Actor' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnLootUncovered_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Garden3x3_C_OnLootUncovered_Event final
{
public:
	const class AValeriaCharacter*                ActorInstigator;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TileIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnLootUncovered_Event) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnLootUncovered_Event");
static_assert(sizeof(BP_Garden3x3_C_OnLootUncovered_Event) == 0x000010, "Wrong size on BP_Garden3x3_C_OnLootUncovered_Event");
static_assert(offsetof(BP_Garden3x3_C_OnLootUncovered_Event, ActorInstigator) == 0x000000, "Member 'BP_Garden3x3_C_OnLootUncovered_Event::ActorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnLootUncovered_Event, TileIndex) == 0x000008, "Member 'BP_Garden3x3_C_OnLootUncovered_Event::TileIndex' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnLootUncovered_Multicast
// 0x0008 (0x0008 - 0x0000)
struct BP_Garden3x3_C_OnLootUncovered_Multicast final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnLootUncovered_Multicast) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnLootUncovered_Multicast");
static_assert(sizeof(BP_Garden3x3_C_OnLootUncovered_Multicast) == 0x000008, "Wrong size on BP_Garden3x3_C_OnLootUncovered_Multicast");
static_assert(offsetof(BP_Garden3x3_C_OnLootUncovered_Multicast, Param_Instigator) == 0x000000, "Member 'BP_Garden3x3_C_OnLootUncovered_Multicast::Param_Instigator' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnSeeded_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Garden3x3_C_OnSeeded_Event final
{
public:
	const class AValeriaCharacter*                ActorInstigator;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TileIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnSeeded_Event) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnSeeded_Event");
static_assert(sizeof(BP_Garden3x3_C_OnSeeded_Event) == 0x000010, "Wrong size on BP_Garden3x3_C_OnSeeded_Event");
static_assert(offsetof(BP_Garden3x3_C_OnSeeded_Event, ActorInstigator) == 0x000000, "Member 'BP_Garden3x3_C_OnSeeded_Event::ActorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnSeeded_Event, TileIndex) == 0x000008, "Member 'BP_Garden3x3_C_OnSeeded_Event::TileIndex' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnSeeded_Multicast
// 0x0010 (0x0010 - 0x0000)
struct BP_Garden3x3_C_OnSeeded_Multicast final
{
public:
	const class AValeriaCharacter*                ActorInstigator;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TileIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnSeeded_Multicast) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnSeeded_Multicast");
static_assert(sizeof(BP_Garden3x3_C_OnSeeded_Multicast) == 0x000010, "Wrong size on BP_Garden3x3_C_OnSeeded_Multicast");
static_assert(offsetof(BP_Garden3x3_C_OnSeeded_Multicast, ActorInstigator) == 0x000000, "Member 'BP_Garden3x3_C_OnSeeded_Multicast::ActorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnSeeded_Multicast, TileIndex) == 0x000008, "Member 'BP_Garden3x3_C_OnSeeded_Multicast::TileIndex' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnTilled_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Garden3x3_C_OnTilled_Event final
{
public:
	const class AValeriaCharacter*                ActorInstigator;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TileIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnTilled_Event) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnTilled_Event");
static_assert(sizeof(BP_Garden3x3_C_OnTilled_Event) == 0x000010, "Wrong size on BP_Garden3x3_C_OnTilled_Event");
static_assert(offsetof(BP_Garden3x3_C_OnTilled_Event, ActorInstigator) == 0x000000, "Member 'BP_Garden3x3_C_OnTilled_Event::ActorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnTilled_Event, TileIndex) == 0x000008, "Member 'BP_Garden3x3_C_OnTilled_Event::TileIndex' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnTilled_Multicast
// 0x0008 (0x0008 - 0x0000)
struct BP_Garden3x3_C_OnTilled_Multicast final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnTilled_Multicast) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnTilled_Multicast");
static_assert(sizeof(BP_Garden3x3_C_OnTilled_Multicast) == 0x000008, "Wrong size on BP_Garden3x3_C_OnTilled_Multicast");
static_assert(offsetof(BP_Garden3x3_C_OnTilled_Multicast, Param_Instigator) == 0x000000, "Member 'BP_Garden3x3_C_OnTilled_Multicast::Param_Instigator' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnWaterAdded
// 0x0070 (0x0070 - 0x0000)
struct BP_Garden3x3_C_OnWaterAdded final
{
public:
	const class AValeriaCharacter*                ActorInstigator;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TileIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3054[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_GetWateredPercent_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3055[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTileWorldLocation_ReturnValue;         // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWatered_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3056[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3057[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlanted_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnWaterAdded) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnWaterAdded");
static_assert(sizeof(BP_Garden3x3_C_OnWaterAdded) == 0x000070, "Wrong size on BP_Garden3x3_C_OnWaterAdded");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, ActorInstigator) == 0x000000, "Member 'BP_Garden3x3_C_OnWaterAdded::ActorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, TileIndex) == 0x000008, "Member 'BP_Garden3x3_C_OnWaterAdded::TileIndex' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000C, "Member 'BP_Garden3x3_C_OnWaterAdded::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, CallFunc_IsLocallyControlled_ReturnValue) == 0x00000D, "Member 'BP_Garden3x3_C_OnWaterAdded::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, Temp_delegate_Variable) == 0x000010, "Member 'BP_Garden3x3_C_OnWaterAdded::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, Temp_struct_Variable) == 0x000020, "Member 'BP_Garden3x3_C_OnWaterAdded::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, CallFunc_GetWateredPercent_ReturnValue) == 0x000030, "Member 'BP_Garden3x3_C_OnWaterAdded::CallFunc_GetWateredPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, CallFunc_GetTileWorldLocation_ReturnValue) == 0x000038, "Member 'BP_Garden3x3_C_OnWaterAdded::CallFunc_GetTileWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, CallFunc_IsWatered_ReturnValue) == 0x000050, "Member 'BP_Garden3x3_C_OnWaterAdded::CallFunc_IsWatered_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000058, "Member 'BP_Garden3x3_C_OnWaterAdded::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'BP_Garden3x3_C_OnWaterAdded::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, CallFunc_PostAkEvent_ReturnValue) == 0x000064, "Member 'BP_Garden3x3_C_OnWaterAdded::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, CallFunc_IsPlanted_ReturnValue) == 0x000068, "Member 'BP_Garden3x3_C_OnWaterAdded::CallFunc_IsPlanted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'BP_Garden3x3_C_OnWaterAdded::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnWaterAdded_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Garden3x3_C_OnWaterAdded_Event final
{
public:
	const class AValeriaCharacter*                ActorInstigator;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TileIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnWaterAdded_Event) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnWaterAdded_Event");
static_assert(sizeof(BP_Garden3x3_C_OnWaterAdded_Event) == 0x000010, "Wrong size on BP_Garden3x3_C_OnWaterAdded_Event");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded_Event, ActorInstigator) == 0x000000, "Member 'BP_Garden3x3_C_OnWaterAdded_Event::ActorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded_Event, TileIndex) == 0x000008, "Member 'BP_Garden3x3_C_OnWaterAdded_Event::TileIndex' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnWaterAdded_Multicast
// 0x0010 (0x0010 - 0x0000)
struct BP_Garden3x3_C_OnWaterAdded_Multicast final
{
public:
	const class AValeriaCharacter*                ActorInstigator;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TileIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnWaterAdded_Multicast) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnWaterAdded_Multicast");
static_assert(sizeof(BP_Garden3x3_C_OnWaterAdded_Multicast) == 0x000010, "Wrong size on BP_Garden3x3_C_OnWaterAdded_Multicast");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded_Multicast, ActorInstigator) == 0x000000, "Member 'BP_Garden3x3_C_OnWaterAdded_Multicast::ActorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWaterAdded_Multicast, TileIndex) == 0x000008, "Member 'BP_Garden3x3_C_OnWaterAdded_Multicast::TileIndex' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnWatered_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Garden3x3_C_OnWatered_Event final
{
public:
	const class AValeriaCharacter*                ActorInstigator;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TileIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnWatered_Event) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnWatered_Event");
static_assert(sizeof(BP_Garden3x3_C_OnWatered_Event) == 0x000010, "Wrong size on BP_Garden3x3_C_OnWatered_Event");
static_assert(offsetof(BP_Garden3x3_C_OnWatered_Event, ActorInstigator) == 0x000000, "Member 'BP_Garden3x3_C_OnWatered_Event::ActorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWatered_Event, TileIndex) == 0x000008, "Member 'BP_Garden3x3_C_OnWatered_Event::TileIndex' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnWateredEvent_Multicast
// 0x0008 (0x0008 - 0x0000)
struct BP_Garden3x3_C_OnWateredEvent_Multicast final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnWateredEvent_Multicast) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnWateredEvent_Multicast");
static_assert(sizeof(BP_Garden3x3_C_OnWateredEvent_Multicast) == 0x000008, "Wrong size on BP_Garden3x3_C_OnWateredEvent_Multicast");
static_assert(offsetof(BP_Garden3x3_C_OnWateredEvent_Multicast, Param_Instigator) == 0x000000, "Member 'BP_Garden3x3_C_OnWateredEvent_Multicast::Param_Instigator' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnWeedRemoved_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Garden3x3_C_OnWeedRemoved_Event final
{
public:
	const class AValeriaCharacter*                ActorInstigator;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TileIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnWeedRemoved_Event) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnWeedRemoved_Event");
static_assert(sizeof(BP_Garden3x3_C_OnWeedRemoved_Event) == 0x000010, "Wrong size on BP_Garden3x3_C_OnWeedRemoved_Event");
static_assert(offsetof(BP_Garden3x3_C_OnWeedRemoved_Event, ActorInstigator) == 0x000000, "Member 'BP_Garden3x3_C_OnWeedRemoved_Event::ActorInstigator' has a wrong offset!");
static_assert(offsetof(BP_Garden3x3_C_OnWeedRemoved_Event, TileIndex) == 0x000008, "Member 'BP_Garden3x3_C_OnWeedRemoved_Event::TileIndex' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.OnWeedRemoved_Multicast
// 0x0008 (0x0008 - 0x0000)
struct BP_Garden3x3_C_OnWeedRemoved_Multicast final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_OnWeedRemoved_Multicast) == 0x000008, "Wrong alignment on BP_Garden3x3_C_OnWeedRemoved_Multicast");
static_assert(sizeof(BP_Garden3x3_C_OnWeedRemoved_Multicast) == 0x000008, "Wrong size on BP_Garden3x3_C_OnWeedRemoved_Multicast");
static_assert(offsetof(BP_Garden3x3_C_OnWeedRemoved_Multicast, Param_Instigator) == 0x000000, "Member 'BP_Garden3x3_C_OnWeedRemoved_Multicast::Param_Instigator' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Garden3x3_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Garden3x3_C_ReceiveEndPlay");
static_assert(sizeof(BP_Garden3x3_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Garden3x3_C_ReceiveEndPlay");
static_assert(offsetof(BP_Garden3x3_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Garden3x3_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Garden3x3_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Garden3x3_C_ReceiveTick");
static_assert(sizeof(BP_Garden3x3_C_ReceiveTick) == 0x000004, "Wrong size on BP_Garden3x3_C_ReceiveTick");
static_assert(offsetof(BP_Garden3x3_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Garden3x3_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.Set Visibility Harvesting FTUE
// 0x0001 (0x0001 - 0x0000)
struct BP_Garden3x3_C_Set_Visibility_Harvesting_FTUE final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_Set_Visibility_Harvesting_FTUE) == 0x000001, "Wrong alignment on BP_Garden3x3_C_Set_Visibility_Harvesting_FTUE");
static_assert(sizeof(BP_Garden3x3_C_Set_Visibility_Harvesting_FTUE) == 0x000001, "Wrong size on BP_Garden3x3_C_Set_Visibility_Harvesting_FTUE");
static_assert(offsetof(BP_Garden3x3_C_Set_Visibility_Harvesting_FTUE, Visibility) == 0x000000, "Member 'BP_Garden3x3_C_Set_Visibility_Harvesting_FTUE::Visibility' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.Set Visibility Watering FTUE
// 0x0001 (0x0001 - 0x0000)
struct BP_Garden3x3_C_Set_Visibility_Watering_FTUE final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_Set_Visibility_Watering_FTUE) == 0x000001, "Wrong alignment on BP_Garden3x3_C_Set_Visibility_Watering_FTUE");
static_assert(sizeof(BP_Garden3x3_C_Set_Visibility_Watering_FTUE) == 0x000001, "Wrong size on BP_Garden3x3_C_Set_Visibility_Watering_FTUE");
static_assert(offsetof(BP_Garden3x3_C_Set_Visibility_Watering_FTUE, Visibility) == 0x000000, "Member 'BP_Garden3x3_C_Set_Visibility_Watering_FTUE::Visibility' has a wrong offset!");

// Function BP_Garden3x3.BP_Garden3x3_C.WeedRemovalAnimation
// 0x0008 (0x0008 - 0x0000)
struct BP_Garden3x3_C_WeedRemovalAnimation final
{
public:
	class AValeriaCharacter*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Garden3x3_C_WeedRemovalAnimation) == 0x000008, "Wrong alignment on BP_Garden3x3_C_WeedRemovalAnimation");
static_assert(sizeof(BP_Garden3x3_C_WeedRemovalAnimation) == 0x000008, "Wrong size on BP_Garden3x3_C_WeedRemovalAnimation");
static_assert(offsetof(BP_Garden3x3_C_WeedRemovalAnimation, Character) == 0x000000, "Member 'BP_Garden3x3_C_WeedRemovalAnimation::Character' has a wrong offset!");

}

