#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HousingPlotUnlockDebrisActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "Palia_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HousingPlotUnlockDebrisActor.BP_HousingPlotUnlockDebrisActor_C
// 0x0050 (0x0300 - 0x02B0)
class ABP_HousingPlotUnlockDebrisActor_C final : public AHousingPlotDebrisActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   DebugID;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GrassMask;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlacementView;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TopDownWritRegion;                                 // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          TargetVisibleState;                                // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverheadMode;                                      // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlacementMode;                                     // 0x02E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60CB[0x5];                                     // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Placement_DMI;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               TopDown_DMI;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UHousingPlotUnlocksComponent*           OwningPlotComponent;                               // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor(int32 EntryPoint, bool CallFunc_IsValid_ReturnValue, class AValeriaCharacter* K2Node_Event_vc, bool K2Node_Event_IsPlacementMode, class UHousingPlotUnlocksComponent* K2Node_Event_component, bool CallFunc_IsInHousingEditMode_ReturnValue, class UCharacterStateMachineComponent* CallFunc_GetCSM_ReturnValue, ECharacterState CallFunc_GetCurrentStateType_ReturnValue, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue_1, const struct FVector4& CallFunc_GetNeighborVisualValue_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_1, bool CallFunc_IsPlotUnlocked_ReturnValue, const struct FVector4& CallFunc_MakeVector4_ReturnValue, bool K2Node_Event_highlight);
	void ForceVisible(const class FString& Info, class FText CallFunc_Conv_StringToText_ReturnValue);
	void ReceiveBeginPlay();
	void SetHighlightState(bool Highlight, const struct FLinearColor& CallFunc_SelectColor_ReturnValue, bool CallFunc_IsValid_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UHousingPlotUnlocksComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsNeighboringUnlockedPlot_ReturnValue, const struct FLinearColor& CallFunc_SelectColor_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2);
	void SetHightlightState(bool Highlight);
	void SetPlacementBorderValue(const struct FVector4& BorderValue, double CallFunc_BreakVector4_X, double CallFunc_BreakVector4_Y, double CallFunc_BreakVector4_Z, double CallFunc_BreakVector4_W, const struct FLinearColor& K2Node_MakeStruct_LinearColor, float K2Node_MakeStruct_R_ImplicitCast, float K2Node_MakeStruct_G_ImplicitCast, float K2Node_MakeStruct_B_ImplicitCast, float K2Node_MakeStruct_A_ImplicitCast);
	void UpdateCharacterState(class AValeriaCharacter* VC, bool IsPlacementMode);
	void UpdateVisibility();
	void UpdateWritPlotUnlockState(class UHousingPlotUnlocksComponent* Component);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HousingPlotUnlockDebrisActor_C">();
	}
	static class ABP_HousingPlotUnlockDebrisActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HousingPlotUnlockDebrisActor_C>();
	}
};
static_assert(alignof(ABP_HousingPlotUnlockDebrisActor_C) == 0x000008, "Wrong alignment on ABP_HousingPlotUnlockDebrisActor_C");
static_assert(sizeof(ABP_HousingPlotUnlockDebrisActor_C) == 0x000300, "Wrong size on ABP_HousingPlotUnlockDebrisActor_C");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_HousingPlotUnlockDebrisActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, DebugID) == 0x0002B8, "Member 'ABP_HousingPlotUnlockDebrisActor_C::DebugID' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, GrassMask) == 0x0002C0, "Member 'ABP_HousingPlotUnlockDebrisActor_C::GrassMask' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, PlacementView) == 0x0002C8, "Member 'ABP_HousingPlotUnlockDebrisActor_C::PlacementView' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, TopDownWritRegion) == 0x0002D0, "Member 'ABP_HousingPlotUnlockDebrisActor_C::TopDownWritRegion' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABP_HousingPlotUnlockDebrisActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, TargetVisibleState) == 0x0002E0, "Member 'ABP_HousingPlotUnlockDebrisActor_C::TargetVisibleState' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, OverheadMode) == 0x0002E1, "Member 'ABP_HousingPlotUnlockDebrisActor_C::OverheadMode' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, PlacementMode) == 0x0002E2, "Member 'ABP_HousingPlotUnlockDebrisActor_C::PlacementMode' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, Placement_DMI) == 0x0002E8, "Member 'ABP_HousingPlotUnlockDebrisActor_C::Placement_DMI' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, TopDown_DMI) == 0x0002F0, "Member 'ABP_HousingPlotUnlockDebrisActor_C::TopDown_DMI' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlotUnlockDebrisActor_C, OwningPlotComponent) == 0x0002F8, "Member 'ABP_HousingPlotUnlockDebrisActor_C::OwningPlotComponent' has a wrong offset!");

}

