#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HousingPlot_Sign

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_HousingPlotSignUiToOpen_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HousingPlot_Sign.BP_HousingPlot_Sign_C
// 0x0050 (0x02F8 - 0x02A8)
class ABP_HousingPlot_Sign_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       InteractableCollider;                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStablesConfigAsset*                    Config;                                            // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   ErrorMessageIfOnFtue;                              // 0x02D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_HousingPlotSignUiToOpen                     UiToOpen;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HousingPlot_Sign(int32 EntryPoint, class AValeriaPlayerController* K2Node_Event_player, const struct FServerUseEventParams& K2Node_Event_params);
	struct FUseEventResult OnClientInteract(class UInteractableComponent* Param_Interactable, class AValeriaPlayerController* Player, const struct FInteractEventParams& Params_0, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsMasterKeyEnabled_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_IsFTUEComplete_ReturnValue, const struct FNotification& K2Node_MakeStruct_Notification, class UVAL_Subsystem_GameplayUIBridge* CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue, TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_GetUIInterface_ReturnValue, const struct FUseEventResult& CallFunc_UseEventResult_HandledAndSentToServer_ReturnValue, const struct FUseEventResult& CallFunc_UseEventResult_Unhandled_ReturnValue, const struct FUseEventResult& CallFunc_UseEventResult_HandledAndSentToServer_ReturnValue_1, class UVAL_Subsystem_GameplayUIBridge* CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1, TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_GetUIInterface_ReturnValue_1);
	struct FUseEventResult OnClientUsedEquippedOnMe(class AValeriaPlayerController* Player, const struct FUseEventParams& Params_0);
	struct FServerUseEventResult OnServerInteract(class UInteractableComponent* Param_Interactable, class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams, const struct FServerUseEventResult& CallFunc_ServerUseEventResult_Unhandled_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void OnServerUsedEquippedOnMe(class AValeriaPlayerController* Player, const struct FServerUseEventParams& Params_0);
	void ReceiveBeginPlay();

	bool GetEventIndexForInputAction(class AValeriaCharacter* Character, TSoftObjectPtr<class UInputAction>& InputAction, EInteractEventIndex* OutEventIndex) const;
	TSoftObjectPtr<class UInputAction> GetInputActionForEventIndex(class AValeriaCharacter* Character, EInteractEventIndex EventIndex) const;
	bool GetText(class AValeriaCharacter* Character, EInteractEventIndex EventIndex, struct FGetTextParams* Params_0, const struct FGetTextParams& K2Node_MakeStruct_GetTextParams, bool CallFunc_EqualEqual_ByteByte_ReturnValue, E_HousingPlotSignUiToOpen Temp_byte_Variable, const struct FGetTextParams& K2Node_MakeStruct_GetTextParams_1, const struct FGetTextParams& K2Node_Select_Default) const;
	bool GetUseableIMC(class AValeriaCharacter* Character, EInteractEventIndex InteractIndex, struct FInputMappingPriorityData* OutMappingData, struct FModifyContextOptions* OutOptions) const;
	int32 InteractPriority(class AValeriaCharacter* Character) const;
	bool IsInteractable(class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HousingPlot_Sign_C">();
	}
	static class ABP_HousingPlot_Sign_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HousingPlot_Sign_C>();
	}
};
static_assert(alignof(ABP_HousingPlot_Sign_C) == 0x000008, "Wrong alignment on ABP_HousingPlot_Sign_C");
static_assert(sizeof(ABP_HousingPlot_Sign_C) == 0x0002F8, "Wrong size on ABP_HousingPlot_Sign_C");
static_assert(offsetof(ABP_HousingPlot_Sign_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_HousingPlot_Sign_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlot_Sign_C, StaticMesh) == 0x0002B0, "Member 'ABP_HousingPlot_Sign_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlot_Sign_C, InteractableCollider) == 0x0002B8, "Member 'ABP_HousingPlot_Sign_C::InteractableCollider' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlot_Sign_C, Interactable) == 0x0002C0, "Member 'ABP_HousingPlot_Sign_C::Interactable' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlot_Sign_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_HousingPlot_Sign_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlot_Sign_C, Config) == 0x0002D0, "Member 'ABP_HousingPlot_Sign_C::Config' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlot_Sign_C, ErrorMessageIfOnFtue) == 0x0002D8, "Member 'ABP_HousingPlot_Sign_C::ErrorMessageIfOnFtue' has a wrong offset!");
static_assert(offsetof(ABP_HousingPlot_Sign_C, UiToOpen) == 0x0002F0, "Member 'ABP_HousingPlot_Sign_C::UiToOpen' has a wrong offset!");

}

