#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HousingPlotActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BP_HousingPlotActor.BP_HousingPlotActor_C.Begin Pivot Rotation
// 0x0001 (0x0001 - 0x0000)
struct BP_HousingPlotActor_C_Begin_Pivot_Rotation final
{
public:
	bool                                          CCW;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotActor_C_Begin_Pivot_Rotation) == 0x000001, "Wrong alignment on BP_HousingPlotActor_C_Begin_Pivot_Rotation");
static_assert(sizeof(BP_HousingPlotActor_C_Begin_Pivot_Rotation) == 0x000001, "Wrong size on BP_HousingPlotActor_C_Begin_Pivot_Rotation");
static_assert(offsetof(BP_HousingPlotActor_C_Begin_Pivot_Rotation, CCW) == 0x000000, "Member 'BP_HousingPlotActor_C_Begin_Pivot_Rotation::CCW' has a wrong offset!");

// Function BP_HousingPlotActor.BP_HousingPlotActor_C.BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B6D[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_HousingPlotActor.BP_HousingPlotActor_C.BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_HousingPlotActor_C_BndEvt__LoadHousingPlotBackground_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_HousingPlotActor.BP_HousingPlotActor_C.ClampCameraPositionInBounds
// 0x00D0 (0x00D0 - 0x0000)
struct BP_HousingPlotActor_C_ClampCameraPositionInBounds final
{
public:
	struct FVector                                InPos;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutPos;                                            // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotActor_C_ClampCameraPositionInBounds) == 0x000008, "Wrong alignment on BP_HousingPlotActor_C_ClampCameraPositionInBounds");
static_assert(sizeof(BP_HousingPlotActor_C_ClampCameraPositionInBounds) == 0x0000D0, "Wrong size on BP_HousingPlotActor_C_ClampCameraPositionInBounds");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, InPos) == 0x000000, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::InPos' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, OutPos) == 0x000018, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::OutPos' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_BreakVector_X) == 0x000030, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_BreakVector_Y) == 0x000038, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_BreakVector_Z) == 0x000040, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_BreakVector_X_1) == 0x000078, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_BreakVector_Y_1) == 0x000080, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_BreakVector_Z_1) == 0x000088, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_BreakVector_X_2) == 0x000090, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_BreakVector_Y_2) == 0x000098, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_BreakVector_Z_2) == 0x0000A0, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_FClamp_ReturnValue) == 0x0000A8, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_FClamp_ReturnValue_1) == 0x0000B0, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ClampCameraPositionInBounds, CallFunc_MakeVector_ReturnValue) == 0x0000B8, "Member 'BP_HousingPlotActor_C_ClampCameraPositionInBounds::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_HousingPlotActor.BP_HousingPlotActor_C.DidVisitorEnter
// 0x0028 (0x0028 - 0x0000)
struct BP_HousingPlotActor_C_DidVisitorEnter final
{
public:
	class AHousingOwnershipActor*                 HOA;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Yes;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B6E[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AValeriaCharacter*>              CallFunc_GetVisitorList_ReturnValue;               // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotActor_C_DidVisitorEnter) == 0x000008, "Wrong alignment on BP_HousingPlotActor_C_DidVisitorEnter");
static_assert(sizeof(BP_HousingPlotActor_C_DidVisitorEnter) == 0x000028, "Wrong size on BP_HousingPlotActor_C_DidVisitorEnter");
static_assert(offsetof(BP_HousingPlotActor_C_DidVisitorEnter, HOA) == 0x000000, "Member 'BP_HousingPlotActor_C_DidVisitorEnter::HOA' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_DidVisitorEnter, Yes) == 0x000008, "Member 'BP_HousingPlotActor_C_DidVisitorEnter::Yes' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_DidVisitorEnter, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_HousingPlotActor_C_DidVisitorEnter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_DidVisitorEnter, CallFunc_GetVisitorList_ReturnValue) == 0x000010, "Member 'BP_HousingPlotActor_C_DidVisitorEnter::CallFunc_GetVisitorList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_DidVisitorEnter, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_HousingPlotActor_C_DidVisitorEnter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_DidVisitorEnter, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'BP_HousingPlotActor_C_DidVisitorEnter::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_DidVisitorEnter, CallFunc_IsServer_ReturnValue) == 0x000025, "Member 'BP_HousingPlotActor_C_DidVisitorEnter::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_DidVisitorEnter, CallFunc_Not_PreBool_ReturnValue) == 0x000026, "Member 'BP_HousingPlotActor_C_DidVisitorEnter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_DidVisitorEnter, CallFunc_BooleanAND_ReturnValue) == 0x000027, "Member 'BP_HousingPlotActor_C_DidVisitorEnter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_HousingPlotActor.BP_HousingPlotActor_C.End Pivot Rotation
// 0x0001 (0x0001 - 0x0000)
struct BP_HousingPlotActor_C_End_Pivot_Rotation final
{
public:
	bool                                          CCW;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotActor_C_End_Pivot_Rotation) == 0x000001, "Wrong alignment on BP_HousingPlotActor_C_End_Pivot_Rotation");
static_assert(sizeof(BP_HousingPlotActor_C_End_Pivot_Rotation) == 0x000001, "Wrong size on BP_HousingPlotActor_C_End_Pivot_Rotation");
static_assert(offsetof(BP_HousingPlotActor_C_End_Pivot_Rotation, CCW) == 0x000000, "Member 'BP_HousingPlotActor_C_End_Pivot_Rotation::CCW' has a wrong offset!");

// Function BP_HousingPlotActor.BP_HousingPlotActor_C.ExecuteUbergraph_BP_HousingPlotActor
// 0x0A10 (0x0A10 - 0x0000)
struct BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_axis_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_axis;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B6F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_Axis;                           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B70[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00D8(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x01C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B71[0x3];                                     // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B72[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B73[0x6];                                     // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B74[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B75[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalCharacterAtThisPlot__IsInside;     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalCharacterAtThisPlot__HasCharacterLoaded; // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B76[0x6];                                     // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0310(0x0018)()
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B77[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B78[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebuggingOn__IsDebuggingOn;             // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B79[0x5];                                     // 0x034B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Delta;                          // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampCameraPositionInBounds_OutPos;       // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0380(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult_1;       // 0x0468(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UHousingPlotUnlocksComponent*           K2Node_Event_component;                            // 0x0550(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampCameraPositionInBounds_OutPos_1;     // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHousingOwnershipActor*                 K2Node_Event_hoa_1;                                // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0578(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B7A[0x7];                                     // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHousingPlotUnlocksComponent*           CallFunc_GetHousingPlotUnlocks_ReturnValue;        // 0x0668(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHousingOwnershipActor*                 K2Node_Event_hoa;                                  // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_3;                   // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DidVisitorEnter_Yes;                      // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B7B[0x6];                                     // 0x067A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHousingOwnershipActor*                 K2Node_CustomEvent_HOA;                            // 0x0680(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess; // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B7C[0x7];                                     // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue; // 0x0690(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AValeriaCharacter*>              CallFunc_GetVisitorList_ReturnValue;               // 0x0698(0x0010)(ReferenceParm)
	class AValeriaCharacter*                      CallFunc_Array_Get_Item;                           // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHousingPermissionLevel                       CallFunc_GetOccupiedHousingOwnershipActor_permissionLevel; // 0x06B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B7D[0x3];                                     // 0x06B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class AHousingOwnershipActor*           CallFunc_GetOccupiedHousingOwnershipActor_ReturnValue; // 0x06B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_4;                   // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x06C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B7E[0x2];                                     // 0x06C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Mailbox_C*                          K2Node_DynamicCast_AsBP_Mailbox;                   // 0x06C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPlaceMode;                    // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B7F[0x6];                                     // 0x06D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x06D8(0x0010)(NoDestructor)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable_1;             // 0x06E8(0x0010)(NoDestructor)
	const class AValeriaCharacter*                K2Node_Event_vc;                                   // 0x06F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_PlacementMode;                        // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B80[0x7];                                     // 0x0701(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHousingPlotDebrisActor*                CallFunc_Array_Get_Item_1;                         // 0x0708(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0718(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B81[0x7];                                     // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0730(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B82[0x4];                                     // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0740(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x07A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_CCW_1;                          // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_CCW;                            // 0x0889(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B83[0x2];                                     // 0x088A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x088C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetFramePivotRotation_Rotation;           // 0x0890(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHousingMenuCameraRotationEnabled_ReturnValue; // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B84[0x7];                                     // 0x08A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x08B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0998(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0999(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B85[0x6];                                     // 0x099A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     K2Node_Select_Default;                             // 0x09A0(0x0010)(NoDestructor)
	TArray<struct FWeightedBlendable>             K2Node_MakeArray_Array;                            // 0x09B0(0x0010)(ReferenceParm)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x09C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x09C8(0x0010)()
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x09DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B86[0x3];                                     // 0x09DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x09E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x09E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x09E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B87[0x2];                                     // 0x09E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHousingPlotUnlocksComponent*           CallFunc_GetHousingPlotUnlocks_ReturnValue_1;      // 0x09E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x09F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x09F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFramePivotRotation_DeltaTime_ImplicitCast; // 0x0A00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor) == 0x000010, "Wrong alignment on BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor");
static_assert(sizeof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor) == 0x000A10, "Wrong size on BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, EntryPoint) == 0x000000, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_Event_axis_1) == 0x000004, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_Event_axis_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_Event_axis) == 0x000008, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_Event_axis' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_MakeVector2D_ReturnValue_1) == 0x000028, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_CustomEvent_Axis) == 0x000038, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_CustomEvent_Axis' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000048, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_Normal_ReturnValue) == 0x000060, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000078, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A0, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0000B8, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0000C0, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0000C8, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0000D0, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000D4, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_ComponentBoundEvent_SweepResult) == 0x0000D8, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x0001C0, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_IsServer_ReturnValue) == 0x0002A8, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, Temp_int_Array_Index_Variable) == 0x0002AC, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_IsServer_ReturnValue_1) == 0x0002B0, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_GetPlayerController_ReturnValue) == 0x0002B8, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_Not_PreBool_ReturnValue) == 0x0002C0, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_IsValid_ReturnValue) == 0x0002C1, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_K2_GetPawn_ReturnValue) == 0x0002C8, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002D0, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0002D8, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_ComponentBoundEvent_OtherActor) == 0x0002E0, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_ComponentBoundEvent_OtherComp) == 0x0002E8, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0002F0, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_BooleanAND_ReturnValue) == 0x0002F4, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_GetDisplayName_ReturnValue) == 0x0002F8, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_IsLocalCharacterAtThisPlot__IsInside) == 0x000308, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_IsLocalCharacterAtThisPlot__IsInside' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_IsLocalCharacterAtThisPlot__HasCharacterLoaded) == 0x000309, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_IsLocalCharacterAtThisPlot__HasCharacterLoaded' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_Conv_StringToText_ReturnValue) == 0x000310, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_IsServer_ReturnValue_2) == 0x000328, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_GetPlayerController_ReturnValue_1) == 0x000330, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_Not_PreBool_ReturnValue_1) == 0x000338, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000340, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000348, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_IsDebuggingOn__IsDebuggingOn) == 0x000349, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_IsDebuggingOn__IsDebuggingOn' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_BooleanAND_ReturnValue_1) == 0x00034A, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_CustomEvent_Delta) == 0x000350, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_CustomEvent_Delta' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_ClampCameraPositionInBounds_OutPos) == 0x000368, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_ClampCameraPositionInBounds_OutPos' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000380, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_K2_AddLocalOffset_SweepHitResult_1) == 0x000468, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_K2_AddLocalOffset_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_Event_component) == 0x000550, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_Event_component' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_ClampCameraPositionInBounds_OutPos_1) == 0x000558, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_ClampCameraPositionInBounds_OutPos_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_Event_hoa_1) == 0x000570, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_Event_hoa_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000578, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_IsValid_ReturnValue_1) == 0x000660, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_GetHousingPlotUnlocks_ReturnValue) == 0x000668, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_GetHousingPlotUnlocks_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_Event_hoa) == 0x000670, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_Event_hoa' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_IsServer_ReturnValue_3) == 0x000678, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_IsServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, CallFunc_DidVisitorEnter_Yes) == 0x000679, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::CallFunc_DidVisitorEnter_Yes' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor, K2Node_CustomEvent_HOA) == 0x000680, "Member 'BP_HousingPlotActor_C_ExecuteUbergraph_BP_HousingPlotActor::K2Node_CustomEvent_HOA' has a wrong offset!");
