#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HousingPlotUnlockDebrisActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BP_HousingPlotUnlockDebrisActor.BP_HousingPlotUnlockDebrisActor_C.ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor
// 0x00C0 (0x00C0 - 0x0000)
struct BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60CC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_Event_vc;                                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsPlacementMode;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60CD[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHousingPlotUnlocksComponent*           K2Node_Event_component;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInHousingEditMode_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60CE[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_GetCurrentStateType_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60CF[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60D0[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60D1[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_GetNeighborVisualValue_ReturnValue;       // 0x0060(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlotUnlocked_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60D2[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0090(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_highlight;                            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor) == 0x000010, "Wrong alignment on BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor");
static_assert(sizeof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor) == 0x0000C0, "Wrong size on BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, EntryPoint) == 0x000000, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, K2Node_Event_vc) == 0x000008, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::K2Node_Event_vc' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, K2Node_Event_IsPlacementMode) == 0x000010, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::K2Node_Event_IsPlacementMode' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, K2Node_Event_component) == 0x000018, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::K2Node_Event_component' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_IsInHousingEditMode_ReturnValue) == 0x000020, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_IsInHousingEditMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_GetCSM_ReturnValue) == 0x000028, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_GetCurrentStateType_ReturnValue) == 0x000030, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_GetCurrentStateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_GetMaterial_ReturnValue) == 0x000038, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_BooleanOR_ReturnValue) == 0x000050, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_GetMaterial_ReturnValue_1) == 0x000058, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_GetNeighborVisualValue_ReturnValue) == 0x000060, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_GetNeighborVisualValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000080, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_IsPlotUnlocked_ReturnValue) == 0x000088, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_IsPlotUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, CallFunc_MakeVector4_ReturnValue) == 0x000090, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor, K2Node_Event_highlight) == 0x0000B0, "Member 'BP_HousingPlotUnlockDebrisActor_C_ExecuteUbergraph_BP_HousingPlotUnlockDebrisActor::K2Node_Event_highlight' has a wrong offset!");

// Function BP_HousingPlotUnlockDebrisActor.BP_HousingPlotUnlockDebrisActor_C.ForceVisible
// 0x0028 (0x0028 - 0x0000)
struct BP_HousingPlotUnlockDebrisActor_C_ForceVisible final
{
public:
	class FString                                 Info;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(BP_HousingPlotUnlockDebrisActor_C_ForceVisible) == 0x000008, "Wrong alignment on BP_HousingPlotUnlockDebrisActor_C_ForceVisible");
static_assert(sizeof(BP_HousingPlotUnlockDebrisActor_C_ForceVisible) == 0x000028, "Wrong size on BP_HousingPlotUnlockDebrisActor_C_ForceVisible");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ForceVisible, Info) == 0x000000, "Member 'BP_HousingPlotUnlockDebrisActor_C_ForceVisible::Info' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_ForceVisible, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'BP_HousingPlotUnlockDebrisActor_C_ForceVisible::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function BP_HousingPlotUnlockDebrisActor.BP_HousingPlotUnlockDebrisActor_C.SetHighlightState
// 0x0048 (0x0048 - 0x0000)
struct BP_HousingPlotUnlockDebrisActor_C_SetHighlightState final
{
public:
	bool                                          Highlight;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60D3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60D4[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60D5[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHousingPlotUnlocksComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNeighboringUnlockedPlot_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60D6[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotUnlockDebrisActor_C_SetHighlightState) == 0x000008, "Wrong alignment on BP_HousingPlotUnlockDebrisActor_C_SetHighlightState");
static_assert(sizeof(BP_HousingPlotUnlockDebrisActor_C_SetHighlightState) == 0x000048, "Wrong size on BP_HousingPlotUnlockDebrisActor_C_SetHighlightState");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetHighlightState, Highlight) == 0x000000, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetHighlightState::Highlight' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetHighlightState, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetHighlightState::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetHighlightState, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetHighlightState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetHighlightState, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetHighlightState::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetHighlightState, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetHighlightState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetHighlightState, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetHighlightState::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetHighlightState, CallFunc_IsNeighboringUnlockedPlot_ReturnValue) == 0x000030, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetHighlightState::CallFunc_IsNeighboringUnlockedPlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetHighlightState, CallFunc_SelectColor_ReturnValue_1) == 0x000034, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetHighlightState::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetHighlightState, CallFunc_IsValid_ReturnValue_2) == 0x000044, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetHighlightState::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_HousingPlotUnlockDebrisActor.BP_HousingPlotUnlockDebrisActor_C.SetHightlightState
// 0x0001 (0x0001 - 0x0000)
struct BP_HousingPlotUnlockDebrisActor_C_SetHightlightState final
{
public:
	bool                                          Highlight;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotUnlockDebrisActor_C_SetHightlightState) == 0x000001, "Wrong alignment on BP_HousingPlotUnlockDebrisActor_C_SetHightlightState");
static_assert(sizeof(BP_HousingPlotUnlockDebrisActor_C_SetHightlightState) == 0x000001, "Wrong size on BP_HousingPlotUnlockDebrisActor_C_SetHightlightState");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetHightlightState, Highlight) == 0x000000, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetHightlightState::Highlight' has a wrong offset!");

// Function BP_HousingPlotUnlockDebrisActor.BP_HousingPlotUnlockDebrisActor_C.SetPlacementBorderValue
// 0x0060 (0x0060 - 0x0000)
struct BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue final
{
public:
	struct FVector4                               BorderValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector4_X;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector4_Y;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector4_Z;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector4_W;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue) == 0x000010, "Wrong alignment on BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue");
static_assert(sizeof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue) == 0x000060, "Wrong size on BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue, BorderValue) == 0x000000, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue::BorderValue' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue, CallFunc_BreakVector4_X) == 0x000020, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue::CallFunc_BreakVector4_X' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue, CallFunc_BreakVector4_Y) == 0x000028, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue::CallFunc_BreakVector4_Y' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue, CallFunc_BreakVector4_Z) == 0x000030, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue::CallFunc_BreakVector4_Z' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue, CallFunc_BreakVector4_W) == 0x000038, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue::CallFunc_BreakVector4_W' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue, K2Node_MakeStruct_LinearColor) == 0x000040, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue, K2Node_MakeStruct_R_ImplicitCast) == 0x000050, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue, K2Node_MakeStruct_G_ImplicitCast) == 0x000054, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue, K2Node_MakeStruct_B_ImplicitCast) == 0x000058, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue, K2Node_MakeStruct_A_ImplicitCast) == 0x00005C, "Member 'BP_HousingPlotUnlockDebrisActor_C_SetPlacementBorderValue::K2Node_MakeStruct_A_ImplicitCast' has a wrong offset!");

// Function BP_HousingPlotUnlockDebrisActor.BP_HousingPlotUnlockDebrisActor_C.UpdateCharacterState
// 0x0010 (0x0010 - 0x0000)
struct BP_HousingPlotUnlockDebrisActor_C_UpdateCharacterState final
{
public:
	class AValeriaCharacter*                      VC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlacementMode;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotUnlockDebrisActor_C_UpdateCharacterState) == 0x000008, "Wrong alignment on BP_HousingPlotUnlockDebrisActor_C_UpdateCharacterState");
static_assert(sizeof(BP_HousingPlotUnlockDebrisActor_C_UpdateCharacterState) == 0x000010, "Wrong size on BP_HousingPlotUnlockDebrisActor_C_UpdateCharacterState");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_UpdateCharacterState, VC) == 0x000000, "Member 'BP_HousingPlotUnlockDebrisActor_C_UpdateCharacterState::VC' has a wrong offset!");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_UpdateCharacterState, IsPlacementMode) == 0x000008, "Member 'BP_HousingPlotUnlockDebrisActor_C_UpdateCharacterState::IsPlacementMode' has a wrong offset!");

// Function BP_HousingPlotUnlockDebrisActor.BP_HousingPlotUnlockDebrisActor_C.UpdateWritPlotUnlockState
// 0x0008 (0x0008 - 0x0000)
struct BP_HousingPlotUnlockDebrisActor_C_UpdateWritPlotUnlockState final
{
public:
	class UHousingPlotUnlocksComponent*           Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HousingPlotUnlockDebrisActor_C_UpdateWritPlotUnlockState) == 0x000008, "Wrong alignment on BP_HousingPlotUnlockDebrisActor_C_UpdateWritPlotUnlockState");
static_assert(sizeof(BP_HousingPlotUnlockDebrisActor_C_UpdateWritPlotUnlockState) == 0x000008, "Wrong size on BP_HousingPlotUnlockDebrisActor_C_UpdateWritPlotUnlockState");
static_assert(offsetof(BP_HousingPlotUnlockDebrisActor_C_UpdateWritPlotUnlockState, Component) == 0x000000, "Member 'BP_HousingPlotUnlockDebrisActor_C_UpdateWritPlotUnlockState::Component' has a wrong offset!");

}

