#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HuntingCreatureHidingSpot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_vfx_leafTypeSetA_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HuntingCreatureHidingSpot.BP_HuntingCreatureHidingSpot_C
// 0x00B0 (0x0350 - 0x02A0)
class UBP_HuntingCreatureHidingSpot_C final : public USceneComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class UClass*, int32>                    CreaturesToNumHiding;                              // 0x02A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UClass*, int32>                    CreaturesToTier;                                   // 0x02F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DoCreatureDespawnVFX(Enum_vfx_leafTypeSetA LeafType, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void ExecuteUbergraph_BP_HuntingCreatureHidingSpot(int32 EntryPoint, bool CallFunc_IsServer_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, TDelegate<void(class UVitalsComponent* Vitals)> K2Node_CreateDelegate_OutputDelegate, class UVitalsComponent* CallFunc_GetComponentByClass_ReturnValue);
	void GetLowestTierCreature(class UClass** Creature, int32* Tier, class UClass* LowestCreature, int32 LowestTier, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UClass*>& CallFunc_Map_Keys_Keys, int32 CallFunc_Array_Length_ReturnValue, class UClass* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1);
	void ReceiveBeginPlay();
	void ServerHandleTreeDowned(class UVitalsComponent* Vitals, bool CallFunc_IsServer_ReturnValue);
	void ServerInitializeHidingCreatures(bool CallFunc_IsServer_ReturnValue);
	void ServerTryAddHidingCreature(class UClass* HuntingCreature, int32 CreatureTier, bool* SuccessfullyHidden, bool* DisplacedDifferentCreature, class FString* DisplacedCreatureClass, bool WasDifferentCreatureDisplaced, class UClass* LowestTierCreature, int32 TotalCreaturesInHidingSpot, int32 MaxCreaturesAllowed, int32 CurrentNumberOfCreature, const class FString& CallFunc_GetClassDisplayName_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Variable, int32 Temp_int_Array_Index_Variable, bool CallFunc_Map_Remove_ReturnValue, bool CallFunc_Map_Remove_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, class UClass* CallFunc_GetLowestTierCreature_Creature, int32 CallFunc_GetLowestTierCreature_Tier, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, TArray<int32>& CallFunc_Map_Values_Values, int32 CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_IsServer_ReturnValue, int32 CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1);
	void ServerTrySpawnHidingCreatures(class UParticipationTrackingComponent* HidingSpotOwnerParticipationComp, class UParticipationTrackingComponent* CreatureParticipationComp, const TArray<struct FParticipant>& HidingSpotOwnerParticipants, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, TArray<struct FParticipant>& CallFunc_GetParticipantList_OutParticipantList, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable, bool CallFunc_IsValid_ReturnValue_1, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_1, const struct FParticipant& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, class UParticipationTrackingComponent* CallFunc_GetComponentByClass_ReturnValue, class UClass* CallFunc_GetObjectClass_ReturnValue, const class FString& CallFunc_GetClassDisplayName_ReturnValue, bool CallFunc_IsServer_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_2, class USpawningManager* CallFunc_GetGameInstanceSubsystem_ReturnValue, TArray<class UClass*>& CallFunc_Map_Keys_Keys, int32 CallFunc_Array_Length_ReturnValue_1, class UClass* CallFunc_Array_Get_Item_1, bool CallFunc_Less_IntInt_ReturnValue_1, class AActor* CallFunc_SpawnSecondaryActor_ReturnValue, class UParticipationTrackingComponent* CallFunc_GetComponentByClass_ReturnValue_1, int32 CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HuntingCreatureHidingSpot_C">();
	}
	static class UBP_HuntingCreatureHidingSpot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HuntingCreatureHidingSpot_C>();
	}
};
static_assert(alignof(UBP_HuntingCreatureHidingSpot_C) == 0x000010, "Wrong alignment on UBP_HuntingCreatureHidingSpot_C");
static_assert(sizeof(UBP_HuntingCreatureHidingSpot_C) == 0x000350, "Wrong size on UBP_HuntingCreatureHidingSpot_C");
static_assert(offsetof(UBP_HuntingCreatureHidingSpot_C, UberGraphFrame) == 0x0002A0, "Member 'UBP_HuntingCreatureHidingSpot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HuntingCreatureHidingSpot_C, CreaturesToNumHiding) == 0x0002A8, "Member 'UBP_HuntingCreatureHidingSpot_C::CreaturesToNumHiding' has a wrong offset!");
static_assert(offsetof(UBP_HuntingCreatureHidingSpot_C, CreaturesToTier) == 0x0002F8, "Member 'UBP_HuntingCreatureHidingSpot_C::CreaturesToTier' has a wrong offset!");

}

