#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemDrag_Gear

#include "Basic.hpp"

#include "BP_ItemDrag_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ItemDrag_Gear.BP_ItemDrag_Gear_C
// 0x0018 (0x00D0 - 0x00B8)
class UBP_ItemDrag_Gear_C final : public UBP_ItemDrag_C
{
public:
	class UGearComponent*                         GearComponent;                                     // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UGearSlotTypeConfig*                    GearSlotType;                                      // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         GearSlotIndex;                                     // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	struct FValeriaItem GetItem(const struct FValeriaItem& CallFunc_GetGearBySlotType_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemDrag_Gear_C">();
	}
	static class UBP_ItemDrag_Gear_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ItemDrag_Gear_C>();
	}
};
static_assert(alignof(UBP_ItemDrag_Gear_C) == 0x000008, "Wrong alignment on UBP_ItemDrag_Gear_C");
static_assert(sizeof(UBP_ItemDrag_Gear_C) == 0x0000D0, "Wrong size on UBP_ItemDrag_Gear_C");
static_assert(offsetof(UBP_ItemDrag_Gear_C, GearComponent) == 0x0000B8, "Member 'UBP_ItemDrag_Gear_C::GearComponent' has a wrong offset!");
static_assert(offsetof(UBP_ItemDrag_Gear_C, GearSlotType) == 0x0000C0, "Member 'UBP_ItemDrag_Gear_C::GearSlotType' has a wrong offset!");
static_assert(offsetof(UBP_ItemDrag_Gear_C, GearSlotIndex) == 0x0000C8, "Member 'UBP_ItemDrag_Gear_C::GearSlotIndex' has a wrong offset!");

}

