#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractablePlateWidgetComponent

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S6EnhancedInputExtended_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractablePlateWidgetComponent.BP_InteractablePlateWidgetComponent_C.RemoveRefillWaterCanIMC
// 0x0038 (0x0038 - 0x0000)
struct BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC final
{
public:
	struct FModifyContextOptions                  K2Node_MakeStruct_ModifyContextOptions;            // 0x0000(0x0001)(NoDestructor)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA0[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA1[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_RemoveMappingContext_self_CastInput;      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC) == 0x000008, "Wrong alignment on BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC");
static_assert(sizeof(BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC) == 0x000038, "Wrong size on BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC, K2Node_MakeStruct_ModifyContextOptions) == 0x000000, "Member 'BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC::K2Node_MakeStruct_ModifyContextOptions' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC, CallFunc_GetValeriaPlayerController_OutResult) == 0x000001, "Member 'BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000008, "Member 'BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000010, "Member 'BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC, CallFunc_RemoveMappingContext_self_CastInput) == 0x000020, "Member 'BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC::CallFunc_RemoveMappingContext_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'BP_InteractablePlateWidgetComponent_C_RemoveRefillWaterCanIMC::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_InteractablePlateWidgetComponent.BP_InteractablePlateWidgetComponent_C.AddRefillWaterCanIMC
// 0x0038 (0x0038 - 0x0000)
struct BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC final
{
public:
	class UInputMappingContext*                   AddIMC;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  K2Node_MakeStruct_ModifyContextOptions;            // 0x0009(0x0001)(NoDestructor)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA2[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA3[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_AddMappingContext_self_CastInput;         // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC) == 0x000008, "Wrong alignment on BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC");
static_assert(sizeof(BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC) == 0x000038, "Wrong size on BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC, AddIMC) == 0x000000, "Member 'BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC::AddIMC' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC, K2Node_MakeStruct_ModifyContextOptions) == 0x000009, "Member 'BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC::K2Node_MakeStruct_ModifyContextOptions' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC, CallFunc_GetValeriaPlayerController_OutResult) == 0x00000A, "Member 'BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000010, "Member 'BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000020, "Member 'BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC, CallFunc_AddMappingContext_self_CastInput) == 0x000028, "Member 'BP_InteractablePlateWidgetComponent_C_AddRefillWaterCanIMC::CallFunc_AddMappingContext_self_CastInput' has a wrong offset!");

// Function BP_InteractablePlateWidgetComponent.BP_InteractablePlateWidgetComponent_C.Refill Water Can Tick
// 0x00E0 (0x00E0 - 0x0000)
struct BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick final
{
public:
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA4[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_ValeriaPlayerController_C*          K2Node_DynamicCast_AsBP_Valeria_Player_Controller; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA5[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InteractPlate_Prompt_C*            K2Node_DynamicCast_AsWBP_Interact_Plate_Prompt;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInteractState_bInteractState;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_GetInteractState_State;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA6[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA7[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           CallFunc_GetEquippedItem_ReturnValue;              // 0x0050(0x0060)()
	class ABP_ValeriaCharacter_C*                 K2Node_DynamicCast_AsBP_Valeria_Character;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Find_Water_For_Refill_Was_Found;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA8[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Find_Water_For_Refill_Water_Actor;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick) == 0x000008, "Wrong alignment on BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick");
static_assert(sizeof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick) == 0x0000E0, "Wrong size on BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000000, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_GetValeriaPlayerController_OutResult) == 0x000008, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000010, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_GetUserWidgetObject_ReturnValue_1) == 0x000018, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_GetUserWidgetObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, K2Node_DynamicCast_AsBP_Valeria_Player_Controller) == 0x000020, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::K2Node_DynamicCast_AsBP_Valeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, K2Node_DynamicCast_AsWBP_Interact_Plate_Prompt) == 0x000030, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::K2Node_DynamicCast_AsWBP_Interact_Plate_Prompt' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_GetInteractState_bInteractState) == 0x000039, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_GetInteractState_bInteractState' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_GetInteractState_State) == 0x00003A, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_GetInteractState_State' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, K2Node_SwitchEnum_CmpSuccess) == 0x00003B, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_GetValeriaCharacter_OutResult) == 0x00003C, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000040, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, K2Node_SwitchEnum_CmpSuccess_1) == 0x000048, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_GetEquippedItem_ReturnValue) == 0x000050, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_GetEquippedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, K2Node_DynamicCast_AsBP_Valeria_Character) == 0x0000B0, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::K2Node_DynamicCast_AsBP_Valeria_Character' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_Find_Water_For_Refill_Was_Found) == 0x0000B9, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_Find_Water_For_Refill_Was_Found' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_Find_Water_For_Refill_Water_Actor) == 0x0000C0, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_Find_Water_For_Refill_Water_Actor' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000C8, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, K2Node_DynamicCast_AsItem_Type_Definition) == 0x0000D0, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, K2Node_DynamicCast_bSuccess_3) == 0x0000D8, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000D9, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick, CallFunc_HasTag_ReturnValue) == 0x0000DA, "Member 'BP_InteractablePlateWidgetComponent_C_Refill_Water_Can_Tick::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function BP_InteractablePlateWidgetComponent.BP_InteractablePlateWidgetComponent_C.TryUpdateAlignment
// 0x0090 (0x0090 - 0x0000)
struct BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment final
{
public:
	struct FBoxSphereBounds                       MeshBounds;                                        // 0x0000(0x0038)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EInteractablePlateVerticalOffsetDirection     Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA9[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPivot_ReturnValue;                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0080(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment) == 0x000008, "Wrong alignment on BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment");
static_assert(sizeof(BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment) == 0x000090, "Wrong size on BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment, MeshBounds) == 0x000000, "Member 'BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment::MeshBounds' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment, Temp_byte_Variable) == 0x000038, "Member 'BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment, CallFunc_GetPivot_ReturnValue) == 0x000040, "Member 'BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment::CallFunc_GetPivot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment, CallFunc_BreakVector2D_X) == 0x000050, "Member 'BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment, CallFunc_BreakVector2D_Y) == 0x000058, "Member 'BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment, CallFunc_MakeVector2D_ReturnValue_1) == 0x000070, "Member 'BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment, K2Node_Select_Default) == 0x000080, "Member 'BP_InteractablePlateWidgetComponent_C_TryUpdateAlignment::K2Node_Select_Default' has a wrong offset!");

// Function BP_InteractablePlateWidgetComponent.BP_InteractablePlateWidgetComponent_C.AutomaticallyPosition
// 0x01C0 (0x01C0 - 0x0000)
struct BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition final
{
public:
	struct FBoxSphereBounds                       MeshBounds;                                        // 0x0000(0x0038)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EInteractablePlateVerticalOffsetDirection     Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FAA[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_GetActorBounds_OutBounds;                 // 0x0050(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Select_Default;                             // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition) == 0x000008, "Wrong alignment on BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition");
static_assert(sizeof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition) == 0x0001C0, "Wrong size on BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, MeshBounds) == 0x000000, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::MeshBounds' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, Temp_byte_Variable) == 0x000038, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, CallFunc_GetObjectClass_ReturnValue) == 0x000048, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, CallFunc_GetActorBounds_OutBounds) == 0x000050, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::CallFunc_GetActorBounds_OutBounds' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, K2Node_Select_Default) == 0x000088, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, CallFunc_BreakVector_X) == 0x0000A0, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, CallFunc_BreakVector_Y) == 0x0000A8, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, CallFunc_BreakVector_Z) == 0x0000B0, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, CallFunc_MakeVector_ReturnValue) == 0x0000C0, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000D8, "Member 'BP_InteractablePlateWidgetComponent_C_AutomaticallyPosition::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function BP_InteractablePlateWidgetComponent.BP_InteractablePlateWidgetComponent_C.HandleHighlightToggled
// 0x0018 (0x0018 - 0x0000)
struct BP_InteractablePlateWidgetComponent_C_HandleHighlightToggled final
{
public:
	class UInteractableComponent*                 Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsHighlighted;                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FAB[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               Player;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractablePlateWidgetComponent_C_HandleHighlightToggled) == 0x000008, "Wrong alignment on BP_InteractablePlateWidgetComponent_C_HandleHighlightToggled");
static_assert(sizeof(BP_InteractablePlateWidgetComponent_C_HandleHighlightToggled) == 0x000018, "Wrong size on BP_InteractablePlateWidgetComponent_C_HandleHighlightToggled");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_HandleHighlightToggled, Interactable) == 0x000000, "Member 'BP_InteractablePlateWidgetComponent_C_HandleHighlightToggled::Interactable' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_HandleHighlightToggled, Param_IsHighlighted) == 0x000008, "Member 'BP_InteractablePlateWidgetComponent_C_HandleHighlightToggled::Param_IsHighlighted' has a wrong offset!");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_HandleHighlightToggled, Player) == 0x000010, "Member 'BP_InteractablePlateWidgetComponent_C_HandleHighlightToggled::Player' has a wrong offset!");

// Function BP_InteractablePlateWidgetComponent.BP_InteractablePlateWidgetComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractablePlateWidgetComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractablePlateWidgetComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_InteractablePlateWidgetComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_InteractablePlateWidgetComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_InteractablePlateWidgetComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_InteractablePlateWidgetComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_InteractablePlateWidgetComponent.BP_InteractablePlateWidgetComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_InteractablePlateWidgetComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractablePlateWidgetComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_InteractablePlateWidgetComponent_C_ReceiveTick");
static_assert(sizeof(BP_InteractablePlateWidgetComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_InteractablePlateWidgetComponent_C_ReceiveTick");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_InteractablePlateWidgetComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_InteractablePlateWidgetComponent.BP_InteractablePlateWidgetComponent_C.UpdateRefillWaterCanIMC
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractablePlateWidgetComponent_C_UpdateRefillWaterCanIMC final
{
public:
	bool                                          bPlateVisibile;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractablePlateWidgetComponent_C_UpdateRefillWaterCanIMC) == 0x000001, "Wrong alignment on BP_InteractablePlateWidgetComponent_C_UpdateRefillWaterCanIMC");
static_assert(sizeof(BP_InteractablePlateWidgetComponent_C_UpdateRefillWaterCanIMC) == 0x000001, "Wrong size on BP_InteractablePlateWidgetComponent_C_UpdateRefillWaterCanIMC");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_UpdateRefillWaterCanIMC, bPlateVisibile) == 0x000000, "Member 'BP_InteractablePlateWidgetComponent_C_UpdateRefillWaterCanIMC::bPlateVisibile' has a wrong offset!");

// Function BP_InteractablePlateWidgetComponent.BP_InteractablePlateWidgetComponent_C.ExecuteUbergraph_BP_InteractablePlateWidgetComponent
// 0x0108 (0x0108 - 0x0000)
struct BP_InteractablePlateWidgetComponent_C_ExecuteUbergraph_BP_InteractablePlateWidgetComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FAC[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FAD[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableComponent*                 K2Node_CustomEvent_Interactable;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsHighlighted;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FAE[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               K2Node_CustomEvent_player;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FAF[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UInteractableComponent* InteractableComponent, bool IsHighlighted, class AValeriaPlayerController* Player)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInteractableComponent* InteractableComponent, bool IsHighlighted, class AValeriaPlayerController* Player)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FB0[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FB1[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UVAL_InputGlobalConfig*           CallFunc_GetInputGlobalConfig_ReturnValue;         // 0x0080(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInteractablePlate>    K2Node_DynamicCast_AsInteractable_Plate;           // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractEventIndex                           Temp_byte_Variable;                                // 0x00A2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FB2[0x5];                                     // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_2;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInteractablePlate>    K2Node_DynamicCast_AsInteractable_Plate_1;         // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FB3[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputMappingPriorityData              CallFunc_Map_Find_Value;                           // 0x00C8(0x0038)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPlateVisibile;                 // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractablePlateWidgetComponent_C_ExecuteUbergraph_BP_InteractablePlateWidgetComponent) == 0x000008, "Wrong alignment on BP_InteractablePlateWidgetComponent_C_ExecuteUbergraph_BP_InteractablePlateWidgetComponent");
static_assert(sizeof(BP_InteractablePlateWidgetComponent_C_ExecuteUbergraph_BP_InteractablePlateWidgetComponent) == 0x000108, "Wrong size on BP_InteractablePlateWidgetComponent_C_ExecuteUbergraph_BP_InteractablePlateWidgetComponent");
static_assert(offsetof(BP_InteractablePlateWidgetComponent_C_ExecuteUbergraph_BP_InteractablePlateWidgetComponent, EntryPoint) == 0x000000, "Member 'BP_InteractablePlateWidgetComponent_C_ExecuteUbergraph_BP_InteractablePlateWidgetComponent::EntryPoint' has a wrong offset!");
