#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_lanternC_PoleStableA

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_lanternC_PoleStableA.BP_lanternC_PoleStableA_C.ExecuteUbergraph_BP_lanternC_PoleStableA
// 0x000C (0x000C - 0x0000)
struct BP_lanternC_PoleStableA_C_ExecuteUbergraph_BP_lanternC_PoleStableA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DestroyIfServer_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_477C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_lanternC_PoleStableA_C_ExecuteUbergraph_BP_lanternC_PoleStableA) == 0x000004, "Wrong alignment on BP_lanternC_PoleStableA_C_ExecuteUbergraph_BP_lanternC_PoleStableA");
static_assert(sizeof(BP_lanternC_PoleStableA_C_ExecuteUbergraph_BP_lanternC_PoleStableA) == 0x00000C, "Wrong size on BP_lanternC_PoleStableA_C_ExecuteUbergraph_BP_lanternC_PoleStableA");
static_assert(offsetof(BP_lanternC_PoleStableA_C_ExecuteUbergraph_BP_lanternC_PoleStableA, EntryPoint) == 0x000000, "Member 'BP_lanternC_PoleStableA_C_ExecuteUbergraph_BP_lanternC_PoleStableA::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_lanternC_PoleStableA_C_ExecuteUbergraph_BP_lanternC_PoleStableA, CallFunc_DestroyIfServer_ReturnValue) == 0x000004, "Member 'BP_lanternC_PoleStableA_C_ExecuteUbergraph_BP_lanternC_PoleStableA::CallFunc_DestroyIfServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lanternC_PoleStableA_C_ExecuteUbergraph_BP_lanternC_PoleStableA, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_lanternC_PoleStableA_C_ExecuteUbergraph_BP_lanternC_PoleStableA::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_lanternC_PoleStableA.BP_lanternC_PoleStableA_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_lanternC_PoleStableA_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_lanternC_PoleStableA_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_lanternC_PoleStableA_C_ReceiveTick");
static_assert(sizeof(BP_lanternC_PoleStableA_C_ReceiveTick) == 0x000004, "Wrong size on BP_lanternC_PoleStableA_C_ReceiveTick");
static_assert(offsetof(BP_lanternC_PoleStableA_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_lanternC_PoleStableA_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

