#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootChestRockPileFTUE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Loot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LootChestRockPileFTUE.BP_LootChestRockPileFTUE_C
// 0x0020 (0x0328 - 0x0308)
class ABP_LootChestRockPileFTUE_C final : public ABP_Loot_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_LootChestRockPileFTUE_C;         // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Mining_StonePebble_03;                          // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Mining_StonePebble_02;                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Mining_StonePebble_01;                          // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LootChestRockPileFTUE(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LootChestRockPileFTUE_C">();
	}
	static class ABP_LootChestRockPileFTUE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LootChestRockPileFTUE_C>();
	}
};
static_assert(alignof(ABP_LootChestRockPileFTUE_C) == 0x000008, "Wrong alignment on ABP_LootChestRockPileFTUE_C");
static_assert(sizeof(ABP_LootChestRockPileFTUE_C) == 0x000328, "Wrong size on ABP_LootChestRockPileFTUE_C");
static_assert(offsetof(ABP_LootChestRockPileFTUE_C, UberGraphFrame_BP_LootChestRockPileFTUE_C) == 0x000308, "Member 'ABP_LootChestRockPileFTUE_C::UberGraphFrame_BP_LootChestRockPileFTUE_C' has a wrong offset!");
static_assert(offsetof(ABP_LootChestRockPileFTUE_C, SM_Mining_StonePebble_03) == 0x000310, "Member 'ABP_LootChestRockPileFTUE_C::SM_Mining_StonePebble_03' has a wrong offset!");
static_assert(offsetof(ABP_LootChestRockPileFTUE_C, SM_Mining_StonePebble_02) == 0x000318, "Member 'ABP_LootChestRockPileFTUE_C::SM_Mining_StonePebble_02' has a wrong offset!");
static_assert(offsetof(ABP_LootChestRockPileFTUE_C, SM_Mining_StonePebble_01) == 0x000320, "Member 'ABP_LootChestRockPileFTUE_C::SM_Mining_StonePebble_01' has a wrong offset!");

}

