#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ModalInterface_Collections

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BP_ModalInterface_Collections.BP_ModalInterface_Collections_C.InitCharacterRenderStudio
// 0x0008 (0x0008 - 0x0000)
struct BP_ModalInterface_Collections_C_InitCharacterRenderStudio final
{
public:
	class AVAL_CharacterRenderStudio*             CharacterRenderStudio;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ModalInterface_Collections_C_InitCharacterRenderStudio) == 0x000008, "Wrong alignment on BP_ModalInterface_Collections_C_InitCharacterRenderStudio");
static_assert(sizeof(BP_ModalInterface_Collections_C_InitCharacterRenderStudio) == 0x000008, "Wrong size on BP_ModalInterface_Collections_C_InitCharacterRenderStudio");
static_assert(offsetof(BP_ModalInterface_Collections_C_InitCharacterRenderStudio, CharacterRenderStudio) == 0x000000, "Member 'BP_ModalInterface_Collections_C_InitCharacterRenderStudio::CharacterRenderStudio' has a wrong offset!");

// Function BP_ModalInterface_Collections.BP_ModalInterface_Collections_C.InitPostOpenModalWidget
// 0x0010 (0x0010 - 0x0000)
struct BP_ModalInterface_Collections_C_InitPostOpenModalWidget final
{
public:
	EVAL_CollectionsTabState                      Starting_Tab;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationComponent*   TargetCharacterCustomizationComponent;             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ModalInterface_Collections_C_InitPostOpenModalWidget) == 0x000008, "Wrong alignment on BP_ModalInterface_Collections_C_InitPostOpenModalWidget");
static_assert(sizeof(BP_ModalInterface_Collections_C_InitPostOpenModalWidget) == 0x000010, "Wrong size on BP_ModalInterface_Collections_C_InitPostOpenModalWidget");
static_assert(offsetof(BP_ModalInterface_Collections_C_InitPostOpenModalWidget, Starting_Tab) == 0x000000, "Member 'BP_ModalInterface_Collections_C_InitPostOpenModalWidget::Starting_Tab' has a wrong offset!");
static_assert(offsetof(BP_ModalInterface_Collections_C_InitPostOpenModalWidget, TargetCharacterCustomizationComponent) == 0x000008, "Member 'BP_ModalInterface_Collections_C_InitPostOpenModalWidget::TargetCharacterCustomizationComponent' has a wrong offset!");

}

