#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mailbox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mailbox.BP_Mailbox_C
// 0x0088 (0x0330 - 0x02A8)
class ABP_Mailbox_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkCulledComponent*                     AkCulled;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_gotMail;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Root_vfx;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProximityChecker*                      ProximityChecker;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Mailbox_Owl_TrapDoor;                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Mailbox_Owl_NoMail;                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Mailbox_Owl_GotMail;                            // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Mailbox_Owl_Base;                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractablePlateWidgetComponent_C* BP_InteractablePlateWidgetComponent;               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       InteractableCollider;                              // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          WasInitialized;                                    // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5333[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AudioMailIdleLoop;                                 // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      CachedMailboxOwnerVC;                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          RepHasMail;                                        // 0x0328(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ClearListenForNewMail();
	void Client_setGotMail(class APlayerController* CallFunc_GetPlayerControllerFromID_ReturnValue, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, EHousingPermissionLevel CallFunc_GetOccupiedHousingOwnershipActor_permissionLevel, class AHousingOwnershipActor* CallFunc_GetOccupiedHousingOwnershipActor_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void Client_setNoMail();
	void ExecuteUbergraph_BP_Mailbox(int32 EntryPoint, class AValeriaPlayerController* K2Node_Event_player, const struct FServerUseEventParams& K2Node_Event_params, TDelegate<void(class UVillagerMailInboxComponent* InBox)> K2Node_CreateDelegate_OutputDelegate, class AValeriaCharacter* K2Node_CustomEvent_Character, class UVillagerMailInboxComponent* K2Node_CustomEvent_inbox, bool CallFunc_HasNewMail_ReturnValue, class UVillagerMailInboxComponent* CallFunc_GetVillagerMailInbox_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UVillagerMailInboxComponent* CallFunc_GetVillagerMailInbox_ReturnValue_1);
	void ListenForNewMail(class AValeriaCharacter* Character);
	struct FUseEventResult OnClientInteract(class UInteractableComponent* Param_Interactable, class AValeriaPlayerController* Player, const struct FInteractEventParams& Params_0, const struct FUseEventResult& CallFunc_UseEventResult_Handled_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, class UVAL_Subsystem_GameplayUIBridge* CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue, TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_GetUIInterface_ReturnValue, const struct FUseEventResult& CallFunc_UseEventResult_Unhandled_ReturnValue);
	struct FUseEventResult OnClientUsedEquippedOnMe(class AValeriaPlayerController* Player, const struct FUseEventParams& Params_0, const struct FUseEventResult& K2Node_MakeStruct_UseEventResult);
	void OnMailChanged(class UVillagerMailInboxComponent* InBox);
	void OnRep_RepHasMail(const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue);
	struct FServerUseEventResult OnServerInteract(class UInteractableComponent* Param_Interactable, class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams);
	void OnServerUsedEquippedOnMe(class AValeriaPlayerController* Player, const struct FServerUseEventParams& Params_0);
	void UserConstructionScript(bool CallFunc_IsValid_ReturnValue);

	bool GetEventIndexForInputAction(class AValeriaCharacter* Character, TSoftObjectPtr<class UInputAction>& InputAction, EInteractEventIndex* OutEventIndex) const;
	TSoftObjectPtr<class UInputAction> GetInputActionForEventIndex(class AValeriaCharacter* Character, EInteractEventIndex EventIndex) const;
	bool GetText(class AValeriaCharacter* Character, EInteractEventIndex EventIndex, struct FGetTextParams* Params_0, TArray<struct FShopItemAdditionalCost>& K2Node_MakeArray_Array, bool CallFunc_EqualEqual_ByteByte_ReturnValue, const struct FGetTextParams& K2Node_MakeStruct_GetTextParams) const;
	bool GetUseableIMC(class AValeriaCharacter* Character, EInteractEventIndex InteractIndex, struct FInputMappingPriorityData* OutMappingData, struct FModifyContextOptions* OutOptions) const;
	int32 InteractPriority(class AValeriaCharacter* Character) const;
	bool IsInteractable(class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams, EHousingPermissionLevel Temp_byte_Variable, EHousingPermissionLevel CallFunc_GetOccupiedHousingOwnershipActor_permissionLevel, class AHousingOwnershipActor* CallFunc_GetOccupiedHousingOwnershipActor_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, bool Temp_bool_Variable_4, bool Temp_bool_Variable_5, bool Temp_bool_Variable_6, bool Temp_bool_Variable_7, bool Temp_bool_Variable_8, bool Temp_bool_Variable_9, bool K2Node_Select_Default, bool CallFunc_BooleanOR_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mailbox_C">();
	}
	static class ABP_Mailbox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mailbox_C>();
	}
};
static_assert(alignof(ABP_Mailbox_C) == 0x000008, "Wrong alignment on ABP_Mailbox_C");
static_assert(sizeof(ABP_Mailbox_C) == 0x000330, "Wrong size on ABP_Mailbox_C");
static_assert(offsetof(ABP_Mailbox_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_Mailbox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, AkCulled) == 0x0002B0, "Member 'ABP_Mailbox_C::AkCulled' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, NS_gotMail) == 0x0002B8, "Member 'ABP_Mailbox_C::NS_gotMail' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, Root_vfx) == 0x0002C0, "Member 'ABP_Mailbox_C::Root_vfx' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, ProximityChecker) == 0x0002C8, "Member 'ABP_Mailbox_C::ProximityChecker' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, SM_Mailbox_Owl_TrapDoor) == 0x0002D0, "Member 'ABP_Mailbox_C::SM_Mailbox_Owl_TrapDoor' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, SM_Mailbox_Owl_NoMail) == 0x0002D8, "Member 'ABP_Mailbox_C::SM_Mailbox_Owl_NoMail' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, SM_Mailbox_Owl_GotMail) == 0x0002E0, "Member 'ABP_Mailbox_C::SM_Mailbox_Owl_GotMail' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, SM_Mailbox_Owl_Base) == 0x0002E8, "Member 'ABP_Mailbox_C::SM_Mailbox_Owl_Base' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, BP_InteractablePlateWidgetComponent) == 0x0002F0, "Member 'ABP_Mailbox_C::BP_InteractablePlateWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, Interactable) == 0x0002F8, "Member 'ABP_Mailbox_C::Interactable' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, InteractableCollider) == 0x000300, "Member 'ABP_Mailbox_C::InteractableCollider' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, DefaultSceneRoot) == 0x000308, "Member 'ABP_Mailbox_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, WasInitialized) == 0x000310, "Member 'ABP_Mailbox_C::WasInitialized' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, AudioMailIdleLoop) == 0x000318, "Member 'ABP_Mailbox_C::AudioMailIdleLoop' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, CachedMailboxOwnerVC) == 0x000320, "Member 'ABP_Mailbox_C::CachedMailboxOwnerVC' has a wrong offset!");
static_assert(offsetof(ABP_Mailbox_C, RepHasMail) == 0x000328, "Member 'ABP_Mailbox_C::RepHasMail' has a wrong offset!");

}

