#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mask

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Mask.BP_Mask_C.Add Mask Mesh to Draw
// 0x0160 (0x0160 - 0x0000)
struct BP_Mask_C_Add_Mask_Mesh_to_Draw final
{
public:
	TArray<class UMeshComponent*>                 Mesh_Array;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          Dynamic;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6144[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6145[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component_1;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6146[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6147[0x1];                                     // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue;                // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue_1;              // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_3;          // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0137(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           K2Node_Select_Default;                             // 0x0138(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           K2Node_Select_Default_1;                           // 0x0148(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mask_C_Add_Mask_Mesh_to_Draw) == 0x000008, "Wrong alignment on BP_Mask_C_Add_Mask_Mesh_to_Draw");
static_assert(sizeof(BP_Mask_C_Add_Mask_Mesh_to_Draw) == 0x000160, "Wrong size on BP_Mask_C_Add_Mask_Mesh_to_Draw");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, Mesh_Array) == 0x000000, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::Mesh_Array' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, Dynamic) == 0x000010, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::Dynamic' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000028, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, K2Node_DynamicCast_AsStatic_Mesh_Component_1) == 0x000038, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::K2Node_DynamicCast_AsStatic_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_GetOwner_ReturnValue_1) == 0x000050, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_GetObjectName_ReturnValue) == 0x000088, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Contains_ReturnValue) == 0x000099, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Contains_ReturnValue_1) == 0x00009A, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000B8, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Vector_GetAbs_ReturnValue) == 0x0000D0, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Vector_GetAbs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Vector_GetAbs_ReturnValue_1) == 0x0000E8, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Vector_GetAbs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_BreakVector_X) == 0x000100, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_BreakVector_Y) == 0x000108, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_BreakVector_Z) == 0x000110, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_BreakVector_X_1) == 0x000118, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_BreakVector_Y_1) == 0x000120, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_BreakVector_Z_1) == 0x000128, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000130, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000131, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000132, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Less_DoubleDouble_ReturnValue_3) == 0x000133, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Less_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_BooleanAND_ReturnValue) == 0x000134, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_BooleanAND_ReturnValue_1) == 0x000135, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, Temp_bool_Variable) == 0x000136, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, Temp_bool_Variable_1) == 0x000137, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, K2Node_Select_Default) == 0x000138, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, K2Node_Select_Default_1) == 0x000148, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Array_Add_ReturnValue) == 0x000158, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_Add_Mask_Mesh_to_Draw, CallFunc_Array_Add_ReturnValue_1) == 0x00015C, "Member 'BP_Mask_C_Add_Mask_Mesh_to_Draw::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_Mask.BP_Mask_C.ExecuteUbergraph_BP_Mask
// 0x01C8 (0x01C8 - 0x0000)
struct BP_Mask_C_ExecuteUbergraph_BP_Mask final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6148[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6149[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_1;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614A[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHousingPlotActor*                      CallFunc_GetCurrentHousingPlot_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614B[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ClientGetAllOutdoorDecorActorsDirtyId_ReturnValue; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_ClientGetAllOutdoorDecorActors_ReturnValue; // 0x0080(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614C[0x2];                                     // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsPlacing_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614D[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614E[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614F[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6150[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6151[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_2;          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6152[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue;                // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6153[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_2;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x01BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mask_C_ExecuteUbergraph_BP_Mask) == 0x000008, "Wrong alignment on BP_Mask_C_ExecuteUbergraph_BP_Mask");
static_assert(sizeof(BP_Mask_C_ExecuteUbergraph_BP_Mask) == 0x0001C8, "Wrong size on BP_Mask_C_ExecuteUbergraph_BP_Mask");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, EntryPoint) == 0x000000, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, Temp_int_Loop_Counter_Variable_1) == 0x000008, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, Temp_int_Loop_Counter_Variable_2) == 0x000018, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Add_IntInt_ReturnValue_2) == 0x00001C, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_GetPlayerController_ReturnValue_1) == 0x000030, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_K2_GetPawn_ReturnValue) == 0x000038, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000040, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, K2Node_DynamicCast_AsValeria_Character) == 0x000048, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, K2Node_DynamicCast_AsValeria_Character_1) == 0x000058, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::K2Node_DynamicCast_AsValeria_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000068, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_GetCurrentHousingPlot_ReturnValue) == 0x000070, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_GetCurrentHousingPlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_ClientGetAllOutdoorDecorActorsDirtyId_ReturnValue) == 0x00007C, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_ClientGetAllOutdoorDecorActorsDirtyId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_ClientGetAllOutdoorDecorActors_ReturnValue) == 0x000080, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_ClientGetAllOutdoorDecorActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_IsValid_ReturnValue_1) == 0x00009C, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Less_IntInt_ReturnValue) == 0x00009D, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0000A0, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_IsPlacing_ReturnValue) == 0x0000B0, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_IsPlacing_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Array_Length_ReturnValue_1) == 0x0000B4, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Array_Length_ReturnValue_2) == 0x0000BC, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000C0, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000C8, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_BreakVector_X) == 0x0000E0, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_BreakVector_Y) == 0x0000E8, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, Temp_int_Array_Index_Variable_1) == 0x0000F8, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Array_Get_Item_1) == 0x000100, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_IsValid_ReturnValue_2) == 0x000108, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_GetPlayerController_ReturnValue_2) == 0x000110, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_K2_GetPawn_ReturnValue_2) == 0x000118, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_K2_GetPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, K2Node_DynamicCast_AsValeria_Character_2) == 0x000120, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::K2Node_DynamicCast_AsValeria_Character_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_HasAuthority_ReturnValue) == 0x000129, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000130, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_BreakVector_X_1) == 0x000148, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_BreakVector_Y_1) == 0x000150, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_BreakVector_Z_1) == 0x000158, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000160, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Vector_GetAbs_ReturnValue) == 0x000178, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Vector_GetAbs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, Temp_int_Array_Index_Variable_2) == 0x000190, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_BreakVector_X_2) == 0x000198, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_BreakVector_Y_2) == 0x0001A0, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_BreakVector_Z_2) == 0x0001A8, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Array_Get_Item_2) == 0x0001B0, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0001B8, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_IsValid_ReturnValue_3) == 0x0001B9, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0001BA, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_BooleanAND_ReturnValue) == 0x0001BB, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_HasAuthority_ReturnValue_1) == 0x0001BC, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001BD, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_BooleanOR_ReturnValue) == 0x0001BE, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x0001BF, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x0001C0, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Mask_C_ExecuteUbergraph_BP_Mask, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x0001C4, "Member 'BP_Mask_C_ExecuteUbergraph_BP_Mask::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");

// Function BP_Mask.BP_Mask_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Mask_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mask_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Mask_C_ReceiveTick");
static_assert(sizeof(BP_Mask_C_ReceiveTick) == 0x000004, "Wrong size on BP_Mask_C_ReceiveTick");
static_assert(offsetof(BP_Mask_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Mask_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

