#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Master_lampGeneralTypeA

#include "Basic.hpp"

#include "Enum_vfx_lightType_structs.hpp"
#include "Enum_vfx_lightOptionsA_structs.hpp"
#include "Enum_core_Scalability_structs.hpp"
#include "S6Core_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Master_lampGeneralTypeA.BP_Master_lampGeneralTypeA_C.event_dayOrNight
// 0x0001 (0x0001 - 0x0000)
struct BP_Master_lampGeneralTypeA_C_Event_dayOrNight final
{
public:
	bool                                          bIsNight;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Master_lampGeneralTypeA_C_Event_dayOrNight) == 0x000001, "Wrong alignment on BP_Master_lampGeneralTypeA_C_Event_dayOrNight");
static_assert(sizeof(BP_Master_lampGeneralTypeA_C_Event_dayOrNight) == 0x000001, "Wrong size on BP_Master_lampGeneralTypeA_C_Event_dayOrNight");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_Event_dayOrNight, bIsNight) == 0x000000, "Member 'BP_Master_lampGeneralTypeA_C_Event_dayOrNight::bIsNight' has a wrong offset!");

// Function BP_Master_lampGeneralTypeA.BP_Master_lampGeneralTypeA_C.event_lightStatus
// 0x0001 (0x0001 - 0x0000)
struct BP_Master_lampGeneralTypeA_C_Event_lightStatus final
{
public:
	bool                                          TurnOn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Master_lampGeneralTypeA_C_Event_lightStatus) == 0x000001, "Wrong alignment on BP_Master_lampGeneralTypeA_C_Event_lightStatus");
static_assert(sizeof(BP_Master_lampGeneralTypeA_C_Event_lightStatus) == 0x000001, "Wrong size on BP_Master_lampGeneralTypeA_C_Event_lightStatus");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_Event_lightStatus, TurnOn) == 0x000000, "Member 'BP_Master_lampGeneralTypeA_C_Event_lightStatus::TurnOn' has a wrong offset!");

// Function BP_Master_lampGeneralTypeA.BP_Master_lampGeneralTypeA_C.ExecuteUbergraph_BP_Master_lampGeneralTypeA
// 0x0348 (0x0348 - 0x0000)
struct BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_lightType                            Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_lightType                            Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_lightType                            Temp_byte_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_lightType                            Temp_byte_Variable_4;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_lightOptionsA                        Temp_byte_Variable_5;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_13;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_14;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_15;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4740[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaWeather*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValEnvironmentManager*                 CallFunc_GetCurrentEnvManager_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETimeOfDayPeriod                              CallFunc_GetTimeOfDayPeriod_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4741[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ETimeOfDayPeriod Period)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4742[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_lighting;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_16;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_turnOn;                         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4743[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorLinearColor_ReturnValue; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4744[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4745[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_17;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4746[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue;                // 0x00D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue_1;              // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsNight;                       // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4747[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_18;                             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_19;                             // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_20;                             // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_21;                             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4748[0x6];                                     // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4749[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        K2Node_Select_Default;                             // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474A[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        K2Node_Select_Default_1;                           // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474B[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_Select_Default_2;                           // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_lightOptionsA                        Temp_byte_Variable_6;                              // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474C[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkRoomComponent*                       CallFunc_GetAkAudioRoomAtLocation_HighestPriorityRoom; // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UAkRoomComponent*>               CallFunc_GetAkAudioRoomAtLocation_AllRooms;        // 0x0178(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474D[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UComp_CV_Local_RTPC_C*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            Temp_byte_Variable_7;                              // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_3;                           // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474E[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue_1;            // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474F[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_22;                             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4750[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_23;                             // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_lightType                            Temp_byte_Variable_8;                              // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_4;                           // 0x01F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_5;                           // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_24;                             // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4751[0x1];                                     // 0x01FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_25;                             // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_6;                           // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_lightType                            Temp_byte_Variable_9;                              // 0x020E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4752[0x1];                                     // 0x020F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_7;                           // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4753[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4754[0x1];                                     // 0x023B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_lightType                            Temp_byte_Variable_10;                             // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4755[0x6];                                     // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_8;                           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_lightType                            Temp_byte_Variable_11;                             // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_26;                             // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4756[0x2];                                     // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_9;                           // 0x0254(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_10;                          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4757[0x5];                                     // 0x026B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_27;                             // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_lightType                            Temp_byte_Variable_12;                             // 0x027F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_11;                          // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeOfDayPeriod                              K2Node_CustomEvent_period;                         // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_28;                             // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_29;                             // 0x0286(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4758[0x1];                                     // 0x0287(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_12;                          // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4759[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent;              // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID;               // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_475A[0x2];                                     // 0x02B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent_1;            // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID_1;             // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast_1;       // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast;       // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast_2;       // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast_3;       // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_NewEnumerator5_ImplicitCast;         // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_NewEnumerator0_ImplicitCast;         // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_475B[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_tick_myLighting_lighting_ImplicitCast;    // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_tick_myLighting_lighting_ImplicitCast_1;  // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_tick_myLighting_lighting_ImplicitCast_2;  // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_tick_myLighting_lighting_ImplicitCast_3;  // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA) == 0x000008, "Wrong alignment on BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA");
static_assert(sizeof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA) == 0x000348, "Wrong size on BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, EntryPoint) == 0x000000, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable) == 0x000004, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_1) == 0x000005, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_2) == 0x000006, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_byte_Variable) == 0x000007, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_byte_Variable_1) == 0x000008, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_byte_Variable_2) == 0x000009, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_byte_Variable_3) == 0x00000A, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_3) == 0x00000B, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_4) == 0x00000C, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_5) == 0x00000D, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_6) == 0x00000E, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_7) == 0x00000F, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_8) == 0x000010, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_9) == 0x000011, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_10) == 0x000012, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_byte_Variable_4) == 0x000013, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_11) == 0x000014, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_12) == 0x000015, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_byte_Variable_5) == 0x000016, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_13) == 0x000017, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_14) == 0x000018, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_15) == 0x000019, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000020, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_GetCurrentEnvManager_ReturnValue) == 0x000028, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_GetCurrentEnvManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_GetTimeOfDayPeriod_ReturnValue) == 0x000030, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_GetTimeOfDayPeriod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_SwitchEnum_CmpSuccess) == 0x000044, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_IsValid_ReturnValue) == 0x000045, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_RandomFloatInRange_ReturnValue) == 0x000048, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_CustomEvent_lighting) == 0x000050, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_CustomEvent_lighting' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x000068, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_16) == 0x000070, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_CustomEvent_turnOn) == 0x000071, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_CustomEvent_turnOn' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000078, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000080, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_Lerp_ReturnValue) == 0x000088, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_Multiply_LinearColorLinearColor_ReturnValue) == 0x000090, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_Multiply_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000A0, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_LinearColorLerp_ReturnValue) == 0x0000A4, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x0000B8, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000BC, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0000C0, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000C8, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_17) == 0x0000D0, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_GetLightColor_ReturnValue) == 0x0000D4, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_GetLightColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_GetLightColor_ReturnValue_1) == 0x0000E4, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_GetLightColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_CustomEvent_bIsNight) == 0x0000F4, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_CustomEvent_bIsNight' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_int_Array_Index_Variable) == 0x0000F8, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_18) == 0x0000FC, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_19) == 0x0000FD, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_20) == 0x0000FE, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_20' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_IsServer_ReturnValue) == 0x0000FF, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_bool_Variable_21) == 0x000100, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_bool_Variable_21' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_Not_PreBool_ReturnValue) == 0x000101, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_MakeArray_Array) == 0x000108, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_SwitchEnum_CmpSuccess_1) == 0x000118, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_Select_Default) == 0x000120, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_int_Loop_Counter_Variable) == 0x000128, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_Select_Default_1) == 0x000130, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_Add_IntInt_ReturnValue) == 0x000138, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_GetPlatformType_ReturnValue) == 0x00013C, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_Lerp_ReturnValue_1) == 0x000140, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_Select_Default_2) == 0x000148, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_SwitchEnum_CmpSuccess_2) == 0x000150, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, K2Node_SwitchEnum_CmpSuccess_3) == 0x000151, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, Temp_byte_Variable_6) == 0x000152, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_SetStaticMesh_ReturnValue) == 0x000153, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000158, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_GetAkAudioRoomAtLocation_HighestPriorityRoom) == 0x000170, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_GetAkAudioRoomAtLocation_HighestPriorityRoom' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_GetAkAudioRoomAtLocation_AllRooms) == 0x000178, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_GetAkAudioRoomAtLocation_AllRooms' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_IsValid_ReturnValue_1) == 0x000188, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA, CallFunc_GetOwner_ReturnValue) == 0x000190, "Member 'BP_Master_lampGeneralTypeA_C_ExecuteUbergraph_BP_Master_lampGeneralTypeA::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
