#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ModalInterface_RepairStation

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ModalInterface_RepairStation.BP_ModalInterface_RepairStation_C.InitPostOpenModalWidget
// 0x0018 (0x0018 - 0x0000)
struct BP_ModalInterface_RepairStation_C_InitPostOpenModalWidget final
{
public:
	bool                                          ShouldEnableGoldRepair;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RepairStationActor;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowRepairKitsFromStorage;                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ModalInterface_RepairStation_C_InitPostOpenModalWidget) == 0x000008, "Wrong alignment on BP_ModalInterface_RepairStation_C_InitPostOpenModalWidget");
static_assert(sizeof(BP_ModalInterface_RepairStation_C_InitPostOpenModalWidget) == 0x000018, "Wrong size on BP_ModalInterface_RepairStation_C_InitPostOpenModalWidget");
static_assert(offsetof(BP_ModalInterface_RepairStation_C_InitPostOpenModalWidget, ShouldEnableGoldRepair) == 0x000000, "Member 'BP_ModalInterface_RepairStation_C_InitPostOpenModalWidget::ShouldEnableGoldRepair' has a wrong offset!");
static_assert(offsetof(BP_ModalInterface_RepairStation_C_InitPostOpenModalWidget, RepairStationActor) == 0x000008, "Member 'BP_ModalInterface_RepairStation_C_InitPostOpenModalWidget::RepairStationActor' has a wrong offset!");
static_assert(offsetof(BP_ModalInterface_RepairStation_C_InitPostOpenModalWidget, AllowRepairKitsFromStorage) == 0x000010, "Member 'BP_ModalInterface_RepairStation_C_InitPostOpenModalWidget::AllowRepairKitsFromStorage' has a wrong offset!");

}

