#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ModalInterface_PMenu

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BP_ModalInterface_PMenu.BP_ModalInterface_PMenu_C.SetMode
// 0x0001 (0x0001 - 0x0000)
struct BP_ModalInterface_PMenu_C_SetMode final
{
public:
	EVAL_GameplayMenuMode                         Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ModalInterface_PMenu_C_SetMode) == 0x000001, "Wrong alignment on BP_ModalInterface_PMenu_C_SetMode");
static_assert(sizeof(BP_ModalInterface_PMenu_C_SetMode) == 0x000001, "Wrong size on BP_ModalInterface_PMenu_C_SetMode");
static_assert(offsetof(BP_ModalInterface_PMenu_C_SetMode, Mode) == 0x000000, "Member 'BP_ModalInterface_PMenu_C_SetMode::Mode' has a wrong offset!");

// Function BP_ModalInterface_PMenu.BP_ModalInterface_PMenu_C.ToggleMode
// 0x0001 (0x0001 - 0x0000)
struct BP_ModalInterface_PMenu_C_ToggleMode final
{
public:
	EVAL_GameplayMenuMode                         Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ModalInterface_PMenu_C_ToggleMode) == 0x000001, "Wrong alignment on BP_ModalInterface_PMenu_C_ToggleMode");
static_assert(sizeof(BP_ModalInterface_PMenu_C_ToggleMode) == 0x000001, "Wrong size on BP_ModalInterface_PMenu_C_ToggleMode");
static_assert(offsetof(BP_ModalInterface_PMenu_C_ToggleMode, Mode) == 0x000000, "Member 'BP_ModalInterface_PMenu_C_ToggleMode::Mode' has a wrong offset!");

}

