#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mask.BP_Mask_C
// 0x0090 (0x0338 - 0x02A8)
class ABP_Mask_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MakePosition;                                      // 0x02B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaceSet;                                        // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNewActorPlaced;                                  // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaceStatChange;                                 // 0x02D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6142[0x5];                                     // 0x02D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           GrassMaskMesh;                                     // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           LanscapeMaskMesh;                                  // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class AActor*>                         MaskObjects;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         LastMaskDirtyId;                                   // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6143[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           GrassMaskMesh_Dynamic;                             // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           LanscapeMaskMesh_Dynamic;                          // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          LastPlaceState;                                    // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Mask_Mesh_to_Draw(TArray<class UMeshComponent*>& Mesh_Array, bool Dynamic, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, class UMeshComponent* CallFunc_Array_Get_Item, class UStaticMeshComponent* K2Node_DynamicCast_AsStatic_Mesh_Component, bool K2Node_DynamicCast_bSuccess, class UStaticMeshComponent* K2Node_DynamicCast_AsStatic_Mesh_Component_1, bool K2Node_DynamicCast_bSuccess_1, class AActor* CallFunc_GetOwner_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const class FString& CallFunc_GetObjectName_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Contains_ReturnValue, bool CallFunc_Contains_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Vector_GetAbs_ReturnValue, const struct FVector& CallFunc_Vector_GetAbs_ReturnValue_1, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue_1, bool CallFunc_Less_DoubleDouble_ReturnValue_2, bool CallFunc_Less_DoubleDouble_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool Temp_bool_Variable, bool Temp_bool_Variable_1, TArray<class UStaticMeshComponent*>& K2Node_Select_Default, TArray<class UStaticMeshComponent*>& K2Node_Select_Default_1, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1);
	void ExecuteUbergraph_BP_Mask(int32 EntryPoint, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, float K2Node_Event_DeltaSeconds, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, class APawn* CallFunc_K2_GetPawn_ReturnValue, class APawn* CallFunc_K2_GetPawn_ReturnValue_1, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character_1, bool K2Node_DynamicCast_bSuccess_1, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, class AHousingPlotActor* CallFunc_GetCurrentHousingPlot_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_ClientGetAllOutdoorDecorActorsDirtyId_ReturnValue, TArray<class AActor*>& CallFunc_ClientGetAllOutdoorDecorActors_ReturnValue, class AActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, TArray<class UStaticMeshComponent*>& CallFunc_K2_GetComponentsByClass_ReturnValue, bool CallFunc_IsPlacing_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, int32 Temp_int_Array_Index_Variable_1, class UStaticMeshComponent* CallFunc_Array_Get_Item_1, bool CallFunc_IsValid_ReturnValue_2, class APlayerController* CallFunc_GetPlayerController_ReturnValue_2, class APawn* CallFunc_K2_GetPawn_ReturnValue_2, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character_2, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_HasAuthority_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_1, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Vector_GetAbs_ReturnValue, int32 Temp_int_Array_Index_Variable_2, double CallFunc_BreakVector_X_2, double CallFunc_BreakVector_Y_2, double CallFunc_BreakVector_Z_2, class UStaticMeshComponent* CallFunc_Array_Get_Item_2, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_Less_DoubleDouble_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_HasAuthority_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_EqualEqual_BoolBool_ReturnValue, float CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast, float CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mask_C">();
	}
	static class ABP_Mask_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mask_C>();
	}
};
static_assert(alignof(ABP_Mask_C) == 0x000008, "Wrong alignment on ABP_Mask_C");
static_assert(sizeof(ABP_Mask_C) == 0x000338, "Wrong size on ABP_Mask_C");
static_assert(offsetof(ABP_Mask_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_Mask_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_Mask_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, MakePosition) == 0x0002B8, "Member 'ABP_Mask_C::MakePosition' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, IsPlaceSet) == 0x0002D0, "Member 'ABP_Mask_C::IsPlaceSet' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, IsNewActorPlaced) == 0x0002D1, "Member 'ABP_Mask_C::IsNewActorPlaced' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, IsPlaceStatChange) == 0x0002D2, "Member 'ABP_Mask_C::IsPlaceStatChange' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, GrassMaskMesh) == 0x0002D8, "Member 'ABP_Mask_C::GrassMaskMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, LanscapeMaskMesh) == 0x0002E8, "Member 'ABP_Mask_C::LanscapeMaskMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, MaskObjects) == 0x0002F8, "Member 'ABP_Mask_C::MaskObjects' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, LastMaskDirtyId) == 0x000308, "Member 'ABP_Mask_C::LastMaskDirtyId' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, GrassMaskMesh_Dynamic) == 0x000310, "Member 'ABP_Mask_C::GrassMaskMesh_Dynamic' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, LanscapeMaskMesh_Dynamic) == 0x000320, "Member 'ABP_Mask_C::LanscapeMaskMesh_Dynamic' has a wrong offset!");
static_assert(offsetof(ABP_Mask_C, LastPlaceState) == 0x000330, "Member 'ABP_Mask_C::LastPlaceState' has a wrong offset!");

}

