#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainHouse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MainHouse.BP_MainHouse_C.DayNightEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_MainHouse_C_DayNightEvent final
{
public:
	bool                                          bIsNight;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainHouse_C_DayNightEvent) == 0x000001, "Wrong alignment on BP_MainHouse_C_DayNightEvent");
static_assert(sizeof(BP_MainHouse_C_DayNightEvent) == 0x000001, "Wrong size on BP_MainHouse_C_DayNightEvent");
static_assert(offsetof(BP_MainHouse_C_DayNightEvent, bIsNight) == 0x000000, "Member 'BP_MainHouse_C_DayNightEvent::bIsNight' has a wrong offset!");

// Function BP_MainHouse.BP_MainHouse_C.ExecuteUbergraph_BP_MainHouse
// 0x02D0 (0x02D0 - 0x0000)
struct BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsNight;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B62[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B63[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B64[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaWeather*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValEnvironmentManager*                 CallFunc_GetCurrentEnvManager_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsNight)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsNightTime_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B65[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children_1;         // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B66[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B67[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_RotatorRotator_ReturnValue;    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B68[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B69[0x6];                                     // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse) == 0x000008, "Wrong alignment on BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse");
static_assert(sizeof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse) == 0x0002D0, "Wrong size on BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, EntryPoint) == 0x000000, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, K2Node_CustomEvent_bIsNight) == 0x000004, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::K2Node_CustomEvent_bIsNight' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_IsServer_ReturnValue) == 0x000020, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000024, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, Temp_int_Variable) == 0x000028, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_IsVisible_ReturnValue) == 0x00002C, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000030, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_GetCurrentEnvManager_ReturnValue) == 0x000038, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_GetCurrentEnvManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_GetIsNightTime_ReturnValue) == 0x000050, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_GetIsNightTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_GetChildrenComponents_Children) == 0x000058, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_GetChildrenComponents_Children_1) == 0x000068, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_GetChildrenComponents_Children_1' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00007C, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000080, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_Conv_IntToString_ReturnValue) == 0x0000A8, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_RInterpTo_ReturnValue) == 0x0000B8, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_EqualEqual_RotatorRotator_ReturnValue) == 0x0000D0, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_EqualEqual_RotatorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_VInterpTo_ReturnValue) == 0x0000D8, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000F0, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0001D8, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_BooleanAND_ReturnValue) == 0x0001D9, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0001E0, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x0002C8, "Member 'BP_MainHouse_C_ExecuteUbergraph_BP_MainHouse::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

// Function BP_MainHouse.BP_MainHouse_C.turnOn
// 0x0001 (0x0001 - 0x0000)
struct BP_MainHouse_C_TurnOn final
{
public:
	bool                                          Param_TurnOn;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainHouse_C_TurnOn) == 0x000001, "Wrong alignment on BP_MainHouse_C_TurnOn");
static_assert(sizeof(BP_MainHouse_C_TurnOn) == 0x000001, "Wrong size on BP_MainHouse_C_TurnOn");
static_assert(offsetof(BP_MainHouse_C_TurnOn, Param_TurnOn) == 0x000000, "Member 'BP_MainHouse_C_TurnOn::Param_TurnOn' has a wrong offset!");

}

