#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NewInboundGuildInvitationNotificationBuilder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S6BlueprintExtensionsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NewInboundGuildInvitationNotificationBuilder.BP_NewInboundGuildInvitationNotificationBuilder_C
// 0x0060 (0x0088 - 0x0028)
class UBP_NewInboundGuildInvitationNotificationBuilder_C final : public US6BPFunctorObjectBase
{
public:
	class APlayerController*                      Owning_Player;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              PlayerGuildManager;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FGuid                                  PlayerGuildId;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       InviterId;                                         // 0x0048(0x0030)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFinishedBuilding;                                // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CreateIncomingInvitationWidget(TSoftClassPtr<class UClass> WidgetClass, const struct FGuid& Param_PlayerGuildId, const struct FUniqueNetIdRepl& Param_InviterId, class UUserWidget** NewWidget, bool CallFunc_IsDesktop_ReturnValue, class UClass* CallFunc_LoadClassAsset_Blocking_ReturnValue, class UClass* K2Node_ClassDynamicCast_AsUser_Widget, bool K2Node_ClassDynamicCast_bSuccess, class UUserWidget* CallFunc_Create_ReturnValue, bool CallFunc_IsMobile_ReturnValue, class UWBP_Notification_NewInboundGuildInvitation_PF_C* K2Node_DynamicCast_AsWBP_Notification_New_Inbound_Guild_Invitation_PF, bool K2Node_DynamicCast_bSuccess, class UWBP_Notification_NewInboundGuildInvitation_CM_C* K2Node_DynamicCast_AsWBP_Notification_New_Inbound_Guild_Invitation_CM, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsConsole_ReturnValue);
	void Handle_Get_Player_Guild_Succeeded(const struct FVAL_PlayerGuild& PlayerGuild, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, TSoftClassPtr<class UClass> CallFunc_RedirectStateType_ReturnValue, class UUserWidget* CallFunc_CreateIncomingInvitationWidget_NewWidget);
	void HandleGetNeighborgoodFailed(const class FString& ErrorMessage);
	void OnFinishedBuilding__DelegateSignature(class UBP_NewInboundGuildInvitationNotificationBuilder_C* Builder, class UWidget* BuiltNotification);
	void StartBuilding(class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, TSoftClassPtr<class UClass> CallFunc_RedirectStateType_ReturnValue, TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(const struct FVAL_PlayerGuild& PlayerGuild)> K2Node_CreateDelegate_OutputDelegate_1, class UUserWidget* CallFunc_CreateIncomingInvitationWidget_NewWidget, const struct FVAL_PlayerGuild& CallFunc_TryGetPlayerGuild_OutPlayerGuildInfo, bool CallFunc_TryGetPlayerGuild_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NewInboundGuildInvitationNotificationBuilder_C">();
	}
	static class UBP_NewInboundGuildInvitationNotificationBuilder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NewInboundGuildInvitationNotificationBuilder_C>();
	}
};
static_assert(alignof(UBP_NewInboundGuildInvitationNotificationBuilder_C) == 0x000008, "Wrong alignment on UBP_NewInboundGuildInvitationNotificationBuilder_C");
static_assert(sizeof(UBP_NewInboundGuildInvitationNotificationBuilder_C) == 0x000088, "Wrong size on UBP_NewInboundGuildInvitationNotificationBuilder_C");
static_assert(offsetof(UBP_NewInboundGuildInvitationNotificationBuilder_C, Owning_Player) == 0x000028, "Member 'UBP_NewInboundGuildInvitationNotificationBuilder_C::Owning_Player' has a wrong offset!");
static_assert(offsetof(UBP_NewInboundGuildInvitationNotificationBuilder_C, PlayerGuildManager) == 0x000030, "Member 'UBP_NewInboundGuildInvitationNotificationBuilder_C::PlayerGuildManager' has a wrong offset!");
static_assert(offsetof(UBP_NewInboundGuildInvitationNotificationBuilder_C, PlayerGuildId) == 0x000038, "Member 'UBP_NewInboundGuildInvitationNotificationBuilder_C::PlayerGuildId' has a wrong offset!");
static_assert(offsetof(UBP_NewInboundGuildInvitationNotificationBuilder_C, InviterId) == 0x000048, "Member 'UBP_NewInboundGuildInvitationNotificationBuilder_C::InviterId' has a wrong offset!");
static_assert(offsetof(UBP_NewInboundGuildInvitationNotificationBuilder_C, OnFinishedBuilding) == 0x000078, "Member 'UBP_NewInboundGuildInvitationNotificationBuilder_C::OnFinishedBuilding' has a wrong offset!");

}

