#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NotificationFactory_PreGame

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_NotificationFactory_PreGame.BP_NotificationFactory_PreGame_C.Add Generic Notification To Queue
// 0x00E0 (0x00E0 - 0x0000)
struct BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue final
{
public:
	struct FNotification                          Notification;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftClassPtr<class UClass>                   NotificationWidgetClass;                           // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DEE[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DEF[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0080(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_NotificationInterface_Simple_C> K2Node_DynamicCast_AsBP_Notification_Interface_Simple; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DF0[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_PushNotification_ReturnValue;             // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue) == 0x000008, "Wrong alignment on BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue");
static_assert(sizeof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue) == 0x0000E0, "Wrong size on BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, Notification) == 0x000000, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::Notification' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, NotificationWidgetClass) == 0x000030, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::NotificationWidgetClass' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000058, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000068, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, K2Node_ClassDynamicCast_AsUser_Widget) == 0x000070, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::K2Node_ClassDynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, K2Node_ClassDynamicCast_bSuccess) == 0x000078, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000080, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, CallFunc_GetValeriaPlayerController_Controller) == 0x0000A8, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::CallFunc_GetValeriaPlayerController_Controller' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, K2Node_DynamicCast_AsBP_Notification_Interface_Simple) == 0x0000B8, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::K2Node_DynamicCast_AsBP_Notification_Interface_Simple' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue, CallFunc_PushNotification_ReturnValue) == 0x0000CC, "Member 'BP_NotificationFactory_PreGame_C_Add_Generic_Notification_To_Queue::CallFunc_PushNotification_ReturnValue' has a wrong offset!");

// Function BP_NotificationFactory_PreGame.BP_NotificationFactory_PreGame_C.GetValeriaPlayerController
// 0x0038 (0x0038 - 0x0000)
struct BP_NotificationFactory_PreGame_C_GetValeriaPlayerController final
{
public:
	class AVAL_PlayerControllerBase*              Controller;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_DynamicCast_AsWidget;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DF1[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              K2Node_DynamicCast_AsVAL_Player_Controller_Base;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NotificationFactory_PreGame_C_GetValeriaPlayerController) == 0x000008, "Wrong alignment on BP_NotificationFactory_PreGame_C_GetValeriaPlayerController");
static_assert(sizeof(BP_NotificationFactory_PreGame_C_GetValeriaPlayerController) == 0x000038, "Wrong size on BP_NotificationFactory_PreGame_C_GetValeriaPlayerController");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_GetValeriaPlayerController, Controller) == 0x000000, "Member 'BP_NotificationFactory_PreGame_C_GetValeriaPlayerController::Controller' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_GetValeriaPlayerController, CallFunc_GetOuterObject_ReturnValue) == 0x000008, "Member 'BP_NotificationFactory_PreGame_C_GetValeriaPlayerController::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_GetValeriaPlayerController, K2Node_DynamicCast_AsWidget) == 0x000010, "Member 'BP_NotificationFactory_PreGame_C_GetValeriaPlayerController::K2Node_DynamicCast_AsWidget' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_GetValeriaPlayerController, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_NotificationFactory_PreGame_C_GetValeriaPlayerController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_GetValeriaPlayerController, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'BP_NotificationFactory_PreGame_C_GetValeriaPlayerController::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_GetValeriaPlayerController, K2Node_DynamicCast_AsVAL_Player_Controller_Base) == 0x000028, "Member 'BP_NotificationFactory_PreGame_C_GetValeriaPlayerController::K2Node_DynamicCast_AsVAL_Player_Controller_Base' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_GetValeriaPlayerController, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_NotificationFactory_PreGame_C_GetValeriaPlayerController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_NotificationFactory_PreGame.BP_NotificationFactory_PreGame_C.HandleOnGenericNotificationRequested
// 0x0090 (0x0090 - 0x0000)
struct BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested final
{
public:
	struct FNotification                          Notification;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DF2[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVALUI_NotificationWidgetInterface> K2Node_DynamicCast_AsVALUI_Notification_Widget_Interface; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DF3[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetLastNotificationOnStack_ReturnValue;   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0060(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesNotification_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested) == 0x000008, "Wrong alignment on BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested");
static_assert(sizeof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested) == 0x000090, "Wrong size on BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested, Notification) == 0x000000, "Member 'BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested::Notification' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000030, "Member 'BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested, K2Node_DynamicCast_AsVALUI_Notification_Widget_Interface) == 0x000040, "Member 'BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested::K2Node_DynamicCast_AsVALUI_Notification_Widget_Interface' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested, CallFunc_DoesImplementInterface_ReturnValue) == 0x000051, "Member 'BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested, CallFunc_GetLastNotificationOnStack_ReturnValue) == 0x000058, "Member 'BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested::CallFunc_GetLastNotificationOnStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000060, "Member 'BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested, CallFunc_MatchesNotification_ReturnValue) == 0x000088, "Member 'BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested::CallFunc_MatchesNotification_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'BP_NotificationFactory_PreGame_C_HandleOnGenericNotificationRequested::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_NotificationFactory_PreGame.BP_NotificationFactory_PreGame_C.Initialize
// 0x0018 (0x0018 - 0x0000)
struct BP_NotificationFactory_PreGame_C_Initialize final
{
public:
	TDelegate<void(const struct FNotification& Notification)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NotificationFactory_PreGame_C_Initialize) == 0x000008, "Wrong alignment on BP_NotificationFactory_PreGame_C_Initialize");
static_assert(sizeof(BP_NotificationFactory_PreGame_C_Initialize) == 0x000018, "Wrong size on BP_NotificationFactory_PreGame_C_Initialize");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Initialize, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_NotificationFactory_PreGame_C_Initialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_Initialize, CallFunc_GetValeriaPlayerController_Controller) == 0x000010, "Member 'BP_NotificationFactory_PreGame_C_Initialize::CallFunc_GetValeriaPlayerController_Controller' has a wrong offset!");

// Function BP_NotificationFactory_PreGame.BP_NotificationFactory_PreGame_C.InitializeNotificationQueues
// 0x0018 (0x0018 - 0x0000)
struct BP_NotificationFactory_PreGame_C_InitializeNotificationQueues final
{
public:
	class UVALUI_NotificationQueue*               CallFunc_SpawnObject_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_NotificationQueue*               CallFunc_SpawnObject_ReturnValue_1;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_NotificationQueue*               CallFunc_SpawnObject_ReturnValue_2;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NotificationFactory_PreGame_C_InitializeNotificationQueues) == 0x000008, "Wrong alignment on BP_NotificationFactory_PreGame_C_InitializeNotificationQueues");
static_assert(sizeof(BP_NotificationFactory_PreGame_C_InitializeNotificationQueues) == 0x000018, "Wrong size on BP_NotificationFactory_PreGame_C_InitializeNotificationQueues");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_InitializeNotificationQueues, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'BP_NotificationFactory_PreGame_C_InitializeNotificationQueues::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_InitializeNotificationQueues, CallFunc_SpawnObject_ReturnValue_1) == 0x000008, "Member 'BP_NotificationFactory_PreGame_C_InitializeNotificationQueues::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_PreGame_C_InitializeNotificationQueues, CallFunc_SpawnObject_ReturnValue_2) == 0x000010, "Member 'BP_NotificationFactory_PreGame_C_InitializeNotificationQueues::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");

}

