#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NotificationInterface_SyncInvite_Error

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BP_NotificationInterface_SyncInvite_Error.BP_NotificationInterface_SyncInvite_Error_C.GetFinalErrorText
// 0x0018 (0x0018 - 0x0000)
struct BP_NotificationInterface_SyncInvite_Error_C_GetFinalErrorText final
{
public:
	class FText                                   FinalErrorText;                                    // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_NotificationInterface_SyncInvite_Error_C_GetFinalErrorText) == 0x000008, "Wrong alignment on BP_NotificationInterface_SyncInvite_Error_C_GetFinalErrorText");
static_assert(sizeof(BP_NotificationInterface_SyncInvite_Error_C_GetFinalErrorText) == 0x000018, "Wrong size on BP_NotificationInterface_SyncInvite_Error_C_GetFinalErrorText");
static_assert(offsetof(BP_NotificationInterface_SyncInvite_Error_C_GetFinalErrorText, FinalErrorText) == 0x000000, "Member 'BP_NotificationInterface_SyncInvite_Error_C_GetFinalErrorText::FinalErrorText' has a wrong offset!");

// Function BP_NotificationInterface_SyncInvite_Error.BP_NotificationInterface_SyncInvite_Error_C.InitPrePushNotification
// 0x0010 (0x0010 - 0x0000)
struct BP_NotificationInterface_SyncInvite_Error_C_InitPrePushNotification final
{
public:
	class UInvitation*                            Invitation;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInvitationFailureReason                      FailureReason;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NotificationInterface_SyncInvite_Error_C_InitPrePushNotification) == 0x000008, "Wrong alignment on BP_NotificationInterface_SyncInvite_Error_C_InitPrePushNotification");
static_assert(sizeof(BP_NotificationInterface_SyncInvite_Error_C_InitPrePushNotification) == 0x000010, "Wrong size on BP_NotificationInterface_SyncInvite_Error_C_InitPrePushNotification");
static_assert(offsetof(BP_NotificationInterface_SyncInvite_Error_C_InitPrePushNotification, Invitation) == 0x000000, "Member 'BP_NotificationInterface_SyncInvite_Error_C_InitPrePushNotification::Invitation' has a wrong offset!");
static_assert(offsetof(BP_NotificationInterface_SyncInvite_Error_C_InitPrePushNotification, FailureReason) == 0x000008, "Member 'BP_NotificationInterface_SyncInvite_Error_C_InitPrePushNotification::FailureReason' has a wrong offset!");

}

