#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NotificationFactory_MainWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "CommonInput_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NotificationFactory_MainWidget.BP_NotificationFactory_MainWidget_C
// 0x00F8 (0x0120 - 0x0028)
class UBP_NotificationFactory_MainWidget_C final : public UVALUI_NotificationFactory
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_NotificationQueue*               NotificationQueue_Banner;                          // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVALUI_NotificationQueue*               NotificationQueue_Major;                           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVALUI_NotificationQueue*               NotificationQueue_Minor;                           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVALUI_ItemAcquisitionNotifier*         ItemAcquisitionNotifier;                           // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<ESkillType>                            SkillTypesToWatch;                                 // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ESkillType, struct FSkillPersist>        CurrentSkillLevels;                                // 0x0060(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<class UBP_NewInboundGuildInvitationNotificationBuilder_C*> NewInboundPlayerGuildInvitationNotificationBuilders; // 0x00B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 NotificationContent;                               // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	ECommonInputType                              CurrentInputType;                                  // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasShownControllerWarning;                         // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A7[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerCrossPlatformHelper*     Cross_Platform_Helper;                             // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
