#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NotificationFactory_MainWidget

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "S6PlatformServiceSubsystems_structs.hpp"


namespace SDK::Params
{

// Function BP_NotificationFactory_MainWidget.BP_NotificationFactory_MainWidget_C.Add Generic Notification To Queue
// 0x00F0 (0x00F0 - 0x0000)
struct BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue final
{
public:
	struct FNotification                          Notification;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftClassPtr<class UClass>                   NotificationWidgetClass;                           // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A8[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A9[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0080(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	ENotificationSpecialType                      Temp_byte_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53AA[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller;    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_NotificationQueue*               K2Node_Select_Default;                             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_NotificationInterface_Simple_C> K2Node_DynamicCast_AsBP_Notification_Interface_Simple; // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53AB[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_PushNotification_ReturnValue;             // 0x00DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue) == 0x000008, "Wrong alignment on BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue");
static_assert(sizeof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue) == 0x0000F0, "Wrong size on BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, Notification) == 0x000000, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::Notification' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, NotificationWidgetClass) == 0x000030, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::NotificationWidgetClass' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000060, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000068, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, K2Node_ClassDynamicCast_AsUser_Widget) == 0x000070, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::K2Node_ClassDynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, K2Node_ClassDynamicCast_bSuccess) == 0x000078, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000080, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, Temp_byte_Variable) == 0x0000A8, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, CallFunc_GetValeriaPlayerController_Controller) == 0x0000B0, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::CallFunc_GetValeriaPlayerController_Controller' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, K2Node_Select_Default) == 0x0000C0, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, K2Node_DynamicCast_AsBP_Notification_Interface_Simple) == 0x0000C8, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::K2Node_DynamicCast_AsBP_Notification_Interface_Simple' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue, CallFunc_PushNotification_ReturnValue) == 0x0000DC, "Member 'BP_NotificationFactory_MainWidget_C_Add_Generic_Notification_To_Queue::CallFunc_PushNotification_ReturnValue' has a wrong offset!");

// Function BP_NotificationFactory_MainWidget.BP_NotificationFactory_MainWidget_C.EnqueueNewInboundPlayerGuildInvitationNotifcation
// 0x0028 (0x0028 - 0x0000)
struct BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation final
{
public:
	const class UBP_NewInboundGuildInvitationNotificationBuilder_C* Builder;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                NotificationWidget;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53AC[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_PushNotification_ReturnValue;             // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation) == 0x000008, "Wrong alignment on BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation");
static_assert(sizeof(BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation) == 0x000028, "Wrong size on BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation, Builder) == 0x000000, "Member 'BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation::Builder' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation, NotificationWidget) == 0x000008, "Member 'BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation::NotificationWidget' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation, CallFunc_Set_Remove_ReturnValue) == 0x000010, "Member 'BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation, CallFunc_PushNotification_ReturnValue) == 0x000014, "Member 'BP_NotificationFactory_MainWidget_C_EnqueueNewInboundPlayerGuildInvitationNotifcation::CallFunc_PushNotification_ReturnValue' has a wrong offset!");

// Function BP_NotificationFactory_MainWidget.BP_NotificationFactory_MainWidget_C.ExecuteUbergraph_BP_NotificationFactory_MainWidget
// 0x1660 (0x1660 - 0x0000)
struct BP_NotificationFactory_MainWidget_C_ExecuteUbergraph_BP_NotificationFactory_MainWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53AD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0028(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0040(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0060(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_3;                    // 0x0098(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_CharacterId_1;                  // 0x00A8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_2;                    // 0x00B8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_CharacterId;                    // 0x00C8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_CharacterNameAndId             K2Node_CustomEvent_Name;                           // 0x00D8(0x0030)(ConstParm)
	TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId, struct FOSSVAL_CharacterNameAndId& Name)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_CharacterNameAndId             Temp_struct_Variable;                              // 0x0118(0x0030)()
	struct FGuid                                  Temp_struct_Variable_1;                            // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Temp_struct_Variable_2;                            // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0168(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0180(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01E0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0210(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0270(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0280(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_3;            // 0x02A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x02B8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x02C8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names;                          // 0x02D8(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x02E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable_3;                            // 0x02F8(0x0010)(ReferenceParm)
	struct FGuid                                  Temp_struct_Variable_4;                            // 0x0308(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller;    // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0328(0x0018)()
	class FString                                 CallFunc_GetCharacterName_ReturnValue;             // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0350(0x0050)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x03A0(0x0030)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x03D0(0x0010)(ReferenceParm)
	struct FMessageTarget                         CallFunc_MakeMessageTarget_DirectMessage_ReturnValue; // 0x03E0(0x0028)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0408(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0420(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0448(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0498(0x0010)(ReferenceParm)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_1;  // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x04B0(0x0018)()
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UInvitation*                            K2Node_CustomEvent_Invitation_3;                   // 0x04E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_2;  // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x04F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_3;  // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterName_ReturnValue_1;           // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue_1;                   // 0x0528(0x0030)(HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_4;  // 0x0558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53AE[0x7];                                     // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue; // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53AF[0x7];                                     // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMessageTarget                         CallFunc_MakeMessageTarget_DirectMessage_ReturnValue_1; // 0x0578(0x0028)(HasGetValueTypeHash)
	class UInvitation*                            K2Node_CustomEvent_Invitation_2;                   // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_5;  // 0x05A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x05B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue_1;               // 0x05B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterName_ReturnValue_2;           // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue_2;                   // 0x05D8(0x0030)(HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_6;  // 0x0608(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMessageTarget                         CallFunc_MakeMessageTarget_DirectMessage_ReturnValue_2; // 0x0610(0x0028)(HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_5;    // 0x0638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue_1;                 // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B0[0x7];                                     // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_7;  // 0x0648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue_1; // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Temp_struct_Variable_5;                            // 0x0658(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B1[0x7];                                     // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable_6;                            // 0x0670(0x0010)(ReferenceParm)
	class UInvitation*                            K2Node_CustomEvent_Invitation_1;                   // 0x0680(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0688(0x0018)()
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_8;  // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x06A8(0x0050)(HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_6;    // 0x06F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_7;    // 0x0700(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUserMuted_New_ReturnValue;              // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUserBlocked_ReturnValue;                // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x070A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x070B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_4;                    // 0x070C(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B2[0x4];                                     // 0x071C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names_1;                        // 0x0720(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B3[0x3];                                     // 0x0731(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  K2Node_CustomEvent_AccountId_13;                   // 0x0734(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B4[0x4];                                     // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_9;  // 0x0748(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0750(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x0758(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B5[0x3];                                     // 0x0761(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0764(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B6[0x4];                                     // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0778(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_NotificationInterface_SyncInvite_Error_C> K2Node_DynamicCast_AsBP_Notification_Interface_Sync_Invite_Error; // 0x0780(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B7[0x3];                                     // 0x0791(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_PushNotification_ReturnValue;             // 0x0794(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B8[0x4];                                     // 0x07A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetFinalErrorText_FinalErrorText;         // 0x07A8(0x0018)()
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_10; // 0x07C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_6;          // 0x07C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_5;                    // 0x07D8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerCrossPlatformHelper*     CallFunc_Get_Cross_Platform_Helper_NewParam;       // 0x07E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Message;                        // 0x07F0(0x0018)()
	TSoftClassPtr<class UClass>                   CallFunc_RedirectStateType_ReturnValue;            // 0x0808(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue_1;    // 0x0830(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_6;            // 0x0838(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_1;           // 0x0848(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B9[0x7];                                     // 0x0851(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue_1;                     // 0x0858(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_11; // 0x0860(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_PushNotification_ReturnValue_1;           // 0x0868(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_NotificationInterface_SyncInvite_Received_C> K2Node_DynamicCast_AsBP_Notification_Interface_Sync_Invite_Received; // 0x0878(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53BA[0x7];                                     // 0x0889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue_2;    // 0x0890(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_2;           // 0x0898(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_2;                // 0x08A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53BB[0x7];                                     // 0x08A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue_2;                     // 0x08A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_7;            // 0x08B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_NotificationInterface_Simple_C> K2Node_DynamicCast_AsBP_Notification_Interface_Simple; // 0x08C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53BC[0x3];                                     // 0x08D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_PushNotification_ReturnValue_2;           // 0x08D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53BD[0x4];                                     // 0x08E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_OtherUserId_2;                  // 0x08E8(0x0030)(HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_12; // 0x0918(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue_2;               // 0x0920(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_8;    // 0x0930(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_9;    // 0x0938(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_13; // 0x0940(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUserBlocked_ReturnValue_1;              // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53BE[0x7];                                     // 0x0949(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_10;   // 0x0950(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53BF[0x7];                                     // 0x0959(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue_3;                   // 0x0960(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue_2;                 // 0x0990(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C0[0x7];                                     // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_14; // 0x0998(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_11;   // 0x09A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Temp_struct_Variable_7;                            // 0x09A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable_8;                            // 0x09B8(0x0010)(ReferenceParm)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_15; // 0x09C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue_2; // 0x09D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x09D8(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x09F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C1[0x7];                                     // 0x09F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x09F8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x0A48(0x0010)(ReferenceParm)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_OtherUserId_1;                  // 0x0A58(0x0030)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x0A88(0x0018)()
	struct FMessageTarget                         CallFunc_MakeMessageTarget_DirectMessage_ReturnValue_3; // 0x0AA0(0x0028)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_7;          // 0x0AC8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue_3;               // 0x0AD8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_16; // 0x0AE8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_6;                    // 0x0AF0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names_2;                        // 0x0B00(0x0010)(ConstParm, ReferenceParm)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_12;   // 0x0B10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_17; // 0x0B18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue_3; // 0x0B20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0B28(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0B38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C2[0x7];                                     // 0x0B39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_OtherUserId;                    // 0x0B40(0x0030)(HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorMsg;                       // 0x0B70(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0B80(0x0018)()
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue_4;               // 0x0B98(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0BA8(0x0050)(HasGetValueTypeHash)
	struct FMessageTarget                         CallFunc_MakeMessageTarget_DirectMessage_ReturnValue_4; // 0x0BF8(0x0028)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x0C20(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0C30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C3[0x7];                                     // 0x0C31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_7;                     // 0x0C38(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_8;          // 0x0C50(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_18; // 0x0C60(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_7;                    // 0x0C68(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_13;   // 0x0C78(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_19; // 0x0C80(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_20; // 0x0C88(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue_4; // 0x0C90(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_9;            // 0x0C98(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0CA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C4[0x7];                                     // 0x0CA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerCrossPlatformHelper*     CallFunc_Get_Cross_Platform_Helper_NewParam_1;     // 0x0CB0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_RedirectStateType_ReturnValue_1;          // 0x0CB8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FChallengeClientInfo                   K2Node_CustomEvent_challengeInfo;                  // 0x0CE0(0x0138)(ConstParm)
	TArray<struct FSingleQuestReward>             K2Node_CustomEvent_rewards;                        // 0x0E18(0x0010)(ConstParm, ReferenceParm)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue_3;    // 0x0E28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6PLAT_PlayerBehaviorSubsystem*        K2Node_CustomEvent_PlayerBehaviorSubsystem;        // 0x0E30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS6PLAT_PlayerBehaviorReportForm       K2Node_CustomEvent_ReportForm;                     // 0x0E38(0x00B8)()
	bool                                          K2Node_CustomEvent_bDidSucceed;                    // 0x0EF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C5[0x7];                                     // 0x0EF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_3;           // 0x0EF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_3;                // 0x0F00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C6[0x7];                                     // 0x0F01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue_3;                     // 0x0F08(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_PushNotification_ReturnValue_3;           // 0x0F10(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0F20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0F21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C7[0x6];                                     // 0x0F22(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_NotificationInterface_FriendInvite_Received_C> K2Node_DynamicCast_AsBP_Notification_Interface_Friend_Invite_Received; // 0x0F28(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0F38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C8[0x3];                                     // 0x0F39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Temp_struct_Variable_9;                            // 0x0F3C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C9[0x4];                                     // 0x0F4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable_10;                           // 0x0F50(0x0010)(ReferenceParm)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_21; // 0x0F60(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0F68(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterName_ReturnValue_3;           // 0x0F70(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x0F80(0x0018)()
	struct FMessageTarget                         CallFunc_MakeMessageTarget_DirectMessage_ReturnValue_5; // 0x0F98(0x0028)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0FC0(0x0050)(HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x1010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_8;                          // 0x1018(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsUserMuted_ReturnValue;                  // 0x1028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53CA[0x7];                                     // 0x1029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_8;                     // 0x1030(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x1048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53CB[0x7];                                     // 0x1049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_9;          // 0x1050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x1060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53CC[0x7];                                     // 0x1061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue_4;                   // 0x1068(0x0030)(HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_22; // 0x1098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMessageTarget                         CallFunc_MakeMessageTarget_DirectMessage_ReturnValue_6; // 0x10A0(0x0028)(HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_14;   // 0x10C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x10D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53CD[0x4];                                     // 0x10D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_23; // 0x10D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_8;                    // 0x10E0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names_3;                        // 0x10F0(0x0010)(ConstParm, ReferenceParm)
	class UOSSVAL_GetCharacterNameByAccountIdAndCharacterIdProxy* CallFunc_GetCharacterNameByAccountIdAndCharacterId_ReturnValue; // 0x1100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x1108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53CE[0x7];                                     // 0x1109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_24; // 0x1110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x1118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_15;   // 0x1128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_9;                    // 0x1130(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_11;           // 0x1140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_25; // 0x1150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x1158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_Controller_26; // 0x1160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterName_ReturnValue_4;           // 0x1168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue_5;                   // 0x1178(0x0030)(HasGetValueTypeHash)
	struct FMessageTarget                         CallFunc_MakeMessageTarget_DirectMessage_ReturnValue_7; // 0x11A8(0x0028)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_BlockedNetId;                   // 0x11D0(0x0030)(ConstParm, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bBlocked;                       // 0x1200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53CF[0x3];                                     // 0x1201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue_5;               // 0x1204(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x1214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53D0[0x3];                                     // 0x1215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue_5; // 0x1218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x1220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53D1[0x7];                                     // 0x1221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_NotificationQueue*               K2Node_CustomEvent_NotificationQueue;              // 0x1228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AffectedNotificationId;         // 0x1230(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetNotificationById_ReturnValue;          // 0x1240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostGlobalEvent_ReturnValue;              // 0x1248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53D2[0x4];                                     // 0x124C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_NotificationInterface_Simple_C> K2Node_DynamicCast_AsBP_Notification_Interface_Simple_1; // 0x1250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x1260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53D3[0x7];                                     // 0x1261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMessage_Message;                       // 0x1268(0x0018)()
	ESkillType                                    CallFunc_Array_Get_Item;                           // 0x1280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53D4[0x7];                                     // 0x1281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_10;         // 0x1288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x1298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x129C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x129D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x129E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_3;                   // 0x129F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x12A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
