#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlacementViewActor

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PlacementViewActor.BP_PlacementViewActor_C.ExecuteUbergraph_BP_PlacementViewActor
// 0x0010 (0x0010 - 0x0000)
struct BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4711[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_amount;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventActor_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor) == 0x000004, "Wrong alignment on BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor");
static_assert(sizeof(BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor) == 0x000010, "Wrong size on BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor");
static_assert(offsetof(BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor, EntryPoint) == 0x000000, "Member 'BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor, K2Node_Event_amount) == 0x000008, "Member 'BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor::K2Node_Event_amount' has a wrong offset!");
static_assert(offsetof(BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor, CallFunc_AkEventActor_ReturnValue) == 0x00000C, "Member 'BP_PlacementViewActor_C_ExecuteUbergraph_BP_PlacementViewActor::CallFunc_AkEventActor_ReturnValue' has a wrong offset!");

// Function BP_PlacementViewActor.BP_PlacementViewActor_C.HandleOnPlacementUserRotationInput
// 0x0004 (0x0004 - 0x0000)
struct BP_PlacementViewActor_C_HandleOnPlacementUserRotationInput final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlacementViewActor_C_HandleOnPlacementUserRotationInput) == 0x000004, "Wrong alignment on BP_PlacementViewActor_C_HandleOnPlacementUserRotationInput");
static_assert(sizeof(BP_PlacementViewActor_C_HandleOnPlacementUserRotationInput) == 0x000004, "Wrong size on BP_PlacementViewActor_C_HandleOnPlacementUserRotationInput");
static_assert(offsetof(BP_PlacementViewActor_C_HandleOnPlacementUserRotationInput, Amount) == 0x000000, "Member 'BP_PlacementViewActor_C_HandleOnPlacementUserRotationInput::Amount' has a wrong offset!");

// Function BP_PlacementViewActor.BP_PlacementViewActor_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PlacementViewActor_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlacementViewActor_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PlacementViewActor_C_ReceiveEndPlay");
static_assert(sizeof(BP_PlacementViewActor_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PlacementViewActor_C_ReceiveEndPlay");
static_assert(offsetof(BP_PlacementViewActor_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PlacementViewActor_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

