#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerControllerTests

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerControllerTests.BP_PlayerControllerTests_C.StopFPSChart
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerControllerTests_C_StopFPSChart final
{
public:
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerTests_C_StopFPSChart) == 0x000001, "Wrong alignment on BP_PlayerControllerTests_C_StopFPSChart");
static_assert(sizeof(BP_PlayerControllerTests_C_StopFPSChart) == 0x000001, "Wrong size on BP_PlayerControllerTests_C_StopFPSChart");
static_assert(offsetof(BP_PlayerControllerTests_C_StopFPSChart, CallFunc_BooleanAND_ReturnValue) == 0x000000, "Member 'BP_PlayerControllerTests_C_StopFPSChart::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_PlayerControllerTests.BP_PlayerControllerTests_C.STEP_TeleportToHousingPlot
// 0x0070 (0x0070 - 0x0000)
struct BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4215[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Find_Teleporters_To_Housing_Plot_Result;  // 0x0008(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4216[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4217[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4218[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               K2Node_DynamicCast_AsValeria_Player_Controller;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot) == 0x000008, "Wrong alignment on BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot");
static_assert(sizeof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot) == 0x000070, "Wrong size on BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, Success) == 0x000000, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::Success' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, CallFunc_Find_Teleporters_To_Housing_Plot_Result) == 0x000008, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::CallFunc_Find_Teleporters_To_Housing_Plot_Result' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000048, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, K2Node_DynamicCast_AsValeria_Player_Controller) == 0x000060, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::K2Node_DynamicCast_AsValeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'BP_PlayerControllerTests_C_STEP_TeleportToHousingPlot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_PlayerControllerTests.BP_PlayerControllerTests_C.STEP_TeleportOffMap
// 0x0070 (0x0070 - 0x0000)
struct BP_PlayerControllerTests_C_STEP_TeleportOffMap final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4219[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421A[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               K2Node_DynamicCast_AsValeria_Player_Controller;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421B[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Find_Teleporters_Off_Map_Result;          // 0x0030(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421C[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerTests_C_STEP_TeleportOffMap) == 0x000008, "Wrong alignment on BP_PlayerControllerTests_C_STEP_TeleportOffMap");
static_assert(sizeof(BP_PlayerControllerTests_C_STEP_TeleportOffMap) == 0x000070, "Wrong size on BP_PlayerControllerTests_C_STEP_TeleportOffMap");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, Success) == 0x000000, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::Success' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000008, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, K2Node_DynamicCast_AsValeria_Player_Controller) == 0x000020, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::K2Node_DynamicCast_AsValeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, CallFunc_Find_Teleporters_Off_Map_Result) == 0x000030, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::CallFunc_Find_Teleporters_Off_Map_Result' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_STEP_TeleportOffMap, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'BP_PlayerControllerTests_C_STEP_TeleportOffMap::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PlayerControllerTests.BP_PlayerControllerTests_C.Find Teleporters To Housing Plot
// 0x0090 (0x0090 - 0x0000)
struct BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot final
{
public:
	TArray<class AActor*>                         Result;                                            // 0x0000(0x0010)(Parm, OutParm)
	class AActor*                                 CurrentTeleporter;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         HomeTeleporters;                                   // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         Teleporters;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421D[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot) == 0x000008, "Wrong alignment on BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot");
static_assert(sizeof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot) == 0x000090, "Wrong size on BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot, Result) == 0x000000, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot::Result' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot, CurrentTeleporter) == 0x000010, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot::CurrentTeleporter' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot, HomeTeleporters) == 0x000018, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot::HomeTeleporters' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot, Teleporters) == 0x000028, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot::Teleporters' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000038, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot, CallFunc_Conv_IntToString_ReturnValue) == 0x000060, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000080, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_To_Housing_Plot::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function BP_PlayerControllerTests.BP_PlayerControllerTests_C.Find Teleporters Off Map
// 0x0148 (0x0148 - 0x0000)
struct BP_PlayerControllerTests_C_Find_Teleporters_Off_Map final
{
public:
	TArray<class AActor*>                         Result;                                            // 0x0000(0x0010)(Parm, OutParm)
	class AActor*                                 CurrentTeleporterActor;                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Teleporters;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421E[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0070(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421F[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue; // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EndsWith_ReturnValue;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4220[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map) == 0x000008, "Wrong alignment on BP_PlayerControllerTests_C_Find_Teleporters_Off_Map");
static_assert(sizeof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map) == 0x000148, "Wrong size on BP_PlayerControllerTests_C_Find_Teleporters_Off_Map");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, Result) == 0x000000, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::Result' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CurrentTeleporterActor) == 0x000010, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CurrentTeleporterActor' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, Teleporters) == 0x000018, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::Teleporters' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000038, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, K2Node_ClassDynamicCast_AsActor) == 0x000050, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, K2Node_ClassDynamicCast_bSuccess) == 0x000058, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_GetAllActorsOfClass_OutActors) == 0x000070, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000080, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, Temp_int_Loop_Counter_Variable) == 0x000094, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Array_Add_ReturnValue) == 0x00009C, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, Temp_int_Array_Index_Variable) == 0x0000A4, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue) == 0x0000A8, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Conv_NameToString_ReturnValue) == 0x0000B8, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0000C8, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D8, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000E8, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000F8, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000108, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000118, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_EndsWith_ReturnValue) == 0x000128, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_EndsWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000130, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_Find_Teleporters_Off_Map, CallFunc_Not_PreBool_ReturnValue) == 0x000140, "Member 'BP_PlayerControllerTests_C_Find_Teleporters_Off_Map::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_PlayerControllerTests.BP_PlayerControllerTests_C.LogMessage
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerControllerTests_C_LogMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerTests_C_LogMessage) == 0x000008, "Wrong alignment on BP_PlayerControllerTests_C_LogMessage");
static_assert(sizeof(BP_PlayerControllerTests_C_LogMessage) == 0x000020, "Wrong size on BP_PlayerControllerTests_C_LogMessage");
static_assert(offsetof(BP_PlayerControllerTests_C_LogMessage, Message) == 0x000000, "Member 'BP_PlayerControllerTests_C_LogMessage::Message' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_LogMessage, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'BP_PlayerControllerTests_C_LogMessage::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_PlayerControllerTests.BP_PlayerControllerTests_C.FindRandomLocation_Internal
// 0x02F0 (0x02F0 - 0x0000)
struct BP_PlayerControllerTests_C_FindRandomLocation_Internal final
{
public:
	struct FVector                                SearchCenter;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SearchExtents;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundPoint;                                        // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4221[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RandomPoint;                                       // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATargetPoint*>                   TargetPoints;                                      // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0078(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4222[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4223[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4224[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4225[0x2];                                     // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4226[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4227[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerTests_C_FindRandomLocation_Internal) == 0x000008, "Wrong alignment on BP_PlayerControllerTests_C_FindRandomLocation_Internal");
static_assert(sizeof(BP_PlayerControllerTests_C_FindRandomLocation_Internal) == 0x0002F0, "Wrong size on BP_PlayerControllerTests_C_FindRandomLocation_Internal");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, SearchCenter) == 0x000000, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::SearchCenter' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, SearchExtents) == 0x000018, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::SearchExtents' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, FoundPoint) == 0x000030, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::FoundPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, Location) == 0x000038, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::Location' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, RandomPoint) == 0x000050, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::RandomPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, TargetPoints) == 0x000068, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::TargetPoints' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, Temp_object_Variable) == 0x000078, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x000088, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, Temp_int_Variable) == 0x0000A0, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000C8, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_LineTraceSingle_OutHit) == 0x0000E0, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_LineTraceSingle_ReturnValue) == 0x0001C8, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakVector_X) == 0x0001D0, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakVector_Y) == 0x0001D8, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakVector_Z) == 0x0001E0, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_MakeVector_ReturnValue) == 0x0001E8, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_bBlockingHit) == 0x000200, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_bInitialOverlap) == 0x000201, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_Time) == 0x000204, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_Distance) == 0x000208, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_Location) == 0x000210, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_ImpactPoint) == 0x000228, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_Normal) == 0x000240, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_ImpactNormal) == 0x000258, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_PhysMat) == 0x000270, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_HitActor) == 0x000278, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_HitComponent) == 0x000280, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_HitBoneName) == 0x000288, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_BoneName) == 0x000290, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_HitItem) == 0x000298, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_ElementIndex) == 0x00029C, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_FaceIndex) == 0x0002A0, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_TraceStart) == 0x0002A8, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_BreakHitResult_TraceEnd) == 0x0002C0, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocation_Internal, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0002D8, "Member 'BP_PlayerControllerTests_C_FindRandomLocation_Internal::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");

// Function BP_PlayerControllerTests.BP_PlayerControllerTests_C.FindRandomLocationOnCurrentMap
// 0x0078 (0x0078 - 0x0000)
struct BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap final
{
public:
	bool                                          FoundPoint;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4228[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindRandomLocation_Internal_FoundPoint;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4229[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindRandomLocation_Internal_Location;     // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindRandomLocation_Internal_FoundPoint_1; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_422A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindRandomLocation_Internal_Location_1;   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap) == 0x000008, "Wrong alignment on BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap");
static_assert(sizeof(BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap) == 0x000078, "Wrong size on BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap, FoundPoint) == 0x000000, "Member 'BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap::FoundPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap, Location) == 0x000008, "Member 'BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap::Location' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap, CallFunc_FindRandomLocation_Internal_FoundPoint) == 0x000020, "Member 'BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap::CallFunc_FindRandomLocation_Internal_FoundPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap, CallFunc_FindRandomLocation_Internal_Location) == 0x000028, "Member 'BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap::CallFunc_FindRandomLocation_Internal_Location' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap, CallFunc_FindRandomLocation_Internal_FoundPoint_1) == 0x000040, "Member 'BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap::CallFunc_FindRandomLocation_Internal_FoundPoint_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap, CallFunc_FindRandomLocation_Internal_Location_1) == 0x000048, "Member 'BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap::CallFunc_FindRandomLocation_Internal_Location_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000060, "Member 'BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap, CallFunc_Contains_ReturnValue) == 0x000070, "Member 'BP_PlayerControllerTests_C_FindRandomLocationOnCurrentMap::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function BP_PlayerControllerTests.BP_PlayerControllerTests_C.DiscardAllItemsInInventory
// 0x00D8 (0x00D8 - 0x0000)
struct BP_PlayerControllerTests_C_DiscardAllItemsInInventory final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBagSlotLocation                       K2Node_MakeStruct_BagSlotLocation;                 // 0x0018(0x0008)(NoDestructor)
	class ABP_ValeriaPlayerController_C*          K2Node_DynamicCast_AsBP_Valeria_Player_Controller; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_422B[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_422C[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryBag                          CallFunc_Array_Get_Item;                           // 0x0048(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_422D[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventorySlot                         CallFunc_Array_Get_Item_1;                         // 0x0068(0x0060)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_422E[0x2];                                     // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerTests_C_DiscardAllItemsInInventory) == 0x000008, "Wrong alignment on BP_PlayerControllerTests_C_DiscardAllItemsInInventory");
static_assert(sizeof(BP_PlayerControllerTests_C_DiscardAllItemsInInventory) == 0x0000D8, "Wrong size on BP_PlayerControllerTests_C_DiscardAllItemsInInventory");
static_assert(offsetof(BP_PlayerControllerTests_C_DiscardAllItemsInInventory, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_PlayerControllerTests_C_DiscardAllItemsInInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_DiscardAllItemsInInventory, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_PlayerControllerTests_C_DiscardAllItemsInInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_DiscardAllItemsInInventory, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_PlayerControllerTests_C_DiscardAllItemsInInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerTests_C_DiscardAllItemsInInventory, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'BP_PlayerControllerTests_C_DiscardAllItemsInInventory::Temp_int_Array_Index_Variable_1' has a wrong offset!");
