#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerControllerTests

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"
#include "Palia_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerControllerTests.BP_PlayerControllerTests_C
// 0x00D0 (0x0190 - 0x00C0)
class UBP_PlayerControllerTests_C final : public UActorTestHarnessComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                TownExtents;                                       // 0x00C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TownCenter;                                        // 0x00E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadTestEnabled;                                 // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4213[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeToTeleportOffMap;                              // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldTeleportOffMap;                              // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldBeMoving;                                    // 0x0109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4214[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeToChangeMovement;                              // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MovementDirection;                                 // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AZ_Center;                                         // 0x0130(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AZ_Extents;                                        // 0x0148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   TeleporterClass;                                   // 0x0160(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bFPSChartStarted;                                  // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StopFPSChart(bool CallFunc_BooleanAND_ReturnValue);
	void StartFPSChart();
	void STEP_TeleportToHousingPlot(bool* Success, TArray<class AActor*>& CallFunc_Find_Teleporters_To_Housing_Plot_Result, class AActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, double CallFunc_GetRealTimeSeconds_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, bool CallFunc_BooleanAND_ReturnValue);
	void STEP_TeleportOffMap(bool* Success, double CallFunc_GetRealTimeSeconds_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, bool CallFunc_BooleanAND_ReturnValue, TArray<class AActor*>& CallFunc_Find_Teleporters_Off_Map_Result, class AActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void Find_Teleporters_To_Housing_Plot(TArray<class AActor*>* Result, class AActor* CurrentTeleporter, const TArray<class AActor*>& HomeTeleporters, const TArray<class AActor*>& Teleporters, const class FString& CallFunc_GetCurrentLevelName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2);
	void Find_Teleporters_Off_Map(TArray<class AActor*>* Result, class AActor* CurrentTeleporterActor, const TArray<class AActor*>& Teleporters, const class FString& CallFunc_GetDisplayName_ReturnValue, class UClass* CallFunc_LoadClassAsset_Blocking_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, class UClass* K2Node_ClassDynamicCast_AsActor, bool K2Node_ClassDynamicCast_bSuccess, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, TArray<class AActor*>& CallFunc_GetAllActorsOfClass_OutActors, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, const struct FPrimaryAssetId& CallFunc_GetPrimaryAssetIdFromSoftObjectReference_ReturnValue, const class FString& CallFunc_Conv_NameToString_ReturnValue, const class FString& CallFunc_Conv_NameToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, const class FString& CallFunc_Concat_StrStr_ReturnValue_6, const class FString& CallFunc_GetCurrentLevelName_ReturnValue, bool CallFunc_EndsWith_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_7, bool CallFunc_Not_PreBool_ReturnValue);
	void LogMessage(const class FString& Message, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void FindRandomLocation_Internal(const struct FVector& SearchCenter, const struct FVector& SearchExtents, bool* FoundPoint, struct FVector* Location, const struct FVector& RandomPoint, const TArray<class ATargetPoint*>& TargetPoints, TArray<class AActor*>& Temp_object_Variable, const struct FVector& CallFunc_RandomPointInBoundingBox_ReturnValue, int32 Temp_int_Variable, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FHitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, const struct FVector& CallFunc_MakeVector_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2);
	void FindRandomLocationOnCurrentMap(bool* FoundPoint, struct FVector* Location, bool CallFunc_FindRandomLocation_Internal_FoundPoint, const struct FVector& CallFunc_FindRandomLocation_Internal_Location, bool CallFunc_FindRandomLocation_Internal_FoundPoint_1, const struct FVector& CallFunc_FindRandomLocation_Internal_Location_1, const class FString& CallFunc_GetCurrentLevelName_ReturnValue, bool CallFunc_Contains_ReturnValue);
	void DiscardAllItemsInInventory(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, class AActor* CallFunc_GetOwner_ReturnValue, const struct FBagSlotLocation& K2Node_MakeStruct_BagSlotLocation, class ABP_ValeriaPlayerController_C* K2Node_DynamicCast_AsBP_Valeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class UPlayerInventoryComponent* CallFunc_GetInventory_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, const struct FInventoryBag& CallFunc_Array_Get_Item, int32 CallFunc_Add_IntInt_ReturnValue_1, const struct FInventorySlot& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1);
	void Find_Random_Gatherable(class AActor** Random_Gatherable, class ABP_ValeriaGatherable_C* ChosenGatherable, TArray<class ABP_ValeriaGatherable_C*>& CallFunc_GetAllActorsOfClass_OutActors, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_RandomInteger_ReturnValue, class ABP_ValeriaGatherable_C* CallFunc_Array_Get_Item, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void Interact(class AActor* CallFunc_GetOwner_ReturnValue, const struct FInteractEventParams& K2Node_MakeStruct_InteractEventParams, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class UInteractorComponent* CallFunc_GetInteractorComponent_ReturnValue, const struct FUseEventResults& CallFunc_InteractWithHighlighted_ReturnValue);
	void Find_Closest_Gatherable(class AActor** Closest_Gatherable, class AValeriaCharacter* Player_Character, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable, bool CallFunc_Not_PreBool_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, int32 Temp_int_Loop_Counter_Variable, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, int32 CallFunc_Add_IntInt_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, TArray<class ABP_ValeriaGatherable_C*>& CallFunc_GetAllActorsOfClass_OutActors, TArray<class AActor*>& CallFunc_SortActorsByClosest_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class AActor* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class ABP_ValeriaGatherable_C* K2Node_DynamicCast_AsBP_Valeria_Gatherable, bool K2Node_DynamicCast_bSuccess, bool CallFunc_CanBeGatheredBy_ReturnValue);
	void Teleport_to_Location(class AValeriaPlayerController* Valeria_Player_Controller, const struct FVector& Location, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const class FString& CallFunc_Conv_VectorToString_ReturnValue, const struct Palia::FDebugCheat& K2Node_MakeStruct_DebugCheat, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2);
	void TickLoadTest();
	void ReceiveTick(float DeltaSeconds);
	void OnTestStarted(const class FString& TestCase);
	void OnTestStopped(const class FString& TestCase);
	void StopTest_LoadTest();
	void StartTest_LoadTest();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_PlayerControllerTests(int32 EntryPoint, bool CallFunc_StartLoadTestClient_ReturnValue, double CallFunc_GetRealTimeSeconds_ReturnValue, double CallFunc_GetRealTimeSeconds_ReturnValue_1, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1, class AActor* CallFunc_Find_Closest_Gatherable_Closest_Gatherable, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, double CallFunc_GetRealTimeSeconds_ReturnValue_2, double CallFunc_Add_DoubleDouble_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_FindRandomLocationOnCurrentMap_FoundPoint, const struct FVector& CallFunc_FindRandomLocationOnCurrentMap_Location, bool CallFunc_STEP_TeleportOffMap_Success, class ACharacter* CallFunc_GetPlayerCharacter_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, class AActor* CallFunc_GetOwner_ReturnValue_1, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller_1, bool K2Node_DynamicCast_bSuccess_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, float K2Node_Event_DeltaSeconds, const class FString& K2Node_Event_testCase_1, const class FString& K2Node_Event_testCase, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, bool K2Node_SwitchString_CmpSuccess, bool K2Node_SwitchString_CmpSuccess_1, class AActor* CallFunc_GetOwner_ReturnValue_2, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller_2, bool K2Node_DynamicCast_bSuccess_2, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, double CallFunc_GetGameTimeInSeconds_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue_2, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2, const struct FVector& CallFunc_RandomUnitVector_ReturnValue, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, double CallFunc_Add_DoubleDouble_B_ImplicitCast, double CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast, double CallFunc_Add_DoubleDouble_B_ImplicitCast_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerControllerTests_C">();
	}
	static class UBP_PlayerControllerTests_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerControllerTests_C>();
	}
};
static_assert(alignof(UBP_PlayerControllerTests_C) == 0x000008, "Wrong alignment on UBP_PlayerControllerTests_C");
static_assert(sizeof(UBP_PlayerControllerTests_C) == 0x000190, "Wrong size on UBP_PlayerControllerTests_C");
static_assert(offsetof(UBP_PlayerControllerTests_C, UberGraphFrame) == 0x0000C0, "Member 'UBP_PlayerControllerTests_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, TownExtents) == 0x0000C8, "Member 'UBP_PlayerControllerTests_C::TownExtents' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, TownCenter) == 0x0000E0, "Member 'UBP_PlayerControllerTests_C::TownCenter' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, IsLoadTestEnabled) == 0x0000F8, "Member 'UBP_PlayerControllerTests_C::IsLoadTestEnabled' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, TimeToTeleportOffMap) == 0x000100, "Member 'UBP_PlayerControllerTests_C::TimeToTeleportOffMap' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, ShouldTeleportOffMap) == 0x000108, "Member 'UBP_PlayerControllerTests_C::ShouldTeleportOffMap' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, ShouldBeMoving) == 0x000109, "Member 'UBP_PlayerControllerTests_C::ShouldBeMoving' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, TimeToChangeMovement) == 0x000110, "Member 'UBP_PlayerControllerTests_C::TimeToChangeMovement' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, MovementDirection) == 0x000118, "Member 'UBP_PlayerControllerTests_C::MovementDirection' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, AZ_Center) == 0x000130, "Member 'UBP_PlayerControllerTests_C::AZ_Center' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, AZ_Extents) == 0x000148, "Member 'UBP_PlayerControllerTests_C::AZ_Extents' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, TeleporterClass) == 0x000160, "Member 'UBP_PlayerControllerTests_C::TeleporterClass' has a wrong offset!");
static_assert(offsetof(UBP_PlayerControllerTests_C, bFPSChartStarted) == 0x000188, "Member 'UBP_PlayerControllerTests_C::bFPSChartStarted' has a wrong offset!");

}

