#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlateHealthBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlateHealthBar.BP_PlateHealthBar_C.ExecuteUbergraph_BP_PlateHealthBar
// 0x0028 (0x0028 - 0x0000)
struct BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47DE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HealthBar_C*                       K2Node_DynamicCast_AsWBP_Health_Bar;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar) == 0x000008, "Wrong alignment on BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar");
static_assert(sizeof(BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar) == 0x000028, "Wrong size on BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar");
static_assert(offsetof(BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar, EntryPoint) == 0x000000, "Member 'BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000010, "Member 'BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar, K2Node_DynamicCast_AsWBP_Health_Bar) == 0x000018, "Member 'BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar::K2Node_DynamicCast_AsWBP_Health_Bar' has a wrong offset!");
static_assert(offsetof(BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_PlateHealthBar_C_ExecuteUbergraph_BP_PlateHealthBar::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

