#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProximityTeleporter_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ProximityTeleporter_Parent.BP_ProximityTeleporter_Parent_C.Implementation_OnEffectOverlapEnd_Server
// 0x0020 (0x0020 - 0x0000)
struct BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server) == 0x000008, "Wrong alignment on BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server");
static_assert(sizeof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server) == 0x000020, "Wrong size on BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server, OverlappedComp) == 0x000000, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server::OverlappedComp' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server, OtherActor) == 0x000008, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server, OtherComp) == 0x000010, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server, OtherBodyIndex) == 0x000018, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Server::OtherBodyIndex' has a wrong offset!");

// Function BP_ProximityTeleporter_Parent.BP_ProximityTeleporter_Parent_C.Implementation_OnEffectOverlapEnd_Client
// 0x0020 (0x0020 - 0x0000)
struct BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client) == 0x000008, "Wrong alignment on BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client");
static_assert(sizeof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client) == 0x000020, "Wrong size on BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client, OverlappedComp) == 0x000000, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client::OverlappedComp' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client, OtherActor) == 0x000008, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client, OtherComp) == 0x000010, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client, OtherBodyIndex) == 0x000018, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapEnd_Client::OtherBodyIndex' has a wrong offset!");

// Function BP_ProximityTeleporter_Parent.BP_ProximityTeleporter_Parent_C.Implementation_OnEffectOverlapBegin_Server
// 0x0108 (0x0108 - 0x0000)
struct BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD6[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server) == 0x000008, "Wrong alignment on BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server");
static_assert(sizeof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server) == 0x000108, "Wrong size on BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server, OverlappedComponent) == 0x000000, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server, OtherActor) == 0x000008, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server, OtherComp) == 0x000010, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server, OtherBodyIndex) == 0x000018, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server, bFromSweep) == 0x00001C, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server, SweepResult) == 0x000020, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Server::SweepResult' has a wrong offset!");

// Function BP_ProximityTeleporter_Parent.BP_ProximityTeleporter_Parent_C.Implementation_OnEffectOverlapBegin_Client
// 0x0108 (0x0108 - 0x0000)
struct BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD7[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client) == 0x000008, "Wrong alignment on BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client");
static_assert(sizeof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client) == 0x000108, "Wrong size on BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client, OverlappedComponent) == 0x000000, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client, OtherActor) == 0x000008, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client, OtherComp) == 0x000010, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client, OtherBodyIndex) == 0x000018, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client, bFromSweep) == 0x00001C, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client, SweepResult) == 0x000020, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnEffectOverlapBegin_Client::SweepResult' has a wrong offset!");

// Function BP_ProximityTeleporter_Parent.BP_ProximityTeleporter_Parent_C.Implementation_OnCharacterTeleported_Client
// 0x0008 (0x0008 - 0x0000)
struct BP_ProximityTeleporter_Parent_C_Implementation_OnCharacterTeleported_Client final
{
public:
	const class AValeriaCharacter*                TeleportedCharacter;                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProximityTeleporter_Parent_C_Implementation_OnCharacterTeleported_Client) == 0x000008, "Wrong alignment on BP_ProximityTeleporter_Parent_C_Implementation_OnCharacterTeleported_Client");
static_assert(sizeof(BP_ProximityTeleporter_Parent_C_Implementation_OnCharacterTeleported_Client) == 0x000008, "Wrong size on BP_ProximityTeleporter_Parent_C_Implementation_OnCharacterTeleported_Client");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_Implementation_OnCharacterTeleported_Client, TeleportedCharacter) == 0x000000, "Member 'BP_ProximityTeleporter_Parent_C_Implementation_OnCharacterTeleported_Client::TeleportedCharacter' has a wrong offset!");

// Function BP_ProximityTeleporter_Parent.BP_ProximityTeleporter_Parent_C.ExecuteUbergraph_BP_ProximityTeleporter_Parent
// 0x02A8 (0x02A8 - 0x0000)
struct BP_ProximityTeleporter_Parent_C_ExecuteUbergraph_BP_ProximityTeleporter_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_OverlappedComponent_1;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_3;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp_3;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OtherBodyIndex_3;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSweep_1;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD9[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_SweepResult_1;                        // 0x0028(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BDA[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AValeriaCharacter*                K2Node_Event_TeleportedCharacter;                  // 0x0120(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMaxWalkSpeedOfActor_Speed;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OverlappedComp_1;                     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_2;                         // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp_2;                          // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OtherBodyIndex_2;                     // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BDB[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_1;          // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BDC[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_OverlappedComponent;                  // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp_1;                          // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OtherBodyIndex_1;                     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSweep;                           // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BDD[0x3];                                     // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_SweepResult;                          // 0x0180(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_Event_OverlappedComp;                       // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OtherBodyIndex;                       // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BDE[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_2;          // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BDF[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_3;          // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProximityTeleporter_Parent_C_ExecuteUbergraph_BP_ProximityTeleporter_Parent) == 0x000008, "Wrong alignment on BP_ProximityTeleporter_Parent_C_ExecuteUbergraph_BP_ProximityTeleporter_Parent");
static_assert(sizeof(BP_ProximityTeleporter_Parent_C_ExecuteUbergraph_BP_ProximityTeleporter_Parent) == 0x0002A8, "Wrong size on BP_ProximityTeleporter_Parent_C_ExecuteUbergraph_BP_ProximityTeleporter_Parent");
static_assert(offsetof(BP_ProximityTeleporter_Parent_C_ExecuteUbergraph_BP_ProximityTeleporter_Parent, EntryPoint) == 0x000000, "Member 'BP_ProximityTeleporter_Parent_C_ExecuteUbergraph_BP_ProximityTeleporter_Parent::EntryPoint' has a wrong offset!");
