#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RadioSliderPregisteredElement

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK
{

// UserDefinedStruct BP_RadioSliderPregisteredElement.BP_RadioSliderPregisteredElement
// 0x0058 (0x0058 - 0x0000)
struct FBP_RadioSliderPregisteredElement final
{
public:
	class FText                                   Name_2_F2B0A50E4E6D1FC8D7FF66AFC6A77DCA;           // 0x0000(0x0018)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UTexture2D>              Icon_6_3AA43F0C49B672F0159B638CDA01DB3C;           // 0x0018(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UWidget*                                ViewWidget_9_AE557E074B9645B655C7A59E3E9BE74F;     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   Id_12_D10FA7574C13BCA13A714095B4743A02;            // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemStorageCategory                          StorageCatagory_18_CC8162214BD87B88565CCEB62E2B3E4B; // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisplayIcon_21_4B756F4346EDF04D59C878B40386BA22;   // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBP_RadioSliderPregisteredElement) == 0x000008, "Wrong alignment on FBP_RadioSliderPregisteredElement");
static_assert(sizeof(FBP_RadioSliderPregisteredElement) == 0x000058, "Wrong size on FBP_RadioSliderPregisteredElement");
static_assert(offsetof(FBP_RadioSliderPregisteredElement, Name_2_F2B0A50E4E6D1FC8D7FF66AFC6A77DCA) == 0x000000, "Member 'FBP_RadioSliderPregisteredElement::Name_2_F2B0A50E4E6D1FC8D7FF66AFC6A77DCA' has a wrong offset!");
static_assert(offsetof(FBP_RadioSliderPregisteredElement, Icon_6_3AA43F0C49B672F0159B638CDA01DB3C) == 0x000018, "Member 'FBP_RadioSliderPregisteredElement::Icon_6_3AA43F0C49B672F0159B638CDA01DB3C' has a wrong offset!");
static_assert(offsetof(FBP_RadioSliderPregisteredElement, ViewWidget_9_AE557E074B9645B655C7A59E3E9BE74F) == 0x000040, "Member 'FBP_RadioSliderPregisteredElement::ViewWidget_9_AE557E074B9645B655C7A59E3E9BE74F' has a wrong offset!");
static_assert(offsetof(FBP_RadioSliderPregisteredElement, Id_12_D10FA7574C13BCA13A714095B4743A02) == 0x000048, "Member 'FBP_RadioSliderPregisteredElement::Id_12_D10FA7574C13BCA13A714095B4743A02' has a wrong offset!");
static_assert(offsetof(FBP_RadioSliderPregisteredElement, StorageCatagory_18_CC8162214BD87B88565CCEB62E2B3E4B) == 0x000050, "Member 'FBP_RadioSliderPregisteredElement::StorageCatagory_18_CC8162214BD87B88565CCEB62E2B3E4B' has a wrong offset!");
static_assert(offsetof(FBP_RadioSliderPregisteredElement, DisplayIcon_21_4B756F4346EDF04D59C878B40386BA22) == 0x000051, "Member 'FBP_RadioSliderPregisteredElement::DisplayIcon_21_4B756F4346EDF04D59C878B40386BA22' has a wrong offset!");

}

