#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SocialWindowTabDataAsset

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SocialWindowTabDataAsset.BP_SocialWindowTabDataAsset_C
// 0x0088 (0x00B8 - 0x0030)
class UBP_SocialWindowTabDataAsset_C final : public UPrimaryDataAsset
{
public:
	class FName                                   TabName;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   TabDisplayName;                                    // 0x0038(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSoftObjectPtr<class UTexture2D>              IconTexture;                                       // 0x0050(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AssociatedContentWidgetType;                       // 0x0078(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              IconFixedSize;                                     // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         SortPriority;                                      // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SocialWindowTabDataAsset_C">();
	}
	static class UBP_SocialWindowTabDataAsset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SocialWindowTabDataAsset_C>();
	}
};
static_assert(alignof(UBP_SocialWindowTabDataAsset_C) == 0x000008, "Wrong alignment on UBP_SocialWindowTabDataAsset_C");
static_assert(sizeof(UBP_SocialWindowTabDataAsset_C) == 0x0000B8, "Wrong size on UBP_SocialWindowTabDataAsset_C");
static_assert(offsetof(UBP_SocialWindowTabDataAsset_C, TabName) == 0x000030, "Member 'UBP_SocialWindowTabDataAsset_C::TabName' has a wrong offset!");
static_assert(offsetof(UBP_SocialWindowTabDataAsset_C, TabDisplayName) == 0x000038, "Member 'UBP_SocialWindowTabDataAsset_C::TabDisplayName' has a wrong offset!");
static_assert(offsetof(UBP_SocialWindowTabDataAsset_C, IconTexture) == 0x000050, "Member 'UBP_SocialWindowTabDataAsset_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UBP_SocialWindowTabDataAsset_C, AssociatedContentWidgetType) == 0x000078, "Member 'UBP_SocialWindowTabDataAsset_C::AssociatedContentWidgetType' has a wrong offset!");
static_assert(offsetof(UBP_SocialWindowTabDataAsset_C, IconFixedSize) == 0x0000A0, "Member 'UBP_SocialWindowTabDataAsset_C::IconFixedSize' has a wrong offset!");
static_assert(offsetof(UBP_SocialWindowTabDataAsset_C, SortPriority) == 0x0000B0, "Member 'UBP_SocialWindowTabDataAsset_C::SortPriority' has a wrong offset!");

}

