#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Starter_Tent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Starter_Tent.BP_Starter_Tent_C.ExecuteUbergraph_BP_Starter_Tent
// 0x0008 (0x0008 - 0x0000)
struct BP_Starter_Tent_C_ExecuteUbergraph_BP_Starter_Tent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsNight;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Starter_Tent_C_ExecuteUbergraph_BP_Starter_Tent) == 0x000004, "Wrong alignment on BP_Starter_Tent_C_ExecuteUbergraph_BP_Starter_Tent");
static_assert(sizeof(BP_Starter_Tent_C_ExecuteUbergraph_BP_Starter_Tent) == 0x000008, "Wrong size on BP_Starter_Tent_C_ExecuteUbergraph_BP_Starter_Tent");
static_assert(offsetof(BP_Starter_Tent_C_ExecuteUbergraph_BP_Starter_Tent, EntryPoint) == 0x000000, "Member 'BP_Starter_Tent_C_ExecuteUbergraph_BP_Starter_Tent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Starter_Tent_C_ExecuteUbergraph_BP_Starter_Tent, K2Node_CustomEvent_bIsNight) == 0x000004, "Member 'BP_Starter_Tent_C_ExecuteUbergraph_BP_Starter_Tent::K2Node_CustomEvent_bIsNight' has a wrong offset!");

// Function BP_Starter_Tent.BP_Starter_Tent_C.ToggleLights
// 0x0001 (0x0001 - 0x0000)
struct BP_Starter_Tent_C_ToggleLights final
{
public:
	bool                                          bIsNight;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Starter_Tent_C_ToggleLights) == 0x000001, "Wrong alignment on BP_Starter_Tent_C_ToggleLights");
static_assert(sizeof(BP_Starter_Tent_C_ToggleLights) == 0x000001, "Wrong size on BP_Starter_Tent_C_ToggleLights");
static_assert(offsetof(BP_Starter_Tent_C_ToggleLights, bIsNight) == 0x000000, "Member 'BP_Starter_Tent_C_ToggleLights::bIsNight' has a wrong offset!");

}

