#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StorageChest_Tier01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StorageChest_Tier01.BP_StorageChest_Tier01_C
// 0x00A8 (0x0350 - 0x02A8)
class ABP_StorageChest_Tier01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StorageChest_Base;                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pivot_Offset;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ScaleGroup;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ValeriaPlayerStorageInteractor_Component_C* PlayerStorageInteractor_Component;                 // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGatherableComponent*                   Gatherable;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           AudioLocation;                                     // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StorageChest_Lid;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractablePlateWidgetComponent_C* BP_InteractablePlateWidgetComponent;               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPersistComponent*                      Persist;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProximityChecker*                      ProximityChecker;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       InteractableCollider;                              // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Close_Close_02DDD4074829D4C6013A08982549810A;      // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Close__Direction_02DDD4074829D4C6013A08982549810A; // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60E1[0x3];                                     // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Close;                                             // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Open_Open_9729EDAB426F100316A98DB99020F71A;        // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Open__Direction_9729EDAB426F100316A98DB99020F71A;  // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60E2[0x3];                                     // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Open;                                              // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         IsOpenOrClosed;                                    // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60E3[0x4];                                     // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          OpenSound;                                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CloseSound;                                        // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_StorageChest_Duplicated_BP_ValeriaPlayerStorageInteractor_Component_K2Node_ComponentBoundEvent_3_OnIsOpenedChanged__DelegateSignature(bool IsOpened);
	void Close__FinishedFunc();
	void Close__UpdateFunc();
	void ExecuteUbergraph_BP_StorageChest_Tier01(int32 EntryPoint, bool K2Node_ComponentBoundEvent_IsOpened, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult_1, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_AkEventComponent_ReturnValue, int32 CallFunc_AkEventComponent_ReturnValue_1);
	void Open__FinishedFunc();
	void Open__UpdateFunc();
	void StorageChest_Close();
	void StorageChest_Open();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StorageChest_Tier01_C">();
	}
	static class ABP_StorageChest_Tier01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StorageChest_Tier01_C>();
	}
};
static_assert(alignof(ABP_StorageChest_Tier01_C) == 0x000008, "Wrong alignment on ABP_StorageChest_Tier01_C");
static_assert(sizeof(ABP_StorageChest_Tier01_C) == 0x000350, "Wrong size on ABP_StorageChest_Tier01_C");
static_assert(offsetof(ABP_StorageChest_Tier01_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_StorageChest_Tier01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, StorageChest_Base) == 0x0002B0, "Member 'ABP_StorageChest_Tier01_C::StorageChest_Base' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, Pivot_Offset) == 0x0002B8, "Member 'ABP_StorageChest_Tier01_C::Pivot_Offset' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, ScaleGroup) == 0x0002C0, "Member 'ABP_StorageChest_Tier01_C::ScaleGroup' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, PlayerStorageInteractor_Component) == 0x0002C8, "Member 'ABP_StorageChest_Tier01_C::PlayerStorageInteractor_Component' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, Gatherable) == 0x0002D0, "Member 'ABP_StorageChest_Tier01_C::Gatherable' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, AudioLocation) == 0x0002D8, "Member 'ABP_StorageChest_Tier01_C::AudioLocation' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, StorageChest_Lid) == 0x0002E0, "Member 'ABP_StorageChest_Tier01_C::StorageChest_Lid' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, BP_InteractablePlateWidgetComponent) == 0x0002E8, "Member 'ABP_StorageChest_Tier01_C::BP_InteractablePlateWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, Interactable) == 0x0002F0, "Member 'ABP_StorageChest_Tier01_C::Interactable' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, Persist) == 0x0002F8, "Member 'ABP_StorageChest_Tier01_C::Persist' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, ProximityChecker) == 0x000300, "Member 'ABP_StorageChest_Tier01_C::ProximityChecker' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, InteractableCollider) == 0x000308, "Member 'ABP_StorageChest_Tier01_C::InteractableCollider' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, DefaultSceneRoot) == 0x000310, "Member 'ABP_StorageChest_Tier01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, Close_Close_02DDD4074829D4C6013A08982549810A) == 0x000318, "Member 'ABP_StorageChest_Tier01_C::Close_Close_02DDD4074829D4C6013A08982549810A' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, Close__Direction_02DDD4074829D4C6013A08982549810A) == 0x00031C, "Member 'ABP_StorageChest_Tier01_C::Close__Direction_02DDD4074829D4C6013A08982549810A' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, Close) == 0x000320, "Member 'ABP_StorageChest_Tier01_C::Close' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, Open_Open_9729EDAB426F100316A98DB99020F71A) == 0x000328, "Member 'ABP_StorageChest_Tier01_C::Open_Open_9729EDAB426F100316A98DB99020F71A' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, Open__Direction_9729EDAB426F100316A98DB99020F71A) == 0x00032C, "Member 'ABP_StorageChest_Tier01_C::Open__Direction_9729EDAB426F100316A98DB99020F71A' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, Open) == 0x000330, "Member 'ABP_StorageChest_Tier01_C::Open' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, IsOpenOrClosed) == 0x000338, "Member 'ABP_StorageChest_Tier01_C::IsOpenOrClosed' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, OpenSound) == 0x000340, "Member 'ABP_StorageChest_Tier01_C::OpenSound' has a wrong offset!");
static_assert(offsetof(ABP_StorageChest_Tier01_C, CloseSound) == 0x000348, "Member 'ABP_StorageChest_Tier01_C::CloseSound' has a wrong offset!");

}

