#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Stables_Sign

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Stables_Sign.BP_Stables_Sign_C
// 0x0068 (0x0310 - 0x02A8)
class ABP_Stables_Sign_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   BP_StableBellA;                                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_lanternC_PoleStableA;                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTeleportDestinationComponent*          TeleportDestination;                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTeleportOriginComponent*               TeleportOrigin;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Dev_wagon_v02;                                     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTrackingTargetComponent*               PlayerCompassTarget;                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       InteractableCollider;                              // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStablesConfigAsset*                    Config;                                            // 0x0308(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void CheckExperiencePackage(class UObject* ExperiencePackage, class UExperiencePackageConfig* ExpPkg_FTUE, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue_1, bool CallFunc_EqualEqual_StriStri_ReturnValue);
	void CurrentExperiencePackage(class UExperiencePackageConfig* ExpPkg);
	void ExecuteUbergraph_BP_Stables_Sign(int32 EntryPoint, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, TDelegate<void(class UExperiencePackageConfig* ExpPkg)> K2Node_CreateDelegate_OutputDelegate, class UExperiencePackageConfig* CallFunc_GetExperiencePackage_ReturnValue, class AValeriaPlayerController* K2Node_Event_player, const struct FServerUseEventParams& K2Node_Event_params, bool CallFunc_IsValid_ReturnValue, class UExperiencePackageConfig* K2Node_CustomEvent_ExpPkg);
	void FindCostForDestination(class UTeleportTravelConfigAsset* DestinationConfig, int32* GoldCost, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, const struct FTeleportDestinationConfig& CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue);
	struct FUseEventResult OnClientInteract(class UInteractableComponent* Param_Interactable, class AValeriaPlayerController* Player, const struct FInteractEventParams& Params_0, bool CallFunc_IsValid_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, const struct FUseEventResult& CallFunc_UseEventResult_HandledAndSentToServer_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, class UVAL_Subsystem_GameplayUIBridge* CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue, const struct FUseEventResult& CallFunc_UseEventResult_Unhandled_ReturnValue, TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_GetUIInterface_ReturnValue);
	struct FUseEventResult OnClientUsedEquippedOnMe(class AValeriaPlayerController* Player, const struct FUseEventParams& Params_0);
	struct FServerUseEventResult OnServerInteract(class UInteractableComponent* Param_Interactable, class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams, const struct FServerUseEventResult& CallFunc_ServerUseEventResult_Unhandled_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void OnServerUsedEquippedOnMe(class AValeriaPlayerController* Player, const struct FServerUseEventParams& Params_0);
	void ReceiveBeginPlay();

	bool GetEventIndexForInputAction(class AValeriaCharacter* Character, TSoftObjectPtr<class UInputAction>& InputAction, EInteractEventIndex* OutEventIndex) const;
	TSoftObjectPtr<class UInputAction> GetInputActionForEventIndex(class AValeriaCharacter* Character, EInteractEventIndex EventIndex) const;
	bool GetText(class AValeriaCharacter* Character, EInteractEventIndex EventIndex, struct FGetTextParams* Params_0, bool CallFunc_EqualEqual_ByteByte_ReturnValue, const struct FGetTextParams& K2Node_MakeStruct_GetTextParams) const;
	bool GetUseableIMC(class AValeriaCharacter* Character, EInteractEventIndex InteractIndex, struct FInputMappingPriorityData* OutMappingData, struct FModifyContextOptions* OutOptions) const;
	int32 InteractPriority(class AValeriaCharacter* Character) const;
	bool IsInteractable(class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Stables_Sign_C">();
	}
	static class ABP_Stables_Sign_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Stables_Sign_C>();
	}
};
static_assert(alignof(ABP_Stables_Sign_C) == 0x000008, "Wrong alignment on ABP_Stables_Sign_C");
static_assert(sizeof(ABP_Stables_Sign_C) == 0x000310, "Wrong size on ABP_Stables_Sign_C");
static_assert(offsetof(ABP_Stables_Sign_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_Stables_Sign_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, BP_StableBellA) == 0x0002B0, "Member 'ABP_Stables_Sign_C::BP_StableBellA' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, BP_lanternC_PoleStableA) == 0x0002B8, "Member 'ABP_Stables_Sign_C::BP_lanternC_PoleStableA' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, TeleportDestination) == 0x0002C0, "Member 'ABP_Stables_Sign_C::TeleportDestination' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, TeleportOrigin) == 0x0002C8, "Member 'ABP_Stables_Sign_C::TeleportOrigin' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, Billboard) == 0x0002D0, "Member 'ABP_Stables_Sign_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, Arrow) == 0x0002D8, "Member 'ABP_Stables_Sign_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, Dev_wagon_v02) == 0x0002E0, "Member 'ABP_Stables_Sign_C::Dev_wagon_v02' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, PlayerCompassTarget) == 0x0002E8, "Member 'ABP_Stables_Sign_C::PlayerCompassTarget' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, InteractableCollider) == 0x0002F0, "Member 'ABP_Stables_Sign_C::InteractableCollider' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, Interactable) == 0x0002F8, "Member 'ABP_Stables_Sign_C::Interactable' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, DefaultSceneRoot) == 0x000300, "Member 'ABP_Stables_Sign_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Stables_Sign_C, Config) == 0x000308, "Member 'ABP_Stables_Sign_C::Config' has a wrong offset!");

}

