#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShippingBin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ShippingBin.BP_ShippingBin_C.BndEvt__StorageInteractorComponent_K2Node_ComponentBoundEvent_0_OnIsOpenedChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_ShippingBin_C_BndEvt__StorageInteractorComponent_K2Node_ComponentBoundEvent_0_OnIsOpenedChanged__DelegateSignature final
{
public:
	bool                                          IsOpened;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShippingBin_C_BndEvt__StorageInteractorComponent_K2Node_ComponentBoundEvent_0_OnIsOpenedChanged__DelegateSignature) == 0x000001, "Wrong alignment on BP_ShippingBin_C_BndEvt__StorageInteractorComponent_K2Node_ComponentBoundEvent_0_OnIsOpenedChanged__DelegateSignature");
static_assert(sizeof(BP_ShippingBin_C_BndEvt__StorageInteractorComponent_K2Node_ComponentBoundEvent_0_OnIsOpenedChanged__DelegateSignature) == 0x000001, "Wrong size on BP_ShippingBin_C_BndEvt__StorageInteractorComponent_K2Node_ComponentBoundEvent_0_OnIsOpenedChanged__DelegateSignature");
static_assert(offsetof(BP_ShippingBin_C_BndEvt__StorageInteractorComponent_K2Node_ComponentBoundEvent_0_OnIsOpenedChanged__DelegateSignature, IsOpened) == 0x000000, "Member 'BP_ShippingBin_C_BndEvt__StorageInteractorComponent_K2Node_ComponentBoundEvent_0_OnIsOpenedChanged__DelegateSignature::IsOpened' has a wrong offset!");

// Function BP_ShippingBin.BP_ShippingBin_C.ExecuteUbergraph_BP_ShippingBin
// 0x0218 (0x0218 - 0x0000)
struct BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6170[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0120(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_IsOpened;               // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6171[0x2];                                     // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventComponent_ReturnValue;             // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventComponent_ReturnValue_1;           // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin) == 0x000008, "Wrong alignment on BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin");
static_assert(sizeof(BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin) == 0x000218, "Wrong size on BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin");
static_assert(offsetof(BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin, EntryPoint) == 0x000000, "Member 'BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin, CallFunc_MakeRotator_ReturnValue_1) == 0x000020, "Member 'BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000038, "Member 'BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000120, "Member 'BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin, K2Node_ComponentBoundEvent_IsOpened) == 0x000208, "Member 'BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin::K2Node_ComponentBoundEvent_IsOpened' has a wrong offset!");
static_assert(offsetof(BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin, CallFunc_Greater_IntInt_ReturnValue) == 0x000209, "Member 'BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin, CallFunc_AkEventComponent_ReturnValue) == 0x00020C, "Member 'BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin::CallFunc_AkEventComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin, CallFunc_AkEventComponent_ReturnValue_1) == 0x000210, "Member 'BP_ShippingBin_C_ExecuteUbergraph_BP_ShippingBin::CallFunc_AkEventComponent_ReturnValue_1' has a wrong offset!");

}

