#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TIM_ChatEmojiPanel_TabButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TIM_ChatEmojiPanel_TabButton.BP_TIM_ChatEmojiPanel_TabButton_C
// 0x0050 (0x06D0 - 0x0680)
class UBP_TIM_ChatEmojiPanel_TabButton_C final : public UVALUI_Button_Styled
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_ButtonStyle*                     ButtonStyle_ActiveTab;                             // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_ButtonStyle*                     ButtonStyle_InactiveTab;                           // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   LabelText;                                         // 0x0698(0x0018)(Edit, BlueprintVisible)
	class UVALUI_TextBlockStyle*                  TextStyle_ActiveTab;                               // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  TextStyle_InactiveTab;                             // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Label;                                   // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TIM_ChatEmojiPanel_TabButton(int32 EntryPoint, bool Temp_bool_Variable, bool K2Node_Event_IsDesignTime, bool K2Node_Event_bIsActive, class UVALUI_TextBlock_Styled* CallFunc_SpawnObject_ReturnValue, class UPanelSlot* CallFunc_SetContent_ReturnValue, bool Temp_bool_Variable_1, class UVALUI_ButtonStyle* K2Node_Select_Default, class UVALUI_TextBlockStyle* K2Node_Select_Default_1);
	void PreConstruct(bool IsDesignTime);
	void SetIsActiveTabButton(bool bIsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TIM_ChatEmojiPanel_TabButton_C">();
	}
	static class UBP_TIM_ChatEmojiPanel_TabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TIM_ChatEmojiPanel_TabButton_C>();
	}
};
static_assert(alignof(UBP_TIM_ChatEmojiPanel_TabButton_C) == 0x000010, "Wrong alignment on UBP_TIM_ChatEmojiPanel_TabButton_C");
static_assert(sizeof(UBP_TIM_ChatEmojiPanel_TabButton_C) == 0x0006D0, "Wrong size on UBP_TIM_ChatEmojiPanel_TabButton_C");
static_assert(offsetof(UBP_TIM_ChatEmojiPanel_TabButton_C, UberGraphFrame) == 0x000680, "Member 'UBP_TIM_ChatEmojiPanel_TabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TIM_ChatEmojiPanel_TabButton_C, ButtonStyle_ActiveTab) == 0x000688, "Member 'UBP_TIM_ChatEmojiPanel_TabButton_C::ButtonStyle_ActiveTab' has a wrong offset!");
static_assert(offsetof(UBP_TIM_ChatEmojiPanel_TabButton_C, ButtonStyle_InactiveTab) == 0x000690, "Member 'UBP_TIM_ChatEmojiPanel_TabButton_C::ButtonStyle_InactiveTab' has a wrong offset!");
static_assert(offsetof(UBP_TIM_ChatEmojiPanel_TabButton_C, LabelText) == 0x000698, "Member 'UBP_TIM_ChatEmojiPanel_TabButton_C::LabelText' has a wrong offset!");
static_assert(offsetof(UBP_TIM_ChatEmojiPanel_TabButton_C, TextStyle_ActiveTab) == 0x0006B0, "Member 'UBP_TIM_ChatEmojiPanel_TabButton_C::TextStyle_ActiveTab' has a wrong offset!");
static_assert(offsetof(UBP_TIM_ChatEmojiPanel_TabButton_C, TextStyle_InactiveTab) == 0x0006B8, "Member 'UBP_TIM_ChatEmojiPanel_TabButton_C::TextStyle_InactiveTab' has a wrong offset!");
static_assert(offsetof(UBP_TIM_ChatEmojiPanel_TabButton_C, TextBlock_Label) == 0x0006C0, "Member 'UBP_TIM_ChatEmojiPanel_TabButton_C::TextBlock_Label' has a wrong offset!");

}

