#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TopBackerSettings_Popup

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct BP_TopBackerSettings_Popup.BP_TopBackerSettings_Popup
// 0x0040 (0x0040 - 0x0000)
struct FBP_TopBackerSettings_Popup final
{
public:
	class FText                                   HeaderText_2_EA373CCE4930FCB77210B394319320C0;     // 0x0000(0x0018)(Edit, BlueprintVisible)
	struct FMargin                                ContainerPadding_17_C45CA54740CDFDB090E5889918A7060F; // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                TextPadding_19_003446FD4AFD75B2F74B25A2797C6E6E;   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          TextHAlignment_24_E8CE26FC40E0B6C8564655BB01406C58; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBP_TopBackerSettings_Popup) == 0x000008, "Wrong alignment on FBP_TopBackerSettings_Popup");
static_assert(sizeof(FBP_TopBackerSettings_Popup) == 0x000040, "Wrong size on FBP_TopBackerSettings_Popup");
static_assert(offsetof(FBP_TopBackerSettings_Popup, HeaderText_2_EA373CCE4930FCB77210B394319320C0) == 0x000000, "Member 'FBP_TopBackerSettings_Popup::HeaderText_2_EA373CCE4930FCB77210B394319320C0' has a wrong offset!");
static_assert(offsetof(FBP_TopBackerSettings_Popup, ContainerPadding_17_C45CA54740CDFDB090E5889918A7060F) == 0x000018, "Member 'FBP_TopBackerSettings_Popup::ContainerPadding_17_C45CA54740CDFDB090E5889918A7060F' has a wrong offset!");
static_assert(offsetof(FBP_TopBackerSettings_Popup, TextPadding_19_003446FD4AFD75B2F74B25A2797C6E6E) == 0x000028, "Member 'FBP_TopBackerSettings_Popup::TextPadding_19_003446FD4AFD75B2F74B25A2797C6E6E' has a wrong offset!");
static_assert(offsetof(FBP_TopBackerSettings_Popup, TextHAlignment_24_E8CE26FC40E0B6C8564655BB01406C58) == 0x000038, "Member 'FBP_TopBackerSettings_Popup::TextHAlignment_24_E8CE26FC40E0B6C8564655BB01406C58' has a wrong offset!");

}

