#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UXIntentHandler_PhotographyMode

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UXIntentHandler_PhotographyMode.BP_UXIntentHandler_PhotographyMode_C.ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode
// 0x0048 (0x0048 - 0x0000)
struct BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B78[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UXIntentSubsystem*                   K2Node_Event_UXIntentSubsystem;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UXIntent*                            K2Node_Event_UXIntent;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_PhotoCameraScreenBase*           K2Node_DynamicCast_AsVALUI_Photo_Camera_Screen_Base; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode) == 0x000008, "Wrong alignment on BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode");
static_assert(sizeof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode) == 0x000048, "Wrong size on BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode, EntryPoint) == 0x000000, "Member 'BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode, CallFunc_IsConsolePlatform_ReturnValue) == 0x000004, "Member 'BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode, Temp_bool_Variable) == 0x000005, "Member 'BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode, Temp_class_Variable) == 0x000008, "Member 'BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode, Temp_class_Variable_1) == 0x000010, "Member 'BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode, K2Node_Event_UXIntentSubsystem) == 0x000018, "Member 'BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode::K2Node_Event_UXIntentSubsystem' has a wrong offset!");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode, K2Node_Event_UXIntent) == 0x000020, "Member 'BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode::K2Node_Event_UXIntent' has a wrong offset!");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode, K2Node_Select_Default) == 0x000028, "Member 'BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode, CallFunc_Create_ReturnValue) == 0x000030, "Member 'BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode, K2Node_DynamicCast_AsVALUI_Photo_Camera_Screen_Base) == 0x000038, "Member 'BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode::K2Node_DynamicCast_AsVALUI_Photo_Camera_Screen_Base' has a wrong offset!");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_UXIntentHandler_PhotographyMode_C_ExecuteUbergraph_BP_UXIntentHandler_PhotographyMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_UXIntentHandler_PhotographyMode.BP_UXIntentHandler_PhotographyMode_C.HandleUXIntentReceived
// 0x0010 (0x0010 - 0x0000)
struct BP_UXIntentHandler_PhotographyMode_C_HandleUXIntentReceived final
{
public:
	class US6UXIntentSubsystem*                   UXIntentSubsystem;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UXIntent*                            UXIntent;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UXIntentHandler_PhotographyMode_C_HandleUXIntentReceived) == 0x000008, "Wrong alignment on BP_UXIntentHandler_PhotographyMode_C_HandleUXIntentReceived");
static_assert(sizeof(BP_UXIntentHandler_PhotographyMode_C_HandleUXIntentReceived) == 0x000010, "Wrong size on BP_UXIntentHandler_PhotographyMode_C_HandleUXIntentReceived");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_HandleUXIntentReceived, UXIntentSubsystem) == 0x000000, "Member 'BP_UXIntentHandler_PhotographyMode_C_HandleUXIntentReceived::UXIntentSubsystem' has a wrong offset!");
static_assert(offsetof(BP_UXIntentHandler_PhotographyMode_C_HandleUXIntentReceived, UXIntent) == 0x000008, "Member 'BP_UXIntentHandler_PhotographyMode_C_HandleUXIntentReceived::UXIntent' has a wrong offset!");

}

