#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UserSearchConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BP_UserSearchConfig.BP_UserSearchConfig
// 0x0004 (0x0004 - 0x0000)
struct FBP_UserSearchConfig final
{
public:
	bool                                          bAllowSelf_1_482CDADA47B68DE76E00DFA1D2099FDF;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowFriends_3_CE7360BE4BB9460838DB3C883E38F018;  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowNeighbors_5_26498DE5459613ABD17F31B37034A0CC; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowOutgoingFriendRequests_8_2E8FD03A4AC2C74E23CD039BD62E041D; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBP_UserSearchConfig) == 0x000001, "Wrong alignment on FBP_UserSearchConfig");
static_assert(sizeof(FBP_UserSearchConfig) == 0x000004, "Wrong size on FBP_UserSearchConfig");
static_assert(offsetof(FBP_UserSearchConfig, bAllowSelf_1_482CDADA47B68DE76E00DFA1D2099FDF) == 0x000000, "Member 'FBP_UserSearchConfig::bAllowSelf_1_482CDADA47B68DE76E00DFA1D2099FDF' has a wrong offset!");
static_assert(offsetof(FBP_UserSearchConfig, bAllowFriends_3_CE7360BE4BB9460838DB3C883E38F018) == 0x000001, "Member 'FBP_UserSearchConfig::bAllowFriends_3_CE7360BE4BB9460838DB3C883E38F018' has a wrong offset!");
static_assert(offsetof(FBP_UserSearchConfig, bAllowNeighbors_5_26498DE5459613ABD17F31B37034A0CC) == 0x000002, "Member 'FBP_UserSearchConfig::bAllowNeighbors_5_26498DE5459613ABD17F31B37034A0CC' has a wrong offset!");
static_assert(offsetof(FBP_UserSearchConfig, bAllowOutgoingFriendRequests_8_2E8FD03A4AC2C74E23CD039BD62E041D) == 0x000003, "Member 'FBP_UserSearchConfig::bAllowOutgoingFriendRequests_8_2E8FD03A4AC2C74E23CD039BD62E041D' has a wrong offset!");

}

