#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaGatherableLoot_Lumber_Shrub

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ValeriaGatherableLoot_Lumber_Shrub.BP_ValeriaGatherableLoot_Lumber_Shrub_C.ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub
// 0x0088 (0x0088 - 0x0000)
struct BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4516[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4517[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent_1;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID_1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4518[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4519[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451A[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlateHealthBar_Tree_C*              CallFunc_GetOrCreateHealthBar_HealthBar;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Instigator;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_1;   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub");
static_assert(sizeof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub) == 0x000088, "Wrong size on BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, EntryPoint) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_AkEventLocation_AkComponent) == 0x000020, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_AkEventLocation_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_AkEventLocation_Playing_ID) == 0x000028, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_AkEventLocation_Playing_ID' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000030, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_AkEventLocation_AkComponent_1) == 0x000048, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_AkEventLocation_AkComponent_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_AkEventLocation_Playing_ID_1) == 0x000050, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_AkEventLocation_Playing_ID_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000058, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000064, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_IsServer_ReturnValue) == 0x000068, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_GetOrCreateHealthBar_HealthBar) == 0x000070, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_GetOrCreateHealthBar_HealthBar' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, K2Node_Event_Instigator) == 0x000078, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::K2Node_Event_Instigator' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000080, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub, CallFunc_SetFloatParameter_Param_ImplicitCast_1) == 0x000084, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Shrub::CallFunc_SetFloatParameter_Param_ImplicitCast_1' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Lumber_Shrub.BP_ValeriaGatherableLoot_Lumber_Shrub_C.OnGatherableDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaGatherableLoot_Lumber_Shrub_C_OnGatherableDestroyed final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_OnGatherableDestroyed) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Lumber_Shrub_C_OnGatherableDestroyed");
static_assert(sizeof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_OnGatherableDestroyed) == 0x000008, "Wrong size on BP_ValeriaGatherableLoot_Lumber_Shrub_C_OnGatherableDestroyed");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_Shrub_C_OnGatherableDestroyed, Param_Instigator) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Lumber_Shrub_C_OnGatherableDestroyed::Param_Instigator' has a wrong offset!");

}

