#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaCrafter_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ValeriaCrafter_Base.BP_ValeriaCrafter_Base_C
// 0x00B8 (0x0360 - 0x02A8)
class ABP_ValeriaCrafter_Base_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComp_PlaceableAudio_C*                 PlaceableAudio;                                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CrafterSoundSource;                                // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CrafterInWorldPlateWidgetComponent_C* BP_CrafterInWorldPlateWidgetComponent;             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractablePlateWidgetComponent_C* BP_InteractablePlateWidgetComponent;               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProximityChecker*                      ProximityChecker;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       InteractableCollider;                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPersistComponent*                      Persist;                                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnedTool;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCrafting;                                       // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F12[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          CrafterOpenSound;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CrafterStartSound;                                 // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CrafterFinishedSound;                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Curr_Valeria_Time_Secs;                            // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartTimeSec;                                      // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EndTimeSec;                                        // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F13[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          ItemFinishedSound;                                 // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkRtpc*                                RemainingTimeRTPC;                                 // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         AkIdStart;                                         // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AkidEnd;                                           // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrafterState                                 Crafter_State;                                     // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F14[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           RTPCTimerHandle;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ValeriaCrafter_Base_PlaceablesAudio_K2Node_ComponentBoundEvent_1_AudioHidden__DelegateSignature();
	void BndEvt__BP_ValeriaCrafter_Base_PlaceablesAudio_K2Node_ComponentBoundEvent_2_AudioShown__DelegateSignature();
	void ExecuteUbergraph_BP_ValeriaCrafter_Base(int32 EntryPoint, bool K2Node_SwitchEnum_CmpSuccess, int32 CallFunc_GetValeriaTimestampSecs_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, ECrafterState K2Node_CustomEvent_CrafterState, int32 CallFunc_PlayCrafterSound_ReturnValue, bool CallFunc_IsServer_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_K2_IsValidTimerHandle_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, int32 CallFunc_PlayCrafterSound_ReturnValue_1, int32 CallFunc_GetRemainingTime_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, int32 CallFunc_PlayCrafterStartSound_EventId, int32 CallFunc_GetRemainingTime_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_PlayCrafterStartSound_EventId_1, EEndPlayReason K2Node_Event_EndPlayReason, bool CallFunc_IsValid_ReturnValue, float CallFunc_SetRTPCValue_Value_ImplicitCast);
	void GetCrafter(class UCrafterComponent** CrafterComponent);
	int32 GetRemainingTime(int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue_2);
	void ItemFinished();
	int32 PlayCrafterSound(class UAkAudioEvent* AkEvent, class UAkComponent* AkComponent, int32 CallFunc_PlayPersistSound_ReturnValue);
	void PlayCrafterStartSound(int32* EventId, int32 AkIdStartLocal, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, int32 CallFunc_PlayCrafterSound_ReturnValue);
	void PlayInteractionSound(ECrafterState CrafterState);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetTimers(int32 Param_StartTimeSec, int32 Param_EndTimeSec);
	void StartTimeRTPC();
	void StopCrafterStartSound(bool CallFunc_NotEqual_IntInt_ReturnValue);
	void UpdateTimeRTPC();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ValeriaCrafter_Base_C">();
	}
	static class ABP_ValeriaCrafter_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ValeriaCrafter_Base_C>();
	}
};
static_assert(alignof(ABP_ValeriaCrafter_Base_C) == 0x000008, "Wrong alignment on ABP_ValeriaCrafter_Base_C");
static_assert(sizeof(ABP_ValeriaCrafter_Base_C) == 0x000360, "Wrong size on ABP_ValeriaCrafter_Base_C");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_ValeriaCrafter_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, PlaceableAudio) == 0x0002B0, "Member 'ABP_ValeriaCrafter_Base_C::PlaceableAudio' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, Arrow) == 0x0002B8, "Member 'ABP_ValeriaCrafter_Base_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, CrafterSoundSource) == 0x0002C0, "Member 'ABP_ValeriaCrafter_Base_C::CrafterSoundSource' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, BP_CrafterInWorldPlateWidgetComponent) == 0x0002C8, "Member 'ABP_ValeriaCrafter_Base_C::BP_CrafterInWorldPlateWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, BP_InteractablePlateWidgetComponent) == 0x0002D0, "Member 'ABP_ValeriaCrafter_Base_C::BP_InteractablePlateWidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, ProximityChecker) == 0x0002D8, "Member 'ABP_ValeriaCrafter_Base_C::ProximityChecker' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, InteractableCollider) == 0x0002E0, "Member 'ABP_ValeriaCrafter_Base_C::InteractableCollider' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, Persist) == 0x0002E8, "Member 'ABP_ValeriaCrafter_Base_C::Persist' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, Interactable) == 0x0002F0, "Member 'ABP_ValeriaCrafter_Base_C::Interactable' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, DefaultSceneRoot) == 0x0002F8, "Member 'ABP_ValeriaCrafter_Base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, SpawnedTool) == 0x000300, "Member 'ABP_ValeriaCrafter_Base_C::SpawnedTool' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, bIsCrafting) == 0x000308, "Member 'ABP_ValeriaCrafter_Base_C::bIsCrafting' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, CrafterOpenSound) == 0x000310, "Member 'ABP_ValeriaCrafter_Base_C::CrafterOpenSound' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, CrafterStartSound) == 0x000318, "Member 'ABP_ValeriaCrafter_Base_C::CrafterStartSound' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, CrafterFinishedSound) == 0x000320, "Member 'ABP_ValeriaCrafter_Base_C::CrafterFinishedSound' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, Curr_Valeria_Time_Secs) == 0x000328, "Member 'ABP_ValeriaCrafter_Base_C::Curr_Valeria_Time_Secs' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, StartTimeSec) == 0x00032C, "Member 'ABP_ValeriaCrafter_Base_C::StartTimeSec' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, EndTimeSec) == 0x000330, "Member 'ABP_ValeriaCrafter_Base_C::EndTimeSec' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, ItemFinishedSound) == 0x000338, "Member 'ABP_ValeriaCrafter_Base_C::ItemFinishedSound' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, RemainingTimeRTPC) == 0x000340, "Member 'ABP_ValeriaCrafter_Base_C::RemainingTimeRTPC' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, AkIdStart) == 0x000348, "Member 'ABP_ValeriaCrafter_Base_C::AkIdStart' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, AkidEnd) == 0x00034C, "Member 'ABP_ValeriaCrafter_Base_C::AkidEnd' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, Crafter_State) == 0x000350, "Member 'ABP_ValeriaCrafter_Base_C::Crafter_State' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaCrafter_Base_C, RTPCTimerHandle) == 0x000358, "Member 'ABP_ValeriaCrafter_Base_C::RTPCTimerHandle' has a wrong offset!");

}

