#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaStorageInteractorComponent

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "S6EnhancedInputExtended_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.ExecuteUbergraph_BP_ValeriaStorageInteractorComponent
// 0x0058 (0x0058 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UProximityChecker* Tracker, class AActor* Tracked, bool IsWithin)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6117[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               K2Node_Event_player;                               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FServerUseEventParams                  K2Node_Event_params;                               // 0x0020(0x0010)(NoDestructor)
	class UProximityChecker*                      K2Node_CustomEvent_Tracker;                        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Tracked;                        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsWithin;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6118[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UProximityChecker*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent) == 0x000058, "Wrong size on BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent, EntryPoint) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent, K2Node_Event_player) == 0x000018, "Member 'BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent, K2Node_Event_params) == 0x000020, "Member 'BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent::K2Node_Event_params' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent, K2Node_CustomEvent_Tracker) == 0x000030, "Member 'BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent::K2Node_CustomEvent_Tracker' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent, K2Node_CustomEvent_Tracked) == 0x000038, "Member 'BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent::K2Node_CustomEvent_Tracked' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent, K2Node_CustomEvent_IsWithin) == 0x000040, "Member 'BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent::K2Node_CustomEvent_IsWithin' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'BP_ValeriaStorageInteractorComponent_C_ExecuteUbergraph_BP_ValeriaStorageInteractorComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.OnClientInteract
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_OnClientInteract final
{
public:
	class UInteractableComponent*                 Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInteractEventParams                   Params_0;                                          // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FUseEventResult                        ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6119[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611A[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_Subsystem_GameplayUIBridge*        CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611B[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_GetUIInterface_ReturnValue;               // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611C[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611D[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUseEventResult                        CallFunc_UseEventResult_Handled_ReturnValue;       // 0x00A0(0x0010)(NoDestructor)
	struct FUseEventResult                        CallFunc_UseEventResult_Unhandled_ReturnValue;     // 0x00B0(0x0010)(NoDestructor)
	struct FUseEventResult                        CallFunc_UseEventResult_Unhandled_ReturnValue_1;   // 0x00C0(0x0010)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UShippingBinComponent*                  K2Node_DynamicCast_AsShipping_Bin_Component;       // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_OnClientInteract");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract) == 0x0000F0, "Wrong size on BP_ValeriaStorageInteractorComponent_C_OnClientInteract");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, Interactable) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::Interactable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, Player) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::Player' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, Params_0) == 0x000010, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::Params_0' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, ReturnValue) == 0x000028, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_GetValeriaCharacter_OutResult) == 0x000039, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000040, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000048, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000058, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_GetValeriaCharacter_OutResult_1) == 0x000060, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_GetValeriaCharacter_OutResult_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_GetValeriaCharacter_ReturnValue_1) == 0x000068, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_GetValeriaCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_GetUIInterface_ReturnValue) == 0x000070, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_GetUIInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, K2Node_SwitchEnum_CmpSuccess_1) == 0x000080, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_IsLocalController_ReturnValue) == 0x000081, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_GetOwner_ReturnValue) == 0x000088, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_GetComponentByClass_ReturnValue) == 0x000090, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_UseEventResult_Handled_ReturnValue) == 0x0000A0, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_UseEventResult_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_UseEventResult_Unhandled_ReturnValue) == 0x0000B0, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_UseEventResult_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_UseEventResult_Unhandled_ReturnValue_1) == 0x0000C0, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_UseEventResult_Unhandled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_GetOwner_ReturnValue_1) == 0x0000D0, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0000D8, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, K2Node_DynamicCast_AsShipping_Bin_Component) == 0x0000E0, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::K2Node_DynamicCast_AsShipping_Bin_Component' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientInteract, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.OnClientUsedEquippedOnMe
// 0x0040 (0x0040 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_OnClientUsedEquippedOnMe final
{
public:
	class AValeriaPlayerController*               Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUseEventParams                        Params_0;                                          // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FUseEventResult                        ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_OnClientUsedEquippedOnMe) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_OnClientUsedEquippedOnMe");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_OnClientUsedEquippedOnMe) == 0x000040, "Wrong size on BP_ValeriaStorageInteractorComponent_C_OnClientUsedEquippedOnMe");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientUsedEquippedOnMe, Player) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientUsedEquippedOnMe::Player' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientUsedEquippedOnMe, Params_0) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientUsedEquippedOnMe::Params_0' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnClientUsedEquippedOnMe, ReturnValue) == 0x000030, "Member 'BP_ValeriaStorageInteractorComponent_C_OnClientUsedEquippedOnMe::ReturnValue' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.OnIsOpenedChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_OnIsOpenedChanged__DelegateSignature final
{
public:
	bool                                          Param_IsOpened;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_OnIsOpenedChanged__DelegateSignature) == 0x000001, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_OnIsOpenedChanged__DelegateSignature");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_OnIsOpenedChanged__DelegateSignature) == 0x000001, "Wrong size on BP_ValeriaStorageInteractorComponent_C_OnIsOpenedChanged__DelegateSignature");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnIsOpenedChanged__DelegateSignature, Param_IsOpened) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_OnIsOpenedChanged__DelegateSignature::Param_IsOpened' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.OnProximityTrackerChange
// 0x0028 (0x0028 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange final
{
public:
	class UProximityChecker*                      Tracker;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Tracked;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWithin;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611E[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange) == 0x000028, "Wrong size on BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange, Tracker) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange::Tracker' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange, Tracked) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange::Tracked' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange, IsWithin) == 0x000010, "Member 'BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange::IsWithin' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange, CallFunc_GetValeriaPlayerController_OutResult) == 0x000012, "Member 'BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000018, "Member 'BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange, CallFunc_IsLocalController_ReturnValue) == 0x000021, "Member 'BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange, K2Node_SwitchEnum_CmpSuccess) == 0x000023, "Member 'BP_ValeriaStorageInteractorComponent_C_OnProximityTrackerChange::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.OnServerInteract
// 0x0030 (0x0030 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_OnServerInteract final
{
public:
	class UInteractableComponent*                 Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInteractEventParams                   EventParams;                                       // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FServerUseEventResult                  ReturnValue;                                       // 0x0028(0x0002)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_OnServerInteract) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_OnServerInteract");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_OnServerInteract) == 0x000030, "Wrong size on BP_ValeriaStorageInteractorComponent_C_OnServerInteract");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnServerInteract, Interactable) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_OnServerInteract::Interactable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnServerInteract, Character) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_OnServerInteract::Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnServerInteract, EventParams) == 0x000010, "Member 'BP_ValeriaStorageInteractorComponent_C_OnServerInteract::EventParams' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnServerInteract, ReturnValue) == 0x000028, "Member 'BP_ValeriaStorageInteractorComponent_C_OnServerInteract::ReturnValue' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.OnServerUsedEquippedOnMe
// 0x0018 (0x0018 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_OnServerUsedEquippedOnMe final
{
public:
	class AValeriaPlayerController*               Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FServerUseEventParams                  Params_0;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_OnServerUsedEquippedOnMe) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_OnServerUsedEquippedOnMe");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_OnServerUsedEquippedOnMe) == 0x000018, "Wrong size on BP_ValeriaStorageInteractorComponent_C_OnServerUsedEquippedOnMe");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnServerUsedEquippedOnMe, Player) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_OnServerUsedEquippedOnMe::Player' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnServerUsedEquippedOnMe, Params_0) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_OnServerUsedEquippedOnMe::Params_0' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.OnTrackerChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_OnTrackerChanged final
{
public:
	class UProximityChecker*                      Tracker;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Tracked;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWithin;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_OnTrackerChanged) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_OnTrackerChanged");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_OnTrackerChanged) == 0x000018, "Wrong size on BP_ValeriaStorageInteractorComponent_C_OnTrackerChanged");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnTrackerChanged, Tracker) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_OnTrackerChanged::Tracker' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnTrackerChanged, Tracked) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_OnTrackerChanged::Tracked' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_OnTrackerChanged, IsWithin) == 0x000010, "Member 'BP_ValeriaStorageInteractorComponent_C_OnTrackerChanged::IsWithin' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.GetEventIndexForInputAction
// 0x0038 (0x0038 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction final
{
public:
	const class AValeriaCharacter*                Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UInputAction>            InputAction;                                       // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	EInteractEventIndex                           OutEventIndex;                                     // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction) == 0x000038, "Wrong size on BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction, Character) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction::Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction, InputAction) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction::InputAction' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction, OutEventIndex) == 0x000030, "Member 'BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction::OutEventIndex' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction, ReturnValue) == 0x000031, "Member 'BP_ValeriaStorageInteractorComponent_C_GetEventIndexForInputAction::ReturnValue' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.GetInputActionForEventIndex
// 0x0038 (0x0038 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_GetInputActionForEventIndex final
{
public:
	const class AValeriaCharacter*                Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInteractEventIndex                           EventIndex;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UInputAction>            ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_GetInputActionForEventIndex) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_GetInputActionForEventIndex");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_GetInputActionForEventIndex) == 0x000038, "Wrong size on BP_ValeriaStorageInteractorComponent_C_GetInputActionForEventIndex");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetInputActionForEventIndex, Character) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_GetInputActionForEventIndex::Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetInputActionForEventIndex, EventIndex) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_GetInputActionForEventIndex::EventIndex' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetInputActionForEventIndex, ReturnValue) == 0x000010, "Member 'BP_ValeriaStorageInteractorComponent_C_GetInputActionForEventIndex::ReturnValue' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.GetText
// 0x00C8 (0x00C8 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_GetText final
{
public:
	const class AValeriaCharacter*                Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInteractEventIndex                           EventIndex;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6120[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGetTextParams                         Params_0;                                          // 0x0010(0x0050)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6121[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FShopItemAdditionalCost>        K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	struct FGetTextParams                         K2Node_MakeStruct_GetTextParams;                   // 0x0078(0x0050)()
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_GetText) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_GetText");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_GetText) == 0x0000C8, "Wrong size on BP_ValeriaStorageInteractorComponent_C_GetText");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetText, Character) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_GetText::Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetText, EventIndex) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_GetText::EventIndex' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetText, Params_0) == 0x000010, "Member 'BP_ValeriaStorageInteractorComponent_C_GetText::Params_0' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetText, ReturnValue) == 0x000060, "Member 'BP_ValeriaStorageInteractorComponent_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetText, K2Node_MakeArray_Array) == 0x000068, "Member 'BP_ValeriaStorageInteractorComponent_C_GetText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetText, K2Node_MakeStruct_GetTextParams) == 0x000078, "Member 'BP_ValeriaStorageInteractorComponent_C_GetText::K2Node_MakeStruct_GetTextParams' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.GetUseableIMC
// 0x0050 (0x0050 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_GetUseableIMC final
{
public:
	const class AValeriaCharacter*                Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInteractEventIndex                           InteractIndex;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6122[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputMappingPriorityData              OutMappingData;                                    // 0x0010(0x0038)(Parm, OutParm)
	struct FModifyContextOptions                  OutOptions;                                        // 0x0048(0x0001)(Parm, OutParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0049(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_GetUseableIMC) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_GetUseableIMC");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_GetUseableIMC) == 0x000050, "Wrong size on BP_ValeriaStorageInteractorComponent_C_GetUseableIMC");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetUseableIMC, Character) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_GetUseableIMC::Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetUseableIMC, InteractIndex) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_GetUseableIMC::InteractIndex' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetUseableIMC, OutMappingData) == 0x000010, "Member 'BP_ValeriaStorageInteractorComponent_C_GetUseableIMC::OutMappingData' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetUseableIMC, OutOptions) == 0x000048, "Member 'BP_ValeriaStorageInteractorComponent_C_GetUseableIMC::OutOptions' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_GetUseableIMC, ReturnValue) == 0x000049, "Member 'BP_ValeriaStorageInteractorComponent_C_GetUseableIMC::ReturnValue' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.InteractPriority
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_InteractPriority final
{
public:
	const class AValeriaCharacter*                Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_InteractPriority) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_InteractPriority");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_InteractPriority) == 0x000010, "Wrong size on BP_ValeriaStorageInteractorComponent_C_InteractPriority");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_InteractPriority, Character) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_InteractPriority::Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_InteractPriority, ReturnValue) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_InteractPriority::ReturnValue' has a wrong offset!");

// Function BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C.IsInteractable
// 0x0028 (0x0028 - 0x0000)
struct BP_ValeriaStorageInteractorComponent_C_IsInteractable final
{
public:
	const class AValeriaCharacter*                Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInteractEventParams                   EventParams;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaStorageInteractorComponent_C_IsInteractable) == 0x000008, "Wrong alignment on BP_ValeriaStorageInteractorComponent_C_IsInteractable");
static_assert(sizeof(BP_ValeriaStorageInteractorComponent_C_IsInteractable) == 0x000028, "Wrong size on BP_ValeriaStorageInteractorComponent_C_IsInteractable");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_IsInteractable, Character) == 0x000000, "Member 'BP_ValeriaStorageInteractorComponent_C_IsInteractable::Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaStorageInteractorComponent_C_IsInteractable, EventParams) == 0x000008, "Member 'BP_ValeriaStorageInteractorComponent_C_IsInteractable::EventParams' has a wrong offset!");
