#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaVillagerCharacter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.AudioMappingFinished
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_AudioMappingFinished final
{
public:
	EAkCallbackType                               CallbackType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        CallbackInfo;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_AudioMappingFinished) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_AudioMappingFinished");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_AudioMappingFinished) == 0x000010, "Wrong size on BP_ValeriaVillagerCharacter_C_AudioMappingFinished");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_AudioMappingFinished, CallbackType) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_AudioMappingFinished::CallbackType' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_AudioMappingFinished, CallbackInfo) == 0x000008, "Member 'BP_ValeriaVillagerCharacter_C_AudioMappingFinished::CallbackInfo' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_10_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD5[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_AwarenessZone_K2Node_ComponentBoundEvent_9_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_0_DialogueWithPlayerDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_0_DialogueWithPlayerDelegate__DelegateSignature final
{
public:
	class UDialogueComponent*                     Diag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      PlayerParticipant;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_0_DialogueWithPlayerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_0_DialogueWithPlayerDelegate__DelegateSignature");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_0_DialogueWithPlayerDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_0_DialogueWithPlayerDelegate__DelegateSignature");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_0_DialogueWithPlayerDelegate__DelegateSignature, Diag) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_0_DialogueWithPlayerDelegate__DelegateSignature::Diag' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_0_DialogueWithPlayerDelegate__DelegateSignature, PlayerParticipant) == 0x000008, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_0_DialogueWithPlayerDelegate__DelegateSignature::PlayerParticipant' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_2_DialogueWithPlayerDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_2_DialogueWithPlayerDelegate__DelegateSignature final
{
public:
	class UDialogueComponent*                     Diag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      PlayerParticipant;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_2_DialogueWithPlayerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_2_DialogueWithPlayerDelegate__DelegateSignature");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_2_DialogueWithPlayerDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_2_DialogueWithPlayerDelegate__DelegateSignature");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_2_DialogueWithPlayerDelegate__DelegateSignature, Diag) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_2_DialogueWithPlayerDelegate__DelegateSignature::Diag' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_2_DialogueWithPlayerDelegate__DelegateSignature, PlayerParticipant) == 0x000008, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_2_DialogueWithPlayerDelegate__DelegateSignature::PlayerParticipant' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_8_DialogueWithPlayerDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_8_DialogueWithPlayerDelegate__DelegateSignature final
{
public:
	class UDialogueComponent*                     Diag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      PlayerParticipant;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_8_DialogueWithPlayerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_8_DialogueWithPlayerDelegate__DelegateSignature");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_8_DialogueWithPlayerDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_8_DialogueWithPlayerDelegate__DelegateSignature");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_8_DialogueWithPlayerDelegate__DelegateSignature, Diag) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_8_DialogueWithPlayerDelegate__DelegateSignature::Diag' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_8_DialogueWithPlayerDelegate__DelegateSignature, PlayerParticipant) == 0x000008, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__BP_ValeriaVillagerCharacter_Dialogue_K2Node_ComponentBoundEvent_8_DialogueWithPlayerDelegate__DelegateSignature::PlayerParticipant' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BndEvt__Dialogue_K2Node_ComponentBoundEvent_0_IgnoreDialogueTriggeredDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_0_IgnoreDialogueTriggeredDelegate__DelegateSignature final
{
public:
	class UDialogueComponent*                     Diag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_0_IgnoreDialogueTriggeredDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_0_IgnoreDialogueTriggeredDelegate__DelegateSignature");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_0_IgnoreDialogueTriggeredDelegate__DelegateSignature) == 0x000008, "Wrong size on BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_0_IgnoreDialogueTriggeredDelegate__DelegateSignature");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_0_IgnoreDialogueTriggeredDelegate__DelegateSignature, Diag) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_0_IgnoreDialogueTriggeredDelegate__DelegateSignature::Diag' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BndEvt__Dialogue_K2Node_ComponentBoundEvent_4_DialogueWithPlayerDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_4_DialogueWithPlayerDelegate__DelegateSignature final
{
public:
	class UDialogueComponent*                     Diag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      PlayerParticipant;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_4_DialogueWithPlayerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_4_DialogueWithPlayerDelegate__DelegateSignature");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_4_DialogueWithPlayerDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_4_DialogueWithPlayerDelegate__DelegateSignature");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_4_DialogueWithPlayerDelegate__DelegateSignature, Diag) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_4_DialogueWithPlayerDelegate__DelegateSignature::Diag' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_4_DialogueWithPlayerDelegate__DelegateSignature, PlayerParticipant) == 0x000008, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_4_DialogueWithPlayerDelegate__DelegateSignature::PlayerParticipant' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BndEvt__Dialogue_K2Node_ComponentBoundEvent_5_DialogueWithPlayerDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_5_DialogueWithPlayerDelegate__DelegateSignature final
{
public:
	class UDialogueComponent*                     Diag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      PlayerParticipant;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_5_DialogueWithPlayerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_5_DialogueWithPlayerDelegate__DelegateSignature");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_5_DialogueWithPlayerDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_5_DialogueWithPlayerDelegate__DelegateSignature");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_5_DialogueWithPlayerDelegate__DelegateSignature, Diag) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_5_DialogueWithPlayerDelegate__DelegateSignature::Diag' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_5_DialogueWithPlayerDelegate__DelegateSignature, PlayerParticipant) == 0x000008, "Member 'BP_ValeriaVillagerCharacter_C_BndEvt__Dialogue_K2Node_ComponentBoundEvent_5_DialogueWithPlayerDelegate__DelegateSignature::PlayerParticipant' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BPIE_ApplyVillagerCostume
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BPIE_ApplyVillagerCostume final
{
public:
	class UVillagerCostumeDataAsset*              CostumeDA;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BPIE_ApplyVillagerCostume) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BPIE_ApplyVillagerCostume");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BPIE_ApplyVillagerCostume) == 0x000008, "Wrong size on BP_ValeriaVillagerCharacter_C_BPIE_ApplyVillagerCostume");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPIE_ApplyVillagerCostume, CostumeDA) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BPIE_ApplyVillagerCostume::CostumeDA' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BPIE_PlayAudioMappingConfig
// 0x0038 (0x0038 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BPIE_PlayAudioMappingConfig final
{
public:
	struct FAudioMappingConfig                    AudioConfig;                                       // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BPIE_PlayAudioMappingConfig) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BPIE_PlayAudioMappingConfig");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BPIE_PlayAudioMappingConfig) == 0x000038, "Wrong size on BP_ValeriaVillagerCharacter_C_BPIE_PlayAudioMappingConfig");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPIE_PlayAudioMappingConfig, AudioConfig) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BPIE_PlayAudioMappingConfig::AudioConfig' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BPIE_PostCurrentActionInfoChanged
// 0x0090 (0x0090 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged final
{
public:
	struct FVillagerActionInfo                    InActionInfo;                                      // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FName                                   Temp_name_Variable;                                // 0x0070(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesVillagerActionInfoHaveAnimationMapping_ReturnValue; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD6[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_FindMontageByMapping_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMontageSectionLength_ReturnValue;      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged) == 0x000090, "Wrong size on BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged, InActionInfo) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged::InActionInfo' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged, Temp_name_Variable) == 0x000070, "Member 'BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged, CallFunc_DoesVillagerActionInfoHaveAnimationMapping_ReturnValue) == 0x000078, "Member 'BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged::CallFunc_DoesVillagerActionInfoHaveAnimationMapping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged, CallFunc_FindMontageByMapping_ReturnValue) == 0x000080, "Member 'BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged::CallFunc_FindMontageByMapping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged, CallFunc_GetMontageSectionLength_ReturnValue) == 0x000088, "Member 'BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged::CallFunc_GetMontageSectionLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged, CallFunc_IsServer_ReturnValue) == 0x00008C, "Member 'BP_ValeriaVillagerCharacter_C_BPIE_PostCurrentActionInfoChanged::CallFunc_IsServer_ReturnValue' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BPIE_ReceivedLongDespawnInfo
// 0x0004 (0x0004 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BPIE_ReceivedLongDespawnInfo final
{
public:
	float                                         Param_WalkOutDuration;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BPIE_ReceivedLongDespawnInfo) == 0x000004, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BPIE_ReceivedLongDespawnInfo");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BPIE_ReceivedLongDespawnInfo) == 0x000004, "Wrong size on BP_ValeriaVillagerCharacter_C_BPIE_ReceivedLongDespawnInfo");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPIE_ReceivedLongDespawnInfo, Param_WalkOutDuration) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BPIE_ReceivedLongDespawnInfo::Param_WalkOutDuration' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.BPNE_GetOrCreateVoicePositionAkComponent
// 0x0018 (0x0018 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_BPNE_GetOrCreateVoicePositionAkComponent final
{
public:
	class UAkComponent*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AkGetComponent_ComponentCreated;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD7[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_AkGetComponent_AkComponent;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_BPNE_GetOrCreateVoicePositionAkComponent) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_BPNE_GetOrCreateVoicePositionAkComponent");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_BPNE_GetOrCreateVoicePositionAkComponent) == 0x000018, "Wrong size on BP_ValeriaVillagerCharacter_C_BPNE_GetOrCreateVoicePositionAkComponent");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPNE_GetOrCreateVoicePositionAkComponent, ReturnValue) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_BPNE_GetOrCreateVoicePositionAkComponent::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPNE_GetOrCreateVoicePositionAkComponent, CallFunc_AkGetComponent_ComponentCreated) == 0x000008, "Member 'BP_ValeriaVillagerCharacter_C_BPNE_GetOrCreateVoicePositionAkComponent::CallFunc_AkGetComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_BPNE_GetOrCreateVoicePositionAkComponent, CallFunc_AkGetComponent_AkComponent) == 0x000010, "Member 'BP_ValeriaVillagerCharacter_C_BPNE_GetOrCreateVoicePositionAkComponent::CallFunc_AkGetComponent_AkComponent' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.CanBePhotobomber
// 0x0040 (0x0040 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_CanBePhotobomber final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPhotobomb;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD8[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaVillagerCharacter*              K2Node_DynamicCast_AsValeria_Villager_Character;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD9[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_DialogueRoom*                      K2Node_DynamicCast_AsVAL_Dialogue_Room;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDialogueOnly_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CDA[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALandscape*                             K2Node_DynamicCast_AsLandscape;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_CanBePhotobomber) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_CanBePhotobomber");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_CanBePhotobomber) == 0x000040, "Wrong size on BP_ValeriaVillagerCharacter_C_CanBePhotobomber");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_CanBePhotobomber, HitActor) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_CanBePhotobomber::HitActor' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_CanBePhotobomber, CanPhotobomb) == 0x000008, "Member 'BP_ValeriaVillagerCharacter_C_CanBePhotobomber::CanPhotobomb' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_CanBePhotobomber, K2Node_DynamicCast_AsValeria_Villager_Character) == 0x000010, "Member 'BP_ValeriaVillagerCharacter_C_CanBePhotobomber::K2Node_DynamicCast_AsValeria_Villager_Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_CanBePhotobomber, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ValeriaVillagerCharacter_C_CanBePhotobomber::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_CanBePhotobomber, K2Node_DynamicCast_AsVAL_Dialogue_Room) == 0x000020, "Member 'BP_ValeriaVillagerCharacter_C_CanBePhotobomber::K2Node_DynamicCast_AsVAL_Dialogue_Room' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_CanBePhotobomber, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_ValeriaVillagerCharacter_C_CanBePhotobomber::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_CanBePhotobomber, CallFunc_IsDialogueOnly_ReturnValue) == 0x000029, "Member 'BP_ValeriaVillagerCharacter_C_CanBePhotobomber::CallFunc_IsDialogueOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_CanBePhotobomber, K2Node_DynamicCast_AsLandscape) == 0x000030, "Member 'BP_ValeriaVillagerCharacter_C_CanBePhotobomber::K2Node_DynamicCast_AsLandscape' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_CanBePhotobomber, K2Node_DynamicCast_bSuccess_2) == 0x000038, "Member 'BP_ValeriaVillagerCharacter_C_CanBePhotobomber::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.DebugInfoComponentChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_DebugInfoComponentChanged final
{
public:
	class UDebugInfoComponent*                    DebugInfo;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowVillagerDebugInfo_ReturnValue;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaVillagerCharacter_C_DebugInfoComponentChanged) == 0x000008, "Wrong alignment on BP_ValeriaVillagerCharacter_C_DebugInfoComponentChanged");
static_assert(sizeof(BP_ValeriaVillagerCharacter_C_DebugInfoComponentChanged) == 0x000010, "Wrong size on BP_ValeriaVillagerCharacter_C_DebugInfoComponentChanged");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_DebugInfoComponentChanged, DebugInfo) == 0x000000, "Member 'BP_ValeriaVillagerCharacter_C_DebugInfoComponentChanged::DebugInfo' has a wrong offset!");
static_assert(offsetof(BP_ValeriaVillagerCharacter_C_DebugInfoComponentChanged, CallFunc_GetShowVillagerDebugInfo_ReturnValue) == 0x000008, "Member 'BP_ValeriaVillagerCharacter_C_DebugInfoComponentChanged::CallFunc_GetShowVillagerDebugInfo_ReturnValue' has a wrong offset!");

// Function BP_ValeriaVillagerCharacter.BP_ValeriaVillagerCharacter_C.ExecuteUbergraph_BP_ValeriaVillagerCharacter
// 0x03E8 (0x03E8 - 0x0000)
struct BP_ValeriaVillagerCharacter_C_ExecuteUbergraph_BP_ValeriaVillagerCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CDB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ValeriaGameState_C*                 K2Node_DynamicCast_AsBP_Valeria_Game_State;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CDC[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ValeriaGameState_C*                 K2Node_DynamicCast_AsBP_Valeria_Game_State_1;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CDD[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_InActivityIndicator;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DisableIfServer_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShouldHide;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WantsMapIndicator_ReturnValue;            // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDialogueComponent*                     K2Node_ComponentBoundEvent_diag_4;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_ComponentBoundEvent_playerParticipant_4;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDialogueComponent*                     K2Node_ComponentBoundEvent_diag_3;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_ComponentBoundEvent_playerParticipant_3;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CDE[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogueComponent*                     K2Node_ComponentBoundEvent_diag_2;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_ComponentBoundEvent_playerParticipant_2;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CDF[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE0[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE1[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVisibilityComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE2[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_DialogueBubble_C*                  K2Node_DynamicCast_AsWBP_Dialogue_Bubble;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE3[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE4[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00F0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AValeriaProjectile*                     K2Node_DynamicCast_AsValeria_Projectile;           // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE5[0x6];                                     // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaVillagerCharacter*              K2Node_DynamicCast_AsValeria_Villager_Character;   // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE6[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE7[0x2];                                     // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0208(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0218(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDebugInfoComponent* DebugInfo)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDebugInfoComponent* DebugInfo)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0230(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE8[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE9[0x4];                                     // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_1;          // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CEA[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDebugInfoComponent*                    CallFunc_GetDebugInfoComponent_ReturnValue;        // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowVillagerDebugInfo_ReturnValue;     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CEB[0x6];                                     // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVisibilityComponent*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Client_RemoveVisibilityModifierSourceByKey_ReturnValue; // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CEC[0x2];                                     // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_walkOutDuration;                      // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldPlateBeVisible_ReturnValue;         // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CED[0x6];                                     // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Alpha;                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CEE[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogueComponent*                     K2Node_ComponentBoundEvent_diag_5;                 // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CEF[0x3];                                     // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVillagerCostumeDataAsset*              K2Node_Event_CostumeDA;                            // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CF0[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CF1[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaVillagerCharacter*              K2Node_DynamicCast_AsValeria_Villager_Character_1; // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CF2[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_2;          // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyEngagedForDialogue_ReturnValue;  // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_2;      // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
