#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaCrafter_Base

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ValeriaCrafter_Base.BP_ValeriaCrafter_Base_C.ExecuteUbergraph_BP_ValeriaCrafter_Base
// 0x0060 (0x0060 - 0x0000)
struct BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F15[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValeriaTimestampSecs_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrafterState                                 K2Node_CustomEvent_CrafterState;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F16[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCrafterSound_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F17[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCrafterSound_ReturnValue_1;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingTime_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F18[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayCrafterStartSound_EventId;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingTime_ReturnValue_1;           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F19[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCrafterStartSound_EventId_1;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1A[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base) == 0x000008, "Wrong alignment on BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base");
static_assert(sizeof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base) == 0x000060, "Wrong size on BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, EntryPoint) == 0x000000, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_GetValeriaTimestampSecs_ReturnValue) == 0x000008, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_GetValeriaTimestampSecs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, K2Node_CustomEvent_CrafterState) == 0x00000D, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::K2Node_CustomEvent_CrafterState' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_PlayCrafterSound_ReturnValue) == 0x000010, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_PlayCrafterSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_IsServer_ReturnValue) == 0x000014, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_BooleanAND_ReturnValue) == 0x000016, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_Greater_IntInt_ReturnValue) == 0x000017, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_BooleanAND_ReturnValue_1) == 0x000018, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000019, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001A, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_PlayCrafterSound_ReturnValue_1) == 0x00001C, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_PlayCrafterSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_GetRemainingTime_ReturnValue) == 0x000020, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_GetRemainingTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_PlayCrafterStartSound_EventId) == 0x000048, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_PlayCrafterStartSound_EventId' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_GetRemainingTime_ReturnValue_1) == 0x00004C, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_GetRemainingTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_PlayCrafterStartSound_EventId_1) == 0x000054, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_PlayCrafterStartSound_EventId_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, K2Node_Event_EndPlayReason) == 0x000058, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base, CallFunc_SetRTPCValue_Value_ImplicitCast) == 0x00005C, "Member 'BP_ValeriaCrafter_Base_C_ExecuteUbergraph_BP_ValeriaCrafter_Base::CallFunc_SetRTPCValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_ValeriaCrafter_Base.BP_ValeriaCrafter_Base_C.GetCrafter
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaCrafter_Base_C_GetCrafter final
{
public:
	class UCrafterComponent*                      CrafterComponent;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCrafter_Base_C_GetCrafter) == 0x000008, "Wrong alignment on BP_ValeriaCrafter_Base_C_GetCrafter");
static_assert(sizeof(BP_ValeriaCrafter_Base_C_GetCrafter) == 0x000008, "Wrong size on BP_ValeriaCrafter_Base_C_GetCrafter");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_GetCrafter, CrafterComponent) == 0x000000, "Member 'BP_ValeriaCrafter_Base_C_GetCrafter::CrafterComponent' has a wrong offset!");

// Function BP_ValeriaCrafter_Base.BP_ValeriaCrafter_Base_C.GetRemainingTime
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaCrafter_Base_C_GetRemainingTime final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCrafter_Base_C_GetRemainingTime) == 0x000004, "Wrong alignment on BP_ValeriaCrafter_Base_C_GetRemainingTime");
static_assert(sizeof(BP_ValeriaCrafter_Base_C_GetRemainingTime) == 0x000010, "Wrong size on BP_ValeriaCrafter_Base_C_GetRemainingTime");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_GetRemainingTime, ReturnValue) == 0x000000, "Member 'BP_ValeriaCrafter_Base_C_GetRemainingTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_GetRemainingTime, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BP_ValeriaCrafter_Base_C_GetRemainingTime::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_GetRemainingTime, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000008, "Member 'BP_ValeriaCrafter_Base_C_GetRemainingTime::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_GetRemainingTime, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x00000C, "Member 'BP_ValeriaCrafter_Base_C_GetRemainingTime::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_ValeriaCrafter_Base.BP_ValeriaCrafter_Base_C.PlayCrafterSound
// 0x0018 (0x0018 - 0x0000)
struct BP_ValeriaCrafter_Base_C_PlayCrafterSound final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           AkComponent;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayPersistSound_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCrafter_Base_C_PlayCrafterSound) == 0x000008, "Wrong alignment on BP_ValeriaCrafter_Base_C_PlayCrafterSound");
static_assert(sizeof(BP_ValeriaCrafter_Base_C_PlayCrafterSound) == 0x000018, "Wrong size on BP_ValeriaCrafter_Base_C_PlayCrafterSound");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_PlayCrafterSound, AkEvent) == 0x000000, "Member 'BP_ValeriaCrafter_Base_C_PlayCrafterSound::AkEvent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_PlayCrafterSound, AkComponent) == 0x000008, "Member 'BP_ValeriaCrafter_Base_C_PlayCrafterSound::AkComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_PlayCrafterSound, ReturnValue) == 0x000010, "Member 'BP_ValeriaCrafter_Base_C_PlayCrafterSound::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_PlayCrafterSound, CallFunc_PlayPersistSound_ReturnValue) == 0x000014, "Member 'BP_ValeriaCrafter_Base_C_PlayCrafterSound::CallFunc_PlayPersistSound_ReturnValue' has a wrong offset!");

// Function BP_ValeriaCrafter_Base.BP_ValeriaCrafter_Base_C.PlayCrafterStartSound
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaCrafter_Base_C_PlayCrafterStartSound final
{
public:
	int32                                         EventId;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AkIdStartLocal;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1B[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCrafterSound_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCrafter_Base_C_PlayCrafterStartSound) == 0x000004, "Wrong alignment on BP_ValeriaCrafter_Base_C_PlayCrafterStartSound");
static_assert(sizeof(BP_ValeriaCrafter_Base_C_PlayCrafterStartSound) == 0x000010, "Wrong size on BP_ValeriaCrafter_Base_C_PlayCrafterStartSound");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_PlayCrafterStartSound, EventId) == 0x000000, "Member 'BP_ValeriaCrafter_Base_C_PlayCrafterStartSound::EventId' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_PlayCrafterStartSound, AkIdStartLocal) == 0x000004, "Member 'BP_ValeriaCrafter_Base_C_PlayCrafterStartSound::AkIdStartLocal' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_PlayCrafterStartSound, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_ValeriaCrafter_Base_C_PlayCrafterStartSound::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_PlayCrafterStartSound, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000009, "Member 'BP_ValeriaCrafter_Base_C_PlayCrafterStartSound::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_PlayCrafterStartSound, CallFunc_PlayCrafterSound_ReturnValue) == 0x00000C, "Member 'BP_ValeriaCrafter_Base_C_PlayCrafterStartSound::CallFunc_PlayCrafterSound_ReturnValue' has a wrong offset!");

// Function BP_ValeriaCrafter_Base.BP_ValeriaCrafter_Base_C.PlayInteractionSound
// 0x0001 (0x0001 - 0x0000)
struct BP_ValeriaCrafter_Base_C_PlayInteractionSound final
{
public:
	ECrafterState                                 CrafterState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCrafter_Base_C_PlayInteractionSound) == 0x000001, "Wrong alignment on BP_ValeriaCrafter_Base_C_PlayInteractionSound");
static_assert(sizeof(BP_ValeriaCrafter_Base_C_PlayInteractionSound) == 0x000001, "Wrong size on BP_ValeriaCrafter_Base_C_PlayInteractionSound");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_PlayInteractionSound, CrafterState) == 0x000000, "Member 'BP_ValeriaCrafter_Base_C_PlayInteractionSound::CrafterState' has a wrong offset!");

// Function BP_ValeriaCrafter_Base.BP_ValeriaCrafter_Base_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ValeriaCrafter_Base_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCrafter_Base_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ValeriaCrafter_Base_C_ReceiveEndPlay");
static_assert(sizeof(BP_ValeriaCrafter_Base_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ValeriaCrafter_Base_C_ReceiveEndPlay");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_ValeriaCrafter_Base_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_ValeriaCrafter_Base.BP_ValeriaCrafter_Base_C.SetTimers
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaCrafter_Base_C_SetTimers final
{
public:
	int32                                         Param_StartTimeSec;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_EndTimeSec;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCrafter_Base_C_SetTimers) == 0x000004, "Wrong alignment on BP_ValeriaCrafter_Base_C_SetTimers");
static_assert(sizeof(BP_ValeriaCrafter_Base_C_SetTimers) == 0x000008, "Wrong size on BP_ValeriaCrafter_Base_C_SetTimers");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_SetTimers, Param_StartTimeSec) == 0x000000, "Member 'BP_ValeriaCrafter_Base_C_SetTimers::Param_StartTimeSec' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_SetTimers, Param_EndTimeSec) == 0x000004, "Member 'BP_ValeriaCrafter_Base_C_SetTimers::Param_EndTimeSec' has a wrong offset!");

// Function BP_ValeriaCrafter_Base.BP_ValeriaCrafter_Base_C.StopCrafterStartSound
// 0x0001 (0x0001 - 0x0000)
struct BP_ValeriaCrafter_Base_C_StopCrafterStartSound final
{
public:
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCrafter_Base_C_StopCrafterStartSound) == 0x000001, "Wrong alignment on BP_ValeriaCrafter_Base_C_StopCrafterStartSound");
static_assert(sizeof(BP_ValeriaCrafter_Base_C_StopCrafterStartSound) == 0x000001, "Wrong size on BP_ValeriaCrafter_Base_C_StopCrafterStartSound");
static_assert(offsetof(BP_ValeriaCrafter_Base_C_StopCrafterStartSound, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000000, "Member 'BP_ValeriaCrafter_Base_C_StopCrafterStartSound::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

}

