#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Valeria_Gatherable_Placed

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Valeria_Gatherable_Placed.BP_Valeria_Gatherable_Placed_C.ExecuteUbergraph_BP_Valeria_Gatherable_Placed
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_530D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMaxElement_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_530E[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_530F[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5310[0x1];                                     // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetNiagaraVariableFloat_InValue_ImplicitCast; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed) == 0x000008, "Wrong alignment on BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed");
static_assert(sizeof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed) == 0x0000C0, "Wrong size on BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, EntryPoint) == 0x000000, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_GetLocalBounds_Min) == 0x000008, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_GetLocalBounds_Max) == 0x000020, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_GetMaxElement_ReturnValue) == 0x000038, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_GetMaxElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_FClamp_ReturnValue) == 0x000040, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000048, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000060, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_IsServer_ReturnValue) == 0x00006A, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, K2Node_Event_DeltaSeconds) == 0x00006C, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_IsServer_ReturnValue_1) == 0x000070, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, K2Node_CreateDelegate_OutputDelegate_1) == 0x000084, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, K2Node_CreateDelegate_OutputDelegate_2) == 0x000094, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A4, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_IsServer_ReturnValue_2) == 0x0000B4, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_IsValid_ReturnValue_1) == 0x0000B5, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_IsValid_ReturnValue_2) == 0x0000B6, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed, CallFunc_SetNiagaraVariableFloat_InValue_ImplicitCast) == 0x0000B8, "Member 'BP_Valeria_Gatherable_Placed_C_ExecuteUbergraph_BP_Valeria_Gatherable_Placed::CallFunc_SetNiagaraVariableFloat_InValue_ImplicitCast' has a wrong offset!");

// Function BP_Valeria_Gatherable_Placed.BP_Valeria_Gatherable_Placed_C.GetFadeOutPercentage
// 0x0068 (0x0068 - 0x0000)
struct BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage final
{
public:
	double                                        Percentage;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5311[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_GetValeriaTimestampMs64_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Subtract_Int64Int64_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_Int64ToInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5312[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage) == 0x000008, "Wrong alignment on BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage");
static_assert(sizeof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage) == 0x000068, "Wrong size on BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, Percentage) == 0x000000, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::Percentage' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_Multiply_IntInt_ReturnValue) == 0x000008, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_GetValeriaTimestampMs64_ReturnValue) == 0x000018, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_GetValeriaTimestampMs64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_Subtract_Int64Int64_ReturnValue) == 0x000020, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_Subtract_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_Conv_Int64ToInt_ReturnValue) == 0x000030, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_Conv_Int64ToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_FMax_ReturnValue) == 0x000050, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_FMin_ReturnValue) == 0x000058, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'BP_Valeria_Gatherable_Placed_C_GetFadeOutPercentage::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_Valeria_Gatherable_Placed.BP_Valeria_Gatherable_Placed_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Valeria_Gatherable_Placed_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valeria_Gatherable_Placed_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Valeria_Gatherable_Placed_C_ReceiveTick");
static_assert(sizeof(BP_Valeria_Gatherable_Placed_C_ReceiveTick) == 0x000004, "Wrong size on BP_Valeria_Gatherable_Placed_C_ReceiveTick");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Valeria_Gatherable_Placed_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Valeria_Gatherable_Placed.BP_Valeria_Gatherable_Placed_C.Start Erosion VFX and SFX
// 0x0060 (0x0060 - 0x0000)
struct BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX final
{
public:
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5313[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5314[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValeriaTimestampSecs_ReturnValue;      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX) == 0x000008, "Wrong alignment on BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX");
static_assert(sizeof(BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX) == 0x000060, "Wrong size on BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX, CallFunc_GetComponentBounds_Origin) == 0x000000, "Member 'BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX, CallFunc_GetComponentBounds_BoxExtent) == 0x000018, "Member 'BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX, CallFunc_GetComponentBounds_SphereRadius) == 0x000030, "Member 'BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000050, "Member 'BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX, CallFunc_GetValeriaTimestampSecs_ReturnValue) == 0x00005C, "Member 'BP_Valeria_Gatherable_Placed_C_Start_Erosion_VFX_and_SFX::CallFunc_GetValeriaTimestampSecs_ReturnValue' has a wrong offset!");

// Function BP_Valeria_Gatherable_Placed.BP_Valeria_Gatherable_Placed_C.StartFadeOutEffect
// 0x0004 (0x0004 - 0x0000)
struct BP_Valeria_Gatherable_Placed_C_StartFadeOutEffect final
{
public:
	int32                                         CallFunc_GetValeriaTimestampSecs_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valeria_Gatherable_Placed_C_StartFadeOutEffect) == 0x000004, "Wrong alignment on BP_Valeria_Gatherable_Placed_C_StartFadeOutEffect");
static_assert(sizeof(BP_Valeria_Gatherable_Placed_C_StartFadeOutEffect) == 0x000004, "Wrong size on BP_Valeria_Gatherable_Placed_C_StartFadeOutEffect");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartFadeOutEffect, CallFunc_GetValeriaTimestampSecs_ReturnValue) == 0x000000, "Member 'BP_Valeria_Gatherable_Placed_C_StartFadeOutEffect::CallFunc_GetValeriaTimestampSecs_ReturnValue' has a wrong offset!");

// Function BP_Valeria_Gatherable_Placed.BP_Valeria_Gatherable_Placed_C.StartStage1CountdownVFX
// 0x0098 (0x0098 - 0x0000)
struct BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX final
{
public:
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5315[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5316[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX) == 0x000008, "Wrong alignment on BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX");
static_assert(sizeof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX) == 0x000098, "Wrong size on BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_GetComponentBounds_Origin) == 0x000000, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_GetComponentBounds_BoxExtent) == 0x000018, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_GetComponentBounds_SphereRadius) == 0x000030, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000038, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000040, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_Add_VectorVector_ReturnValue) == 0x000060, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_Subtract_IntInt_ReturnValue) == 0x00007C, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, Temp_int_Variable) == 0x000080, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000090, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage1CountdownVFX::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Valeria_Gatherable_Placed.BP_Valeria_Gatherable_Placed_C.StartStage2CountdownVFX
// 0x0028 (0x0028 - 0x0000)
struct BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5317[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5318[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5319[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX) == 0x000008, "Wrong alignment on BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX");
static_assert(sizeof(BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX) == 0x000028, "Wrong size on BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX, Temp_int_Variable) == 0x000004, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_Valeria_Gatherable_Placed_C_StartStage2CountdownVFX::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Valeria_Gatherable_Placed.BP_Valeria_Gatherable_Placed_C.TickErosionVFX
// 0x0030 (0x0030 - 0x0000)
struct BP_Valeria_Gatherable_Placed_C_TickErosionVFX final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetFadeOutPercentage_Percentage;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531B[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531C[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valeria_Gatherable_Placed_C_TickErosionVFX) == 0x000008, "Wrong alignment on BP_Valeria_Gatherable_Placed_C_TickErosionVFX");
static_assert(sizeof(BP_Valeria_Gatherable_Placed_C_TickErosionVFX) == 0x000030, "Wrong size on BP_Valeria_Gatherable_Placed_C_TickErosionVFX");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_TickErosionVFX, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'BP_Valeria_Gatherable_Placed_C_TickErosionVFX::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_TickErosionVFX, CallFunc_GetFadeOutPercentage_Percentage) == 0x000008, "Member 'BP_Valeria_Gatherable_Placed_C_TickErosionVFX::CallFunc_GetFadeOutPercentage_Percentage' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_TickErosionVFX, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_Valeria_Gatherable_Placed_C_TickErosionVFX::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_TickErosionVFX, Temp_int_Variable) == 0x000014, "Member 'BP_Valeria_Gatherable_Placed_C_TickErosionVFX::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_TickErosionVFX, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_Valeria_Gatherable_Placed_C_TickErosionVFX::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_TickErosionVFX, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Valeria_Gatherable_Placed_C_TickErosionVFX::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_TickErosionVFX, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_Valeria_Gatherable_Placed_C_TickErosionVFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_TickErosionVFX, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000029, "Member 'BP_Valeria_Gatherable_Placed_C_TickErosionVFX::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_TickErosionVFX, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00002C, "Member 'BP_Valeria_Gatherable_Placed_C_TickErosionVFX::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_Valeria_Gatherable_Placed.BP_Valeria_Gatherable_Placed_C.TickGhostEffect
// 0x0010 (0x0010 - 0x0000)
struct BP_Valeria_Gatherable_Placed_C_TickGhostEffect final
{
public:
	double                                        CallFunc_GetFadeOutPercentage_Percentage;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valeria_Gatherable_Placed_C_TickGhostEffect) == 0x000008, "Wrong alignment on BP_Valeria_Gatherable_Placed_C_TickGhostEffect");
static_assert(sizeof(BP_Valeria_Gatherable_Placed_C_TickGhostEffect) == 0x000010, "Wrong size on BP_Valeria_Gatherable_Placed_C_TickGhostEffect");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_TickGhostEffect, CallFunc_GetFadeOutPercentage_Percentage) == 0x000000, "Member 'BP_Valeria_Gatherable_Placed_C_TickGhostEffect::CallFunc_GetFadeOutPercentage_Percentage' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_TickGhostEffect, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000008, "Member 'BP_Valeria_Gatherable_Placed_C_TickGhostEffect::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_Valeria_Gatherable_Placed.BP_Valeria_Gatherable_Placed_C.UserConstructionScript
// 0x0280 (0x0280 - 0x0000)
struct BP_Valeria_Gatherable_Placed_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531D[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMaxElement_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531E[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0078(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Select_Default;                             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531F[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5320[0x6];                                     // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0188(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5321[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetNiagaraVariableFloat_InValue_ImplicitCast; // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valeria_Gatherable_Placed_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Valeria_Gatherable_Placed_C_UserConstructionScript");
static_assert(sizeof(BP_Valeria_Gatherable_Placed_C_UserConstructionScript) == 0x000280, "Wrong size on BP_Valeria_Gatherable_Placed_C_UserConstructionScript");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Valeria_Gatherable_Placed_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valeria_Gatherable_Placed_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Valeria_Gatherable_Placed_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
