#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaCharacter

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Palia_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S6Core_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ValeriaCharacter.BP_ValeriaCharacter_C
// 0x02B0 (0x1740 - 0x1490)
class ABP_ValeriaCharacter_C final : public AValeriaCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComp_Listener_Padding_C*               Comp_Listener_Padding;                             // 0x1498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UValeriaSpringArmComponent*             ValeriaSpringArmListener_Padding;                  // 0x14A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractablePlateWidgetComponent_C* RefillWaterCanPlateWidgetComponent;                // 0x14A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         TorsoMesh;                                         // 0x14B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         LegsMesh;                                          // 0x14B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         HatMesh;                                           // 0x14C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         HairMesh;                                          // 0x14C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         FaceAccMesh;                                       // 0x14D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         FaceCoverMesh;                                     // 0x14D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         HeadMesh;                                          // 0x14E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComp_RtpcTracker_C*                    RtpcTracker;                                       // 0x14E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterCustomizationComponent_C*  BP_CharacterCustomizationComponent;                // 0x14F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_VFX_playerFollowMeA_outdoor_C*      BP_VFX_playerFollowMeA_outdoor;                    // 0x14F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComp_Audio_Pool_Manager_C*             AudioPoolManager;                                  // 0x1500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FoliageRustleAudio_C*               BP_FoliageRustleAudio;                             // 0x1508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaminaPlateWidgetComponent_C*      BP_StaminaPlateWidgetComponent;                    // 0x1510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCapture_Selfie;                               // 0x1518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCapture_FP;                                   // 0x1520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UValeriaSpringArmComponent*             PhotographyBoom_Selfie;                            // 0x1528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UValeriaSpringArmComponent*             PhotographyBoom_FP;                                // 0x1530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComp_VoiceSet_C*                       VoiceSetComponent;                                 // 0x1538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComp_Player_Audio_C*                   Comp_Player_Audio;                                 // 0x1540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComp_Actor_Audio_Data_C*               Comp_Actor_AudioData;                              // 0x1548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FishingViewComponent_C*             BP_FishingViewComponent;                           // 0x1550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CameraFadeScenery_C*                BP_CameraFadeScenery;                              // 0x1558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterPlateWidgetComponent_C*    BP_CharacterPlateWidgetComponent;                  // 0x1560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_FishingSafeArea_C*                  FishingSafeArea;                                   // 0x1568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayingArcade;                                   // 0x1570(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A7A[0x7];                                     // 0x1571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   TempCarriedMesh;                                   // 0x1578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 MusicPriority;                                     // 0x1580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShouldRunCosmetics;                                // 0x1590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A7B[0x7];                                     // 0x1591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ECharacterAttachPoint, TSoftClassPtr<class UClass>> GliderPropMap;                                     // 0x1598(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 PreloadGliderHardRef;                              // 0x15E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GliderGearGameplayTag;                             // 0x15F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<ECharacterAttachPoint, TSoftClassPtr<class UClass>> DefaultGliderPropMap;                              // 0x15F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        IKHipOffset;                                       // 0x1648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IKLeft_Foot_Offset;                                // 0x1650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Delta_Seconds;                                     // 0x1658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IKRight_Foot_Offset;                               // 0x1660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKRightHandLocation;                               // 0x1668(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKLeftHandLocation;                                // 0x1680(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LeftHandHitWall;                                   // 0x1698(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RightHandHitWall;                                  // 0x1699(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A7C[0x6];                                     // 0x169A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   GliderPropClassOverride;                           // 0x16A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        GliderCameraPanBack;                               // 0x16C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GliderCameraPanUp;                                 // 0x16D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartCameraPosition;                               // 0x16D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WaterSphereOverlapOffset;                          // 0x16F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WaterSphereOverlapRadius;                          // 0x16F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      WaterSphereOverlapObjectTypes;                     // 0x1700(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           WateringCanTimer;                                  // 0x1710(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          DialoguePrintSound;                                // 0x1718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          DialogueFullyShownSound;                           // 0x1720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousDialogueStringLength;                      // 0x1728(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Glider_Attach_Point_Override;                      // 0x172C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ValeriaCharacter_DialogueManager_K2Node_ComponentBoundEvent_1_DialogProgressedDelegate__DelegateSignature(class UDialogueComponent* Diag);
	void BndEvt__BP_ValeriaCharacter_EquipmentComponent_K2Node_ComponentBoundEvent_2_EquipmentChangedDelegate__DelegateSignature(class UEquipmentComponent* Param_EquipmentComponent, const struct FEquipmentItem& Item);
	void BndEvt__BP_ValeriaCharacter_Placement_K2Node_ComponentBoundEvent_0_PlacementConfirmed__DelegateSignature(class UPlacementComponent* PC, bool Placed);
	void ChargeForStableUsage(class AActor* StablesActor, class UTeleportTravelConfigAsset* DestinationConfig);
	void Client_BeginInspirationSequence();
	void Client_DisplayCrafter(class UCrafterComponent* Crafter);
	void Client_EndInspirationSequence();
	void CloseSubgameScreen();
