#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaGatherableLoot

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.AudioOnHit
// 0x0068 (0x0068 - 0x0000)
struct BP_ValeriaGatherableLoot_C_AudioOnHit final
{
public:
	bool                                          CanDamage;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47E2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Instigator;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47E3[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47E4[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent_1;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID_1;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_AudioOnHit) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_AudioOnHit");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_AudioOnHit) == 0x000068, "Wrong size on BP_ValeriaGatherableLoot_C_AudioOnHit");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_AudioOnHit, CanDamage) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_AudioOnHit::CanDamage' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_AudioOnHit, Param_Instigator) == 0x000008, "Member 'BP_ValeriaGatherableLoot_C_AudioOnHit::Param_Instigator' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_AudioOnHit, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_ValeriaGatherableLoot_C_AudioOnHit::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_AudioOnHit, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'BP_ValeriaGatherableLoot_C_AudioOnHit::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_AudioOnHit, CallFunc_IsServer_ReturnValue) == 0x000040, "Member 'BP_ValeriaGatherableLoot_C_AudioOnHit::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_AudioOnHit, CallFunc_AkEventLocation_AkComponent) == 0x000048, "Member 'BP_ValeriaGatherableLoot_C_AudioOnHit::CallFunc_AkEventLocation_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_AudioOnHit, CallFunc_AkEventLocation_Playing_ID) == 0x000050, "Member 'BP_ValeriaGatherableLoot_C_AudioOnHit::CallFunc_AkEventLocation_Playing_ID' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_AudioOnHit, CallFunc_AkEventLocation_AkComponent_1) == 0x000058, "Member 'BP_ValeriaGatherableLoot_C_AudioOnHit::CallFunc_AkEventLocation_AkComponent_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_AudioOnHit, CallFunc_AkEventLocation_Playing_ID_1) == 0x000060, "Member 'BP_ValeriaGatherableLoot_C_AudioOnHit::CallFunc_AkEventLocation_Playing_ID_1' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.Can Character Participate
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaGatherableLoot_C_Can_Character_Participate final
{
public:
	class AValeriaCharacter*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CanParticipate;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_Can_Character_Participate) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_Can_Character_Participate");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_Can_Character_Participate) == 0x000010, "Wrong size on BP_ValeriaGatherableLoot_C_Can_Character_Participate");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_Can_Character_Participate, Character) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_Can_Character_Participate::Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_Can_Character_Participate, CanParticipate) == 0x000008, "Member 'BP_ValeriaGatherableLoot_C_Can_Character_Participate::CanParticipate' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.CanLocalPlayerSeeHealthBar
// 0x0001 (0x0001 - 0x0000)
struct BP_ValeriaGatherableLoot_C_CanLocalPlayerSeeHealthBar final
{
public:
	bool                                          CanSee;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_CanLocalPlayerSeeHealthBar) == 0x000001, "Wrong alignment on BP_ValeriaGatherableLoot_C_CanLocalPlayerSeeHealthBar");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_CanLocalPlayerSeeHealthBar) == 0x000001, "Wrong size on BP_ValeriaGatherableLoot_C_CanLocalPlayerSeeHealthBar");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_CanLocalPlayerSeeHealthBar, CanSee) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_CanLocalPlayerSeeHealthBar::CanSee' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.DestroySelf
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaGatherableLoot_C_DestroySelf final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_DestroySelf) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_DestroySelf");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_DestroySelf) == 0x000008, "Wrong size on BP_ValeriaGatherableLoot_C_DestroySelf");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_DestroySelf, Param_Instigator) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_DestroySelf::Param_Instigator' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.ExecuteUbergraph_BP_ValeriaGatherableLoot
// 0x01C8 (0x01C8 - 0x0000)
struct BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47E5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVitalsComponent*                       K2Node_CustomEvent_Vitals;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVitalsChange                          K2Node_CustomEvent_change;                         // 0x0010(0x0040)()
	class AActor*                                 K2Node_CustomEvent_instigator_3;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_instigator_2;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       K2Node_CustomEvent_vital;                          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_PlateHealthBar_Tree_C*              CallFunc_GetOrCreateHealthBar_HealthBar;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       K2Node_CustomEvent_Vitals_2;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVitalsChange                          K2Node_CustomEvent_change_1;                       // 0x0078(0x0040)()
	class UBP_PlateHealthBar_Tree_C*              CallFunc_GetOrCreateHealthBar_HealthBar_1;         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       K2Node_CustomEvent_Vitals_1;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVital_ReturnValue;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVitalMax_ReturnValue;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47E6[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVitalsComponent*                       CallFunc_GetVitals_ReturnValue;                    // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_instigator_1;                   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47E7[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47E8[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVitalsComponent* Vitals, const struct FVitalsChange& Change)> K2Node_CreateDelegate_OutputDelegate;              // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVitalsComponent* Vitals, const struct FVitalsChange& Change)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActorSpawnPointsManager*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UBP_PlateHealthBar_Tree_C*              CallFunc_GetOrCreateHealthBar_HealthBar_2;         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanLocalPlayerSeeHealthBar_CanSee;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47E9[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_instigator;                     // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent;              // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47EA[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVitalsComponent*                       CallFunc_GetVitals_ReturnValue_1;                  // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot) == 0x0001C8, "Wrong size on BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, EntryPoint) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CustomEvent_Vitals) == 0x000008, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CustomEvent_Vitals' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CustomEvent_change) == 0x000010, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CustomEvent_change' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CustomEvent_instigator_3) == 0x000050, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CustomEvent_instigator_3' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CustomEvent_instigator_2) == 0x000058, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CustomEvent_instigator_2' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CustomEvent_vital) == 0x000060, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CustomEvent_vital' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_GetOrCreateHealthBar_HealthBar) == 0x000068, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_GetOrCreateHealthBar_HealthBar' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CustomEvent_Vitals_2) == 0x000070, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CustomEvent_Vitals_2' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CustomEvent_change_1) == 0x000078, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CustomEvent_change_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_GetOrCreateHealthBar_HealthBar_1) == 0x0000B8, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_GetOrCreateHealthBar_HealthBar_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CustomEvent_Vitals_1) == 0x0000C0, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CustomEvent_Vitals_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_GetVital_ReturnValue) == 0x0000C8, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_GetVital_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_GetVitalMax_ReturnValue) == 0x0000CC, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_GetVitalMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_IsServer_ReturnValue) == 0x0000D1, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_GetVitals_ReturnValue) == 0x0000D8, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_GetVitals_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CustomEvent_instigator_1) == 0x0000E0, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CustomEvent_instigator_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E8, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000100, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_IsServer_ReturnValue_1) == 0x000118, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000120, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_IsValid_ReturnValue_1) == 0x000129, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000130, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CreateDelegate_OutputDelegate) == 0x000138, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000148, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000158, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CreateDelegate_OutputDelegate_2) == 0x000160, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000170, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_GetOrCreateHealthBar_HealthBar_2) == 0x000178, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_GetOrCreateHealthBar_HealthBar_2' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000180, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_CanLocalPlayerSeeHealthBar_CanSee) == 0x000198, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_CanLocalPlayerSeeHealthBar_CanSee' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, K2Node_CustomEvent_instigator) == 0x0001A0, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::K2Node_CustomEvent_instigator' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_AkEventLocation_AkComponent) == 0x0001A8, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_AkEventLocation_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_AkEventLocation_Playing_ID) == 0x0001B0, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_AkEventLocation_Playing_ID' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_GetVitals_ReturnValue_1) == 0x0001B8, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_GetVitals_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot, CallFunc_Delay_Duration_ImplicitCast) == 0x0001C0, "Member 'BP_ValeriaGatherableLoot_C_ExecuteUbergraph_BP_ValeriaGatherableLoot::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.GetOrCreateHealthBar
// 0x0020 (0x0020 - 0x0000)
struct BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar final
{
public:
	class UBP_PlateHealthBar_Tree_C*              HealthBar;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47EB[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlateHealthBar_Tree_C*              CallFunc_AddComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar) == 0x000020, "Wrong size on BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar, HealthBar) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar::HealthBar' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar, Temp_bool_Has_Been_Initd_Variable) == 0x000008, "Member 'BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar, Temp_bool_IsClosed_Variable) == 0x000009, "Member 'BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar, CallFunc_AddComponentByClass_ReturnValue) == 0x000010, "Member 'BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000018, "Member 'BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_ValeriaGatherableLoot_C_GetOrCreateHealthBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.HandleVitalsChanged
// 0x0050 (0x0050 - 0x0000)
struct BP_ValeriaGatherableLoot_C_HandleVitalsChanged final
{
public:
	class UVitalsComponent*                       VitalsComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVitalsChange                          Change;                                            // 0x0008(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CallFunc_GetVital_ReturnValue;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_HandleVitalsChanged) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_HandleVitalsChanged");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_HandleVitalsChanged) == 0x000050, "Wrong size on BP_ValeriaGatherableLoot_C_HandleVitalsChanged");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_HandleVitalsChanged, VitalsComponent) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_HandleVitalsChanged::VitalsComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_HandleVitalsChanged, Change) == 0x000008, "Member 'BP_ValeriaGatherableLoot_C_HandleVitalsChanged::Change' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_HandleVitalsChanged, CallFunc_GetVital_ReturnValue) == 0x000048, "Member 'BP_ValeriaGatherableLoot_C_HandleVitalsChanged::CallFunc_GetVital_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_HandleVitalsChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'BP_ValeriaGatherableLoot_C_HandleVitalsChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_HandleVitalsChanged, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'BP_ValeriaGatherableLoot_C_HandleVitalsChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_HandleVitalsChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004E, "Member 'BP_ValeriaGatherableLoot_C_HandleVitalsChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.OnGatherableDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaGatherableLoot_C_OnGatherableDestroyed final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_OnGatherableDestroyed) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_OnGatherableDestroyed");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_OnGatherableDestroyed) == 0x000008, "Wrong size on BP_ValeriaGatherableLoot_C_OnGatherableDestroyed");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_OnGatherableDestroyed, Param_Instigator) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_OnGatherableDestroyed::Param_Instigator' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.OnGatherableHit
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaGatherableLoot_C_OnGatherableHit final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       Vital;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_OnGatherableHit) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_OnGatherableHit");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_OnGatherableHit) == 0x000010, "Wrong size on BP_ValeriaGatherableLoot_C_OnGatherableHit");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_OnGatherableHit, Param_Instigator) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_OnGatherableHit::Param_Instigator' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_OnGatherableHit, Vital) == 0x000008, "Member 'BP_ValeriaGatherableLoot_C_OnGatherableHit::Vital' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.OnHealthReachedZero
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaGatherableLoot_C_OnHealthReachedZero final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_OnHealthReachedZero) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_OnHealthReachedZero");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_OnHealthReachedZero) == 0x000008, "Wrong size on BP_ValeriaGatherableLoot_C_OnHealthReachedZero");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_OnHealthReachedZero, Param_Instigator) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_OnHealthReachedZero::Param_Instigator' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.OnVitalsChanged
// 0x0048 (0x0048 - 0x0000)
struct BP_ValeriaGatherableLoot_C_OnVitalsChanged final
{
public:
	class UVitalsComponent*                       Param_Vitals;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVitalsChange                          Change;                                            // 0x0008(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_OnVitalsChanged) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_OnVitalsChanged");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_OnVitalsChanged) == 0x000048, "Wrong size on BP_ValeriaGatherableLoot_C_OnVitalsChanged");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_OnVitalsChanged, Param_Vitals) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_OnVitalsChanged::Param_Vitals' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_OnVitalsChanged, Change) == 0x000008, "Member 'BP_ValeriaGatherableLoot_C_OnVitalsChanged::Change' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.OnVitalsChanged_PostReplicate
// 0x0048 (0x0048 - 0x0000)
struct BP_ValeriaGatherableLoot_C_OnVitalsChanged_PostReplicate final
{
public:
	class UVitalsComponent*                       Param_Vitals;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVitalsChange                          Change;                                            // 0x0008(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_OnVitalsChanged_PostReplicate) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_OnVitalsChanged_PostReplicate");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_OnVitalsChanged_PostReplicate) == 0x000048, "Wrong size on BP_ValeriaGatherableLoot_C_OnVitalsChanged_PostReplicate");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_OnVitalsChanged_PostReplicate, Param_Vitals) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_OnVitalsChanged_PostReplicate::Param_Vitals' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_OnVitalsChanged_PostReplicate, Change) == 0x000008, "Member 'BP_ValeriaGatherableLoot_C_OnVitalsChanged_PostReplicate::Change' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.UpdateHealthBar
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaGatherableLoot_C_UpdateHealthBar final
{
public:
	class UVitalsComponent*                       Param_Vitals;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_UpdateHealthBar) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_UpdateHealthBar");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_UpdateHealthBar) == 0x000008, "Wrong size on BP_ValeriaGatherableLoot_C_UpdateHealthBar");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_UpdateHealthBar, Param_Vitals) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_UpdateHealthBar::Param_Vitals' has a wrong offset!");

// Function BP_ValeriaGatherableLoot.BP_ValeriaGatherableLoot_C.VFX_OnHit
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaGatherableLoot_C_VFX_OnHit final
{
public:
	bool                                          CanDamage;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47EC[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Instigator;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_C_VFX_OnHit) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_C_VFX_OnHit");
static_assert(sizeof(BP_ValeriaGatherableLoot_C_VFX_OnHit) == 0x000010, "Wrong size on BP_ValeriaGatherableLoot_C_VFX_OnHit");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_VFX_OnHit, CanDamage) == 0x000000, "Member 'BP_ValeriaGatherableLoot_C_VFX_OnHit::CanDamage' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_C_VFX_OnHit, Param_Instigator) == 0x000008, "Member 'BP_ValeriaGatherableLoot_C_VFX_OnHit::Param_Instigator' has a wrong offset!");

}

