#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VFX_playerFollowMeA_outdoor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_core_Scalability_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BP_VFX_playerFollowMeA_outdoor.BP_VFX_playerFollowMeA_outdoor_C.event_dayOrNight
// 0x0001 (0x0001 - 0x0000)
struct BP_VFX_playerFollowMeA_outdoor_C_Event_dayOrNight final
{
public:
	bool                                          bIsNight;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFX_playerFollowMeA_outdoor_C_Event_dayOrNight) == 0x000001, "Wrong alignment on BP_VFX_playerFollowMeA_outdoor_C_Event_dayOrNight");
static_assert(sizeof(BP_VFX_playerFollowMeA_outdoor_C_Event_dayOrNight) == 0x000001, "Wrong size on BP_VFX_playerFollowMeA_outdoor_C_Event_dayOrNight");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_Event_dayOrNight, bIsNight) == 0x000000, "Member 'BP_VFX_playerFollowMeA_outdoor_C_Event_dayOrNight::bIsNight' has a wrong offset!");

// Function BP_VFX_playerFollowMeA_outdoor.BP_VFX_playerFollowMeA_outdoor_C.event_InsectMe
// 0x0040 (0x0040 - 0x0000)
struct BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe final
{
public:
	double                                        RangeMin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RangeMax;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RangeVertical;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          NS_Insect;                                         // 0x0018(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe) == 0x000008, "Wrong alignment on BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe");
static_assert(sizeof(BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe) == 0x000040, "Wrong size on BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe, RangeMin) == 0x000000, "Member 'BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe::RangeMin' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe, RangeMax) == 0x000008, "Member 'BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe::RangeMax' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe, RangeVertical) == 0x000010, "Member 'BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe::RangeVertical' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe, NS_Insect) == 0x000018, "Member 'BP_VFX_playerFollowMeA_outdoor_C_Event_InsectMe::NS_Insect' has a wrong offset!");

// Function BP_VFX_playerFollowMeA_outdoor.BP_VFX_playerFollowMeA_outdoor_C.event_rainSetUp
// 0x0028 (0x0028 - 0x0000)
struct BP_VFX_playerFollowMeA_outdoor_C_Event_rainSetUp final
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          NSRain;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFX_playerFollowMeA_outdoor_C_Event_rainSetUp) == 0x000008, "Wrong alignment on BP_VFX_playerFollowMeA_outdoor_C_Event_rainSetUp");
static_assert(sizeof(BP_VFX_playerFollowMeA_outdoor_C_Event_rainSetUp) == 0x000028, "Wrong size on BP_VFX_playerFollowMeA_outdoor_C_Event_rainSetUp");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_Event_rainSetUp, NSRain) == 0x000000, "Member 'BP_VFX_playerFollowMeA_outdoor_C_Event_rainSetUp::NSRain' has a wrong offset!");

// Function BP_VFX_playerFollowMeA_outdoor.BP_VFX_playerFollowMeA_outdoor_C.event_windMe
// 0x0028 (0x0028 - 0x0000)
struct BP_VFX_playerFollowMeA_outdoor_C_Event_windMe final
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          NSWind;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFX_playerFollowMeA_outdoor_C_Event_windMe) == 0x000008, "Wrong alignment on BP_VFX_playerFollowMeA_outdoor_C_Event_windMe");
static_assert(sizeof(BP_VFX_playerFollowMeA_outdoor_C_Event_windMe) == 0x000028, "Wrong size on BP_VFX_playerFollowMeA_outdoor_C_Event_windMe");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_Event_windMe, NSWind) == 0x000000, "Member 'BP_VFX_playerFollowMeA_outdoor_C_Event_windMe::NSWind' has a wrong offset!");

// Function BP_VFX_playerFollowMeA_outdoor.BP_VFX_playerFollowMeA_outdoor_C.ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor
// 0x02F0 (0x02F0 - 0x0000)
struct BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419E[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloat_ReturnValue_1;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyByPi_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sqrt_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sin_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Cos_ReturnValue;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_rangeMin;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_rangeMax;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_rangeVertical;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          K2Node_CustomEvent_NS_Insect;                      // 0x0068(0x0028)(HasGetValueTypeHash)
	Enum_core_Scalability                         CallFunc_GlobalScalabilitySetting_ScalabilitySetting; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419F[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A0[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A1[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               K2Node_CustomEvent_vpc;                            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_CustomEvent_ctxt;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsNight)>                K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A2[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          K2Node_CustomEvent_NSRain;                         // 0x0108(0x0028)(HasGetValueTypeHash)
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A3[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          K2Node_CustomEvent_NSWind;                         // 0x0140(0x0028)(HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A4[0x6];                                     // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A5[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaPlayerController* Vpc, class AValeriaCharacter* Ctxt)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_1;             // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A6[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A7[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_fn_whereMyGround_posZ_ground;             // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_fn_whereMyGround_IFoundGround;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A8[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_fn_whereMyGround_surface_type;            // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A9[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41AA[0x3];                                     // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0254(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41AB[0x3];                                     // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0268(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0280(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0290(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UValeriaWeather*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValEnvironmentManager*                 CallFunc_GetCurrentEnvManager_ReturnValue;         // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_core_Scalability                         CallFunc_GlobalScalabilitySetting_ScalabilitySetting_1; // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeOfDayPeriod                              CallFunc_GetTimeOfDayPeriod_ReturnValue;           // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41AC[0x2];                                     // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsNight;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_2;          // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41AD[0x5];                                     // 0x02C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_2;        // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_3;          // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41AE[0x5];                                     // 0x02D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_3;        // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41AF[0x2];                                     // 0x02E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor) == 0x000008, "Wrong alignment on BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor");
static_assert(sizeof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor) == 0x0002F0, "Wrong size on BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, EntryPoint) == 0x000000, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetValeriaCharacter_OutResult) == 0x000004, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_IsLocallyControlled_ReturnValue) == 0x000010, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_RandomFloat_ReturnValue) == 0x000018, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_RandomFloat_ReturnValue_1) == 0x000020, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_MultiplyByPi_ReturnValue) == 0x000028, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_MultiplyByPi_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_Sqrt_ReturnValue) == 0x000030, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_Sin_ReturnValue) == 0x000040, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_Cos_ReturnValue) == 0x000048, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CustomEvent_rangeMin) == 0x000050, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CustomEvent_rangeMin' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CustomEvent_rangeMax) == 0x000058, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CustomEvent_rangeMax' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CustomEvent_rangeVertical) == 0x000060, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CustomEvent_rangeVertical' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CustomEvent_NS_Insect) == 0x000068, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CustomEvent_NS_Insect' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GlobalScalabilitySetting_ScalabilitySetting) == 0x000090, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GlobalScalabilitySetting_ScalabilitySetting' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_Lerp_ReturnValue) == 0x000098, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000A0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000A8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000B0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_MakeVector_ReturnValue) == 0x0000B8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_Event_DeltaSeconds) == 0x0000D0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CustomEvent_vpc) == 0x0000D8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CustomEvent_vpc' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CustomEvent_ctxt) == 0x0000E0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CustomEvent_ctxt' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetValeriaCharacter_OutResult_1) == 0x0000F8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetValeriaCharacter_OutResult_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetValeriaCharacter_ReturnValue_1) == 0x000100, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetValeriaCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CustomEvent_NSRain) == 0x000108, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CustomEvent_NSRain' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000130, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_SwitchEnum_CmpSuccess_2) == 0x000138, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CustomEvent_NSWind) == 0x000140, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CustomEvent_NSWind' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, Temp_object_Variable) == 0x000168, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_DynamicCast_AsNiagara_System) == 0x000170, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, Temp_bool_Has_Been_Initd_Variable) == 0x000179, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CustomEvent_Loaded) == 0x000180, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, Temp_bool_IsClosed_Variable) == 0x000188, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CreateDelegate_OutputDelegate_1) == 0x00018C, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00019C, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, Temp_object_Variable_1) == 0x0001A0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_DynamicCast_AsNiagara_System_1) == 0x0001A8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_DynamicCast_AsNiagara_System_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_DynamicCast_bSuccess_1) == 0x0001B0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetOwner_ReturnValue) == 0x0001B8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetOwner_ReturnValue_1) == 0x0001C0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001C8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x0001D0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0001D8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001E0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_Add_VectorVector_ReturnValue) == 0x0001F8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_IsValid_ReturnValue) == 0x000210, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_fn_whereMyGround_posZ_ground) == 0x000218, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_fn_whereMyGround_posZ_ground' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_fn_whereMyGround_IFoundGround) == 0x000230, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_fn_whereMyGround_IFoundGround' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_fn_whereMyGround_surface_type) == 0x000234, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_fn_whereMyGround_surface_type' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000238, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000240, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CustomEvent_Loaded_1) == 0x000248, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_IsValid_ReturnValue_1) == 0x000250, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CreateDelegate_OutputDelegate_2) == 0x000254, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_IsServer_ReturnValue) == 0x000264, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000268, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CreateDelegate_OutputDelegate_3) == 0x000270, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CreateDelegate_OutputDelegate_4) == 0x000280, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000290, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000298, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetCurrentEnvManager_ReturnValue) == 0x0002A0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetCurrentEnvManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GlobalScalabilitySetting_ScalabilitySetting_1) == 0x0002A8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GlobalScalabilitySetting_ScalabilitySetting_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetTimeOfDayPeriod_ReturnValue) == 0x0002A9, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetTimeOfDayPeriod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_SwitchEnum_CmpSuccess_3) == 0x0002AA, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002AB, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_IsValid_ReturnValue_2) == 0x0002AC, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_Not_PreBool_ReturnValue) == 0x0002AD, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002B0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_CustomEvent_bIsNight) == 0x0002C0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_CustomEvent_bIsNight' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002C1, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetValeriaCharacter_OutResult_2) == 0x0002C2, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetValeriaCharacter_OutResult_2' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetValeriaCharacter_ReturnValue_2) == 0x0002C8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetValeriaCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0002D0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_SwitchEnum_CmpSuccess_4) == 0x0002D1, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetValeriaCharacter_OutResult_3) == 0x0002D2, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetValeriaCharacter_OutResult_3' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_GetValeriaCharacter_ReturnValue_3) == 0x0002D8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_GetValeriaCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, K2Node_SwitchEnum_CmpSuccess_5) == 0x0002E0, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x0002E1, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0002E4, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x0002E8, "Member 'BP_VFX_playerFollowMeA_outdoor_C_ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");

// Function BP_VFX_playerFollowMeA_outdoor.BP_VFX_playerFollowMeA_outdoor_C.fn_whereMyGround
// 0x02E8 (0x02E8 - 0x0000)
struct BP_VFX_playerFollowMeA_outdoor_C_Fn_whereMyGround final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Range;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PosZ_ground;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IFoundGround;                                      // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B0[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Surface_type;                                      // 0x003C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Surface_hit;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B1[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MyPosZ_ground;                                     // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Ground_type;                                       // 0x0060(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B2[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_16;                              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_17;                              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_18;                              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_19;                              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B3[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable_20;                              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              Temp_byte_Variable;                                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B4[0x3];                                     // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0110(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0120(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B5[0x1];                                     // 0x020B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B6[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
