#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VFX_playerFollowMeA_outdoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_core_Scalability_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VFX_playerFollowMeA_outdoor.BP_VFX_playerFollowMeA_outdoor_C
// 0x0050 (0x00F0 - 0x00A0)
class UBP_VFX_playerFollowMeA_outdoor_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Insect_spawnRadiusCloseMin;                        // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Insect_spawnRadiusCloseMax;                        // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DayWalker;                                         // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419C[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Insect_spawnRadiusFarMin;                          // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Insect_spawnRadiusFarMax;                          // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Insect_spawnInterval_Close;                        // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Insect_spawnInterval_Far;                          // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      MyNS_rain;                                         // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      MyNS_wind;                                         // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Event_DayCheck();
	void Event_dayOrNight(bool bIsNight);
	void Event_insectClose();
	void Event_insectFar();
	void Event_InsectMe(double RangeMin, double RangeMax, double RangeVertical, TSoftObjectPtr<class UNiagaraSystem> NS_Insect);
	void Event_rainSetUp(TSoftObjectPtr<class UNiagaraSystem> NSRain);
	void Event_testAttachMe();
	void Event_timerInsect();
	void Event_windMe(TSoftObjectPtr<class UNiagaraSystem> NSWind);
	void ExecuteUbergraph_BP_VFX_playerFollowMeA_outdoor(int32 EntryPoint, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, double CallFunc_RandomFloat_ReturnValue, double CallFunc_RandomFloat_ReturnValue_1, double CallFunc_MultiplyByPi_ReturnValue, double CallFunc_Sqrt_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Sin_ReturnValue, double CallFunc_Cos_ReturnValue, double K2Node_CustomEvent_rangeMin, double K2Node_CustomEvent_rangeMax, double K2Node_CustomEvent_rangeVertical, TSoftObjectPtr<class UNiagaraSystem> K2Node_CustomEvent_NS_Insect, Enum_core_Scalability CallFunc_GlobalScalabilitySetting_ScalabilitySetting, double CallFunc_Lerp_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, const struct FVector& CallFunc_MakeVector_ReturnValue, float K2Node_Event_DeltaSeconds, class AValeriaPlayerController* K2Node_CustomEvent_vpc, class AValeriaCharacter* K2Node_CustomEvent_ctxt, TDelegate<void(bool bIsNight)> K2Node_CreateDelegate_OutputDelegate, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult_1, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_1, TSoftObjectPtr<class UNiagaraSystem> K2Node_CustomEvent_NSRain, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_2, TSoftObjectPtr<class UNiagaraSystem> K2Node_CustomEvent_NSWind, class UObject* Temp_object_Variable, class UNiagaraSystem* K2Node_DynamicCast_AsNiagara_System, bool K2Node_DynamicCast_bSuccess, bool Temp_bool_Has_Been_Initd_Variable, class UObject* K2Node_CustomEvent_Loaded, bool Temp_bool_IsClosed_Variable, TDelegate<void(class AValeriaPlayerController* Vpc, class AValeriaCharacter* Ctxt)> K2Node_CreateDelegate_OutputDelegate_1, int32 CallFunc_RandomIntegerInRange_ReturnValue, class UObject* Temp_object_Variable_1, class UNiagaraSystem* K2Node_DynamicCast_AsNiagara_System_1, bool K2Node_DynamicCast_bSuccess_1, class AActor* CallFunc_GetOwner_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue_1, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_fn_whereMyGround_posZ_ground, bool CallFunc_fn_whereMyGround_IFoundGround, int32 CallFunc_fn_whereMyGround_surface_type, bool CallFunc_GreaterEqual_IntInt_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, class UObject* K2Node_CustomEvent_Loaded_1, bool CallFunc_IsValid_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_IsServer_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate_4, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, class UValeriaWeather* CallFunc_GetWorldSubsystem_ReturnValue, class AValEnvironmentManager* CallFunc_GetCurrentEnvManager_ReturnValue, Enum_core_Scalability CallFunc_GlobalScalabilitySetting_ScalabilitySetting_1, ETimeOfDayPeriod CallFunc_GetTimeOfDayPeriod_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_3, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_Not_PreBool_ReturnValue, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate_5, bool K2Node_CustomEvent_bIsNight, bool CallFunc_Not_PreBool_ReturnValue_1, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult_2, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_2, bool CallFunc_IsLocallyControlled_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_4, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult_3, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_3, bool K2Node_SwitchEnum_CmpSuccess_5, bool CallFunc_IsLocallyControlled_ReturnValue_2, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1);
	void Fn_whereMyGround(const struct FVector& Pos, double Range, struct FVector* PosZ_ground, bool* IFoundGround, int32* Surface_type, int32 Surface_hit, const struct FVector& MyPosZ_ground, const TArray<EObjectTypeQuery>& Ground_type, int32 Temp_int_Variable, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, int32 Temp_int_Variable_1, int32 Temp_int_Variable_2, int32 Temp_int_Variable_3, int32 Temp_int_Variable_4, int32 Temp_int_Variable_5, int32 Temp_int_Variable_6, int32 Temp_int_Variable_7, int32 Temp_int_Variable_8, int32 Temp_int_Variable_9, int32 Temp_int_Variable_10, int32 Temp_int_Variable_11, int32 Temp_int_Variable_12, int32 Temp_int_Variable_13, int32 Temp_int_Variable_14, int32 Temp_int_Variable_15, int32 Temp_int_Variable_16, int32 Temp_int_Variable_17, int32 Temp_int_Variable_18, int32 Temp_int_Variable_19, TArray<EObjectTypeQuery>& K2Node_MakeArray_Array, int32 Temp_int_Variable_20, EPhysicalSurface Temp_byte_Variable, TArray<class AActor*>& Temp_object_Variable, const struct FHitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, int32 K2Node_Select_Default);
	void GetValeriaCharacter(class AActor** Character, class AActor* ActorFound, class AActor* CallFunc_GetOwner_ReturnValue, class APlayerController* K2Node_DynamicCast_AsPlayer_Controller, bool K2Node_DynamicCast_bSuccess, class APawn* CallFunc_K2_GetPawn_ReturnValue);
	void HandleOnPlayerSpawned(class AValeriaPlayerController* Vpc, class AValeriaCharacter* Ctxt);
	void OnLoaded_195848F44756CFB0D86BF8A6DB61AC0A(class UObject* Loaded);
	void OnLoaded_FCC30F074FEAC4A4972F8AAA0EC59CA5(class UObject* Loaded);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Tick_rainMe();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VFX_playerFollowMeA_outdoor_C">();
	}
	static class UBP_VFX_playerFollowMeA_outdoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VFX_playerFollowMeA_outdoor_C>();
	}
};
static_assert(alignof(UBP_VFX_playerFollowMeA_outdoor_C) == 0x000008, "Wrong alignment on UBP_VFX_playerFollowMeA_outdoor_C");
static_assert(sizeof(UBP_VFX_playerFollowMeA_outdoor_C) == 0x0000F0, "Wrong size on UBP_VFX_playerFollowMeA_outdoor_C");
static_assert(offsetof(UBP_VFX_playerFollowMeA_outdoor_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_VFX_playerFollowMeA_outdoor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_VFX_playerFollowMeA_outdoor_C, Insect_spawnRadiusCloseMin) == 0x0000A8, "Member 'UBP_VFX_playerFollowMeA_outdoor_C::Insect_spawnRadiusCloseMin' has a wrong offset!");
static_assert(offsetof(UBP_VFX_playerFollowMeA_outdoor_C, Insect_spawnRadiusCloseMax) == 0x0000B0, "Member 'UBP_VFX_playerFollowMeA_outdoor_C::Insect_spawnRadiusCloseMax' has a wrong offset!");
static_assert(offsetof(UBP_VFX_playerFollowMeA_outdoor_C, DayWalker) == 0x0000B8, "Member 'UBP_VFX_playerFollowMeA_outdoor_C::DayWalker' has a wrong offset!");
static_assert(offsetof(UBP_VFX_playerFollowMeA_outdoor_C, Insect_spawnRadiusFarMin) == 0x0000C0, "Member 'UBP_VFX_playerFollowMeA_outdoor_C::Insect_spawnRadiusFarMin' has a wrong offset!");
static_assert(offsetof(UBP_VFX_playerFollowMeA_outdoor_C, Insect_spawnRadiusFarMax) == 0x0000C8, "Member 'UBP_VFX_playerFollowMeA_outdoor_C::Insect_spawnRadiusFarMax' has a wrong offset!");
static_assert(offsetof(UBP_VFX_playerFollowMeA_outdoor_C, Insect_spawnInterval_Close) == 0x0000D0, "Member 'UBP_VFX_playerFollowMeA_outdoor_C::Insect_spawnInterval_Close' has a wrong offset!");
static_assert(offsetof(UBP_VFX_playerFollowMeA_outdoor_C, Insect_spawnInterval_Far) == 0x0000D8, "Member 'UBP_VFX_playerFollowMeA_outdoor_C::Insect_spawnInterval_Far' has a wrong offset!");
static_assert(offsetof(UBP_VFX_playerFollowMeA_outdoor_C, MyNS_rain) == 0x0000E0, "Member 'UBP_VFX_playerFollowMeA_outdoor_C::MyNS_rain' has a wrong offset!");
static_assert(offsetof(UBP_VFX_playerFollowMeA_outdoor_C, MyNS_wind) == 0x0000E8, "Member 'UBP_VFX_playerFollowMeA_outdoor_C::MyNS_wind' has a wrong offset!");

}

