#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaGatherableLoot_Mining_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "Enum_vfx_mineNodeType_structs.hpp"


namespace SDK::Params
{

// Function BP_ValeriaGatherableLoot_Mining_Base.BP_ValeriaGatherableLoot_Mining_Base_C.ApplyImpactDecal
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAttached_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60FF[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal");
static_assert(sizeof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal) == 0x0000A0, "Wrong size on BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal, Position) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal::Position' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal, Rotation) == 0x000018, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal::Rotation' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000038, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000040, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal, CallFunc_MakeRotator_ReturnValue) == 0x000060, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal, CallFunc_ComposeRotators_ReturnValue) == 0x000078, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal, CallFunc_SpawnDecalAttached_ReturnValue) == 0x000090, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal::CallFunc_SpawnDecalAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x00009C, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ApplyImpactDecal::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Mining_Base.BP_ValeriaGatherableLoot_Mining_Base_C.ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base
// 0x0278 (0x0278 - 0x0000)
struct BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_mineNodeType                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6100[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_6;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Instigator_1;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       K2Node_Event_vital;                                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Instigator;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6101[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6102[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0090(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0190(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base");
static_assert(sizeof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base) == 0x000278, "Wrong size on BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, EntryPoint) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, Temp_byte_Variable) == 0x000004, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, Temp_object_Variable) == 0x000008, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, Temp_object_Variable_1) == 0x000010, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, Temp_object_Variable_2) == 0x000018, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, Temp_object_Variable_3) == 0x000020, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, Temp_object_Variable_4) == 0x000028, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, Temp_object_Variable_5) == 0x000030, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, Temp_object_Variable_6) == 0x000038, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, K2Node_Event_Instigator_1) == 0x000040, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::K2Node_Event_Instigator_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, K2Node_Event_vital) == 0x000048, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::K2Node_Event_vital' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000050, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, K2Node_Event_Instigator) == 0x000068, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::K2Node_Event_Instigator' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, CallFunc_IsServer_ReturnValue) == 0x000070, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, K2Node_Select_Default) == 0x000078, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000080, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000084, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000090, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, CallFunc_VLerp_ReturnValue) == 0x000178, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000190, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Mining_Base::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Mining_Base.BP_ValeriaGatherableLoot_Mining_Base_C.GetImpactLocation
// 0x0318 (0x0318 - 0x0000)
struct BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation final
{
public:
	double                                        Hit_power;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hit_Position;                                      // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Hit_rot;                                           // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AEquipViewActor*>                SpawnedActors;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<EObjectTypeQuery>                      NewLocalVar_0;                                     // 0x0048(0x0010)(Edit, BlueprintVisible)
	struct FVector                                My_hitPos;                                         // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        My_power;                                          // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class AEquipViewActor*                        CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Pick_EquipView_C*                   K2Node_DynamicCast_AsBP_Pick_Equip_View;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6103[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_LineTraceComponent_HitLocation;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_LineTraceComponent_HitNormal;          // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_LineTraceComponent_BoneName;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_LineTraceComponent_OutHit;             // 0x0178(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_LineTraceComponent_ReturnValue;        // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6104[0x6];                                     // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6105[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ValeriaCharacter_C*                 K2Node_DynamicCast_AsBP_Valeria_Character;         // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6106[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue;                 // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         CallFunc_GetEquippedItem_ReturnValue;              // 0x02C8(0x0050)()
};
static_assert(alignof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation");
static_assert(sizeof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation) == 0x000318, "Wrong size on BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, Hit_power) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::Hit_power' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, Hit_Position) == 0x000008, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::Hit_Position' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, Hit_rot) == 0x000020, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::Hit_rot' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, SpawnedActors) == 0x000038, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::SpawnedActors' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, NewLocalVar_0) == 0x000048, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, My_hitPos) == 0x000058, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::My_hitPos' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, My_power) == 0x000070, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::My_power' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, K2Node_DynamicCast_AsBP_Pick_Equip_View) == 0x000090, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::K2Node_DynamicCast_AsBP_Pick_Equip_View' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A0, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000B8, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_BreakVector_X) == 0x0000D0, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_BreakVector_Y) == 0x0000D8, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_BreakVector_Z) == 0x0000E0, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000F0, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_MakeVector_ReturnValue) == 0x0000F8, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_MakeVector_ReturnValue_1) == 0x000110, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000128, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_K2_LineTraceComponent_HitLocation) == 0x000140, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_K2_LineTraceComponent_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_K2_LineTraceComponent_HitNormal) == 0x000158, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_K2_LineTraceComponent_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_K2_LineTraceComponent_BoneName) == 0x000170, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_K2_LineTraceComponent_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_K2_LineTraceComponent_OutHit) == 0x000178, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_K2_LineTraceComponent_OutHit' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_K2_LineTraceComponent_ReturnValue) == 0x000260, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_K2_LineTraceComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_IsServer_ReturnValue) == 0x000261, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_MakeRotFromX_ReturnValue) == 0x000268, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000280, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000298, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_GetPlayerController_ReturnValue) == 0x0002A0, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_K2_GetPawn_ReturnValue) == 0x0002A8, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, K2Node_DynamicCast_AsBP_Valeria_Character) == 0x0002B0, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::K2Node_DynamicCast_AsBP_Valeria_Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, K2Node_DynamicCast_bSuccess_1) == 0x0002B8, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_GetEquipment_ReturnValue) == 0x0002C0, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation, CallFunc_GetEquippedItem_ReturnValue) == 0x0002C8, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_GetImpactLocation::CallFunc_GetEquippedItem_ReturnValue' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Mining_Base.BP_ValeriaGatherableLoot_Mining_Base_C.HandlePickImpact
// 0x0080 (0x0080 - 0x0000)
struct BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetImpactLocation_hit_power;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetImpactLocation_hit_position;           // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetImpactLocation_hit_rot;                // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact");
static_assert(sizeof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact) == 0x000080, "Wrong size on BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000008, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000018, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact, CallFunc_GetImpactLocation_hit_power) == 0x000020, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact::CallFunc_GetImpactLocation_hit_power' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact, CallFunc_GetImpactLocation_hit_position) == 0x000028, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact::CallFunc_GetImpactLocation_hit_position' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact, CallFunc_GetImpactLocation_hit_rot) == 0x000040, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact::CallFunc_GetImpactLocation_hit_rot' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact, CallFunc_Lerp_ReturnValue) == 0x000078, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_HandlePickImpact::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Mining_Base.BP_ValeriaGatherableLoot_Mining_Base_C.OnGatherableDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableDestroyed final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableDestroyed) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableDestroyed");
static_assert(sizeof(BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableDestroyed) == 0x000008, "Wrong size on BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableDestroyed");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableDestroyed, Param_Instigator) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableDestroyed::Param_Instigator' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Mining_Base.BP_ValeriaGatherableLoot_Mining_Base_C.OnGatherableHit
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableHit final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       Vital;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableHit) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableHit");
static_assert(sizeof(BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableHit) == 0x000010, "Wrong size on BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableHit");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableHit, Param_Instigator) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableHit::Param_Instigator' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableHit, Vital) == 0x000008, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_OnGatherableHit::Vital' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Mining_Base.BP_ValeriaGatherableLoot_Mining_Base_C.UserConstructionScript
// 0x0158 (0x0158 - 0x0000)
struct BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript final
{
public:
	int32                                         CurrentIndex;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6107[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6108[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6109[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610A[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610B[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610C[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610D[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue_1;            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript");
static_assert(sizeof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript) == 0x000158, "Wrong size on BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CurrentIndex) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CurrentIndex' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, Temp_int_Variable) == 0x000004, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, Temp_int_Variable_1) == 0x000018, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000038, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_GetNumMaterials_ReturnValue) == 0x000040, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000048, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000054, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_1) == 0x000058, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x00005C, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000060, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_GetNumMaterials_ReturnValue_1) == 0x00014C, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_GetNumMaterials_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000150, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000154, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000155, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000156, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Mining_Base.BP_ValeriaGatherableLoot_Mining_Base_C.VFX_OnHit
// 0x0030 (0x0030 - 0x0000)
struct BP_ValeriaGatherableLoot_Mining_Base_C_VFX_OnHit final
{
public:
	bool                                          CanDamage;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Instigator;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_610F[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6110[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Mining_Base_C_VFX_OnHit) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Mining_Base_C_VFX_OnHit");
static_assert(sizeof(BP_ValeriaGatherableLoot_Mining_Base_C_VFX_OnHit) == 0x000030, "Wrong size on BP_ValeriaGatherableLoot_Mining_Base_C_VFX_OnHit");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_VFX_OnHit, CanDamage) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_VFX_OnHit::CanDamage' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Mining_Base_C_VFX_OnHit, Param_Instigator) == 0x000008, "Member 'BP_ValeriaGatherableLoot_Mining_Base_C_VFX_OnHit::Param_Instigator' has a wrong offset!");
