#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaStorageInteractorComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ValeriaStorageInteractorComponent.BP_ValeriaStorageInteractorComponent_C
// 0x0028 (0x00C8 - 0x00A0)
class UBP_ValeriaStorageInteractorComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProximityChecker*                      ProximityChecker;                                  // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnIsOpenedChanged;                                 // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsOpened;                                          // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ValeriaStorageInteractorComponent(int32 EntryPoint, TDelegate<void(class UProximityChecker* Tracker, class AActor* Tracked, bool IsWithin)> K2Node_CreateDelegate_OutputDelegate, class AValeriaPlayerController* K2Node_Event_player, const struct FServerUseEventParams& K2Node_Event_params, class UProximityChecker* K2Node_CustomEvent_Tracker, class AActor* K2Node_CustomEvent_Tracked, bool K2Node_CustomEvent_IsWithin, class AActor* CallFunc_GetOwner_ReturnValue, class UProximityChecker* CallFunc_GetComponentByClass_ReturnValue);
	struct FUseEventResult OnClientInteract(class UInteractableComponent* Interactable, class AValeriaPlayerController* Player, const struct FInteractEventParams& Params_0, bool CallFunc_EqualEqual_ByteByte_ReturnValue, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UVAL_Subsystem_GameplayUIBridge* CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult_1, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_1, TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_GetUIInterface_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_IsLocalController_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class UInventoryComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FUseEventResult& CallFunc_UseEventResult_Handled_ReturnValue, const struct FUseEventResult& CallFunc_UseEventResult_Unhandled_ReturnValue, const struct FUseEventResult& CallFunc_UseEventResult_Unhandled_ReturnValue_1, class AActor* CallFunc_GetOwner_ReturnValue_1, class UInventoryComponent* CallFunc_GetComponentByClass_ReturnValue_1, class UShippingBinComponent* K2Node_DynamicCast_AsShipping_Bin_Component, bool K2Node_DynamicCast_bSuccess);
	struct FUseEventResult OnClientUsedEquippedOnMe(class AValeriaPlayerController* Player, const struct FUseEventParams& Params_0);
	void OnIsOpenedChanged__DelegateSignature(bool Param_IsOpened);
	void OnProximityTrackerChange(class UProximityChecker* Tracker, class AActor* Tracked, bool IsWithin, bool CallFunc_Not_PreBool_ReturnValue, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsLocalController_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	struct FServerUseEventResult OnServerInteract(class UInteractableComponent* Interactable, class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams);
	void OnServerUsedEquippedOnMe(class AValeriaPlayerController* Player, const struct FServerUseEventParams& Params_0);
	void OnTrackerChanged(class UProximityChecker* Tracker, class AActor* Tracked, bool IsWithin);
	void ReceiveBeginPlay();

	bool GetEventIndexForInputAction(class AValeriaCharacter* Character, TSoftObjectPtr<class UInputAction>& InputAction, EInteractEventIndex* OutEventIndex) const;
	TSoftObjectPtr<class UInputAction> GetInputActionForEventIndex(class AValeriaCharacter* Character, EInteractEventIndex EventIndex) const;
	bool GetText(class AValeriaCharacter* Character, EInteractEventIndex EventIndex, struct FGetTextParams* Params_0, TArray<struct FShopItemAdditionalCost>& K2Node_MakeArray_Array, const struct FGetTextParams& K2Node_MakeStruct_GetTextParams) const;
	bool GetUseableIMC(class AValeriaCharacter* Character, EInteractEventIndex InteractIndex, struct FInputMappingPriorityData* OutMappingData, struct FModifyContextOptions* OutOptions) const;
	int32 InteractPriority(class AValeriaCharacter* Character) const;
	bool IsInteractable(class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams, bool CallFunc_EqualEqual_ByteByte_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ValeriaStorageInteractorComponent_C">();
	}
	static class UBP_ValeriaStorageInteractorComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ValeriaStorageInteractorComponent_C>();
	}
};
static_assert(alignof(UBP_ValeriaStorageInteractorComponent_C) == 0x000008, "Wrong alignment on UBP_ValeriaStorageInteractorComponent_C");
static_assert(sizeof(UBP_ValeriaStorageInteractorComponent_C) == 0x0000C8, "Wrong size on UBP_ValeriaStorageInteractorComponent_C");
static_assert(offsetof(UBP_ValeriaStorageInteractorComponent_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_ValeriaStorageInteractorComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ValeriaStorageInteractorComponent_C, ProximityChecker) == 0x0000A8, "Member 'UBP_ValeriaStorageInteractorComponent_C::ProximityChecker' has a wrong offset!");
static_assert(offsetof(UBP_ValeriaStorageInteractorComponent_C, OnIsOpenedChanged) == 0x0000B0, "Member 'UBP_ValeriaStorageInteractorComponent_C::OnIsOpenedChanged' has a wrong offset!");
static_assert(offsetof(UBP_ValeriaStorageInteractorComponent_C, IsOpened) == 0x0000C0, "Member 'UBP_ValeriaStorageInteractorComponent_C::IsOpened' has a wrong offset!");

}

