#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaGatherable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ValeriaGatherable.BP_ValeriaGatherable_C.BndEvt__BP_ValeriaGatherable_Gatherable_K2Node_ComponentBoundEvent_0_GatherableDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Gatherable_K2Node_ComponentBoundEvent_0_GatherableDelegate__DelegateSignature final
{
public:
	class UGatherableComponent*                   GatherableComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Gatherable_K2Node_ComponentBoundEvent_0_GatherableDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Gatherable_K2Node_ComponentBoundEvent_0_GatherableDelegate__DelegateSignature");
static_assert(sizeof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Gatherable_K2Node_ComponentBoundEvent_0_GatherableDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Gatherable_K2Node_ComponentBoundEvent_0_GatherableDelegate__DelegateSignature");
static_assert(offsetof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Gatherable_K2Node_ComponentBoundEvent_0_GatherableDelegate__DelegateSignature, GatherableComponent) == 0x000000, "Member 'BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Gatherable_K2Node_ComponentBoundEvent_0_GatherableDelegate__DelegateSignature::GatherableComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Gatherable_K2Node_ComponentBoundEvent_0_GatherableDelegate__DelegateSignature, Character) == 0x000008, "Member 'BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Gatherable_K2Node_ComponentBoundEvent_0_GatherableDelegate__DelegateSignature::Character' has a wrong offset!");

// Function BP_ValeriaGatherable.BP_ValeriaGatherable_C.BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_1_InteractableClientInteractDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_1_InteractableClientInteractDelegate__DelegateSignature final
{
public:
	class UInteractableComponent*                 InteractableComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_1_InteractableClientInteractDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_1_InteractableClientInteractDelegate__DelegateSignature");
static_assert(sizeof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_1_InteractableClientInteractDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_1_InteractableClientInteractDelegate__DelegateSignature");
static_assert(offsetof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_1_InteractableClientInteractDelegate__DelegateSignature, InteractableComponent) == 0x000000, "Member 'BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_1_InteractableClientInteractDelegate__DelegateSignature::InteractableComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_1_InteractableClientInteractDelegate__DelegateSignature, Character) == 0x000008, "Member 'BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_1_InteractableClientInteractDelegate__DelegateSignature::Character' has a wrong offset!");

// Function BP_ValeriaGatherable.BP_ValeriaGatherable_C.BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_2_InteractableClientInteractDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_2_InteractableClientInteractDelegate__DelegateSignature final
{
public:
	class UInteractableComponent*                 InteractableComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_2_InteractableClientInteractDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_2_InteractableClientInteractDelegate__DelegateSignature");
static_assert(sizeof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_2_InteractableClientInteractDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_2_InteractableClientInteractDelegate__DelegateSignature");
static_assert(offsetof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_2_InteractableClientInteractDelegate__DelegateSignature, InteractableComponent) == 0x000000, "Member 'BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_2_InteractableClientInteractDelegate__DelegateSignature::InteractableComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_2_InteractableClientInteractDelegate__DelegateSignature, Character) == 0x000008, "Member 'BP_ValeriaGatherable_C_BndEvt__BP_ValeriaGatherable_Interactable_K2Node_ComponentBoundEvent_2_InteractableClientInteractDelegate__DelegateSignature::Character' has a wrong offset!");

// Function BP_ValeriaGatherable.BP_ValeriaGatherable_C.ExecuteUbergraph_BP_ValeriaGatherable
// 0x0078 (0x0078 - 0x0000)
struct BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46CA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableComponent*                 K2Node_ComponentBoundEvent_InteractableComponent;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_ComponentBoundEvent_character;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46CB[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_CustomEvent_Character;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46CC[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46CD[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableComponent*                 K2Node_ComponentBoundEvent_InteractableComponent_1; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_ComponentBoundEvent_character_1;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGatherableComponent*                   K2Node_ComponentBoundEvent_gatherableComponent;    // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_ComponentBoundEvent_character_2;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable) == 0x000008, "Wrong alignment on BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable");
static_assert(sizeof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable) == 0x000078, "Wrong size on BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, EntryPoint) == 0x000000, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, K2Node_ComponentBoundEvent_InteractableComponent) == 0x000008, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::K2Node_ComponentBoundEvent_InteractableComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, K2Node_ComponentBoundEvent_character) == 0x000010, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::K2Node_ComponentBoundEvent_character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, K2Node_CustomEvent_Character) == 0x000020, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, CallFunc_IsLocallyControlled_ReturnValue) == 0x000028, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, CallFunc_AkEventLocation_AkComponent) == 0x000048, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::CallFunc_AkEventLocation_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, CallFunc_AkEventLocation_Playing_ID) == 0x000050, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::CallFunc_AkEventLocation_Playing_ID' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000054, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000055, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, K2Node_ComponentBoundEvent_InteractableComponent_1) == 0x000058, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::K2Node_ComponentBoundEvent_InteractableComponent_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, K2Node_ComponentBoundEvent_character_1) == 0x000060, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::K2Node_ComponentBoundEvent_character_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, K2Node_ComponentBoundEvent_gatherableComponent) == 0x000068, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::K2Node_ComponentBoundEvent_gatherableComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable, K2Node_ComponentBoundEvent_character_2) == 0x000070, "Member 'BP_ValeriaGatherable_C_ExecuteUbergraph_BP_ValeriaGatherable::K2Node_ComponentBoundEvent_character_2' has a wrong offset!");

// Function BP_ValeriaGatherable.BP_ValeriaGatherable_C.Gathered FX
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaGatherable_C_Gathered_FX final
{
public:
	class AValeriaCharacter*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherable_C_Gathered_FX) == 0x000008, "Wrong alignment on BP_ValeriaGatherable_C_Gathered_FX");
static_assert(sizeof(BP_ValeriaGatherable_C_Gathered_FX) == 0x000008, "Wrong size on BP_ValeriaGatherable_C_Gathered_FX");
static_assert(offsetof(BP_ValeriaGatherable_C_Gathered_FX, Character) == 0x000000, "Member 'BP_ValeriaGatherable_C_Gathered_FX::Character' has a wrong offset!");

// Function BP_ValeriaGatherable.BP_ValeriaGatherable_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_ValeriaGatherable_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherable_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_ValeriaGatherable_C_UserConstructionScript");
static_assert(sizeof(BP_ValeriaGatherable_C_UserConstructionScript) == 0x000001, "Wrong size on BP_ValeriaGatherable_C_UserConstructionScript");
static_assert(offsetof(BP_ValeriaGatherable_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_ValeriaGatherable_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

