#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaCharacter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "S6Core_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.BndEvt__BP_ValeriaCharacter_DialogueManager_K2Node_ComponentBoundEvent_1_DialogProgressedDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_DialogueManager_K2Node_ComponentBoundEvent_1_DialogProgressedDelegate__DelegateSignature final
{
public:
	class UDialogueComponent*                     Diag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_DialogueManager_K2Node_ComponentBoundEvent_1_DialogProgressedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_DialogueManager_K2Node_ComponentBoundEvent_1_DialogProgressedDelegate__DelegateSignature");
static_assert(sizeof(BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_DialogueManager_K2Node_ComponentBoundEvent_1_DialogProgressedDelegate__DelegateSignature) == 0x000008, "Wrong size on BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_DialogueManager_K2Node_ComponentBoundEvent_1_DialogProgressedDelegate__DelegateSignature");
static_assert(offsetof(BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_DialogueManager_K2Node_ComponentBoundEvent_1_DialogProgressedDelegate__DelegateSignature, Diag) == 0x000000, "Member 'BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_DialogueManager_K2Node_ComponentBoundEvent_1_DialogProgressedDelegate__DelegateSignature::Diag' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.BndEvt__BP_ValeriaCharacter_EquipmentComponent_K2Node_ComponentBoundEvent_2_EquipmentChangedDelegate__DelegateSignature
// 0x0058 (0x0058 - 0x0000)
struct BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_EquipmentComponent_K2Node_ComponentBoundEvent_2_EquipmentChangedDelegate__DelegateSignature final
{
public:
	class UEquipmentComponent*                    Param_EquipmentComponent;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         Item;                                              // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_EquipmentComponent_K2Node_ComponentBoundEvent_2_EquipmentChangedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_EquipmentComponent_K2Node_ComponentBoundEvent_2_EquipmentChangedDelegate__DelegateSignature");
static_assert(sizeof(BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_EquipmentComponent_K2Node_ComponentBoundEvent_2_EquipmentChangedDelegate__DelegateSignature) == 0x000058, "Wrong size on BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_EquipmentComponent_K2Node_ComponentBoundEvent_2_EquipmentChangedDelegate__DelegateSignature");
static_assert(offsetof(BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_EquipmentComponent_K2Node_ComponentBoundEvent_2_EquipmentChangedDelegate__DelegateSignature, Param_EquipmentComponent) == 0x000000, "Member 'BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_EquipmentComponent_K2Node_ComponentBoundEvent_2_EquipmentChangedDelegate__DelegateSignature::Param_EquipmentComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_EquipmentComponent_K2Node_ComponentBoundEvent_2_EquipmentChangedDelegate__DelegateSignature, Item) == 0x000008, "Member 'BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_EquipmentComponent_K2Node_ComponentBoundEvent_2_EquipmentChangedDelegate__DelegateSignature::Item' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.BndEvt__BP_ValeriaCharacter_Placement_K2Node_ComponentBoundEvent_0_PlacementConfirmed__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_Placement_K2Node_ComponentBoundEvent_0_PlacementConfirmed__DelegateSignature final
{
public:
	class UPlacementComponent*                    PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Placed;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_Placement_K2Node_ComponentBoundEvent_0_PlacementConfirmed__DelegateSignature) == 0x000008, "Wrong alignment on BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_Placement_K2Node_ComponentBoundEvent_0_PlacementConfirmed__DelegateSignature");
static_assert(sizeof(BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_Placement_K2Node_ComponentBoundEvent_0_PlacementConfirmed__DelegateSignature) == 0x000010, "Wrong size on BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_Placement_K2Node_ComponentBoundEvent_0_PlacementConfirmed__DelegateSignature");
static_assert(offsetof(BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_Placement_K2Node_ComponentBoundEvent_0_PlacementConfirmed__DelegateSignature, PC) == 0x000000, "Member 'BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_Placement_K2Node_ComponentBoundEvent_0_PlacementConfirmed__DelegateSignature::PC' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_Placement_K2Node_ComponentBoundEvent_0_PlacementConfirmed__DelegateSignature, Placed) == 0x000008, "Member 'BP_ValeriaCharacter_C_BndEvt__BP_ValeriaCharacter_Placement_K2Node_ComponentBoundEvent_0_PlacementConfirmed__DelegateSignature::Placed' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.ChargeForStableUsage
// 0x0010 (0x0010 - 0x0000)
struct BP_ValeriaCharacter_C_ChargeForStableUsage final
{
public:
	const class AActor*                           StablesActor;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTeleportTravelConfigAsset*       DestinationConfig;                                 // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCharacter_C_ChargeForStableUsage) == 0x000008, "Wrong alignment on BP_ValeriaCharacter_C_ChargeForStableUsage");
static_assert(sizeof(BP_ValeriaCharacter_C_ChargeForStableUsage) == 0x000010, "Wrong size on BP_ValeriaCharacter_C_ChargeForStableUsage");
static_assert(offsetof(BP_ValeriaCharacter_C_ChargeForStableUsage, StablesActor) == 0x000000, "Member 'BP_ValeriaCharacter_C_ChargeForStableUsage::StablesActor' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCharacter_C_ChargeForStableUsage, DestinationConfig) == 0x000008, "Member 'BP_ValeriaCharacter_C_ChargeForStableUsage::DestinationConfig' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.Client_DisplayCrafter
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaCharacter_C_Client_DisplayCrafter final
{
public:
	class UCrafterComponent*                      Crafter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCharacter_C_Client_DisplayCrafter) == 0x000008, "Wrong alignment on BP_ValeriaCharacter_C_Client_DisplayCrafter");
static_assert(sizeof(BP_ValeriaCharacter_C_Client_DisplayCrafter) == 0x000008, "Wrong size on BP_ValeriaCharacter_C_Client_DisplayCrafter");
static_assert(offsetof(BP_ValeriaCharacter_C_Client_DisplayCrafter, Crafter) == 0x000000, "Member 'BP_ValeriaCharacter_C_Client_DisplayCrafter::Crafter' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0038 (0x0038 - 0x0000)
struct BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	class AValeriaCharacter*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastUnstuckLocation;                               // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000038, "Wrong size on BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_0, Character) == 0x000000, "Member 'BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_0::Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_0, Location) == 0x000008, "Member 'BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_0::Location' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_0, LastUnstuckLocation) == 0x000020, "Member 'BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_0::LastUnstuckLocation' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.CREATEDELEGATE_PROXYFUNCTION_1
// 0x0038 (0x0038 - 0x0000)
struct BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_1 final
{
public:
	class AValeriaCharacter*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastUnstuckLocation;                               // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000008, "Wrong alignment on BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(sizeof(BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000038, "Wrong size on BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(offsetof(BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_1, Character) == 0x000000, "Member 'BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_1::Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_1, Location) == 0x000008, "Member 'BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_1::Location' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_1, LastUnstuckLocation) == 0x000020, "Member 'BP_ValeriaCharacter_C_CREATEDELEGATE_PROXYFUNCTION_1::LastUnstuckLocation' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.CustomEvent_0
// 0x0004 (0x0004 - 0x0000)
struct BP_ValeriaCharacter_C_CustomEvent_0 final
{
public:
	float                                         Change;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCharacter_C_CustomEvent_0) == 0x000004, "Wrong alignment on BP_ValeriaCharacter_C_CustomEvent_0");
static_assert(sizeof(BP_ValeriaCharacter_C_CustomEvent_0) == 0x000004, "Wrong size on BP_ValeriaCharacter_C_CustomEvent_0");
static_assert(offsetof(BP_ValeriaCharacter_C_CustomEvent_0, Change) == 0x000000, "Member 'BP_ValeriaCharacter_C_CustomEvent_0::Change' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.DisplayAmmoMenu
// 0x0001 (0x0001 - 0x0000)
struct BP_ValeriaCharacter_C_DisplayAmmoMenu final
{
public:
	EAmmoType                                     AmmoType;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCharacter_C_DisplayAmmoMenu) == 0x000001, "Wrong alignment on BP_ValeriaCharacter_C_DisplayAmmoMenu");
static_assert(sizeof(BP_ValeriaCharacter_C_DisplayAmmoMenu) == 0x000001, "Wrong size on BP_ValeriaCharacter_C_DisplayAmmoMenu");
static_assert(offsetof(BP_ValeriaCharacter_C_DisplayAmmoMenu, AmmoType) == 0x000000, "Member 'BP_ValeriaCharacter_C_DisplayAmmoMenu::AmmoType' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.DisplayHousingEditMode
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaCharacter_C_DisplayHousingEditMode final
{
public:
	class AHousingPlotActor*                      HousingPlotActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCharacter_C_DisplayHousingEditMode) == 0x000008, "Wrong alignment on BP_ValeriaCharacter_C_DisplayHousingEditMode");
static_assert(sizeof(BP_ValeriaCharacter_C_DisplayHousingEditMode) == 0x000008, "Wrong size on BP_ValeriaCharacter_C_DisplayHousingEditMode");
static_assert(offsetof(BP_ValeriaCharacter_C_DisplayHousingEditMode, HousingPlotActor) == 0x000000, "Member 'BP_ValeriaCharacter_C_DisplayHousingEditMode::HousingPlotActor' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.DisplaySubgameScreen
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaCharacter_C_DisplaySubgameScreen final
{
public:
	const class USubgameConfig*                   InSubgameConfig;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCharacter_C_DisplaySubgameScreen) == 0x000008, "Wrong alignment on BP_ValeriaCharacter_C_DisplaySubgameScreen");
static_assert(sizeof(BP_ValeriaCharacter_C_DisplaySubgameScreen) == 0x000008, "Wrong size on BP_ValeriaCharacter_C_DisplaySubgameScreen");
static_assert(offsetof(BP_ValeriaCharacter_C_DisplaySubgameScreen, InSubgameConfig) == 0x000000, "Member 'BP_ValeriaCharacter_C_DisplaySubgameScreen::InSubgameConfig' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.EnableHousingEditMode
// 0x0020 (0x0020 - 0x0000)
struct BP_ValeriaCharacter_C_EnableHousingEditMode final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A7D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHousingPlotActor*                      HousingPlot;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeState_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaCharacter_C_EnableHousingEditMode) == 0x000008, "Wrong alignment on BP_ValeriaCharacter_C_EnableHousingEditMode");
static_assert(sizeof(BP_ValeriaCharacter_C_EnableHousingEditMode) == 0x000020, "Wrong size on BP_ValeriaCharacter_C_EnableHousingEditMode");
static_assert(offsetof(BP_ValeriaCharacter_C_EnableHousingEditMode, Enable) == 0x000000, "Member 'BP_ValeriaCharacter_C_EnableHousingEditMode::Enable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCharacter_C_EnableHousingEditMode, HousingPlot) == 0x000008, "Member 'BP_ValeriaCharacter_C_EnableHousingEditMode::HousingPlot' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCharacter_C_EnableHousingEditMode, CallFunc_GetCSM_ReturnValue) == 0x000010, "Member 'BP_ValeriaCharacter_C_EnableHousingEditMode::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCharacter_C_EnableHousingEditMode, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_ValeriaCharacter_C_EnableHousingEditMode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaCharacter_C_EnableHousingEditMode, CallFunc_ChangeState_ReturnValue) == 0x000019, "Member 'BP_ValeriaCharacter_C_EnableHousingEditMode::CallFunc_ChangeState_ReturnValue' has a wrong offset!");

// Function BP_ValeriaCharacter.BP_ValeriaCharacter_C.ExecuteUbergraph_BP_ValeriaCharacter
// 0x0880 (0x0880 - 0x0000)
struct BP_ValeriaCharacter_C_ExecuteUbergraph_BP_ValeriaCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVisibilityBasedAnimTickOption                Temp_byte_Variable;                                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVisibilityBasedAnimTickOption                Temp_byte_Variable_1;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            Temp_byte_Variable_2;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_13;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_14;                             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_15;                             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_16;                             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_17;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_18;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            Temp_byte_Variable_3;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_19;                             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_20;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_21;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_22;                             // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_23;                             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_24;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_25;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_26;                             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_27;                             // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0034(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x003C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPlaying;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A7E[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_NewController;                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A7F[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaCharacterMoveComponent*         CallFunc_GetValeriaCharacterMovementComponent_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsGliding)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isGliding;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A80[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaCharacterMoveComponent*         CallFunc_GetValeriaCharacterMovementComponent_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsGliding)>               K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           CallFunc_Map_Values_Values;                        // 0x00B8(0x0010)(ReferenceParm)
	TSoftClassPtr<class UClass>                   CallFunc_Array_Get_Item;                           // 0x00C8(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A81[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A82[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGearComponent*                         K2Node_CustomEvent_GearComponent;                  // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            Temp_byte_Variable_4;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A83[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGearComponent*                         CallFunc_GetGear_ReturnValue;                      // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGearComponent*                         CallFunc_GetGear_ReturnValue_1;                    // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           CallFunc_GetGearByGameplayTag_ReturnValue;         // 0x0120(0x0060)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A84[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A85[0x6];                                     // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ECharacterAttachPoint, TSoftClassPtr<class UClass>> K2Node_MakeMap_Map;                                // 0x01A0(0x0050)()
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A86[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_ActorHit;                             // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_WasDamaged;                           // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A87[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> K2Node_Event_HeldItemType;                         // 0x0208(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_ExtInstigator;                        // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A88[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValeriaGASAttributeSet*                CallFunc_GetAttributeSet_ReturnValue;              // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_change;                         // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0266(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A89[0x1];                                     // 0x0267(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGASComponent*                   CallFunc_GetGAS_ReturnValue;                       // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0270(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGearComponent* GearComponent)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A8A[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlacementComponent*                    K2Node_ComponentBoundEvent_pc;                     // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Placed;                 // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryTriggerInspirationCamera_Success;      // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryTriggerInspirationCamera_Success_1;    // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A8B[0x1];                                     // 0x029B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_OldLocation;                    // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_OldVelocity;                    // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeSquared_ReturnValue;                 // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue_1;  // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_Event_PrevMovementMode;                     // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_Event_NewMovementMode;                      // 0x02DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_PrevCustomMode;                       // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_NewCustomMode;                        // 0x02DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A8C[0x1];                                     // 0x02DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaSpringArmComponent*             K2Node_DynamicCast_AsValeria_Spring_Arm_Component; // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A8D[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaSpringArmComponent*             K2Node_DynamicCast_AsValeria_Spring_Arm_Component_1; // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A8E[0x1];                                     // 0x02FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaMoveablePawn* Pawn, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x02FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A8F[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaMoveablePawn*                   K2Node_CustomEvent_Pawn;                           // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_PrevMovementMode;               // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_PreviousCustomMode;             // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A90[0x2];                                     // 0x031A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A91[0x3];                                     // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsClimbing)>              K2Node_CreateDelegate_OutputDelegate_5;            // 0x0324(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A92[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaCharacterMoveComponent*         CallFunc_GetValeriaCharacterMovementComponent_ReturnValue_2; // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isClimbing;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A93[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A94[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_Subsystem_GameplayUIBridge*        CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCrafterComponent*                      K2Node_Event_Crafter;                              // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_GetUIInterface_ReturnValue;               // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAmmoType                                     K2Node_Event_AmmoType;                             // 0x0380(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A95[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHousingPlotActor*                      K2Node_Event_HousingPlotActor;                     // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A96[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_Subsystem_GameplayUIBridge*        CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_2;          // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A97[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_GetUIInterface_ReturnValue_1;             // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UVAL_Subsystem_GameplayUIBridge*        CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_2; // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_GetUIInterface_ReturnValue_2;             // 0x03E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	const class AActor*                           K2Node_Event_StablesActor;                         // 0x03F0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTeleportTravelConfigAsset*       K2Node_Event_DestinationConfig;                    // 0x03F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Stables_Sign_C*                     K2Node_DynamicCast_AsBP_Stables_Sign;              // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A98[0x3];                                     // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x040C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindCostForDestination_GoldCost;          // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A99[0x4];                                     // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVitalsComponent*                       CallFunc_GetVitals_ReturnValue;                    // 0x0420(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVitalsChange                          K2Node_MakeStruct_VitalsChange;                    // 0x0428(0x0040)()
	const class USubgameConfig*                   K2Node_Event_inSubgameConfig;                      // 0x0468(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryVitalChange_ReturnValue;               // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9A[0x7];                                     // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_3;              // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_3;          // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9B[0x3];                                     // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_3;                              // 0x048C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9C[0x4];                                     // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_Subsystem_GameplayUIBridge*        CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_3; // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_GetUIInterface_ReturnValue_3;             // 0x04A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_4;              // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_4;          // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9D[0x7];                                     // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_Subsystem_GameplayUIBridge*        CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_4; // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_GetUIInterface_ReturnValue_4;             // 0x04D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x04E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9E[0x1];                                     // 0x04E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9F[0x3];                                     // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x04F0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* Character, struct FVector& Location, struct FVector& LastUnstuckLocation)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x04F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* Character, struct FVector& Location, struct FVector& LastUnstuckLocation)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0508(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   K2Node_Event_GliderPropClass;                      // 0x0518(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AttachPoint;                          // 0x0540(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    K2Node_ComponentBoundEvent_EquipmentComponent;     // 0x0548(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         K2Node_ComponentBoundEvent_Item;                   // 0x0550(0x0050)()
	struct FEquipmentItem                         CallFunc_GetEquippedItem_ReturnValue;              // 0x05A0(0x0050)()
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AA0[0x7];                                     // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AA1[0x7];                                     // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition_1;       // 0x0608(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0612(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0613(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0614(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AA2[0x3];                                     // 0x0615(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaMoveablePawn* Pawn, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0618(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0628(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0640(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerPausedHandle_ReturnValue;       // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0649(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue;                    // 0x064A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AA3[0x5];                                     // 0x064B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0650(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0658(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0670(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x067D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AA4[0x2];                                     // 0x067E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaGraphicSettings                K2Node_CustomEvent_GraphicSettings;                // 0x0680(0x0008)(ConstParm, NoDestructor)
	class FName                                   Temp_name_Variable_5;                              // 0x0688(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AA5[0x7];                                     // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0698(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AA6[0x3];                                     // 0x06A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
