#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaGatherableLoot_Lumber_Tree

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_ValeriaGatherableLoot_Lumber_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ValeriaGatherableLoot_Lumber_Tree.BP_ValeriaGatherableLoot_Lumber_Tree_C
// 0x00D8 (0x06D8 - 0x0600)
class ABP_ValeriaGatherableLoot_Lumber_Tree_C : public ABP_ValeriaGatherableLoot_Lumber_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ValeriaGatherableLoot_Lumber_Tree_C; // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTrackedResourceComponent*              TrackedResource;                                   // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_HuntingCreatureHidingSpot_C*        BP_HuntingCreatureHidingSpot;                      // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MySM_TempMesh;                                     // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProceduralMeshComponent*               MyProcSM_Plant;                                    // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_treefall_shake_FA52198D478C8714C20C92A429B8D13F; // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_treefall_fall_FA52198D478C8714C20C92A429B8D13F; // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_treefall__Direction_FA52198D478C8714C20C92A429B8D13F; // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5019[0x7];                                     // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_treefall;                                       // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Dur_treeFall;                                      // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ImFallingStopBotheringMe;                          // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501A[0x7];                                     // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      MyNS_LeafTrailA;                                   // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NS_treeGoneVFX;                                    // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Axis_treeFall;                                     // 0x0660(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rot_vfxTreeBreak;                                  // 0x0678(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Pos_vfxTreeBreak;                                  // 0x0690(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Dir_treeForce;                                     // 0x06A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Chop_offsetMax;                                    // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInterface*                     MI_chopCap;                                        // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DontCutMe_MoveMe;                                  // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__BP_ValeriaGatherableLoot_Lumber_Tree_myProcSM_Plant_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void CheckIfValidHidingTree(class UValeriaCreatureManager* CallFunc_GetGameInstanceSubsystem_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void DergisterHidingTree(class UValeriaCreatureManager* CallFunc_GetGameInstanceSubsystem_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void Event_IveFallenAndICantGetUp();
	void Event_treeFall(class AActor* Param_Instigator);
	void Event_treeFall_trailMe(class UStaticMeshComponent* MyTree);
	void Event_treePuffyAmiYumi(class USceneComponent* MyTree);
	void Event_youCutMeHowCouldyou(class AActor* Param_Instigator);
	void ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber_Tree(int32 EntryPoint, class USceneComponent* K2Node_CustomEvent_myTree, class AActor* K2Node_Event_Instigator, class AActor* K2Node_CustomEvent_instigator_1, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, class UAkComponent* CallFunc_AkEventLocation_AkComponent, int32 CallFunc_AkEventLocation_Playing_ID, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_1, class UAkComponent* CallFunc_AkEventLocation_AkComponent_1, int32 CallFunc_AkEventLocation_Playing_ID_1, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_2, class UAkComponent* CallFunc_AkEventLocation_AkComponent_2, int32 CallFunc_AkEventLocation_Playing_ID_2, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_3, class UAkComponent* CallFunc_AkEventLocation_AkComponent_3, int32 CallFunc_AkEventLocation_Playing_ID_3, double CallFunc_Divide_DoubleDouble_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, double K2Node_CustomEvent_fall, double K2Node_CustomEvent_shakes, double CallFunc_Lerp_ReturnValue, const struct FRotator& CallFunc_RotatorFromAxisAndAngle_ReturnValue, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult, int32 CallFunc_Conv_ByteToInt_ReturnValue_2, int32 CallFunc_Conv_ByteToInt_ReturnValue_3, class UStaticMeshComponent* K2Node_CustomEvent_myTree_1, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_3, class AActor* K2Node_CustomEvent_instigator, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_4, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, bool Temp_bool_Has_Been_Initd_Variable, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_5, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_FMin_ReturnValue, bool CallFunc_IsServer_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, class UProceduralMeshComponent* CallFunc_SliceProceduralMesh_OutOtherHalfProcMesh, const struct FVector& CallFunc_GetComponentBounds_Origin, const struct FVector& CallFunc_GetComponentBounds_BoxExtent, float CallFunc_GetComponentBounds_SphereRadius, double CallFunc_BreakVector_X_2, double CallFunc_BreakVector_Y_2, double CallFunc_BreakVector_Z_2, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue_1, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue_2, class UPrimitiveComponent* K2Node_ComponentBoundEvent_HitComponent, class AActor* K2Node_ComponentBoundEvent_OtherActor, class UPrimitiveComponent* K2Node_ComponentBoundEvent_OtherComp, const struct FVector& K2Node_ComponentBoundEvent_NormalImpulse, struct FHitResult& K2Node_ComponentBoundEvent_Hit, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_6, bool Temp_bool_IsClosed_Variable, class UAkComponent* CallFunc_AkEventLocation_AkComponent_4, int32 CallFunc_AkEventLocation_Playing_ID_4, bool CallFunc_IsServer_ReturnValue_1, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_7, double CallFunc_BreakVector_X_3, double CallFunc_BreakVector_Y_3, double CallFunc_BreakVector_Z_3, const struct FVector& CallFunc_Fn_treeFallHitLocation_hit_location, const struct FVector& CallFunc_Fn_treeFallRotation_fall_axis, const struct FRotator& CallFunc_Fn_treeFallRotation_break_rotation, double CallFunc_BreakVector_X_4, double CallFunc_BreakVector_Y_4, double CallFunc_BreakVector_Z_4, const struct FVector& CallFunc_MakeVector_ReturnValue_1, bool CallFunc_IsServer_ReturnValue_2, bool CallFunc_IsServer_ReturnValue_3, bool CallFunc_IsServer_ReturnValue_4, class UVitalsComponent* CallFunc_GetVitals_ReturnValue, TDelegate<void(class UVitalsComponent* Vitals)> K2Node_CreateDelegate_OutputDelegate, class UVitalsComponent* K2Node_CustomEvent_Vitals, class UBP_PlateHealthBar_Tree_C* CallFunc_GetOrCreateHealthBar_HealthBar, EEndPlayReason K2Node_Event_EndPlayReason, double CallFunc_tick_fallingTree_shakes_ImplicitCast, float CallFunc_SetFloatParameter_Param_ImplicitCast, float CallFunc_SetPlayRate_NewRate_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast, float CallFunc_SetFloatParameter_Param_ImplicitCast_1, float CallFunc_SetFloatParameter_Param_ImplicitCast_2, float CallFunc_SetFloatParameter_Param_ImplicitCast_3, float CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast, float CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast, float CallFunc_SetFloatParameter_Param_ImplicitCast_4, float CallFunc_SetFloatParameter_Param_ImplicitCast_5, float CallFunc_SetFloatParameter_Param_ImplicitCast_6, float CallFunc_SetFloatParameter_Param_ImplicitCast_7, float CallFunc_SetFloatParameter_Param_ImplicitCast_8, float CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast, double CallFunc_tick_fallingTree_fall_ImplicitCast);
	void Fn_Puffy_Yumi_Ami(class UStaticMeshComponent* MyTempTree, class UStaticMeshComponent* MyChoppedTree, int32 CallFunc_Conv_ByteToInt_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, int32 CallFunc_Conv_ByteToInt_ReturnValue_2, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, class UAkComponent* CallFunc_AkEventLocation_AkComponent, int32 CallFunc_AkEventLocation_Playing_ID, bool CallFunc_IsServer_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue, bool CallFunc_IsValid_ReturnValue, float CallFunc_SetFloatParameter_Param_ImplicitCast, float CallFunc_SetFloatParameter_Param_ImplicitCast_1, float CallFunc_SetFloatParameter_Param_ImplicitCast_2, float CallFunc_SetFloatParameter_Param_ImplicitCast_3, float CallFunc_SetFloatParameter_Param_ImplicitCast_4, float CallFunc_SetFloatParameter_Param_ImplicitCast_5, float CallFunc_SetFloatParameter_Param_ImplicitCast_6);
	void HandleTreeDowned(class UVitalsComponent* Param_Vitals);
	void OnGatherableDestroyed(class AActor* Param_Instigator);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Tick_fallingTree(double Fall, double Shakes);
	void TL_treefall__FinishedFunc();
	void TL_treefall__hitground__EventFunc();
	void TL_treefall__poof__EventFunc();
	void TL_treefall__UpdateFunc();
	void UserConstructionScript(bool CallFunc_SetStaticMesh_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ValeriaGatherableLoot_Lumber_Tree_C">();
	}
	static class ABP_ValeriaGatherableLoot_Lumber_Tree_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ValeriaGatherableLoot_Lumber_Tree_C>();
	}
};
static_assert(alignof(ABP_ValeriaGatherableLoot_Lumber_Tree_C) == 0x000008, "Wrong alignment on ABP_ValeriaGatherableLoot_Lumber_Tree_C");
static_assert(sizeof(ABP_ValeriaGatherableLoot_Lumber_Tree_C) == 0x0006D8, "Wrong size on ABP_ValeriaGatherableLoot_Lumber_Tree_C");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, UberGraphFrame_BP_ValeriaGatherableLoot_Lumber_Tree_C) == 0x000600, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::UberGraphFrame_BP_ValeriaGatherableLoot_Lumber_Tree_C' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, TrackedResource) == 0x000608, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::TrackedResource' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, BP_HuntingCreatureHidingSpot) == 0x000610, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::BP_HuntingCreatureHidingSpot' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, MySM_TempMesh) == 0x000618, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::MySM_TempMesh' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, MyProcSM_Plant) == 0x000620, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::MyProcSM_Plant' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, TL_treefall_shake_FA52198D478C8714C20C92A429B8D13F) == 0x000628, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::TL_treefall_shake_FA52198D478C8714C20C92A429B8D13F' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, TL_treefall_fall_FA52198D478C8714C20C92A429B8D13F) == 0x00062C, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::TL_treefall_fall_FA52198D478C8714C20C92A429B8D13F' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, TL_treefall__Direction_FA52198D478C8714C20C92A429B8D13F) == 0x000630, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::TL_treefall__Direction_FA52198D478C8714C20C92A429B8D13F' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, TL_treefall) == 0x000638, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::TL_treefall' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, Dur_treeFall) == 0x000640, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::Dur_treeFall' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, ImFallingStopBotheringMe) == 0x000648, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::ImFallingStopBotheringMe' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, MyNS_LeafTrailA) == 0x000650, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::MyNS_LeafTrailA' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, NS_treeGoneVFX) == 0x000658, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::NS_treeGoneVFX' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, Axis_treeFall) == 0x000660, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::Axis_treeFall' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, Rot_vfxTreeBreak) == 0x000678, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::Rot_vfxTreeBreak' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, Pos_vfxTreeBreak) == 0x000690, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::Pos_vfxTreeBreak' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, Dir_treeForce) == 0x0006A8, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::Dir_treeForce' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, Chop_offsetMax) == 0x0006C0, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::Chop_offsetMax' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, MI_chopCap) == 0x0006C8, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::MI_chopCap' has a wrong offset!");
static_assert(offsetof(ABP_ValeriaGatherableLoot_Lumber_Tree_C, DontCutMe_MoveMe) == 0x0006D0, "Member 'ABP_ValeriaGatherableLoot_Lumber_Tree_C::DontCutMe_MoveMe' has a wrong offset!");

}

