#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaGatherableLoot_Lumber

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_vfx_treeSize_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ValeriaGatherableLoot_Lumber.BP_ValeriaGatherableLoot_Lumber_C.ApplyConversion
// 0x0001 (0x0001 - 0x0000)
struct BP_ValeriaGatherableLoot_Lumber_C_ApplyConversion final
{
public:
	EActorConversionType                          ConversionType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Lumber_C_ApplyConversion) == 0x000001, "Wrong alignment on BP_ValeriaGatherableLoot_Lumber_C_ApplyConversion");
static_assert(sizeof(BP_ValeriaGatherableLoot_Lumber_C_ApplyConversion) == 0x000001, "Wrong size on BP_ValeriaGatherableLoot_Lumber_C_ApplyConversion");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ApplyConversion, ConversionType) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ApplyConversion::ConversionType' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Lumber.BP_ValeriaGatherableLoot_Lumber_C.Destroyed
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaGatherableLoot_Lumber_C_Destroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Lumber_C_Destroyed) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Lumber_C_Destroyed");
static_assert(sizeof(BP_ValeriaGatherableLoot_Lumber_C_Destroyed) == 0x000008, "Wrong size on BP_ValeriaGatherableLoot_Lumber_C_Destroyed");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_Destroyed, DestroyedActor) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Lumber_C_Destroyed::DestroyedActor' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Lumber.BP_ValeriaGatherableLoot_Lumber_C.event_BessonShakeItBaby
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaGatherableLoot_Lumber_C_Event_BessonShakeItBaby final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Lumber_C_Event_BessonShakeItBaby) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Lumber_C_Event_BessonShakeItBaby");
static_assert(sizeof(BP_ValeriaGatherableLoot_Lumber_C_Event_BessonShakeItBaby) == 0x000008, "Wrong size on BP_ValeriaGatherableLoot_Lumber_C_Event_BessonShakeItBaby");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_Event_BessonShakeItBaby, Param_Instigator) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Lumber_C_Event_BessonShakeItBaby::Param_Instigator' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Lumber.BP_ValeriaGatherableLoot_Lumber_C.event_hitMe
// 0x0020 (0x0020 - 0x0000)
struct BP_ValeriaGatherableLoot_Lumber_C_Event_hitMe final
{
public:
	struct FRotator                               Rot_decal;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        Height_decal;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Lumber_C_Event_hitMe) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Lumber_C_Event_hitMe");
static_assert(sizeof(BP_ValeriaGatherableLoot_Lumber_C_Event_hitMe) == 0x000020, "Wrong size on BP_ValeriaGatherableLoot_Lumber_C_Event_hitMe");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_Event_hitMe, Rot_decal) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Lumber_C_Event_hitMe::Rot_decal' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_Event_hitMe, Height_decal) == 0x000018, "Member 'BP_ValeriaGatherableLoot_Lumber_C_Event_hitMe::Height_decal' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Lumber.BP_ValeriaGatherableLoot_Lumber_C.event_shakeLeaves
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaGatherableLoot_Lumber_C_Event_shakeLeaves final
{
public:
	class AActor*                                 Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Lumber_C_Event_shakeLeaves) == 0x000008, "Wrong alignment on BP_ValeriaGatherableLoot_Lumber_C_Event_shakeLeaves");
static_assert(sizeof(BP_ValeriaGatherableLoot_Lumber_C_Event_shakeLeaves) == 0x000008, "Wrong size on BP_ValeriaGatherableLoot_Lumber_C_Event_shakeLeaves");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_Event_shakeLeaves, Param_Instigator) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Lumber_C_Event_shakeLeaves::Param_Instigator' has a wrong offset!");

// Function BP_ValeriaGatherableLoot_Lumber.BP_ValeriaGatherableLoot_Lumber_C.ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber
// 0x09F0 (0x09F0 - 0x0000)
struct BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4788[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4789[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_478A[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x0090(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin;              // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent;           // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius;        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_478B[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_478C[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_478D[0x2];                                     // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_instigator;                     // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Fn_BessonAxeStrength_axe_power;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Fn_BessonHitPos_pos_OuchThisHurts;        // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Fn_BessonHitPos_rot_decalHere;            // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Fn_BessonHitPos_height_decalHere;         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_instigator_1;                   // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Fn_BessonAxeStrength_axe_power_1;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_rot_decal;                      // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        K2Node_CustomEvent_height_decal;                   // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0200(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0300(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_478E[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Env_Audio_Pool_Foliage_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Instigator_1;                         // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_478F[0x6];                                     // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0398(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4790[0x3];                                     // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4791[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Instigator;                           // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       K2Node_Event_vital;                                // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EActorConversionType                          K2Node_Event_ConversionType;                       // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4792[0x3];                                     // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetVitalMax_ReturnValue;                  // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVital_ReturnValue;                     // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4793[0x4];                                     // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4794[0x7];                                     // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4795[0x7];                                     // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_2;                          // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0440(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0478(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_LineTraceComponent_HitLocation;        // 0x0590(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_LineTraceComponent_HitNormal;          // 0x05A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_LineTraceComponent_BoneName;           // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_LineTraceComponent_OutHit;             // 0x05C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_LineTraceComponent_ReturnValue;        // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4796[0x7];                                     // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_3;                          // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x06D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x06F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0708(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4797[0x7];                                     // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0738(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0751(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4798[0x2];                                     // 0x0752(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4799[0x7];                                     // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVitalsComponent*                       CallFunc_GetVitals_ReturnValue;                    // 0x0760(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVital_ReturnValue_1;                   // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVitalMax_ReturnValue_1;                // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479A[0x7];                                     // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_4;        // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_5;        // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479B[0x7];                                     // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAttached_ReturnValue;           // 0x07C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479C[0x7];                                     // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x07D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_4;                       // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0818(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_6;        // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0840(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0858(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        Temp_real_Variable_3;                              // 0x0940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x0948(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_vfx_treeSize                             Temp_byte_Variable;                                // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479D[0x7];                                     // 0x0961(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent_1;            // 0x0968(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID_1;             // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0974(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0990(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479E[0x7];                                     // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x0998(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_3;                   // 0x09A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x09A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479F[0x1];                                     // 0x09A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x09A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x09A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x09AC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x09B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x09B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_2;                // 0x09C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1; // 0x09C8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_1;   // 0x09CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNiagaraVariableFloat_InValue_ImplicitCast; // 0x09D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRtpc_Value_ImplicitCast;               // 0x09D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_2;   // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_3;   // 0x09DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnDecalAttached_LifeSpan_ImplicitCast; // 0x09E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFadeOut_StartDelay_ImplicitCast;       // 0x09E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x09E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber) == 0x000010, "Wrong alignment on BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber");
static_assert(sizeof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber) == 0x0009F0, "Wrong size on BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, EntryPoint) == 0x000000, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_AkEventLocation_AkComponent) == 0x000020, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_AkEventLocation_AkComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_AkEventLocation_Playing_ID) == 0x000028, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_AkEventLocation_Playing_ID' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_GetComponentBounds_Origin) == 0x000038, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_GetComponentBounds_BoxExtent) == 0x000050, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_GetComponentBounds_SphereRadius) == 0x000068, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_BreakVector_X) == 0x000070, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_BreakVector_Y) == 0x000078, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_BreakVector_Z) == 0x000080, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_GetBounds_ReturnValue) == 0x000090, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_BreakBoxSphereBounds_Origin) == 0x0000D0, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_BreakBoxSphereBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_BreakBoxSphereBounds_BoxExtent) == 0x0000E8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_BreakBoxSphereBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_BreakBoxSphereBounds_SphereRadius) == 0x000100, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_BreakBoxSphereBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_BreakVector_X_1) == 0x000108, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_BreakVector_Y_1) == 0x000110, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_BreakVector_Z_1) == 0x000118, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000120, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000128, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000130, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000140, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_FClamp_ReturnValue) == 0x000148, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_IsValid_ReturnValue_1) == 0x000150, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_BooleanAND_ReturnValue) == 0x000151, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000154, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, K2Node_CustomEvent_instigator) == 0x000158, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::K2Node_CustomEvent_instigator' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Fn_BessonAxeStrength_axe_power) == 0x000160, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Fn_BessonAxeStrength_axe_power' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Fn_BessonHitPos_pos_OuchThisHurts) == 0x000168, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Fn_BessonHitPos_pos_OuchThisHurts' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Fn_BessonHitPos_rot_decalHere) == 0x000180, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Fn_BessonHitPos_rot_decalHere' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Fn_BessonHitPos_height_decalHere) == 0x000198, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Fn_BessonHitPos_height_decalHere' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0001A0, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001A8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_MakeRotator_ReturnValue) == 0x0001B0, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, K2Node_CustomEvent_instigator_1) == 0x0001C8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::K2Node_CustomEvent_instigator_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Fn_BessonAxeStrength_axe_power_1) == 0x0001D0, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Fn_BessonAxeStrength_axe_power_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0001D8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, K2Node_CustomEvent_rot_decal) == 0x0001E0, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::K2Node_CustomEvent_rot_decal' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, K2Node_CustomEvent_height_decal) == 0x0001F8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::K2Node_CustomEvent_height_decal' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000200, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0002E8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000300, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, K2Node_CustomEvent_DestroyedActor) == 0x000360, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000368, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_IsValid_ReturnValue_2) == 0x000370, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_FinishSpawningActor_ReturnValue) == 0x000378, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000380, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, K2Node_Event_Instigator_1) == 0x000388, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::K2Node_Event_Instigator_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_IsValid_ReturnValue_3) == 0x000390, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_IsValid_ReturnValue_4) == 0x000391, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000398, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Array_Length_ReturnValue) == 0x0003A8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Less_IntInt_ReturnValue) == 0x0003AC, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_GetMaterial_ReturnValue) == 0x0003B0, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_Lerp_ReturnValue) == 0x0003B8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0003C0, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_IsValid_ReturnValue_5) == 0x0003C8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, K2Node_Event_Instigator) == 0x0003D0, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::K2Node_Event_Instigator' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, K2Node_Event_vital) == 0x0003D8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::K2Node_Event_vital' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, K2Node_Event_ConversionType) == 0x0003E0, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::K2Node_Event_ConversionType' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_GetVitalMax_ReturnValue) == 0x0003E4, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_GetVitalMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber, CallFunc_GetVital_ReturnValue) == 0x0003E8, "Member 'BP_ValeriaGatherableLoot_Lumber_C_ExecuteUbergraph_BP_ValeriaGatherableLoot_Lumber::CallFunc_GetVital_ReturnValue' has a wrong offset!");
