#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WorldPersistGatherable_Treasure_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WorldPersistGatherable_Treasure_Base.BP_WorldPersistGatherable_Treasure_Base_C.ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base
// 0x0078 (0x0078 - 0x0000)
struct BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B79[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B7A[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children_1;         // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B7B[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component_1;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base) == 0x000008, "Wrong alignment on BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base");
static_assert(sizeof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base) == 0x000078, "Wrong size on BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, EntryPoint) == 0x000000, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, CallFunc_GetChildrenComponents_Children) == 0x000018, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, K2Node_DynamicCast_AsPrimitive_Component) == 0x000038, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, CallFunc_GetChildrenComponents_Children_1) == 0x000048, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::CallFunc_GetChildrenComponents_Children_1' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, K2Node_DynamicCast_AsPrimitive_Component_1) == 0x000068, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::K2Node_DynamicCast_AsPrimitive_Component_1' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base, CallFunc_Less_IntInt_ReturnValue_1) == 0x000071, "Member 'BP_WorldPersistGatherable_Treasure_Base_C_ExecuteUbergraph_BP_WorldPersistGatherable_Treasure_Base::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

}

