#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Worktable_Placed

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Worktable_Placed.BP_Worktable_Placed_C.ExecuteUbergraph_BP_Worktable_Placed
// 0x02B8 (0x02B8 - 0x0000)
struct BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60E8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaWeather*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValEnvironmentManager*                 CallFunc_GetCurrentEnvManager_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsNightTime_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsNight;                       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60E9[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60EA[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60EB[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0058(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0160(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Fraction_ReturnValue;                     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsNight)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60EC[0x5];                                     // 0x0283(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60ED[0x4];                                     // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60EE[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_2;                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed) == 0x000008, "Wrong alignment on BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed");
static_assert(sizeof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed) == 0x0002B8, "Wrong size on BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, EntryPoint) == 0x000000, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_GetCurrentEnvManager_ReturnValue) == 0x000010, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_GetCurrentEnvManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_GetIsNightTime_ReturnValue) == 0x000018, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_GetIsNightTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, K2Node_CustomEvent_bIsNight) == 0x00001A, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::K2Node_CustomEvent_bIsNight' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000058, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_Lerp_ReturnValue_1) == 0x000140, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_MakeRotator_ReturnValue) == 0x000148, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000160, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000248, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_Lerp_ReturnValue_2) == 0x000250, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_Fraction_ReturnValue) == 0x000258, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_GetMaterial_ReturnValue) == 0x000260, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000268, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, K2Node_CreateDelegate_OutputDelegate) == 0x000270, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_IsValid_ReturnValue_3) == 0x000280, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_IsValid_ReturnValue_4) == 0x000281, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_IsValid_ReturnValue_5) == 0x000282, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000288, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000290, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000298, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0002A0, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_Lerp_Alpha_ImplicitCast_2) == 0x0002A8, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_Lerp_Alpha_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0002B0, "Member 'BP_Worktable_Placed_C_ExecuteUbergraph_BP_Worktable_Placed::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_Worktable_Placed.BP_Worktable_Placed_C.LanternToggle
// 0x0001 (0x0001 - 0x0000)
struct BP_Worktable_Placed_C_LanternToggle final
{
public:
	bool                                          bIsNight;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Worktable_Placed_C_LanternToggle) == 0x000001, "Wrong alignment on BP_Worktable_Placed_C_LanternToggle");
static_assert(sizeof(BP_Worktable_Placed_C_LanternToggle) == 0x000001, "Wrong size on BP_Worktable_Placed_C_LanternToggle");
static_assert(offsetof(BP_Worktable_Placed_C_LanternToggle, bIsNight) == 0x000000, "Member 'BP_Worktable_Placed_C_LanternToggle::bIsNight' has a wrong offset!");

}

