#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Worktable_Placed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ValeriaCrafter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Worktable_Placed.BP_Worktable_Placed_C
// 0x0088 (0x0418 - 0x0390)
class ABP_Worktable_Placed_C final : public ABP_ValeriaCrafter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Worktable_Placed_C;              // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Lamp;                                           // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_clampScrew;                                     // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_clampPlate;                                     // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_craftingA;                                      // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlayerPositioner;                                  // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WorkBenchTier01_Mallet;                         // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GrassMask;                                         // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SelectitemHitbox;                                  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_table;                                          // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGatherableComponent*                   Gatherable;                                        // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_crafting_lamp_E9B6368E43E26AA14A656EB3AAC38FBD; // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_crafting_screwing_E9B6368E43E26AA14A656EB3AAC38FBD; // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_crafting_clamping_E9B6368E43E26AA14A656EB3AAC38FBD; // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_crafting__Direction_E9B6368E43E26AA14A656EB3AAC38FBD; // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60E7[0x3];                                     // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_crafting;                                       // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_lamp;                                           // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Anim_duration;                                     // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Event_addStuff2Me();
	void Event_checkLights();
	void Event_craftMe();
	void Event_Crafty_crafting();
	void Event_Crafty_selectIngredient();
	void Event_Crafty_stuffReady();
	void Event_gotStuff4U();
	void Event_reset2default();
	void Event_setMeUp();
	void Event_stopCraftingOhPleaseStop();
	void Event_thatsItImDone();
	void ExecuteUbergraph_BP_Worktable_Placed(int32 EntryPoint, class UValeriaWeather* CallFunc_GetWorldSubsystem_ReturnValue, class AValEnvironmentManager* CallFunc_GetCurrentEnvManager_ReturnValue, bool CallFunc_GetIsNightTime_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool K2Node_CustomEvent_bIsNight, double CallFunc_Lerp_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, double CallFunc_Divide_DoubleDouble_ReturnValue, const struct FHitResult& CallFunc_K2_SetRelativeLocation_SweepHitResult, double CallFunc_Lerp_ReturnValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue, double CallFunc_Lerp_ReturnValue_2, double CallFunc_Fraction_ReturnValue, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, TDelegate<void(bool bIsNight)> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_5, double CallFunc_Lerp_Alpha_ImplicitCast, float CallFunc_SetPlayRate_NewRate_ImplicitCast, double CallFunc_Lerp_Alpha_ImplicitCast_1, float CallFunc_MakeRotator_Pitch_ImplicitCast, double CallFunc_Lerp_Alpha_ImplicitCast_2, float CallFunc_SetScalarParameterValue_Value_ImplicitCast);
	void LanternToggle(bool bIsNight);
	void ReceiveBeginPlay();
	void TL_crafting__FinishedFunc();
	void TL_crafting__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Worktable_Placed_C">();
	}
	static class ABP_Worktable_Placed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Worktable_Placed_C>();
	}
};
static_assert(alignof(ABP_Worktable_Placed_C) == 0x000008, "Wrong alignment on ABP_Worktable_Placed_C");
static_assert(sizeof(ABP_Worktable_Placed_C) == 0x000418, "Wrong size on ABP_Worktable_Placed_C");
static_assert(offsetof(ABP_Worktable_Placed_C, UberGraphFrame_BP_Worktable_Placed_C) == 0x000390, "Member 'ABP_Worktable_Placed_C::UberGraphFrame_BP_Worktable_Placed_C' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, SM_Lamp) == 0x000398, "Member 'ABP_Worktable_Placed_C::SM_Lamp' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, SM_clampScrew) == 0x0003A0, "Member 'ABP_Worktable_Placed_C::SM_clampScrew' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, SM_clampPlate) == 0x0003A8, "Member 'ABP_Worktable_Placed_C::SM_clampPlate' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, NS_craftingA) == 0x0003B0, "Member 'ABP_Worktable_Placed_C::NS_craftingA' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, PlayerPositioner) == 0x0003B8, "Member 'ABP_Worktable_Placed_C::PlayerPositioner' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, SM_WorkBenchTier01_Mallet) == 0x0003C0, "Member 'ABP_Worktable_Placed_C::SM_WorkBenchTier01_Mallet' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, GrassMask) == 0x0003C8, "Member 'ABP_Worktable_Placed_C::GrassMask' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, SpotLight) == 0x0003D0, "Member 'ABP_Worktable_Placed_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, SelectitemHitbox) == 0x0003D8, "Member 'ABP_Worktable_Placed_C::SelectitemHitbox' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, SM_table) == 0x0003E0, "Member 'ABP_Worktable_Placed_C::SM_table' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, Gatherable) == 0x0003E8, "Member 'ABP_Worktable_Placed_C::Gatherable' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, TL_crafting_lamp_E9B6368E43E26AA14A656EB3AAC38FBD) == 0x0003F0, "Member 'ABP_Worktable_Placed_C::TL_crafting_lamp_E9B6368E43E26AA14A656EB3AAC38FBD' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, TL_crafting_screwing_E9B6368E43E26AA14A656EB3AAC38FBD) == 0x0003F4, "Member 'ABP_Worktable_Placed_C::TL_crafting_screwing_E9B6368E43E26AA14A656EB3AAC38FBD' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, TL_crafting_clamping_E9B6368E43E26AA14A656EB3AAC38FBD) == 0x0003F8, "Member 'ABP_Worktable_Placed_C::TL_crafting_clamping_E9B6368E43E26AA14A656EB3AAC38FBD' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, TL_crafting__Direction_E9B6368E43E26AA14A656EB3AAC38FBD) == 0x0003FC, "Member 'ABP_Worktable_Placed_C::TL_crafting__Direction_E9B6368E43E26AA14A656EB3AAC38FBD' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, TL_crafting) == 0x000400, "Member 'ABP_Worktable_Placed_C::TL_crafting' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, MI_lamp) == 0x000408, "Member 'ABP_Worktable_Placed_C::MI_lamp' has a wrong offset!");
static_assert(offsetof(ABP_Worktable_Placed_C, Anim_duration) == 0x000410, "Member 'ABP_Worktable_Placed_C::Anim_duration' has a wrong offset!");

}

