#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_CinematicsUtils

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPFL_CinematicsUtils.BPFL_CinematicsUtils_C.GetActiveCinematicsConfig
// 0x0020 (0x0020 - 0x0000)
struct BPFL_CinematicsUtils_C_GetActiveCinematicsConfig final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCinematicSequenceConfig*               NewParam;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCinematicManagerComponent*             CallFunc_GetCinematicsManager_CinematicsManager;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCinematicsManager_bIsValid;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_CinematicsUtils_C_GetActiveCinematicsConfig) == 0x000008, "Wrong alignment on BPFL_CinematicsUtils_C_GetActiveCinematicsConfig");
static_assert(sizeof(BPFL_CinematicsUtils_C_GetActiveCinematicsConfig) == 0x000020, "Wrong size on BPFL_CinematicsUtils_C_GetActiveCinematicsConfig");
static_assert(offsetof(BPFL_CinematicsUtils_C_GetActiveCinematicsConfig, __WorldContext) == 0x000000, "Member 'BPFL_CinematicsUtils_C_GetActiveCinematicsConfig::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_GetActiveCinematicsConfig, NewParam) == 0x000008, "Member 'BPFL_CinematicsUtils_C_GetActiveCinematicsConfig::NewParam' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_GetActiveCinematicsConfig, CallFunc_GetCinematicsManager_CinematicsManager) == 0x000010, "Member 'BPFL_CinematicsUtils_C_GetActiveCinematicsConfig::CallFunc_GetCinematicsManager_CinematicsManager' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_GetActiveCinematicsConfig, CallFunc_GetCinematicsManager_bIsValid) == 0x000018, "Member 'BPFL_CinematicsUtils_C_GetActiveCinematicsConfig::CallFunc_GetCinematicsManager_bIsValid' has a wrong offset!");

// Function BPFL_CinematicsUtils.BPFL_CinematicsUtils_C.GetCinematicsManager
// 0x0038 (0x0038 - 0x0000)
struct BPFL_CinematicsUtils_C_GetCinematicsManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCinematicManagerComponent*             CinematicsManager;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41FE[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               K2Node_DynamicCast_AsValeria_Player_Controller;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41FF[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCinematicManagerComponent*             CallFunc_GetCinematicManager_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_CinematicsUtils_C_GetCinematicsManager) == 0x000008, "Wrong alignment on BPFL_CinematicsUtils_C_GetCinematicsManager");
static_assert(sizeof(BPFL_CinematicsUtils_C_GetCinematicsManager) == 0x000038, "Wrong size on BPFL_CinematicsUtils_C_GetCinematicsManager");
static_assert(offsetof(BPFL_CinematicsUtils_C_GetCinematicsManager, __WorldContext) == 0x000000, "Member 'BPFL_CinematicsUtils_C_GetCinematicsManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_GetCinematicsManager, CinematicsManager) == 0x000008, "Member 'BPFL_CinematicsUtils_C_GetCinematicsManager::CinematicsManager' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_GetCinematicsManager, bIsValid) == 0x000010, "Member 'BPFL_CinematicsUtils_C_GetCinematicsManager::bIsValid' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_GetCinematicsManager, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BPFL_CinematicsUtils_C_GetCinematicsManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_GetCinematicsManager, K2Node_DynamicCast_AsValeria_Player_Controller) == 0x000020, "Member 'BPFL_CinematicsUtils_C_GetCinematicsManager::K2Node_DynamicCast_AsValeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_GetCinematicsManager, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPFL_CinematicsUtils_C_GetCinematicsManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_GetCinematicsManager, CallFunc_GetCinematicManager_ReturnValue) == 0x000030, "Member 'BPFL_CinematicsUtils_C_GetCinematicsManager::CallFunc_GetCinematicManager_ReturnValue' has a wrong offset!");

// Function BPFL_CinematicsUtils.BPFL_CinematicsUtils_C.IsPlayerVisibleForLocalCinematicState
// 0x0028 (0x0028 - 0x0000)
struct BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState final
{
public:
	class AValeriaCharacter*                      ValeriaCharacter;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisible;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayerIsLocal;                                    // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayerIsVisible;                                  // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4200[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCinematicSequenceConfig*               CallFunc_GetActiveCinematicsConfig_NewParam;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState) == 0x000008, "Wrong alignment on BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState");
static_assert(sizeof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState) == 0x000028, "Wrong size on BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, ValeriaCharacter) == 0x000000, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::ValeriaCharacter' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, __WorldContext) == 0x000008, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, bVisible) == 0x000010, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::bVisible' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, bPlayerIsLocal) == 0x000011, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::bPlayerIsLocal' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, bPlayerIsVisible) == 0x000012, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::bPlayerIsVisible' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, CallFunc_IsLocallyControlled_ReturnValue) == 0x000014, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, CallFunc_GetActiveCinematicsConfig_NewParam) == 0x000018, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::CallFunc_GetActiveCinematicsConfig_NewParam' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, CallFunc_Not_PreBool_ReturnValue_1) == 0x000021, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, CallFunc_Not_PreBool_ReturnValue_2) == 0x000022, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, CallFunc_BooleanAND_ReturnValue_1) == 0x000024, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState, CallFunc_BooleanOR_ReturnValue) == 0x000025, "Member 'BPFL_CinematicsUtils_C_IsPlayerVisibleForLocalCinematicState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

