#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_QuestUI

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPFL_QuestUI.BPFL_QuestUI_C.GetBranchingStatement
// 0x0258 (0x0258 - 0x0000)
struct BPFL_QuestUI_C_GetBranchingStatement final
{
public:
	struct FVAL_QuestStepDef                      QuestStepDef;                                      // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0108(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   BranchingStatement;                                // 0x0110(0x0018)(Parm, OutParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA0[0x5];                                     // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA1[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0140(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA2[0x6];                                     // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA3[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01D0(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA4[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0228(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA5[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0240(0x0018)()
};
static_assert(alignof(BPFL_QuestUI_C_GetBranchingStatement) == 0x000008, "Wrong alignment on BPFL_QuestUI_C_GetBranchingStatement");
static_assert(sizeof(BPFL_QuestUI_C_GetBranchingStatement) == 0x000258, "Wrong size on BPFL_QuestUI_C_GetBranchingStatement");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, QuestStepDef) == 0x000000, "Member 'BPFL_QuestUI_C_GetBranchingStatement::QuestStepDef' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, __WorldContext) == 0x000108, "Member 'BPFL_QuestUI_C_GetBranchingStatement::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, BranchingStatement) == 0x000110, "Member 'BPFL_QuestUI_C_GetBranchingStatement::BranchingStatement' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000128, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_Less_IntInt_ReturnValue) == 0x000129, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_Greater_IntInt_ReturnValue) == 0x00012A, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000130, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_BooleanAND_ReturnValue) == 0x000138, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, K2Node_MakeStruct_FormatArgumentData) == 0x000140, "Member 'BPFL_QuestUI_C_GetBranchingStatement::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, K2Node_MakeArray_Array) == 0x000190, "Member 'BPFL_QuestUI_C_GetBranchingStatement::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_Format_ReturnValue) == 0x0001A0, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001B8, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001B9, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0001C0, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0001C8, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001D0, "Member 'BPFL_QuestUI_C_GetBranchingStatement::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_BooleanAND_ReturnValue_1) == 0x000220, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, K2Node_MakeArray_Array_1) == 0x000228, "Member 'BPFL_QuestUI_C_GetBranchingStatement::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_BooleanAND_ReturnValue_2) == 0x000238, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetBranchingStatement, CallFunc_Format_ReturnValue_1) == 0x000240, "Member 'BPFL_QuestUI_C_GetBranchingStatement::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BPFL_QuestUI.BPFL_QuestUI_C.GetDescriptionFromQuestGoal
// 0x0240 (0x0240 - 0x0000)
struct BPFL_QuestUI_C_GetDescriptionFromQuestGoal final
{
public:
	struct FVAL_QuestGoalState                    QuestGoalState;                                    // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVAL_QuestGoalDef                      QuestGoalDef;                                      // 0x0068(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   GoalDescriptionText;                               // 0x00C0(0x0018)(Parm, OutParm)
	class FText                                   GoalDescription;                                   // 0x00D8(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA6[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAutoDescription_outDescription;        // 0x00F8(0x0018)()
	bool                                          CallFunc_GetAutoDescription_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA7[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0128(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0178(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01C8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0218(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0228(0x0018)()
};
static_assert(alignof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal) == 0x000008, "Wrong alignment on BPFL_QuestUI_C_GetDescriptionFromQuestGoal");
static_assert(sizeof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal) == 0x000240, "Wrong size on BPFL_QuestUI_C_GetDescriptionFromQuestGoal");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, QuestGoalState) == 0x000000, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::QuestGoalState' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, QuestGoalDef) == 0x000068, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::QuestGoalDef' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, __WorldContext) == 0x0000B8, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, GoalDescriptionText) == 0x0000C0, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::GoalDescriptionText' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, GoalDescription) == 0x0000D8, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::GoalDescription' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, CallFunc_TextIsEmpty_ReturnValue) == 0x0000F0, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, CallFunc_GetAutoDescription_outDescription) == 0x0000F8, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::CallFunc_GetAutoDescription_outDescription' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, CallFunc_GetAutoDescription_ReturnValue) == 0x000110, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::CallFunc_GetAutoDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, CallFunc_BooleanAND_ReturnValue) == 0x000111, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000118, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000120, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, K2Node_MakeStruct_FormatArgumentData) == 0x000128, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, K2Node_MakeStruct_FormatArgumentData_1) == 0x000178, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001C8, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, K2Node_MakeArray_Array) == 0x000218, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetDescriptionFromQuestGoal, CallFunc_Format_ReturnValue) == 0x000228, "Member 'BPFL_QuestUI_C_GetDescriptionFromQuestGoal::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BPFL_QuestUI.BPFL_QuestUI_C.GetQuestDescription
// 0x01D0 (0x01D0 - 0x0000)
struct BPFL_QuestUI_C_GetQuestDescription final
{
public:
	struct FVAL_QuestState                        QuestState;                                        // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UVAL_QuestDef*                    QuestDef;                                          // 0x0098(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   QuestDescription;                                  // 0x00A8(0x0018)(Parm, OutParm)
	struct FVAL_QuestStepDef                      CallFunc_GetCurrentQuestStepDefinition_QuestStepDef; // 0x00C0(0x0108)(ContainsInstancedReference)
	bool                                          CallFunc_GetCurrentQuestStepDefinition_bFoundQuestStep; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_QuestUI_C_GetQuestDescription) == 0x000008, "Wrong alignment on BPFL_QuestUI_C_GetQuestDescription");
static_assert(sizeof(BPFL_QuestUI_C_GetQuestDescription) == 0x0001D0, "Wrong size on BPFL_QuestUI_C_GetQuestDescription");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestDescription, QuestState) == 0x000000, "Member 'BPFL_QuestUI_C_GetQuestDescription::QuestState' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestDescription, QuestDef) == 0x000098, "Member 'BPFL_QuestUI_C_GetQuestDescription::QuestDef' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestDescription, __WorldContext) == 0x0000A0, "Member 'BPFL_QuestUI_C_GetQuestDescription::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestDescription, QuestDescription) == 0x0000A8, "Member 'BPFL_QuestUI_C_GetQuestDescription::QuestDescription' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestDescription, CallFunc_GetCurrentQuestStepDefinition_QuestStepDef) == 0x0000C0, "Member 'BPFL_QuestUI_C_GetQuestDescription::CallFunc_GetCurrentQuestStepDefinition_QuestStepDef' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestDescription, CallFunc_GetCurrentQuestStepDefinition_bFoundQuestStep) == 0x0001C8, "Member 'BPFL_QuestUI_C_GetQuestDescription::CallFunc_GetCurrentQuestStepDefinition_bFoundQuestStep' has a wrong offset!");

// Function BPFL_QuestUI.BPFL_QuestUI_C.GetQuestTitle
// 0x01D0 (0x01D0 - 0x0000)
struct BPFL_QuestUI_C_GetQuestTitle final
{
public:
	struct FVAL_QuestState                        QuestState;                                        // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UVAL_QuestDef*                    QuestDef;                                          // 0x0098(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   QuestTitle;                                        // 0x00A8(0x0018)(Parm, OutParm)
	struct FVAL_QuestStepDef                      CallFunc_GetCurrentQuestStepDefinition_QuestStepDef; // 0x00C0(0x0108)(ContainsInstancedReference)
	bool                                          CallFunc_GetCurrentQuestStepDefinition_bFoundQuestStep; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_QuestUI_C_GetQuestTitle) == 0x000008, "Wrong alignment on BPFL_QuestUI_C_GetQuestTitle");
static_assert(sizeof(BPFL_QuestUI_C_GetQuestTitle) == 0x0001D0, "Wrong size on BPFL_QuestUI_C_GetQuestTitle");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestTitle, QuestState) == 0x000000, "Member 'BPFL_QuestUI_C_GetQuestTitle::QuestState' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestTitle, QuestDef) == 0x000098, "Member 'BPFL_QuestUI_C_GetQuestTitle::QuestDef' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestTitle, __WorldContext) == 0x0000A0, "Member 'BPFL_QuestUI_C_GetQuestTitle::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestTitle, QuestTitle) == 0x0000A8, "Member 'BPFL_QuestUI_C_GetQuestTitle::QuestTitle' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestTitle, CallFunc_GetCurrentQuestStepDefinition_QuestStepDef) == 0x0000C0, "Member 'BPFL_QuestUI_C_GetQuestTitle::CallFunc_GetCurrentQuestStepDefinition_QuestStepDef' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetQuestTitle, CallFunc_GetCurrentQuestStepDefinition_bFoundQuestStep) == 0x0001C8, "Member 'BPFL_QuestUI_C_GetQuestTitle::CallFunc_GetCurrentQuestStepDefinition_bFoundQuestStep' has a wrong offset!");

// Function BPFL_QuestUI.BPFL_QuestUI_C.GetReturnTextAndIconForDialogueAsset
// 0x0220 (0x0220 - 0x0000)
struct BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset final
{
public:
	struct FVAL_QuestStepDef                      QuestStepDef;                                      // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	class UVAL_DialogueAsset*                     DialogueAsset;                                     // 0x0108(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0110(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          WasSuccess;                                        // 0x0118(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA8[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnToText;                                      // 0x0120(0x0018)(Parm, OutParm)
	TSoftObjectPtr<class UTexture2D>              ReturnToIcon;                                      // 0x0138(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA9[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSpeakerIcon_ReturnValue;               // 0x0168(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0190(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0208(0x0018)()
};
static_assert(alignof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset) == 0x000008, "Wrong alignment on BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset");
static_assert(sizeof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset) == 0x000220, "Wrong size on BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, QuestStepDef) == 0x000000, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::QuestStepDef' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, DialogueAsset) == 0x000108, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::DialogueAsset' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, __WorldContext) == 0x000110, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, WasSuccess) == 0x000118, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::WasSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, ReturnToText) == 0x000120, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::ReturnToText' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, ReturnToIcon) == 0x000138, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::ReturnToIcon' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, Temp_bool_Variable) == 0x000160, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, CallFunc_GetSpeakerIcon_ReturnValue) == 0x000168, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::CallFunc_GetSpeakerIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, K2Node_MakeStruct_FormatArgumentData) == 0x000190, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, K2Node_MakeArray_Array) == 0x0001E0, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, CallFunc_Format_ReturnValue) == 0x0001F0, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset, K2Node_Select_Default) == 0x000208, "Member 'BPFL_QuestUI_C_GetReturnTextAndIconForDialogueAsset::K2Node_Select_Default' has a wrong offset!");

// Function BPFL_QuestUI.BPFL_QuestUI_C.GetReturnToText
// 0x03B8 (0x03B8 - 0x0000)
struct BPFL_QuestUI_C_GetReturnToText final
{
public:
	struct FVAL_QuestStepDef                      QuestStepDef;                                      // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FVAL_QuestState                        QuestState;                                        // 0x0108(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x01A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          WasSuccess;                                        // 0x01A8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DAA[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnToText;                                      // 0x01B0(0x0018)(Parm, OutParm)
	TSoftObjectPtr<class UTexture2D>              ReturnToIcon;                                      // 0x01C8(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DAB[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_DialogueAsset*                     K2Node_DynamicCast_AsDialogue_Asset;               // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DAC[0x6];                                     // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_QuestStepState                    CallFunc_GetCurrentQuestStep_QuestStepState;       // 0x0218(0x0070)()
	bool                                          CallFunc_GetCurrentQuestStep_bFoundQuestStep;      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DAD[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_DialogueAsset*                     K2Node_DynamicCast_AsDialogue_Asset_1;             // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReturnTextAndIconForDialogueAsset_WasSuccess; // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DAE[0x6];                                     // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetReturnTextAndIconForDialogueAsset_ReturnToText; // 0x02A0(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetReturnTextAndIconForDialogueAsset_ReturnToIcon; // 0x02B8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DAF[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_QuestBranchingGoalState           CallFunc_Array_Get_Item;                           // 0x02E8(0x0070)()
	bool                                          CallFunc_GetReturnTextAndIconForDialogueAsset_WasSuccess_1; // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DB0[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetReturnTextAndIconForDialogueAsset_ReturnToText_1; // 0x0360(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetReturnTextAndIconForDialogueAsset_ReturnToIcon_1; // 0x0378(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DB1[0x3];                                     // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DB2[0x3];                                     // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DB3[0x3];                                     // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_QuestUI_C_GetReturnToText) == 0x000008, "Wrong alignment on BPFL_QuestUI_C_GetReturnToText");
static_assert(sizeof(BPFL_QuestUI_C_GetReturnToText) == 0x0003B8, "Wrong size on BPFL_QuestUI_C_GetReturnToText");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnToText, QuestStepDef) == 0x000000, "Member 'BPFL_QuestUI_C_GetReturnToText::QuestStepDef' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnToText, QuestState) == 0x000108, "Member 'BPFL_QuestUI_C_GetReturnToText::QuestState' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnToText, __WorldContext) == 0x0001A0, "Member 'BPFL_QuestUI_C_GetReturnToText::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_QuestUI_C_GetReturnToText, WasSuccess) == 0x0001A8, "Member 'BPFL_QuestUI_C_GetReturnToText::WasSuccess' has a wrong offset!");
