#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_Matchmaking

#include "Basic.hpp"

#include "OnlineSubsystemValeria_structs.hpp"
#include "F_GenericErrorModalPayload_structs.hpp"
#include "S6Core_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPFL_Matchmaking.BPFL_Matchmaking_C.GetAlreadyMatchmakingErrorText
// 0x0020 (0x0020 - 0x0000)
struct BPFL_Matchmaking_C_GetAlreadyMatchmakingErrorText final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0008(0x0018)(Parm, OutParm)
};
static_assert(alignof(BPFL_Matchmaking_C_GetAlreadyMatchmakingErrorText) == 0x000008, "Wrong alignment on BPFL_Matchmaking_C_GetAlreadyMatchmakingErrorText");
static_assert(sizeof(BPFL_Matchmaking_C_GetAlreadyMatchmakingErrorText) == 0x000020, "Wrong size on BPFL_Matchmaking_C_GetAlreadyMatchmakingErrorText");
static_assert(offsetof(BPFL_Matchmaking_C_GetAlreadyMatchmakingErrorText, __WorldContext) == 0x000000, "Member 'BPFL_Matchmaking_C_GetAlreadyMatchmakingErrorText::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_GetAlreadyMatchmakingErrorText, Text) == 0x000008, "Member 'BPFL_Matchmaking_C_GetAlreadyMatchmakingErrorText::Text' has a wrong offset!");

// Function BPFL_Matchmaking.BPFL_Matchmaking_C.CreateErrorPayloadForMatchmakingResult
// 0x03B8 (0x03B8 - 0x0000)
struct BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult final
{
public:
	struct FOSSVAL_MatchmakingResult              Result;                                            // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FF_GenericErrorModalPayload            Payload;                                           // 0x00C8(0x0098)(Parm, OutParm, HasGetValueTypeHash)
	class FText                                   SubErrorText;                                      // 0x0160(0x0018)(Edit, BlueprintVisible)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E59[0x6];                                     // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0190(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01E0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0240(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E5A[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0258(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E5B[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0278(0x0018)()
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0290(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E5C[0x6];                                     // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSSVAL_MatchmakingCustomErrorContainer K2Node_Select_Default;                             // 0x02B0(0x0050)(ConstParm)
	struct FF_GenericErrorModalPayload            K2Node_MakeStruct_F_GenericErrorModalPayload;      // 0x0300(0x0098)(HasGetValueTypeHash)
	class FText                                   CallFunc_Map_Find_Value_1;                         // 0x0398(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult) == 0x000008, "Wrong alignment on BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult");
static_assert(sizeof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult) == 0x0003B8, "Wrong size on BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, Result) == 0x000000, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::Result' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, __WorldContext) == 0x0000C0, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, Payload) == 0x0000C8, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::Payload' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, SubErrorText) == 0x000160, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::SubErrorText' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_GetPlatformType_ReturnValue) == 0x000178, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000179, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000180, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000188, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, K2Node_MakeStruct_FormatArgumentData) == 0x000190, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001E0, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, K2Node_MakeArray_Array) == 0x000230, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, K2Node_MakeArray_Array_1) == 0x000240, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000250, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_Format_ReturnValue) == 0x000258, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000270, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_Format_ReturnValue_1) == 0x000278, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_Map_Find_Value) == 0x000290, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_Map_Find_ReturnValue) == 0x0002A8, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, Temp_bool_Variable) == 0x0002A9, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, K2Node_Select_Default) == 0x0002B0, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, K2Node_MakeStruct_F_GenericErrorModalPayload) == 0x000300, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::K2Node_MakeStruct_F_GenericErrorModalPayload' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_Map_Find_Value_1) == 0x000398, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult, CallFunc_Map_Find_ReturnValue_1) == 0x0003B0, "Member 'BPFL_Matchmaking_C_CreateErrorPayloadForMatchmakingResult::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

}

