#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_UiHelpers

#include "Basic.hpp"

#include "ValeriaUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "EWorldToUiScaling_structs.hpp"


namespace SDK::Params
{

// Function BPFL_UiHelpers.BPFL_UiHelpers_C.AreCheatsEnabled
// 0x0048 (0x0048 - 0x0000)
struct BPFL_UiHelpers_C_AreCheatsEnabled final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE6[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CharacterCached;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE7[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE8[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDebugInfoComponent*                    CallFunc_GetDebugInfoComponent_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreCheatsEnabled_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UiHelpers_C_AreCheatsEnabled) == 0x000008, "Wrong alignment on BPFL_UiHelpers_C_AreCheatsEnabled");
static_assert(sizeof(BPFL_UiHelpers_C_AreCheatsEnabled) == 0x000048, "Wrong size on BPFL_UiHelpers_C_AreCheatsEnabled");
static_assert(offsetof(BPFL_UiHelpers_C_AreCheatsEnabled, Context) == 0x000000, "Member 'BPFL_UiHelpers_C_AreCheatsEnabled::Context' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_AreCheatsEnabled, __WorldContext) == 0x000008, "Member 'BPFL_UiHelpers_C_AreCheatsEnabled::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_AreCheatsEnabled, Result) == 0x000010, "Member 'BPFL_UiHelpers_C_AreCheatsEnabled::Result' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_AreCheatsEnabled, CharacterCached) == 0x000018, "Member 'BPFL_UiHelpers_C_AreCheatsEnabled::CharacterCached' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_AreCheatsEnabled, CallFunc_GetValeriaCharacter_OutResult) == 0x000020, "Member 'BPFL_UiHelpers_C_AreCheatsEnabled::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_AreCheatsEnabled, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000028, "Member 'BPFL_UiHelpers_C_AreCheatsEnabled::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_AreCheatsEnabled, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BPFL_UiHelpers_C_AreCheatsEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_AreCheatsEnabled, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'BPFL_UiHelpers_C_AreCheatsEnabled::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_AreCheatsEnabled, CallFunc_GetDebugInfoComponent_ReturnValue) == 0x000038, "Member 'BPFL_UiHelpers_C_AreCheatsEnabled::CallFunc_GetDebugInfoComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_AreCheatsEnabled, CallFunc_AreCheatsEnabled_ReturnValue) == 0x000040, "Member 'BPFL_UiHelpers_C_AreCheatsEnabled::CallFunc_AreCheatsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_AreCheatsEnabled, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BPFL_UiHelpers_C_AreCheatsEnabled::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BPFL_UiHelpers.BPFL_UiHelpers_C.CanItemBeRequested?
// 0x0050 (0x0050 - 0x0000)
struct BPFL_UiHelpers_C_CanItemBeRequested_ final
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRequestable_;                                    // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE9[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UiHelpers_C_CanItemBeRequested_) == 0x000008, "Wrong alignment on BPFL_UiHelpers_C_CanItemBeRequested_");
static_assert(sizeof(BPFL_UiHelpers_C_CanItemBeRequested_) == 0x000050, "Wrong size on BPFL_UiHelpers_C_CanItemBeRequested_");
static_assert(offsetof(BPFL_UiHelpers_C_CanItemBeRequested_, ItemType) == 0x000000, "Member 'BPFL_UiHelpers_C_CanItemBeRequested_::ItemType' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CanItemBeRequested_, __WorldContext) == 0x000028, "Member 'BPFL_UiHelpers_C_CanItemBeRequested_::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CanItemBeRequested_, IsRequestable_) == 0x000030, "Member 'BPFL_UiHelpers_C_CanItemBeRequested_::IsRequestable_' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CanItemBeRequested_, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000038, "Member 'BPFL_UiHelpers_C_CanItemBeRequested_::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CanItemBeRequested_, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000040, "Member 'BPFL_UiHelpers_C_CanItemBeRequested_::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CanItemBeRequested_, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BPFL_UiHelpers_C_CanItemBeRequested_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CanItemBeRequested_, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BPFL_UiHelpers_C_CanItemBeRequested_::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CanItemBeRequested_, CallFunc_Greater_IntInt_ReturnValue) == 0x00004A, "Member 'BPFL_UiHelpers_C_CanItemBeRequested_::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CanItemBeRequested_, CallFunc_Not_PreBool_ReturnValue) == 0x00004B, "Member 'BPFL_UiHelpers_C_CanItemBeRequested_::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CanItemBeRequested_, CallFunc_BooleanAND_ReturnValue) == 0x00004C, "Member 'BPFL_UiHelpers_C_CanItemBeRequested_::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPFL_UiHelpers.BPFL_UiHelpers_C.CenterMousePointer
// 0x0050 (0x0050 - 0x0000)
struct BPFL_UiHelpers_C_CenterMousePointer final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UiHelpers_C_CenterMousePointer) == 0x000008, "Wrong alignment on BPFL_UiHelpers_C_CenterMousePointer");
static_assert(sizeof(BPFL_UiHelpers_C_CenterMousePointer) == 0x000050, "Wrong size on BPFL_UiHelpers_C_CenterMousePointer");
static_assert(offsetof(BPFL_UiHelpers_C_CenterMousePointer, WorldContextObject) == 0x000000, "Member 'BPFL_UiHelpers_C_CenterMousePointer::WorldContextObject' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CenterMousePointer, __WorldContext) == 0x000008, "Member 'BPFL_UiHelpers_C_CenterMousePointer::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CenterMousePointer, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BPFL_UiHelpers_C_CenterMousePointer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CenterMousePointer, CallFunc_GetViewportSize_ReturnValue) == 0x000018, "Member 'BPFL_UiHelpers_C_CenterMousePointer::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CenterMousePointer, CallFunc_BreakVector2D_X) == 0x000028, "Member 'BPFL_UiHelpers_C_CenterMousePointer::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CenterMousePointer, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'BPFL_UiHelpers_C_CenterMousePointer::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CenterMousePointer, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'BPFL_UiHelpers_C_CenterMousePointer::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CenterMousePointer, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BPFL_UiHelpers_C_CenterMousePointer::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CenterMousePointer, CallFunc_FTrunc_ReturnValue) == 0x000048, "Member 'BPFL_UiHelpers_C_CenterMousePointer::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CenterMousePointer, CallFunc_FTrunc_ReturnValue_1) == 0x00004C, "Member 'BPFL_UiHelpers_C_CenterMousePointer::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");

// Function BPFL_UiHelpers.BPFL_UiHelpers_C.ChangeCanvasSlotPosition
// 0x00C0 (0x00C0 - 0x0000)
struct BPFL_UiHelpers_C_ChangeCanvasSlotPosition final
{
public:
	class UCanvasPanelSlot*                       ToChange;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       ToCopyFrom;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetZOrder_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EEA[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchorData                            CallFunc_GetLayout_ReturnValue;                    // 0x0030(0x0040)(NoDestructor)
	bool                                          CallFunc_GetAutoSize_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EEB[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetAlignment_ReturnValue;                 // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               CallFunc_GetAnchors_ReturnValue;                   // 0x0098(0x0020)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition) == 0x000008, "Wrong alignment on BPFL_UiHelpers_C_ChangeCanvasSlotPosition");
static_assert(sizeof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition) == 0x0000C0, "Wrong size on BPFL_UiHelpers_C_ChangeCanvasSlotPosition");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, ToChange) == 0x000000, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::ToChange' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, ToCopyFrom) == 0x000008, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::ToCopyFrom' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, __WorldContext) == 0x000010, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, CallFunc_GetZOrder_ReturnValue) == 0x000018, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::CallFunc_GetZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, CallFunc_GetSize_ReturnValue) == 0x000020, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, CallFunc_GetLayout_ReturnValue) == 0x000030, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::CallFunc_GetLayout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, CallFunc_GetAutoSize_ReturnValue) == 0x000070, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::CallFunc_GetAutoSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, CallFunc_GetAlignment_ReturnValue) == 0x000078, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::CallFunc_GetAlignment_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, CallFunc_GetPosition_ReturnValue) == 0x000088, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, CallFunc_GetAnchors_ReturnValue) == 0x000098, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::CallFunc_GetAnchors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, CallFunc_IsValid_ReturnValue_1) == 0x0000B9, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_ChangeCanvasSlotPosition, CallFunc_BooleanAND_ReturnValue) == 0x0000BA, "Member 'BPFL_UiHelpers_C_ChangeCanvasSlotPosition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPFL_UiHelpers.BPFL_UiHelpers_C.CheckTimePassed
// 0x0048 (0x0048 - 0x0000)
struct BPFL_UiHelpers_C_CheckTimePassed final
{
public:
	double                                        TimePassed;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeltaTime;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Period;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        NewTimePassed;                                     // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPassed;                                         // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EEC[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TmpTimePassed;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UiHelpers_C_CheckTimePassed) == 0x000008, "Wrong alignment on BPFL_UiHelpers_C_CheckTimePassed");
static_assert(sizeof(BPFL_UiHelpers_C_CheckTimePassed) == 0x000048, "Wrong size on BPFL_UiHelpers_C_CheckTimePassed");
static_assert(offsetof(BPFL_UiHelpers_C_CheckTimePassed, TimePassed) == 0x000000, "Member 'BPFL_UiHelpers_C_CheckTimePassed::TimePassed' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CheckTimePassed, DeltaTime) == 0x000008, "Member 'BPFL_UiHelpers_C_CheckTimePassed::DeltaTime' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CheckTimePassed, Period) == 0x000010, "Member 'BPFL_UiHelpers_C_CheckTimePassed::Period' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CheckTimePassed, __WorldContext) == 0x000018, "Member 'BPFL_UiHelpers_C_CheckTimePassed::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CheckTimePassed, NewTimePassed) == 0x000020, "Member 'BPFL_UiHelpers_C_CheckTimePassed::NewTimePassed' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CheckTimePassed, HasPassed) == 0x000028, "Member 'BPFL_UiHelpers_C_CheckTimePassed::HasPassed' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CheckTimePassed, TmpTimePassed) == 0x000030, "Member 'BPFL_UiHelpers_C_CheckTimePassed::TmpTimePassed' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CheckTimePassed, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'BPFL_UiHelpers_C_CheckTimePassed::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_CheckTimePassed, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000040, "Member 'BPFL_UiHelpers_C_CheckTimePassed::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BPFL_UiHelpers.BPFL_UiHelpers_C.DoesWorldLocationContextMatchCurrentTravelType
// 0x0020 (0x0020 - 0x0000)
struct BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType final
{
public:
	EWorldLocationContext                         WorldLocationContext;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeleportTravelType                           TravelType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EED[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          DoesMatch;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType) == 0x000008, "Wrong alignment on BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType");
static_assert(sizeof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType) == 0x000020, "Wrong size on BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, WorldLocationContext) == 0x000000, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::WorldLocationContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, TravelType) == 0x000001, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::TravelType' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, __WorldContext) == 0x000008, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, DoesMatch) == 0x000010, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::DoesMatch' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000013, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000014, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, CallFunc_BooleanOR_ReturnValue) == 0x000015, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000016, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000017, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000018, "Member 'BPFL_UiHelpers_C_DoesWorldLocationContextMatchCurrentTravelType::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");

// Function BPFL_UiHelpers.BPFL_UiHelpers_C.FormatClockTimeInValeria
// 0x0120 (0x0120 - 0x0000)
struct BPFL_UiHelpers_C_FormatClockTimeInValeria final
{
public:
	struct FClockTimeInValeria                    Time;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Result;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EEE[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EEF[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF0[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF1[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF2[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_1;                           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_2;                           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UiHelpers_C_FormatClockTimeInValeria) == 0x000008, "Wrong alignment on BPFL_UiHelpers_C_FormatClockTimeInValeria");
static_assert(sizeof(BPFL_UiHelpers_C_FormatClockTimeInValeria) == 0x000120, "Wrong size on BPFL_UiHelpers_C_FormatClockTimeInValeria");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, Time) == 0x000000, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::Time' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, __WorldContext) == 0x000010, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, Result) == 0x000018, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::Result' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, Temp_string_Variable) == 0x000028, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000038, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000050, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, CallFunc_Percent_IntInt_ReturnValue) == 0x000054, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, Temp_string_Variable_1) == 0x000058, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, Temp_bool_Variable) == 0x000069, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, Temp_int_Variable) == 0x00006C, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, Temp_bool_Variable_1) == 0x000070, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, K2Node_Select_Default) == 0x000074, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000078, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, Temp_string_Variable_2) == 0x000088, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, Temp_string_Variable_3) == 0x0000A8, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, Temp_bool_Variable_2) == 0x0000B8, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, K2Node_Select_Default_1) == 0x0000C0, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, K2Node_Select_Default_2) == 0x0000D0, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000E0, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000F0, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000100, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimeInValeria, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000110, "Member 'BPFL_UiHelpers_C_FormatClockTimeInValeria::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function BPFL_UiHelpers.BPFL_UiHelpers_C.FormatClockTimInValeriaDHM
// 0x0078 (0x0078 - 0x0000)
struct BPFL_UiHelpers_C_FormatClockTimInValeriaDHM final
{
public:
	struct FClockTimeInValeria                    Time;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Result;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatClockTimeInValeria_Result;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UiHelpers_C_FormatClockTimInValeriaDHM) == 0x000008, "Wrong alignment on BPFL_UiHelpers_C_FormatClockTimInValeriaDHM");
static_assert(sizeof(BPFL_UiHelpers_C_FormatClockTimInValeriaDHM) == 0x000078, "Wrong size on BPFL_UiHelpers_C_FormatClockTimInValeriaDHM");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimInValeriaDHM, Time) == 0x000000, "Member 'BPFL_UiHelpers_C_FormatClockTimInValeriaDHM::Time' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimInValeriaDHM, __WorldContext) == 0x000010, "Member 'BPFL_UiHelpers_C_FormatClockTimInValeriaDHM::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimInValeriaDHM, Result) == 0x000018, "Member 'BPFL_UiHelpers_C_FormatClockTimInValeriaDHM::Result' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimInValeriaDHM, CallFunc_FormatClockTimeInValeria_Result) == 0x000028, "Member 'BPFL_UiHelpers_C_FormatClockTimInValeriaDHM::CallFunc_FormatClockTimeInValeria_Result' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimInValeriaDHM, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'BPFL_UiHelpers_C_FormatClockTimInValeriaDHM::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimInValeriaDHM, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'BPFL_UiHelpers_C_FormatClockTimInValeriaDHM::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimInValeriaDHM, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'BPFL_UiHelpers_C_FormatClockTimInValeriaDHM::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_FormatClockTimInValeriaDHM, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000068, "Member 'BPFL_UiHelpers_C_FormatClockTimInValeriaDHM::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function BPFL_UiHelpers.BPFL_UiHelpers_C.GetCurrentDay
// 0x0028 (0x0028 - 0x0000)
struct BPFL_UiHelpers_C_GetCurrentDay final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentDay;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF3[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaTimeManager*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaTimeManager*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValeriaTimeValid_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF4[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentDay_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UiHelpers_C_GetCurrentDay) == 0x000008, "Wrong alignment on BPFL_UiHelpers_C_GetCurrentDay");
static_assert(sizeof(BPFL_UiHelpers_C_GetCurrentDay) == 0x000028, "Wrong size on BPFL_UiHelpers_C_GetCurrentDay");
static_assert(offsetof(BPFL_UiHelpers_C_GetCurrentDay, __WorldContext) == 0x000000, "Member 'BPFL_UiHelpers_C_GetCurrentDay::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetCurrentDay, CurrentDay) == 0x000008, "Member 'BPFL_UiHelpers_C_GetCurrentDay::CurrentDay' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetCurrentDay, IsValid) == 0x00000C, "Member 'BPFL_UiHelpers_C_GetCurrentDay::IsValid' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetCurrentDay, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BPFL_UiHelpers_C_GetCurrentDay::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetCurrentDay, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000018, "Member 'BPFL_UiHelpers_C_GetCurrentDay::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetCurrentDay, CallFunc_IsValeriaTimeValid_ReturnValue) == 0x000020, "Member 'BPFL_UiHelpers_C_GetCurrentDay::CallFunc_IsValeriaTimeValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetCurrentDay, CallFunc_GetCurrentDay_ReturnValue) == 0x000024, "Member 'BPFL_UiHelpers_C_GetCurrentDay::CallFunc_GetCurrentDay_ReturnValue' has a wrong offset!");

// Function BPFL_UiHelpers.BPFL_UiHelpers_C.GetGwgTriplesTeamColor
// 0x0058 (0x0058 - 0x0000)
struct BPFL_UiHelpers_C_GetGwgTriplesTeamColor final
{
public:
	bool                                          GoodGuys;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF6[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UiHelpers_C_GetGwgTriplesTeamColor) == 0x000008, "Wrong alignment on BPFL_UiHelpers_C_GetGwgTriplesTeamColor");
static_assert(sizeof(BPFL_UiHelpers_C_GetGwgTriplesTeamColor) == 0x000058, "Wrong size on BPFL_UiHelpers_C_GetGwgTriplesTeamColor");
static_assert(offsetof(BPFL_UiHelpers_C_GetGwgTriplesTeamColor, GoodGuys) == 0x000000, "Member 'BPFL_UiHelpers_C_GetGwgTriplesTeamColor::GoodGuys' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetGwgTriplesTeamColor, __WorldContext) == 0x000008, "Member 'BPFL_UiHelpers_C_GetGwgTriplesTeamColor::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetGwgTriplesTeamColor, Color) == 0x000010, "Member 'BPFL_UiHelpers_C_GetGwgTriplesTeamColor::Color' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetGwgTriplesTeamColor, Temp_bool_Variable) == 0x000020, "Member 'BPFL_UiHelpers_C_GetGwgTriplesTeamColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetGwgTriplesTeamColor, Temp_struct_Variable) == 0x000024, "Member 'BPFL_UiHelpers_C_GetGwgTriplesTeamColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetGwgTriplesTeamColor, Temp_struct_Variable_1) == 0x000034, "Member 'BPFL_UiHelpers_C_GetGwgTriplesTeamColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetGwgTriplesTeamColor, K2Node_Select_Default) == 0x000044, "Member 'BPFL_UiHelpers_C_GetGwgTriplesTeamColor::K2Node_Select_Default' has a wrong offset!");

// Function BPFL_UiHelpers.BPFL_UiHelpers_C.GetItemCategoryColor
// 0x01E8 (0x01E8 - 0x0000)
struct BPFL_UiHelpers_C_GetItemCategoryColor final
{
public:
	EItemCategory                                 ItemCategory;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemCategory                                 Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF8[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_9;                            // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_10;                           // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_11;                           // 0x00D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_12;                           // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_13;                           // 0x00F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_14;                           // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_15;                           // 0x0114(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_16;                           // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_17;                           // 0x0134(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_18;                           // 0x0144(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_19;                           // 0x0154(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_20;                           // 0x0164(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_21;                           // 0x0174(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_22;                           // 0x0184(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_23;                           // 0x0194(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_24;                           // 0x01A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_25;                           // 0x01B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_26;                           // 0x01C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x01D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UiHelpers_C_GetItemCategoryColor) == 0x000008, "Wrong alignment on BPFL_UiHelpers_C_GetItemCategoryColor");
static_assert(sizeof(BPFL_UiHelpers_C_GetItemCategoryColor) == 0x0001E8, "Wrong size on BPFL_UiHelpers_C_GetItemCategoryColor");
static_assert(offsetof(BPFL_UiHelpers_C_GetItemCategoryColor, ItemCategory) == 0x000000, "Member 'BPFL_UiHelpers_C_GetItemCategoryColor::ItemCategory' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetItemCategoryColor, __WorldContext) == 0x000008, "Member 'BPFL_UiHelpers_C_GetItemCategoryColor::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetItemCategoryColor, Color) == 0x000010, "Member 'BPFL_UiHelpers_C_GetItemCategoryColor::Color' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetItemCategoryColor, Temp_byte_Variable) == 0x000020, "Member 'BPFL_UiHelpers_C_GetItemCategoryColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetItemCategoryColor, Temp_struct_Variable) == 0x000024, "Member 'BPFL_UiHelpers_C_GetItemCategoryColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetItemCategoryColor, Temp_struct_Variable_1) == 0x000034, "Member 'BPFL_UiHelpers_C_GetItemCategoryColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetItemCategoryColor, Temp_struct_Variable_2) == 0x000044, "Member 'BPFL_UiHelpers_C_GetItemCategoryColor::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetItemCategoryColor, Temp_struct_Variable_3) == 0x000054, "Member 'BPFL_UiHelpers_C_GetItemCategoryColor::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BPFL_UiHelpers_C_GetItemCategoryColor, Temp_struct_Variable_4) == 0x000064, "Member 'BPFL_UiHelpers_C_GetItemCategoryColor::Temp_struct_Variable_4' has a wrong offset!");
