#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_CharacterCustomizationHUD

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BPI_CharacterCustomizationHUD.BPI_CharacterCustomizationHUD_C.InitCharacterCustomizationHUD
// 0x0018 (0x0018 - 0x0000)
struct BPI_CharacterCustomizationHUD_C_InitCharacterCustomizationHUD final
{
public:
	class AValeriaCharacter*                      TargetCharacterActor;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationModeConfig  ModeConfig;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BPI_CharacterCustomizationHUD_C_InitCharacterCustomizationHUD) == 0x000008, "Wrong alignment on BPI_CharacterCustomizationHUD_C_InitCharacterCustomizationHUD");
static_assert(sizeof(BPI_CharacterCustomizationHUD_C_InitCharacterCustomizationHUD) == 0x000018, "Wrong size on BPI_CharacterCustomizationHUD_C_InitCharacterCustomizationHUD");
static_assert(offsetof(BPI_CharacterCustomizationHUD_C_InitCharacterCustomizationHUD, TargetCharacterActor) == 0x000000, "Member 'BPI_CharacterCustomizationHUD_C_InitCharacterCustomizationHUD::TargetCharacterActor' has a wrong offset!");
static_assert(offsetof(BPI_CharacterCustomizationHUD_C_InitCharacterCustomizationHUD, ModeConfig) == 0x000008, "Member 'BPI_CharacterCustomizationHUD_C_InitCharacterCustomizationHUD::ModeConfig' has a wrong offset!");

// Function BPI_CharacterCustomizationHUD.BPI_CharacterCustomizationHUD_C.InitCharacterRenderStudio
// 0x0008 (0x0008 - 0x0000)
struct BPI_CharacterCustomizationHUD_C_InitCharacterRenderStudio final
{
public:
	class AVAL_CharacterRenderStudio*             CharacterRenderStudio;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterCustomizationHUD_C_InitCharacterRenderStudio) == 0x000008, "Wrong alignment on BPI_CharacterCustomizationHUD_C_InitCharacterRenderStudio");
static_assert(sizeof(BPI_CharacterCustomizationHUD_C_InitCharacterRenderStudio) == 0x000008, "Wrong size on BPI_CharacterCustomizationHUD_C_InitCharacterRenderStudio");
static_assert(offsetof(BPI_CharacterCustomizationHUD_C_InitCharacterRenderStudio, CharacterRenderStudio) == 0x000000, "Member 'BPI_CharacterCustomizationHUD_C_InitCharacterRenderStudio::CharacterRenderStudio' has a wrong offset!");

}

