#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_PremiumStoreHUD

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function BPI_PremiumStoreHUD.BPI_PremiumStoreHUD_C.InitCharacterRenderStudio
// 0x0008 (0x0008 - 0x0000)
struct BPI_PremiumStoreHUD_C_InitCharacterRenderStudio final
{
public:
	class AVAL_CharacterRenderStudio*             RenderStudio;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PremiumStoreHUD_C_InitCharacterRenderStudio) == 0x000008, "Wrong alignment on BPI_PremiumStoreHUD_C_InitCharacterRenderStudio");
static_assert(sizeof(BPI_PremiumStoreHUD_C_InitCharacterRenderStudio) == 0x000008, "Wrong size on BPI_PremiumStoreHUD_C_InitCharacterRenderStudio");
static_assert(offsetof(BPI_PremiumStoreHUD_C_InitCharacterRenderStudio, RenderStudio) == 0x000000, "Member 'BPI_PremiumStoreHUD_C_InitCharacterRenderStudio::RenderStudio' has a wrong offset!");

// Function BPI_PremiumStoreHUD.BPI_PremiumStoreHUD_C.InitPreOpenHUD
// 0x0030 (0x0030 - 0x0000)
struct BPI_PremiumStoreHUD_C_InitPreOpenHUD final
{
public:
	class AValeriaCharacter*                      TargetCharacterActor;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_OpenStorePayload                  OpenStorePayload;                                  // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPI_PremiumStoreHUD_C_InitPreOpenHUD) == 0x000008, "Wrong alignment on BPI_PremiumStoreHUD_C_InitPreOpenHUD");
static_assert(sizeof(BPI_PremiumStoreHUD_C_InitPreOpenHUD) == 0x000030, "Wrong size on BPI_PremiumStoreHUD_C_InitPreOpenHUD");
static_assert(offsetof(BPI_PremiumStoreHUD_C_InitPreOpenHUD, TargetCharacterActor) == 0x000000, "Member 'BPI_PremiumStoreHUD_C_InitPreOpenHUD::TargetCharacterActor' has a wrong offset!");
static_assert(offsetof(BPI_PremiumStoreHUD_C_InitPreOpenHUD, OpenStorePayload) == 0x000008, "Member 'BPI_PremiumStoreHUD_C_InitPreOpenHUD::OpenStorePayload' has a wrong offset!");

}

