#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_UIFocusable

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_UIFocusable.BPI_UIFocusable_C.ShowFocusTip
// 0x0001 (0x0001 - 0x0000)
struct BPI_UIFocusable_C_ShowFocusTip final
{
public:
	bool                                          bIsShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_UIFocusable_C_ShowFocusTip) == 0x000001, "Wrong alignment on BPI_UIFocusable_C_ShowFocusTip");
static_assert(sizeof(BPI_UIFocusable_C_ShowFocusTip) == 0x000001, "Wrong size on BPI_UIFocusable_C_ShowFocusTip");
static_assert(offsetof(BPI_UIFocusable_C_ShowFocusTip, bIsShow) == 0x000000, "Member 'BPI_UIFocusable_C_ShowFocusTip::bIsShow' has a wrong offset!");

// Function BPI_UIFocusable.BPI_UIFocusable_C.IsEmpty
// 0x0001 (0x0001 - 0x0000)
struct BPI_UIFocusable_C_IsEmpty final
{
public:
	bool                                          bIsEmpty;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_UIFocusable_C_IsEmpty) == 0x000001, "Wrong alignment on BPI_UIFocusable_C_IsEmpty");
static_assert(sizeof(BPI_UIFocusable_C_IsEmpty) == 0x000001, "Wrong size on BPI_UIFocusable_C_IsEmpty");
static_assert(offsetof(BPI_UIFocusable_C_IsEmpty, bIsEmpty) == 0x000000, "Member 'BPI_UIFocusable_C_IsEmpty::bIsEmpty' has a wrong offset!");

}

