#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Comp_AkHomeVerb

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Comp_AkHomeVerb.Comp_AkHomeVerb_C.AudioDebugAbsorption
// 0x0001 (0x0001 - 0x0000)
struct Comp_AkHomeVerb_C_AudioDebugAbsorption final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_AkHomeVerb_C_AudioDebugAbsorption) == 0x000001, "Wrong alignment on Comp_AkHomeVerb_C_AudioDebugAbsorption");
static_assert(sizeof(Comp_AkHomeVerb_C_AudioDebugAbsorption) == 0x000001, "Wrong size on Comp_AkHomeVerb_C_AudioDebugAbsorption");
static_assert(offsetof(Comp_AkHomeVerb_C_AudioDebugAbsorption, On) == 0x000000, "Member 'Comp_AkHomeVerb_C_AudioDebugAbsorption::On' has a wrong offset!");

// Function Comp_AkHomeVerb.Comp_AkHomeVerb_C.ExecuteUbergraph_Comp_AkHomeVerb
// 0x0128 (0x0128 - 0x0000)
struct Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1992[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1993[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1994[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGatherableComponent*>           CallFunc_Set_ToArray_Result;                       // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1995[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGatherableComponent*                   CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1996[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb) == 0x000008, "Wrong alignment on Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb");
static_assert(sizeof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb) == 0x000128, "Wrong size on Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, EntryPoint) == 0x000000, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::EntryPoint' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, K2Node_CustomEvent_On) == 0x000034, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::K2Node_CustomEvent_On' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000038, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_GetAttachParent_ReturnValue) == 0x000058, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_GetAttachParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, K2Node_Event_DeltaSeconds) == 0x000060, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000068, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Set_ToArray_Result) == 0x000080, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Array_Get_Item) == 0x000098, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_GetDisplayName_ReturnValue_1) == 0x0000A8, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Replace_ReturnValue) == 0x0000B8, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x0000C8, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000D8, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_GetOwner_ReturnValue) == 0x0000E8, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000F0, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000100, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000118, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1) == 0x000120, "Member 'Comp_AkHomeVerb_C_ExecuteUbergraph_Comp_AkHomeVerb::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1' has a wrong offset!");

// Function Comp_AkHomeVerb.Comp_AkHomeVerb_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Comp_AkHomeVerb_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_AkHomeVerb_C_ReceiveTick) == 0x000004, "Wrong alignment on Comp_AkHomeVerb_C_ReceiveTick");
static_assert(sizeof(Comp_AkHomeVerb_C_ReceiveTick) == 0x000004, "Wrong size on Comp_AkHomeVerb_C_ReceiveTick");
static_assert(offsetof(Comp_AkHomeVerb_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Comp_AkHomeVerb_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

