#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Comp_RtpcTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Comp_RtpcTracker.Comp_RtpcTracker_C
// 0x0060 (0x01B0 - 0x0150)
class UComp_RtpcTracker_C final : public URtpcTrackerComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0150(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class UAkRtpc*, double>                  Rtpc_Map;                                          // 0x0158(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	bool                                          Debug;                                             // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void AudioDebugRtpc(bool On);
	void DrawDebug(const class FString& BuiltString, const TArray<class UAkRtpc*>& Keys, const TArray<double>& Values, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Set_Length_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, double CallFunc_Array_Get_Item, const TMap<class UAkRtpc*, float>& CallFunc_GetRtpcs_Rtpc_Map, const class FString& CallFunc_Conv_DoubleToString_ReturnValue, TArray<class UAkRtpc*>& CallFunc_Map_Keys_Keys, class UAkRtpc* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, class AActor* CallFunc_GetOwner_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const TMap<class UAkRtpc*, float>& CallFunc_GetRtpcs_Rtpc_Map_1, TArray<float>& CallFunc_Map_Values_Values, TArray<double>& K2Node_VariableSet_Values_ImplicitCast);
	void ExecuteUbergraph_Comp_RtpcTracker(int32 EntryPoint, EEndPlayReason K2Node_Event_EndPlayReason, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_BuildIsShipping_ReturnValue, bool K2Node_CustomEvent_On);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Comp_RtpcTracker_C">();
	}
	static class UComp_RtpcTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComp_RtpcTracker_C>();
	}
};
static_assert(alignof(UComp_RtpcTracker_C) == 0x000008, "Wrong alignment on UComp_RtpcTracker_C");
static_assert(sizeof(UComp_RtpcTracker_C) == 0x0001B0, "Wrong size on UComp_RtpcTracker_C");
static_assert(offsetof(UComp_RtpcTracker_C, UberGraphFrame) == 0x000150, "Member 'UComp_RtpcTracker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComp_RtpcTracker_C, Rtpc_Map) == 0x000158, "Member 'UComp_RtpcTracker_C::Rtpc_Map' has a wrong offset!");
static_assert(offsetof(UComp_RtpcTracker_C, Debug) == 0x0001A8, "Member 'UComp_RtpcTracker_C::Debug' has a wrong offset!");

}

