#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Comp_RtpcTracker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Comp_RtpcTracker.Comp_RtpcTracker_C.AudioDebugRtpc
// 0x0001 (0x0001 - 0x0000)
struct Comp_RtpcTracker_C_AudioDebugRtpc final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_RtpcTracker_C_AudioDebugRtpc) == 0x000001, "Wrong alignment on Comp_RtpcTracker_C_AudioDebugRtpc");
static_assert(sizeof(Comp_RtpcTracker_C_AudioDebugRtpc) == 0x000001, "Wrong size on Comp_RtpcTracker_C_AudioDebugRtpc");
static_assert(offsetof(Comp_RtpcTracker_C_AudioDebugRtpc, On) == 0x000000, "Member 'Comp_RtpcTracker_C_AudioDebugRtpc::On' has a wrong offset!");

// Function Comp_RtpcTracker.Comp_RtpcTracker_C.DrawDebug
// 0x01D0 (0x01D0 - 0x0000)
struct Comp_RtpcTracker_C_DrawDebug final
{
public:
	class FString                                 BuiltString;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class UAkRtpc*>                        Keys;                                              // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                Values;                                            // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UAkRtpc*, float>                   CallFunc_GetRtpcs_Rtpc_Map;                        // 0x0078(0x0050)()
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UAkRtpc*>                        CallFunc_Map_Keys_Keys;                            // 0x00D8(0x0010)(ReferenceParm)
	class UAkRtpc*                                CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4520[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4521[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UAkRtpc*, float>                   CallFunc_GetRtpcs_Rtpc_Map_1;                      // 0x0160(0x0050)()
	TArray<float>                                 CallFunc_Map_Values_Values;                        // 0x01B0(0x0010)(ReferenceParm)
	TArray<double>                                K2Node_VariableSet_Values_ImplicitCast;            // 0x01C0(0x0010)(ReferenceParm)
};
static_assert(alignof(Comp_RtpcTracker_C_DrawDebug) == 0x000008, "Wrong alignment on Comp_RtpcTracker_C_DrawDebug");
static_assert(sizeof(Comp_RtpcTracker_C_DrawDebug) == 0x0001D0, "Wrong size on Comp_RtpcTracker_C_DrawDebug");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, BuiltString) == 0x000000, "Member 'Comp_RtpcTracker_C_DrawDebug::BuiltString' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, Keys) == 0x000010, "Member 'Comp_RtpcTracker_C_DrawDebug::Keys' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, Values) == 0x000020, "Member 'Comp_RtpcTracker_C_DrawDebug::Values' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, Temp_int_Array_Index_Variable) == 0x000030, "Member 'Comp_RtpcTracker_C_DrawDebug::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'Comp_RtpcTracker_C_DrawDebug::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Set_Length_ReturnValue) == 0x00003C, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Array_Get_Item) == 0x000070, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_GetRtpcs_Rtpc_Map) == 0x000078, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_GetRtpcs_Rtpc_Map' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0000C8, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Map_Keys_Keys) == 0x0000D8, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_GetDisplayName_ReturnValue) == 0x0000F8, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000110, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000120, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_GetOwner_ReturnValue) == 0x000130, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000138, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000148, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_GetRtpcs_Rtpc_Map_1) == 0x000160, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_GetRtpcs_Rtpc_Map_1' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, CallFunc_Map_Values_Values) == 0x0001B0, "Member 'Comp_RtpcTracker_C_DrawDebug::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_DrawDebug, K2Node_VariableSet_Values_ImplicitCast) == 0x0001C0, "Member 'Comp_RtpcTracker_C_DrawDebug::K2Node_VariableSet_Values_ImplicitCast' has a wrong offset!");

// Function Comp_RtpcTracker.Comp_RtpcTracker_C.ExecuteUbergraph_Comp_RtpcTracker
// 0x0008 (0x0008 - 0x0000)
struct Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BuildIsShipping_ReturnValue;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker) == 0x000004, "Wrong alignment on Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker");
static_assert(sizeof(Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker) == 0x000008, "Wrong size on Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker");
static_assert(offsetof(Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker, EntryPoint) == 0x000000, "Member 'Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker::EntryPoint' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker, K2Node_Event_EndPlayReason) == 0x000004, "Member 'Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker, CallFunc_BuildIsShipping_ReturnValue) == 0x000006, "Member 'Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker::CallFunc_BuildIsShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker, K2Node_CustomEvent_On) == 0x000007, "Member 'Comp_RtpcTracker_C_ExecuteUbergraph_Comp_RtpcTracker::K2Node_CustomEvent_On' has a wrong offset!");

// Function Comp_RtpcTracker.Comp_RtpcTracker_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Comp_RtpcTracker_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_RtpcTracker_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Comp_RtpcTracker_C_ReceiveEndPlay");
static_assert(sizeof(Comp_RtpcTracker_C_ReceiveEndPlay) == 0x000001, "Wrong size on Comp_RtpcTracker_C_ReceiveEndPlay");
static_assert(offsetof(Comp_RtpcTracker_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Comp_RtpcTracker_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

