#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Comp_Listener_Padding

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_ListenerPushDirection_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Palia_structs.hpp"
#include "S6Core_structs.hpp"


namespace SDK::Params
{

// Function Comp_Listener_Padding.Comp_Listener_Padding_C.AudioDebugListener
// 0x0001 (0x0001 - 0x0000)
struct Comp_Listener_Padding_C_AudioDebugListener final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Listener_Padding_C_AudioDebugListener) == 0x000001, "Wrong alignment on Comp_Listener_Padding_C_AudioDebugListener");
static_assert(sizeof(Comp_Listener_Padding_C_AudioDebugListener) == 0x000001, "Wrong size on Comp_Listener_Padding_C_AudioDebugListener");
static_assert(offsetof(Comp_Listener_Padding_C_AudioDebugListener, On) == 0x000000, "Member 'Comp_Listener_Padding_C_AudioDebugListener::On' has a wrong offset!");

// Function Comp_Listener_Padding.Comp_Listener_Padding_C.DoesEncompassPaddingBox
// 0x01E8 (0x01E8 - 0x0000)
struct Comp_Listener_Padding_C_DoesEncompassPaddingBox final
{
public:
	class UPrimitiveComponent*                    Primitive;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          EncompassesPoints;                                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FEE[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Points;                                            // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Int;                                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Encompasses;                                       // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FEF[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FF0[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FF1[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FF2[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FF3[0x2];                                     // 0x01DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Listener_Padding_C_DoesEncompassPaddingBox) == 0x000008, "Wrong alignment on Comp_Listener_Padding_C_DoesEncompassPaddingBox");
static_assert(sizeof(Comp_Listener_Padding_C_DoesEncompassPaddingBox) == 0x0001E8, "Wrong size on Comp_Listener_Padding_C_DoesEncompassPaddingBox");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, Primitive) == 0x000000, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::Primitive' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, EncompassesPoints) == 0x000008, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::EncompassesPoints' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, Points) == 0x000010, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::Points' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, Int) == 0x000020, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::Int' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, Encompasses) == 0x000024, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::Encompasses' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, Temp_bool_True_if_break_was_hit_Variable) == 0x000025, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Not_PreBool_ReturnValue) == 0x00002C, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_MakeVector_ReturnValue_1) == 0x000058, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_MakeVector_ReturnValue_2) == 0x000078, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_MakeVector_ReturnValue_3) == 0x000090, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000A8, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B0, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_MakeVector_ReturnValue_4) == 0x0000C8, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E0, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000F8, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000110, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000128, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000140, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_MakeVector_ReturnValue_5) == 0x000158, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_MakeVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Add_VectorVector_ReturnValue_5) == 0x000170, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, K2Node_MakeArray_Array) == 0x000188, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Array_Length_ReturnValue) == 0x000198, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_Less_IntInt_ReturnValue) == 0x0001B8, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x0001C0, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x0001D8, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_BooleanAND_ReturnValue) == 0x0001DC, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0001DD, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingBox, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0001E0, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingBox::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Comp_Listener_Padding.Comp_Listener_Padding_C.DoesEncompassPaddingVolume
// 0x01C0 (0x01C0 - 0x0000)
struct Comp_Listener_Padding_C_DoesEncompassPaddingVolume final
{
public:
	class AValeriaSpatialAudioVolume*             ValSpat;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          EncompassesPoints;                                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FF4[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Points;                                            // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Int;                                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Encompasses;                                       // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FF5[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FF6[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FF7[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesEncompassPoint_ReturnValue;           // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume) == 0x000008, "Wrong alignment on Comp_Listener_Padding_C_DoesEncompassPaddingVolume");
static_assert(sizeof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume) == 0x0001C0, "Wrong size on Comp_Listener_Padding_C_DoesEncompassPaddingVolume");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, ValSpat) == 0x000000, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::ValSpat' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, EncompassesPoints) == 0x000008, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::EncompassesPoints' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, Points) == 0x000010, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::Points' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, Int) == 0x000020, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::Int' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, Encompasses) == 0x000024, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::Encompasses' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, Temp_bool_True_if_break_was_hit_Variable) == 0x000025, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Not_PreBool_ReturnValue) == 0x00002C, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_MakeVector_ReturnValue_1) == 0x000058, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_MakeVector_ReturnValue_2) == 0x000078, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_MakeVector_ReturnValue_3) == 0x000090, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000A8, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B0, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_MakeVector_ReturnValue_4) == 0x0000C8, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E0, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000F8, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000110, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000128, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000140, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_MakeVector_ReturnValue_5) == 0x000158, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_MakeVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Add_VectorVector_ReturnValue_5) == 0x000170, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, K2Node_MakeArray_Array) == 0x000188, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Array_Length_ReturnValue) == 0x000198, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_Less_IntInt_ReturnValue) == 0x0001B8, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_DoesEncompassPoint_ReturnValue) == 0x0001B9, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_DoesEncompassPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_DoesEncompassPaddingVolume, CallFunc_BooleanAND_ReturnValue) == 0x0001BA, "Member 'Comp_Listener_Padding_C_DoesEncompassPaddingVolume::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Comp_Listener_Padding.Comp_Listener_Padding_C.ExecuteUbergraph_Comp_Listener_Padding
// 0x0700 (0x0700 - 0x0000)
struct Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FF8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FF9[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FFA[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0058(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FFB[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FFC[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               Temp_byte_Variable;                                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FFD[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue_1;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FFE[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHousingPlotActor*                      K2Node_DynamicCast_AsHousing_Plot_Actor;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FFF[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4000[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               Temp_byte_Variable_1;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4001[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_1;          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4002[0x2];                                     // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetComponentTickInterval_ReturnValue;     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               K2Node_Select_Default;                             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4003[0x5];                                     // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_On;                             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4004[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x0110(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4005[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0128(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsReeling;                      // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0217(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4006[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0220(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4007[0x6];                                     // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFishingViewComponent*                  CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4008[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        K2Node_CustomEvent_csm;                            // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FCharacterStateChangeParams            K2Node_CustomEvent_params;                         // 0x0328(0x0178)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4009[0x7];                                     // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_2;          // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInHousingEditMode_ReturnValue;          // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x04BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_400A[0x5];                                     // 0x04BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_400B[0x6];                                     // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFishingViewComponent*                  K2Node_CustomEvent_FishingView;                    // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFishingMiniGameViewState              K2Node_CustomEvent_ViewState;                      // 0x04E0(0x0120)()
	class UFishingComponent*                      K2Node_CustomEvent_Source;                         // 0x0600(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0609(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            Temp_byte_Variable_2;                              // 0x060A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_400C[0x5];                                     // 0x060B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetValeriaAudioListenerPosition_OutLocation; // 0x0610(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValeriaAudioListenerPosition_OutFrontDir; // 0x0628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValeriaAudioListenerPosition_OutRightDir; // 0x0640(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFishingViewComponent* FishingView, const struct FFishingMiniGameViewState& ViewState, class UFishingComponent* Source)> K2Node_CreateDelegate_OutputDelegate;              // 0x0670(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0680(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAkRoomComponent*>               CallFunc_GetAudioRoomComponents_ReturnValue;       // 0x0698(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAkRoomComponent*                       CallFunc_Array_Get_Item_1;                         // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x06B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x06C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_400D[0x6];                                     // 0x06C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue_1;            // 0x06C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_400E[0x7];                                     // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpringArmComponent*                    K2Node_DynamicCast_AsSpring_Arm_Component;         // 0x06D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_400F[0x3];                                     // 0x06E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCharacterStateMachineComponent* Csm, const struct FCharacterStateChangeParams& Params)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x06E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SphereTraceMultiForObjects_Radius_ImplicitCast; // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding) == 0x000010, "Wrong alignment on Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding");
static_assert(sizeof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding) == 0x000700, "Wrong size on Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, EntryPoint) == 0x000000, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::EntryPoint' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, K2Node_DynamicCast_AsValeria_Character) == 0x000010, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000020, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_GetViewTarget_ReturnValue) == 0x000030, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, Temp_object_Variable) == 0x000058, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_BooleanAND_ReturnValue) == 0x000070, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_IsDedicatedServer_ReturnValue) == 0x000078, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, Temp_byte_Variable) == 0x000079, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding, CallFunc_GetViewTarget_ReturnValue_1) == 0x000080, "Member 'Comp_Listener_Padding_C_ExecuteUbergraph_Comp_Listener_Padding::CallFunc_GetViewTarget_ReturnValue_1' has a wrong offset!");
