#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Comp_VoiceSet

#include "Basic.hpp"

#include "E_VoiceEffortEvent_structs.hpp"


namespace SDK::Params
{

// Function Comp_VoiceSet.Comp_VoiceSet_C.GetVoiceEvent
// 0x0020 (0x0020 - 0x0000)
struct Comp_VoiceSet_C_GetVoiceEvent final
{
public:
	E_VoiceEffortEvent                            Effort;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42B2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Value;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CallFunc_GetVoiceEvent_Value;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_VoiceSet_C_GetVoiceEvent) == 0x000008, "Wrong alignment on Comp_VoiceSet_C_GetVoiceEvent");
static_assert(sizeof(Comp_VoiceSet_C_GetVoiceEvent) == 0x000020, "Wrong size on Comp_VoiceSet_C_GetVoiceEvent");
static_assert(offsetof(Comp_VoiceSet_C_GetVoiceEvent, Effort) == 0x000000, "Member 'Comp_VoiceSet_C_GetVoiceEvent::Effort' has a wrong offset!");
static_assert(offsetof(Comp_VoiceSet_C_GetVoiceEvent, Value) == 0x000008, "Member 'Comp_VoiceSet_C_GetVoiceEvent::Value' has a wrong offset!");
static_assert(offsetof(Comp_VoiceSet_C_GetVoiceEvent, CallFunc_GetVoiceEvent_Value) == 0x000010, "Member 'Comp_VoiceSet_C_GetVoiceEvent::CallFunc_GetVoiceEvent_Value' has a wrong offset!");
static_assert(offsetof(Comp_VoiceSet_C_GetVoiceEvent, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Comp_VoiceSet_C_GetVoiceEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

