#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Comp_Actor_Audio_Data

#include "Basic.hpp"

#include "Struct_DialogBookendConfig_structs.hpp"
#include "Palia_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.DialogueEntered
// 0x0010 (0x0010 - 0x0000)
struct Comp_Actor_Audio_Data_C_DialogueEntered final
{
public:
	class UDialogueComponent*                     Diag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      PlayerParticipant;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Actor_Audio_Data_C_DialogueEntered) == 0x000008, "Wrong alignment on Comp_Actor_Audio_Data_C_DialogueEntered");
static_assert(sizeof(Comp_Actor_Audio_Data_C_DialogueEntered) == 0x000010, "Wrong size on Comp_Actor_Audio_Data_C_DialogueEntered");
static_assert(offsetof(Comp_Actor_Audio_Data_C_DialogueEntered, Diag) == 0x000000, "Member 'Comp_Actor_Audio_Data_C_DialogueEntered::Diag' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_DialogueEntered, PlayerParticipant) == 0x000008, "Member 'Comp_Actor_Audio_Data_C_DialogueEntered::PlayerParticipant' has a wrong offset!");

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.DialogueExited
// 0x0010 (0x0010 - 0x0000)
struct Comp_Actor_Audio_Data_C_DialogueExited final
{
public:
	class UDialogueComponent*                     Diag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      PlayerParticipant;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Actor_Audio_Data_C_DialogueExited) == 0x000008, "Wrong alignment on Comp_Actor_Audio_Data_C_DialogueExited");
static_assert(sizeof(Comp_Actor_Audio_Data_C_DialogueExited) == 0x000010, "Wrong size on Comp_Actor_Audio_Data_C_DialogueExited");
static_assert(offsetof(Comp_Actor_Audio_Data_C_DialogueExited, Diag) == 0x000000, "Member 'Comp_Actor_Audio_Data_C_DialogueExited::Diag' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_DialogueExited, PlayerParticipant) == 0x000008, "Member 'Comp_Actor_Audio_Data_C_DialogueExited::PlayerParticipant' has a wrong offset!");

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.ExecuteUbergraph_Comp_Actor_Audio_Data
// 0x01C8 (0x01C8 - 0x0000)
struct Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FWeatherStateProperties& State)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_458C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_True_1;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_458D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaWeather*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_True;                           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeatherManagerIsRaining_bIsRaining;       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_458E[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeatherStateProperties                K2Node_CustomEvent_state;                          // 0x0040(0x0028)(ConstParm)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeatherManagerIsRaining_bIsRaining_1;     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_458F[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInside_IsInside;                        // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4590[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4591[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogueComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4592[0x2];                                     // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UDialogueComponent* Diag, class AValeriaCharacter* PlayerParticipant)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4593[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogueComponent*                     K2Node_CustomEvent_diag_1;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_CustomEvent_playerParticipant_1;            // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDialogueComponent* Diag, class AValeriaCharacter* PlayerParticipant)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CallFunc_GetDialogBookend_DialogEvent;             // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDialogueComponent*                     K2Node_CustomEvent_diag;                           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_CustomEvent_playerParticipant;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CallFunc_GetDialogBookend_DialogEvent_1;           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaVillagerCharacter*              CallFunc_GetVillager_ReturnValue;                  // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVillager_ReturnValue;                   // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4594[0x5];                                     // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAkCallbackType                               K2Node_CustomEvent_CallbackType_1;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4595[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        K2Node_CustomEvent_CallbackInfo_1;                 // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAkCallbackType                               K2Node_CustomEvent_CallbackType;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4596[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        K2Node_CustomEvent_CallbackInfo;                   // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_Get_Voice_Audio_Component_AkComponent;    // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Intro;                          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4597[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_CustomEvent_AkEvent;                        // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4598[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4599[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> K2Node_Select_Default;                             // 0x01B4(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventComponentCallback_ReturnValue;     // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data) == 0x000008, "Wrong alignment on Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data");
static_assert(sizeof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data) == 0x0001C8, "Wrong size on Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, EntryPoint) == 0x000000, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::EntryPoint' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_FClamp_ReturnValue_1) == 0x000020, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_True_1) == 0x000028, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_True_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000030, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_BooleanOR_ReturnValue) == 0x000038, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_True) == 0x000039, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_True' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_WeatherManagerIsRaining_bIsRaining) == 0x00003A, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_WeatherManagerIsRaining_bIsRaining' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_BooleanOR_ReturnValue_1) == 0x00003B, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_state) == 0x000040, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_state' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000068, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_WeatherManagerIsRaining_bIsRaining_1) == 0x000069, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_WeatherManagerIsRaining_bIsRaining_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_FClamp_ReturnValue_2) == 0x000078, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000080, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_FClamp_ReturnValue_3) == 0x000088, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_GetOwner_ReturnValue) == 0x000090, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000098, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_IsInside_IsInside) == 0x0000B1, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_IsInside_IsInside' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B3, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000B4, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_GetOwner_ReturnValue_1) == 0x0000B8, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_BooleanAND_ReturnValue_1) == 0x0000C0, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_GetComponentByClass_ReturnValue) == 0x0000C8, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000D1, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D4, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000E4, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_diag_1) == 0x0000E8, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_diag_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_playerParticipant_1) == 0x0000F0, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_playerParticipant_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F8, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_GetDialogBookend_DialogEvent) == 0x000108, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_GetDialogBookend_DialogEvent' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_diag) == 0x000110, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_diag' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_playerParticipant) == 0x000118, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_playerParticipant' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_GetDialogBookend_DialogEvent_1) == 0x000120, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_GetDialogBookend_DialogEvent_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_GetVillager_ReturnValue) == 0x000128, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_GetVillager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_IsValid_ReturnValue_1) == 0x000130, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000131, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_IsVillager_ReturnValue) == 0x000132, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_IsVillager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_GetOwner_ReturnValue_2) == 0x000138, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_GetOwner_ReturnValue_3) == 0x000140, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_CallbackType_1) == 0x000148, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_CallbackType_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_CallbackInfo_1) == 0x000150, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_CallbackInfo_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_CallbackType) == 0x000158, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_CallbackType' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_CallbackInfo) == 0x000160, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_CallbackInfo' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_Get_Voice_Audio_Component_AkComponent) == 0x000168, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_Get_Voice_Audio_Component_AkComponent' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_Intro) == 0x000170, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_Intro' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CustomEvent_AkEvent) == 0x000178, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CustomEvent_AkEvent' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_IsValid_ReturnValue_2) == 0x000180, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000188, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CreateDelegate_OutputDelegate_3) == 0x000190, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001A0, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, Temp_bool_Variable) == 0x0001B0, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, K2Node_Select_Default) == 0x0001B4, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data, CallFunc_AkEventComponentCallback_ReturnValue) == 0x0001C4, "Member 'Comp_Actor_Audio_Data_C_ExecuteUbergraph_Comp_Actor_Audio_Data::CallFunc_AkEventComponentCallback_ReturnValue' has a wrong offset!");

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.Get Voice Audio Component
// 0x0030 (0x0030 - 0x0000)
struct Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component final
{
public:
	class UAkComponent*                           AkComponent;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IDialogueable>         K2Node_DynamicCast_AsDialogueable;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459A[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_BPNE_GetOrCreateVoicePositionAkComponent_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component) == 0x000008, "Wrong alignment on Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component");
static_assert(sizeof(Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component) == 0x000030, "Wrong size on Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component");
static_assert(offsetof(Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component, AkComponent) == 0x000000, "Member 'Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component::AkComponent' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component, K2Node_DynamicCast_AsDialogueable) == 0x000010, "Member 'Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component::K2Node_DynamicCast_AsDialogueable' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component, CallFunc_BPNE_GetOrCreateVoicePositionAkComponent_ReturnValue) == 0x000028, "Member 'Comp_Actor_Audio_Data_C_Get_Voice_Audio_Component::CallFunc_BPNE_GetOrCreateVoicePositionAkComponent_ReturnValue' has a wrong offset!");

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.GetDialogBookend
// 0x0360 (0x0360 - 0x0000)
struct Comp_Actor_Audio_Data_C_GetDialogBookend final
{
public:
	bool                                          Intro;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogueComponent*                     Dialog;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      Player;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          DialogEvent;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDialogBookendConfig_C*                 CurrentDialogBookendConfig;                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaVillagerCharacter*              Villager;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UDialogBookendAudioSet_C*               CurrentDialogSet;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStruct_DialogBookendConfig>    Config;                                            // 0x0038(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459C[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459D[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaVillagerCharacter*              CallFunc_GetVillager_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVillager_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459E[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogBookendConfig_C*                 K2Node_DynamicCast_AsDialog_Bookend_Config;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459F[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A0[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A1[0x1];                                     // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A2[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_DialogBookendConfig            CallFunc_Array_Get_Item;                           // 0x0090(0x0140)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A3[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A4[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          CallFunc_GetRandomDialogEvent_DialogEvent;         // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A5[0x3];                                     // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A6[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_DialogBookendConfig            CallFunc_Array_Get_Item_1;                         // 0x01F8(0x0140)(HasGetValueTypeHash)
	bool                                          CallFunc_IsDialogueRequirementMetForVillagerId_ReturnValue; // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A7[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          CallFunc_GetRandomDialogEvent_DialogEvent_1;       // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDialogueRequirementMetForWorldVillager_ReturnValue; // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A8[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStruct_DialogBookendConfig>    K2Node_Select_Default;                             // 0x0350(0x0010)(ReferenceParm)
};
static_assert(alignof(Comp_Actor_Audio_Data_C_GetDialogBookend) == 0x000008, "Wrong alignment on Comp_Actor_Audio_Data_C_GetDialogBookend");
static_assert(sizeof(Comp_Actor_Audio_Data_C_GetDialogBookend) == 0x000360, "Wrong size on Comp_Actor_Audio_Data_C_GetDialogBookend");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Intro) == 0x000000, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Intro' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Dialog) == 0x000008, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Dialog' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Player) == 0x000010, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Player' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, DialogEvent) == 0x000018, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::DialogEvent' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CurrentDialogBookendConfig) == 0x000020, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CurrentDialogBookendConfig' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Villager) == 0x000028, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Villager' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CurrentDialogSet) == 0x000030, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CurrentDialogSet' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Config) == 0x000038, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Config' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_IsLocallyControlled_ReturnValue) == 0x00004C, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_GetVillager_ReturnValue) == 0x000058, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_GetVillager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_IsVillager_ReturnValue) == 0x000060, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_IsVillager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, K2Node_DynamicCast_AsDialog_Bookend_Config) == 0x000068, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::K2Node_DynamicCast_AsDialog_Bookend_Config' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Temp_bool_True_if_break_was_hit_Variable) == 0x000071, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_Not_PreBool_ReturnValue) == 0x000072, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Temp_int_Loop_Counter_Variable_1) == 0x000074, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Temp_bool_True_if_break_was_hit_Variable_1) == 0x00007C, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Temp_int_Array_Index_Variable) == 0x000080, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_Not_PreBool_ReturnValue_1) == 0x000084, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_IsValid_ReturnValue_1) == 0x000085, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_IsDedicatedServer_ReturnValue) == 0x000086, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_Array_Get_Item) == 0x000090, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_BooleanAND_ReturnValue) == 0x0001D0, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_Array_Length_ReturnValue_1) == 0x0001D4, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001D8, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_GetRandomDialogEvent_DialogEvent) == 0x0001E0, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_GetRandomDialogEvent_DialogEvent' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_BooleanAND_ReturnValue_1) == 0x0001E8, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Temp_int_Array_Index_Variable_1) == 0x0001EC, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, Temp_bool_Variable) == 0x0001F0, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_Array_Get_Item_1) == 0x0001F8, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_IsDialogueRequirementMetForVillagerId_ReturnValue) == 0x000338, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_IsDialogueRequirementMetForVillagerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_GetRandomDialogEvent_DialogEvent_1) == 0x000340, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_GetRandomDialogEvent_DialogEvent_1' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, CallFunc_IsDialogueRequirementMetForWorldVillager_ReturnValue) == 0x000348, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::CallFunc_IsDialogueRequirementMetForWorldVillager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_GetDialogBookend, K2Node_Select_Default) == 0x000350, "Member 'Comp_Actor_Audio_Data_C_GetDialogBookend::K2Node_Select_Default' has a wrong offset!");

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.HasEnteredWater
// 0x0001 (0x0001 - 0x0000)
struct Comp_Actor_Audio_Data_C_HasEnteredWater final
{
public:
	bool                                          TURR;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Actor_Audio_Data_C_HasEnteredWater) == 0x000001, "Wrong alignment on Comp_Actor_Audio_Data_C_HasEnteredWater");
static_assert(sizeof(Comp_Actor_Audio_Data_C_HasEnteredWater) == 0x000001, "Wrong size on Comp_Actor_Audio_Data_C_HasEnteredWater");
static_assert(offsetof(Comp_Actor_Audio_Data_C_HasEnteredWater, TURR) == 0x000000, "Member 'Comp_Actor_Audio_Data_C_HasEnteredWater::TURR' has a wrong offset!");

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.HasEnteredWetArea
// 0x0001 (0x0001 - 0x0000)
struct Comp_Actor_Audio_Data_C_HasEnteredWetArea final
{
public:
	bool                                          TURR;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Actor_Audio_Data_C_HasEnteredWetArea) == 0x000001, "Wrong alignment on Comp_Actor_Audio_Data_C_HasEnteredWetArea");
static_assert(sizeof(Comp_Actor_Audio_Data_C_HasEnteredWetArea) == 0x000001, "Wrong size on Comp_Actor_Audio_Data_C_HasEnteredWetArea");
static_assert(offsetof(Comp_Actor_Audio_Data_C_HasEnteredWetArea, TURR) == 0x000000, "Member 'Comp_Actor_Audio_Data_C_HasEnteredWetArea::TURR' has a wrong offset!");

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.IntroAudioFinished
// 0x0010 (0x0010 - 0x0000)
struct Comp_Actor_Audio_Data_C_IntroAudioFinished final
{
public:
	EAkCallbackType                               CallbackType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        CallbackInfo;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Actor_Audio_Data_C_IntroAudioFinished) == 0x000008, "Wrong alignment on Comp_Actor_Audio_Data_C_IntroAudioFinished");
static_assert(sizeof(Comp_Actor_Audio_Data_C_IntroAudioFinished) == 0x000010, "Wrong size on Comp_Actor_Audio_Data_C_IntroAudioFinished");
static_assert(offsetof(Comp_Actor_Audio_Data_C_IntroAudioFinished, CallbackType) == 0x000000, "Member 'Comp_Actor_Audio_Data_C_IntroAudioFinished::CallbackType' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_IntroAudioFinished, CallbackInfo) == 0x000008, "Member 'Comp_Actor_Audio_Data_C_IntroAudioFinished::CallbackInfo' has a wrong offset!");

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.OutroAudioFinished
// 0x0010 (0x0010 - 0x0000)
struct Comp_Actor_Audio_Data_C_OutroAudioFinished final
{
public:
	EAkCallbackType                               CallbackType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45AA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        CallbackInfo;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Actor_Audio_Data_C_OutroAudioFinished) == 0x000008, "Wrong alignment on Comp_Actor_Audio_Data_C_OutroAudioFinished");
static_assert(sizeof(Comp_Actor_Audio_Data_C_OutroAudioFinished) == 0x000010, "Wrong size on Comp_Actor_Audio_Data_C_OutroAudioFinished");
static_assert(offsetof(Comp_Actor_Audio_Data_C_OutroAudioFinished, CallbackType) == 0x000000, "Member 'Comp_Actor_Audio_Data_C_OutroAudioFinished::CallbackType' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_OutroAudioFinished, CallbackInfo) == 0x000008, "Member 'Comp_Actor_Audio_Data_C_OutroAudioFinished::CallbackInfo' has a wrong offset!");

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.PlayDialogBookend
// 0x0010 (0x0010 - 0x0000)
struct Comp_Actor_Audio_Data_C_PlayDialogBookend final
{
public:
	bool                                          Intro;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45AB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AkEvent;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Actor_Audio_Data_C_PlayDialogBookend) == 0x000008, "Wrong alignment on Comp_Actor_Audio_Data_C_PlayDialogBookend");
static_assert(sizeof(Comp_Actor_Audio_Data_C_PlayDialogBookend) == 0x000010, "Wrong size on Comp_Actor_Audio_Data_C_PlayDialogBookend");
static_assert(offsetof(Comp_Actor_Audio_Data_C_PlayDialogBookend, Intro) == 0x000000, "Member 'Comp_Actor_Audio_Data_C_PlayDialogBookend::Intro' has a wrong offset!");
static_assert(offsetof(Comp_Actor_Audio_Data_C_PlayDialogBookend, AkEvent) == 0x000008, "Member 'Comp_Actor_Audio_Data_C_PlayDialogBookend::AkEvent' has a wrong offset!");

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.SetDialogIntro
// 0x0001 (0x0001 - 0x0000)
struct Comp_Actor_Audio_Data_C_SetDialogIntro final
{
public:
	bool                                          Param_IsPlayingIntro;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_Actor_Audio_Data_C_SetDialogIntro) == 0x000001, "Wrong alignment on Comp_Actor_Audio_Data_C_SetDialogIntro");
static_assert(sizeof(Comp_Actor_Audio_Data_C_SetDialogIntro) == 0x000001, "Wrong size on Comp_Actor_Audio_Data_C_SetDialogIntro");
static_assert(offsetof(Comp_Actor_Audio_Data_C_SetDialogIntro, Param_IsPlayingIntro) == 0x000000, "Member 'Comp_Actor_Audio_Data_C_SetDialogIntro::Param_IsPlayingIntro' has a wrong offset!");

// Function Comp_Actor_Audio_Data.Comp_Actor_Audio_Data_C.SetDialogOutro
// 0x0001 (0x0001 - 0x0000)
struct Comp_Actor_Audio_Data_C_SetDialogOutro final
{
public:
