#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreatureAudioSet

#include "Basic.hpp"

#include "E_CreatureAudioEvents_structs.hpp"


namespace SDK::Params
{

// Function CreatureAudioSet.CreatureAudioSet_C.Get Creature Audio Event
// 0x0028 (0x0028 - 0x0000)
struct CreatureAudioSet_C_Get_Creature_Audio_Event final
{
public:
	E_CreatureAudioEvents                         Event;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41FC[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AkEvent;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41FD[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreatureAudioSet_C_Get_Creature_Audio_Event) == 0x000008, "Wrong alignment on CreatureAudioSet_C_Get_Creature_Audio_Event");
static_assert(sizeof(CreatureAudioSet_C_Get_Creature_Audio_Event) == 0x000028, "Wrong size on CreatureAudioSet_C_Get_Creature_Audio_Event");
static_assert(offsetof(CreatureAudioSet_C_Get_Creature_Audio_Event, Event) == 0x000000, "Member 'CreatureAudioSet_C_Get_Creature_Audio_Event::Event' has a wrong offset!");
static_assert(offsetof(CreatureAudioSet_C_Get_Creature_Audio_Event, AkEvent) == 0x000008, "Member 'CreatureAudioSet_C_Get_Creature_Audio_Event::AkEvent' has a wrong offset!");
static_assert(offsetof(CreatureAudioSet_C_Get_Creature_Audio_Event, Found) == 0x000010, "Member 'CreatureAudioSet_C_Get_Creature_Audio_Event::Found' has a wrong offset!");
static_assert(offsetof(CreatureAudioSet_C_Get_Creature_Audio_Event, CallFunc_Map_Find_Value) == 0x000018, "Member 'CreatureAudioSet_C_Get_Creature_Audio_Event::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CreatureAudioSet_C_Get_Creature_Audio_Event, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'CreatureAudioSet_C_Get_Creature_Audio_Event::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

