#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CV_Cinematic

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CV_Cinematic.CV_Cinematic_C.BeginOverlap
// 0x0010 (0x0010 - 0x0000)
struct CV_Cinematic_C_BeginOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CV_Cinematic_C_BeginOverlap) == 0x000008, "Wrong alignment on CV_Cinematic_C_BeginOverlap");
static_assert(sizeof(CV_Cinematic_C_BeginOverlap) == 0x000010, "Wrong size on CV_Cinematic_C_BeginOverlap");
static_assert(offsetof(CV_Cinematic_C_BeginOverlap, OverlappedActor) == 0x000000, "Member 'CV_Cinematic_C_BeginOverlap::OverlappedActor' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_BeginOverlap, OtherActor) == 0x000008, "Member 'CV_Cinematic_C_BeginOverlap::OtherActor' has a wrong offset!");

// Function CV_Cinematic.CV_Cinematic_C.BindToSequencePlayerEvents
// 0x0058 (0x0058 - 0x0000)
struct CV_Cinematic_C_BindToSequencePlayerEvents final
{
public:
	bool                                          Bind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8D[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CV_Cinematic_C_BindToSequencePlayerEvents) == 0x000008, "Wrong alignment on CV_Cinematic_C_BindToSequencePlayerEvents");
static_assert(sizeof(CV_Cinematic_C_BindToSequencePlayerEvents) == 0x000058, "Wrong size on CV_Cinematic_C_BindToSequencePlayerEvents");
static_assert(offsetof(CV_Cinematic_C_BindToSequencePlayerEvents, Bind) == 0x000000, "Member 'CV_Cinematic_C_BindToSequencePlayerEvents::Bind' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_BindToSequencePlayerEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CV_Cinematic_C_BindToSequencePlayerEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_BindToSequencePlayerEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'CV_Cinematic_C_BindToSequencePlayerEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_BindToSequencePlayerEvents, CallFunc_GetSequencePlayer_ReturnValue) == 0x000028, "Member 'CV_Cinematic_C_BindToSequencePlayerEvents::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_BindToSequencePlayerEvents, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000030, "Member 'CV_Cinematic_C_BindToSequencePlayerEvents::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_BindToSequencePlayerEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'CV_Cinematic_C_BindToSequencePlayerEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_BindToSequencePlayerEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'CV_Cinematic_C_BindToSequencePlayerEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function CV_Cinematic.CV_Cinematic_C.ExecuteUbergraph_CV_Cinematic
// 0x02C8 (0x02C8 - 0x0000)
struct CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8F[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterMoveComponent*         CallFunc_GetValeriaCharacterMovementComponent_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_1;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E90[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Cinematic_Overlay_C*               CallFunc_Create_ReturnValue_1;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_2;          // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E91[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaCharacterMoveComponent*         CallFunc_GetValeriaCharacterMovementComponent_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E92[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameInstance*                   K2Node_DynamicCast_AsValeria_Game_Instance;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E93[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameInstance*                   K2Node_DynamicCast_AsValeria_Game_Instance_1;      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E94[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x00F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E95[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OverlappedActor;                      // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_3;          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E96[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaliaScreenManager*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E97[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaliaScreenManager*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaliaScreenManager*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoadingScreenVisible_ReturnValue;       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E98[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCinematicSequenceConfig* CinConfig)> K2Node_CreateDelegate_OutputDelegate;              // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E99[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaWeather*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValEnvironmentManager*                 CallFunc_GetCurrentEnvManager_ReturnValue;         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          K2Node_CustomEvent_LevelSequence;                  // 0x0178(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(TSoftObjectPtr<class ULevelSequence> LevelSequence)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_3;                 // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_4;          // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Client_TryUnequip_ReturnValue;            // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9A[0x2];                                     // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagValue_ReturnValue;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9B[0x6];                                     // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveSequence_IsValid;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9C[0x3];                                     // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UCinematicSequenceConfig*         K2Node_CustomEvent_CinConfig;                      // 0x01F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9D[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9E[0x3];                                     // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCinematicManagerComponent*             CallFunc_GetCinematicManager_CinManager;           // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCinematicManager_isValid;              // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9F[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCinematicManagerComponent*             CallFunc_GetCinematicManager_CinManager_1;         // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCinematicManager_isValid_1;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA0[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCinematicManagerComponent*             CallFunc_GetCinematicManager_CinManager_2;         // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCinematicManager_isValid_2;            // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA1[0x3];                                     // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA2[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA3[0x2];                                     // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCurrentSubtitleText_SubtitleText;      // 0x0258(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_2;                         // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0280(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item_3;                         // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA4[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPaliaScreenState State)>      K2Node_CreateDelegate_OutputDelegate_3;            // 0x02A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPaliaScreenState                             K2Node_CustomEvent_state;                          // 0x02B0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA5[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic) == 0x000008, "Wrong alignment on CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic");
static_assert(sizeof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic) == 0x0002C8, "Wrong size on CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, EntryPoint) == 0x000000, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::EntryPoint' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetPlayerController_ReturnValue_1) == 0x000010, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_AsValeria_Character) == 0x000020, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetCSM_ReturnValue) == 0x000030, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetValeriaCharacterMovementComponent_ReturnValue) == 0x000038, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetValeriaCharacterMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetPlayerController_ReturnValue_2) == 0x000040, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Create_ReturnValue) == 0x000048, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetPlayerController_ReturnValue_3) == 0x000050, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000058, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_AsValeria_Character_1) == 0x000060, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_AsValeria_Character_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetPlayerController_ReturnValue_4) == 0x000070, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetPlayerController_ReturnValue_5) == 0x000078, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_K2_GetPawn_ReturnValue_2) == 0x000080, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_K2_GetPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Create_ReturnValue_1) == 0x000088, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_AsValeria_Character_2) == 0x000090, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_AsValeria_Character_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetValeriaCharacterMovementComponent_ReturnValue_1) == 0x0000A0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetValeriaCharacterMovementComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, Temp_int_Loop_Counter_Variable) == 0x0000A8, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Add_IntInt_ReturnValue) == 0x0000AC, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Array_Length_ReturnValue_1) == 0x0000B4, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_IsValid_ReturnValue) == 0x0000B9, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetGameInstance_ReturnValue) == 0x0000C0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_AsValeria_Game_Instance) == 0x0000C8, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_AsValeria_Game_Instance' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_bSuccess_3) == 0x0000D0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_Event_EndPlayReason) == 0x0000D1, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000D8, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_AsValeria_Game_Instance_1) == 0x0000E0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_AsValeria_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_bSuccess_4) == 0x0000E8, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, Temp_int_Array_Index_Variable) == 0x0000EC, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0000F8, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Array_Length_ReturnValue_2) == 0x000108, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_Event_OverlappedActor) == 0x000110, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_Event_OverlappedActor' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_Event_OtherActor) == 0x000118, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_AsValeria_Character_3) == 0x000120, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_AsValeria_Character_3' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_bSuccess_5) == 0x000128, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_IsLocallyControlled_ReturnValue) == 0x000129, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000130, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_AkEventGlobal_ReturnValue) == 0x000138, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000140, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000148, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_IsLoadingScreenVisible_ReturnValue) == 0x000150, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_IsLoadingScreenVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_CreateDelegate_OutputDelegate) == 0x000154, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000168, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetCurrentEnvManager_ReturnValue) == 0x000170, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetCurrentEnvManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_CustomEvent_LevelSequence) == 0x000178, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_CustomEvent_LevelSequence' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetPlayerController_ReturnValue_6) == 0x0001B0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_K2_GetPawn_ReturnValue_3) == 0x0001B8, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_K2_GetPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_AsValeria_Character_4) == 0x0001C0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_AsValeria_Character_4' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_DynamicCast_bSuccess_6) == 0x0001C8, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Client_TryUnequip_ReturnValue) == 0x0001C9, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Client_TryUnequip_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001CC, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetTagValue_ReturnValue) == 0x0001DC, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetTagValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Greater_IntInt_ReturnValue) == 0x0001E0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_IsValid_ReturnValue_1) == 0x0001E1, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetSequencePlayer_ReturnValue) == 0x0001E8, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_SetActiveSequence_IsValid) == 0x0001F0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_SetActiveSequence_IsValid' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, Temp_int_Variable) == 0x0001F4, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_CustomEvent_CinConfig) == 0x0001F8, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_CustomEvent_CinConfig' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Add_IntInt_ReturnValue_1) == 0x000200, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Array_Get_Item_1) == 0x000208, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Less_IntInt_ReturnValue_1) == 0x000210, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_Event_DeltaSeconds) == 0x000214, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetCinematicManager_CinManager) == 0x000218, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetCinematicManager_CinManager' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetCinematicManager_isValid) == 0x000220, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetCinematicManager_isValid' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetCinematicManager_CinManager_1) == 0x000228, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetCinematicManager_CinManager_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetCinematicManager_isValid_1) == 0x000230, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetCinematicManager_isValid_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetCinematicManager_CinManager_2) == 0x000238, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetCinematicManager_CinManager_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetCinematicManager_isValid_2) == 0x000240, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetCinematicManager_isValid_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, Temp_int_Loop_Counter_Variable_1) == 0x000244, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Less_IntInt_ReturnValue_2) == 0x000248, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Add_IntInt_ReturnValue_2) == 0x00024C, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_IsValid_ReturnValue_2) == 0x000250, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000251, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, Temp_int_Variable_1) == 0x000254, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetCurrentSubtitleText_SubtitleText) == 0x000258, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetCurrentSubtitleText_SubtitleText' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Add_IntInt_ReturnValue_3) == 0x000270, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, Temp_int_Array_Index_Variable_1) == 0x000274, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Array_Get_Item_2) == 0x000278, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x000280, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Array_Get_Item_3) == 0x000290, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Array_Length_ReturnValue_3) == 0x000298, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Less_IntInt_ReturnValue_3) == 0x00029C, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002A0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_CustomEvent_state) == 0x0002B0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_CustomEvent_state' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, K2Node_SwitchEnum_CmpSuccess) == 0x0002B1, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_Not_PreBool_ReturnValue) == 0x0002B2, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_BooleanAND_ReturnValue) == 0x0002B3, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_GetPlayerController_ReturnValue_7) == 0x0002B8, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_GetPlayerController_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic, CallFunc_IsValid_ReturnValue_3) == 0x0002C0, "Member 'CV_Cinematic_C_ExecuteUbergraph_CV_Cinematic::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function CV_Cinematic.CV_Cinematic_C.FastForwardToEnd
// 0x00A0 (0x00A0 - 0x0000)
struct CV_Cinematic_C_FastForwardToEnd final
{
public:
	double                                        DesiredTime;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetCurrentTime_ReturnValue;               // 0x0018(0x0010)(NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetEndTime_ReturnValue;                   // 0x0028(0x0010)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_2;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_3;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA6[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams; // 0x0060(0x0028)()
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Time_ImplicitCast;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CV_Cinematic_C_FastForwardToEnd) == 0x000008, "Wrong alignment on CV_Cinematic_C_FastForwardToEnd");
static_assert(sizeof(CV_Cinematic_C_FastForwardToEnd) == 0x0000A0, "Wrong size on CV_Cinematic_C_FastForwardToEnd");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, DesiredTime) == 0x000000, "Member 'CV_Cinematic_C_FastForwardToEnd::DesiredTime' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_GetSequencePlayer_ReturnValue) == 0x000008, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000010, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_GetCurrentTime_ReturnValue) == 0x000018, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_GetCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_GetEndTime_ReturnValue) == 0x000028, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue) == 0x000038, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1) == 0x00003C, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000040, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_GetSequencePlayer_ReturnValue_2) == 0x000048, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_GetSequencePlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_GetSequencePlayer_ReturnValue_3) == 0x000050, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_GetSequencePlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00005A, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, K2Node_MakeStruct_MovieSceneSequencePlaybackParams) == 0x000060, "Member 'CV_Cinematic_C_FastForwardToEnd::K2Node_MakeStruct_MovieSceneSequencePlaybackParams' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000088, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'CV_Cinematic_C_FastForwardToEnd::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_FastForwardToEnd, K2Node_MakeStruct_Time_ImplicitCast) == 0x000098, "Member 'CV_Cinematic_C_FastForwardToEnd::K2Node_MakeStruct_Time_ImplicitCast' has a wrong offset!");

// Function CV_Cinematic.CV_Cinematic_C.GetCinematicManager
// 0x0020 (0x0020 - 0x0000)
struct CV_Cinematic_C_GetCinematicManager final
{
public:
	class UCinematicManagerComponent*             CinManager;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA7[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCinematicManagerComponent*             CallFunc_GetCinematicsManager_CinematicsManager;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCinematicsManager_bIsValid;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CV_Cinematic_C_GetCinematicManager) == 0x000008, "Wrong alignment on CV_Cinematic_C_GetCinematicManager");
static_assert(sizeof(CV_Cinematic_C_GetCinematicManager) == 0x000020, "Wrong size on CV_Cinematic_C_GetCinematicManager");
static_assert(offsetof(CV_Cinematic_C_GetCinematicManager, CinManager) == 0x000000, "Member 'CV_Cinematic_C_GetCinematicManager::CinManager' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_GetCinematicManager, IsValid) == 0x000008, "Member 'CV_Cinematic_C_GetCinematicManager::IsValid' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_GetCinematicManager, CallFunc_GetCinematicsManager_CinematicsManager) == 0x000010, "Member 'CV_Cinematic_C_GetCinematicManager::CallFunc_GetCinematicsManager_CinematicsManager' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_GetCinematicManager, CallFunc_GetCinematicsManager_bIsValid) == 0x000018, "Member 'CV_Cinematic_C_GetCinematicManager::CallFunc_GetCinematicsManager_bIsValid' has a wrong offset!");
static_assert(offsetof(CV_Cinematic_C_GetCinematicManager, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'CV_Cinematic_C_GetCinematicManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CV_Cinematic.CV_Cinematic_C.GetCurrentSubtitleText
// 0x00A8 (0x00A8 - 0x0000)
struct CV_Cinematic_C_GetCurrentSubtitleText final
{
public:
	class FText                                   SubtitleText;                                      // 0x0000(0x0018)(Parm, OutParm)
	struct FCinematicSubtitleData                 ActiveSubtitle;                                    // 0x0018(0x0020)(Edit, BlueprintVisible)
	double                                        CurrentPlaybackTimeSeconds;                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
