#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_GenericErrorModalPayload

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_GenericErrorModalPayload.F_GenericErrorModalPayload
// 0x0098 (0x0098 - 0x0000)
struct FF_GenericErrorModalPayload final
{
public:
	class FText                                   ErrorText_5_4DB69AFC41EF7F6A096A5EB822ADD327;      // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   TitleText_7_A8D1914549F9A577FDC9F598ADAD311F;      // 0x0018(0x0018)(Edit, BlueprintVisible)
	class FText                                   ButtonText_4_43F56B32485931BA0D1F6490639C7C74;     // 0x0030(0x0018)(Edit, BlueprintVisible)
	class FText                                   SubErrorText_20_43F3123141843E5759CD35B9C95A76F2;  // 0x0048(0x0018)(Edit, BlueprintVisible)
	struct FMargin                                ErrorContainerPadding_10_0895A96B48FC01C459682C8FFA488AF9; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                ErrorTextPadding_13_53731E1340E83025468B73AFD7E23B6B; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                TitleTextPadding_14_1D16239B45F278DD3F3FDCA22E8C20A2; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        ButtonMinimumDesiredWidth_17_C02813D54CA5DE9590DA26983BFE0A3E; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_GenericErrorModalPayload) == 0x000008, "Wrong alignment on FF_GenericErrorModalPayload");
static_assert(sizeof(FF_GenericErrorModalPayload) == 0x000098, "Wrong size on FF_GenericErrorModalPayload");
static_assert(offsetof(FF_GenericErrorModalPayload, ErrorText_5_4DB69AFC41EF7F6A096A5EB822ADD327) == 0x000000, "Member 'FF_GenericErrorModalPayload::ErrorText_5_4DB69AFC41EF7F6A096A5EB822ADD327' has a wrong offset!");
static_assert(offsetof(FF_GenericErrorModalPayload, TitleText_7_A8D1914549F9A577FDC9F598ADAD311F) == 0x000018, "Member 'FF_GenericErrorModalPayload::TitleText_7_A8D1914549F9A577FDC9F598ADAD311F' has a wrong offset!");
static_assert(offsetof(FF_GenericErrorModalPayload, ButtonText_4_43F56B32485931BA0D1F6490639C7C74) == 0x000030, "Member 'FF_GenericErrorModalPayload::ButtonText_4_43F56B32485931BA0D1F6490639C7C74' has a wrong offset!");
static_assert(offsetof(FF_GenericErrorModalPayload, SubErrorText_20_43F3123141843E5759CD35B9C95A76F2) == 0x000048, "Member 'FF_GenericErrorModalPayload::SubErrorText_20_43F3123141843E5759CD35B9C95A76F2' has a wrong offset!");
static_assert(offsetof(FF_GenericErrorModalPayload, ErrorContainerPadding_10_0895A96B48FC01C459682C8FFA488AF9) == 0x000060, "Member 'FF_GenericErrorModalPayload::ErrorContainerPadding_10_0895A96B48FC01C459682C8FFA488AF9' has a wrong offset!");
static_assert(offsetof(FF_GenericErrorModalPayload, ErrorTextPadding_13_53731E1340E83025468B73AFD7E23B6B) == 0x000070, "Member 'FF_GenericErrorModalPayload::ErrorTextPadding_13_53731E1340E83025468B73AFD7E23B6B' has a wrong offset!");
static_assert(offsetof(FF_GenericErrorModalPayload, TitleTextPadding_14_1D16239B45F278DD3F3FDCA22E8C20A2) == 0x000080, "Member 'FF_GenericErrorModalPayload::TitleTextPadding_14_1D16239B45F278DD3F3FDCA22E8C20A2' has a wrong offset!");
static_assert(offsetof(FF_GenericErrorModalPayload, ButtonMinimumDesiredWidth_17_C02813D54CA5DE9590DA26983BFE0A3E) == 0x000090, "Member 'FF_GenericErrorModalPayload::ButtonMinimumDesiredWidth_17_C02813D54CA5DE9590DA26983BFE0A3E' has a wrong offset!");

}

