#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_HairMorphAlphas

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_HairMorphAlphas.F_HairMorphAlphas
// 0x0038 (0x0038 - 0x0000)
struct FF_HairMorphAlphas final
{
public:
	double                                        HairMassC_5_85ABF5544D32A411EEECDEB3723ADDA2;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairMassL_7_F34CD1ED448362DABEA3168CD2246051;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairMassR_9_5957119247DDB64A841D2AB52EBE4003;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairBangs_11_942146174A07DB4151E3DBAAD6928E82;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairChainC_18_116A93BE4E064194636712A9CA889C9F;    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairChainL_19_601ED7BD4B4A9872C77307AB854D4F67;    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairChainR_20_CCBE2B7740449222A395B6A66BDD5E5C;    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_HairMorphAlphas) == 0x000008, "Wrong alignment on FF_HairMorphAlphas");
static_assert(sizeof(FF_HairMorphAlphas) == 0x000038, "Wrong size on FF_HairMorphAlphas");
static_assert(offsetof(FF_HairMorphAlphas, HairMassC_5_85ABF5544D32A411EEECDEB3723ADDA2) == 0x000000, "Member 'FF_HairMorphAlphas::HairMassC_5_85ABF5544D32A411EEECDEB3723ADDA2' has a wrong offset!");
static_assert(offsetof(FF_HairMorphAlphas, HairMassL_7_F34CD1ED448362DABEA3168CD2246051) == 0x000008, "Member 'FF_HairMorphAlphas::HairMassL_7_F34CD1ED448362DABEA3168CD2246051' has a wrong offset!");
static_assert(offsetof(FF_HairMorphAlphas, HairMassR_9_5957119247DDB64A841D2AB52EBE4003) == 0x000010, "Member 'FF_HairMorphAlphas::HairMassR_9_5957119247DDB64A841D2AB52EBE4003' has a wrong offset!");
static_assert(offsetof(FF_HairMorphAlphas, HairBangs_11_942146174A07DB4151E3DBAAD6928E82) == 0x000018, "Member 'FF_HairMorphAlphas::HairBangs_11_942146174A07DB4151E3DBAAD6928E82' has a wrong offset!");
static_assert(offsetof(FF_HairMorphAlphas, HairChainC_18_116A93BE4E064194636712A9CA889C9F) == 0x000020, "Member 'FF_HairMorphAlphas::HairChainC_18_116A93BE4E064194636712A9CA889C9F' has a wrong offset!");
static_assert(offsetof(FF_HairMorphAlphas, HairChainL_19_601ED7BD4B4A9872C77307AB854D4F67) == 0x000028, "Member 'FF_HairMorphAlphas::HairChainL_19_601ED7BD4B4A9872C77307AB854D4F67' has a wrong offset!");
static_assert(offsetof(FF_HairMorphAlphas, HairChainR_20_CCBE2B7740449222A395B6A66BDD5E5C) == 0x000030, "Member 'FF_HairMorphAlphas::HairChainR_20_CCBE2B7740449222A395B6A66BDD5E5C' has a wrong offset!");

}

