#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_PopupSimple_Buttons_Settings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_PopupSimple_Buttons_Settings.F_PopupSimple_Buttons_Settings
// 0x0020 (0x0020 - 0x0000)
struct FF_PopupSimple_Buttons_Settings final
{
public:
	bool                                          UsePrimaryButton_4_03410D0F4EDDE15A55D06A91A070C13A; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSecondaryButton_5_DE1B51F3426F7DFE554129AD432A3703; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B94[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpacingBetweenButtons_7_73DFEFAC40AEB9855A55BE8F1B687EE8; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                ButtonsPadding_9_17BEA53B448FA23281740A97248B6A71; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FF_PopupSimple_Buttons_Settings) == 0x000008, "Wrong alignment on FF_PopupSimple_Buttons_Settings");
static_assert(sizeof(FF_PopupSimple_Buttons_Settings) == 0x000020, "Wrong size on FF_PopupSimple_Buttons_Settings");
static_assert(offsetof(FF_PopupSimple_Buttons_Settings, UsePrimaryButton_4_03410D0F4EDDE15A55D06A91A070C13A) == 0x000000, "Member 'FF_PopupSimple_Buttons_Settings::UsePrimaryButton_4_03410D0F4EDDE15A55D06A91A070C13A' has a wrong offset!");
static_assert(offsetof(FF_PopupSimple_Buttons_Settings, UseSecondaryButton_5_DE1B51F3426F7DFE554129AD432A3703) == 0x000001, "Member 'FF_PopupSimple_Buttons_Settings::UseSecondaryButton_5_DE1B51F3426F7DFE554129AD432A3703' has a wrong offset!");
static_assert(offsetof(FF_PopupSimple_Buttons_Settings, SpacingBetweenButtons_7_73DFEFAC40AEB9855A55BE8F1B687EE8) == 0x000008, "Member 'FF_PopupSimple_Buttons_Settings::SpacingBetweenButtons_7_73DFEFAC40AEB9855A55BE8F1B687EE8' has a wrong offset!");
static_assert(offsetof(FF_PopupSimple_Buttons_Settings, ButtonsPadding_9_17BEA53B448FA23281740A97248B6A71) == 0x000010, "Member 'FF_PopupSimple_Buttons_Settings::ButtonsPadding_9_17BEA53B448FA23281740A97248B6A71' has a wrong offset!");

}

