#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPerfLocCaptureProfile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FPerfLocCaptureProfile.FPerfLocCaptureProfile
// 0x0068 (0x0068 - 0x0000)
struct FFPerfLocCaptureProfile final
{
public:
	struct FVector                                Location_2_594DC101457A51E90D0D8FA4B276F44D;       // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_28_B34885404E6FFD445BA8169E747A1F00;      // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bGetInsightsfile_11_AEEB421D4C51162084DA39A7FC72CE89; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGetUEStatsFile_13_0936D2574BC600EBA3DB7093A1DCBBF3; // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C7[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ScalabilityLevel_33_A11A7B7444072001228D04B6F1AADFD7; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 InsightsSaveLocation_20_430FE57D48B537EA9DF5C2A1C33DA233; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 UEStatsSaveLocaiton_22_41F3503047CC685C7A1D6E9FBD22A907; // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ScreenshotsSaveLocaiton_26_3B4804554DDA36EFD4EE7BB15D63EB11; // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FFPerfLocCaptureProfile) == 0x000008, "Wrong alignment on FFPerfLocCaptureProfile");
static_assert(sizeof(FFPerfLocCaptureProfile) == 0x000068, "Wrong size on FFPerfLocCaptureProfile");
static_assert(offsetof(FFPerfLocCaptureProfile, Location_2_594DC101457A51E90D0D8FA4B276F44D) == 0x000000, "Member 'FFPerfLocCaptureProfile::Location_2_594DC101457A51E90D0D8FA4B276F44D' has a wrong offset!");
static_assert(offsetof(FFPerfLocCaptureProfile, Rotation_28_B34885404E6FFD445BA8169E747A1F00) == 0x000018, "Member 'FFPerfLocCaptureProfile::Rotation_28_B34885404E6FFD445BA8169E747A1F00' has a wrong offset!");
static_assert(offsetof(FFPerfLocCaptureProfile, bGetInsightsfile_11_AEEB421D4C51162084DA39A7FC72CE89) == 0x000030, "Member 'FFPerfLocCaptureProfile::bGetInsightsfile_11_AEEB421D4C51162084DA39A7FC72CE89' has a wrong offset!");
static_assert(offsetof(FFPerfLocCaptureProfile, bGetUEStatsFile_13_0936D2574BC600EBA3DB7093A1DCBBF3) == 0x000031, "Member 'FFPerfLocCaptureProfile::bGetUEStatsFile_13_0936D2574BC600EBA3DB7093A1DCBBF3' has a wrong offset!");
static_assert(offsetof(FFPerfLocCaptureProfile, ScalabilityLevel_33_A11A7B7444072001228D04B6F1AADFD7) == 0x000034, "Member 'FFPerfLocCaptureProfile::ScalabilityLevel_33_A11A7B7444072001228D04B6F1AADFD7' has a wrong offset!");
static_assert(offsetof(FFPerfLocCaptureProfile, InsightsSaveLocation_20_430FE57D48B537EA9DF5C2A1C33DA233) == 0x000038, "Member 'FFPerfLocCaptureProfile::InsightsSaveLocation_20_430FE57D48B537EA9DF5C2A1C33DA233' has a wrong offset!");
static_assert(offsetof(FFPerfLocCaptureProfile, UEStatsSaveLocaiton_22_41F3503047CC685C7A1D6E9FBD22A907) == 0x000048, "Member 'FFPerfLocCaptureProfile::UEStatsSaveLocaiton_22_41F3503047CC685C7A1D6E9FBD22A907' has a wrong offset!");
static_assert(offsetof(FFPerfLocCaptureProfile, ScreenshotsSaveLocaiton_26_3B4804554DDA36EFD4EE7BB15D63EB11) == 0x000058, "Member 'FFPerfLocCaptureProfile::ScreenshotsSaveLocaiton_26_3B4804554DDA36EFD4EE7BB15D63EB11' has a wrong offset!");

}

