#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSettingsItemSlider

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FSettingsItemSlider.FSettingsItemSlider
// 0x0028 (0x0028 - 0x0000)
struct FFSettingsItemSlider final
{
public:
	bool                                          UseDefaultNotch_5_499B696445B15E699117F78FBD649CAB; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B95[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DefaultNotchValue_13_B7A8AE744D54EE74D11630B336752107; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinSliderValue_15_A35A5B4D41C0C0B47D504F96FAE2474A; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSliderValue_16_F6E7B5BB4602748161BEA7B0BD30F5E6; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinFractionalDigits_21_90D54EAC4B504F3BB326AABC48BD6D98; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxFractionalDigits_22_4C02921C4D87BFBABD27468D10FEC8AA; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFSettingsItemSlider) == 0x000008, "Wrong alignment on FFSettingsItemSlider");
static_assert(sizeof(FFSettingsItemSlider) == 0x000028, "Wrong size on FFSettingsItemSlider");
static_assert(offsetof(FFSettingsItemSlider, UseDefaultNotch_5_499B696445B15E699117F78FBD649CAB) == 0x000000, "Member 'FFSettingsItemSlider::UseDefaultNotch_5_499B696445B15E699117F78FBD649CAB' has a wrong offset!");
static_assert(offsetof(FFSettingsItemSlider, DefaultNotchValue_13_B7A8AE744D54EE74D11630B336752107) == 0x000008, "Member 'FFSettingsItemSlider::DefaultNotchValue_13_B7A8AE744D54EE74D11630B336752107' has a wrong offset!");
static_assert(offsetof(FFSettingsItemSlider, MinSliderValue_15_A35A5B4D41C0C0B47D504F96FAE2474A) == 0x000010, "Member 'FFSettingsItemSlider::MinSliderValue_15_A35A5B4D41C0C0B47D504F96FAE2474A' has a wrong offset!");
static_assert(offsetof(FFSettingsItemSlider, MaxSliderValue_16_F6E7B5BB4602748161BEA7B0BD30F5E6) == 0x000018, "Member 'FFSettingsItemSlider::MaxSliderValue_16_F6E7B5BB4602748161BEA7B0BD30F5E6' has a wrong offset!");
static_assert(offsetof(FFSettingsItemSlider, MinFractionalDigits_21_90D54EAC4B504F3BB326AABC48BD6D98) == 0x000020, "Member 'FFSettingsItemSlider::MinFractionalDigits_21_90D54EAC4B504F3BB326AABC48BD6D98' has a wrong offset!");
static_assert(offsetof(FFSettingsItemSlider, MaxFractionalDigits_22_4C02921C4D87BFBABD27468D10FEC8AA) == 0x000024, "Member 'FFSettingsItemSlider::MaxFractionalDigits_22_4C02921C4D87BFBABD27468D10FEC8AA' has a wrong offset!");

}

