#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Cooking_OneOff_CollectAnim

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function GA_Cooking_OneOff_CollectAnim.GA_Cooking_OneOff_CollectAnim_C.ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim
// 0x01B8 (0x01B8 - 0x0000)
struct GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B7C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B7D[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrafterComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B7E[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCrafterConfig                         CallFunc_GetCrafterConfig_ReturnValue;             // 0x00D0(0x00E0)(ConstParm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim) == 0x000008, "Wrong alignment on GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim");
static_assert(sizeof(GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim) == 0x0001B8, "Wrong size on GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim");
static_assert(offsetof(GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim, EntryPoint) == 0x000000, "Member 'GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim, K2Node_Event_EventData) == 0x000008, "Member 'GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim, CallFunc_GetComponentByClass_ReturnValue) == 0x0000C0, "Member 'GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim, CallFunc_IsValid_ReturnValue_1) == 0x0000C8, "Member 'GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim, CallFunc_GetCrafterConfig_ReturnValue) == 0x0000D0, "Member 'GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim::CallFunc_GetCrafterConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001B0, "Member 'GA_Cooking_OneOff_CollectAnim_C_ExecuteUbergraph_GA_Cooking_OneOff_CollectAnim::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function GA_Cooking_OneOff_CollectAnim.GA_Cooking_OneOff_CollectAnim_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Cooking_OneOff_CollectAnim_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Cooking_OneOff_CollectAnim_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Cooking_OneOff_CollectAnim_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Cooking_OneOff_CollectAnim_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Cooking_OneOff_CollectAnim_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Cooking_OneOff_CollectAnim_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Cooking_OneOff_CollectAnim_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

