#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Cooking_OneOff_Base

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Cooking_OneOff_Base.GA_Cooking_OneOff_Base_C.CanUnlockCharacterDuringAnimation
// 0x0001 (0x0001 - 0x0000)
struct GA_Cooking_OneOff_Base_C_CanUnlockCharacterDuringAnimation final
{
public:
	bool                                          CanUnlock;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_OneOff_Base_C_CanUnlockCharacterDuringAnimation) == 0x000001, "Wrong alignment on GA_Cooking_OneOff_Base_C_CanUnlockCharacterDuringAnimation");
static_assert(sizeof(GA_Cooking_OneOff_Base_C_CanUnlockCharacterDuringAnimation) == 0x000001, "Wrong size on GA_Cooking_OneOff_Base_C_CanUnlockCharacterDuringAnimation");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_CanUnlockCharacterDuringAnimation, CanUnlock) == 0x000000, "Member 'GA_Cooking_OneOff_Base_C_CanUnlockCharacterDuringAnimation::CanUnlock' has a wrong offset!");

// Function GA_Cooking_OneOff_Base.GA_Cooking_OneOff_Base_C.ExecuteUbergraph_GA_Cooking_OneOff_Base
// 0x0128 (0x0128 - 0x0000)
struct GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C9[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43CA[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrafterComponent*                      CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43CB[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_InteractorLockParams              CallFunc_GetLockParams_VAL_InteractorLockParams;   // 0x00E0(0x0028)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43CC[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractorComponent*                   CallFunc_GetInteractorComponent_ReturnValue;       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Client_TryInteractableLockSetup_ReturnValue; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayerChangeLockWith_ReturnValue;      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base) == 0x000008, "Wrong alignment on GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base");
static_assert(sizeof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base) == 0x000128, "Wrong size on GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, EntryPoint) == 0x000000, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, K2Node_Event_EventData) == 0x000008, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_GetComponentByClass_ReturnValue) == 0x0000C0, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_IsValid_ReturnValue_1) == 0x0000C8, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_IsValid_ReturnValue_2) == 0x0000C9, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0000D0, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_IsServer_ReturnValue) == 0x0000D8, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_GetLockParams_VAL_InteractorLockParams) == 0x0000E0, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_GetLockParams_VAL_InteractorLockParams' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000108, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x000110, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_GetInteractorComponent_ReturnValue) == 0x000118, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_GetInteractorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_Client_TryInteractableLockSetup_ReturnValue) == 0x000120, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_Client_TryInteractableLockSetup_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base, CallFunc_CanPlayerChangeLockWith_ReturnValue) == 0x000121, "Member 'GA_Cooking_OneOff_Base_C_ExecuteUbergraph_GA_Cooking_OneOff_Base::CallFunc_CanPlayerChangeLockWith_ReturnValue' has a wrong offset!");

// Function GA_Cooking_OneOff_Base.GA_Cooking_OneOff_Base_C.GetLockParams
// 0x0058 (0x0058 - 0x0000)
struct GA_Cooking_OneOff_Base_C_GetLockParams final
{
public:
	struct FVAL_InteractorLockParams              VAL_InteractorLockParams;                          // 0x0000(0x0028)(Parm, OutParm, NoDestructor, ContainsInstancedReference)
	class UObject*                                CallFunc_SelectObject_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_InteractorLockParams              K2Node_MakeStruct_VAL_InteractorLockParams;        // 0x0030(0x0028)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_Cooking_OneOff_Base_C_GetLockParams) == 0x000008, "Wrong alignment on GA_Cooking_OneOff_Base_C_GetLockParams");
static_assert(sizeof(GA_Cooking_OneOff_Base_C_GetLockParams) == 0x000058, "Wrong size on GA_Cooking_OneOff_Base_C_GetLockParams");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_GetLockParams, VAL_InteractorLockParams) == 0x000000, "Member 'GA_Cooking_OneOff_Base_C_GetLockParams::VAL_InteractorLockParams' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_GetLockParams, CallFunc_SelectObject_ReturnValue) == 0x000028, "Member 'GA_Cooking_OneOff_Base_C_GetLockParams::CallFunc_SelectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_GetLockParams, K2Node_MakeStruct_VAL_InteractorLockParams) == 0x000030, "Member 'GA_Cooking_OneOff_Base_C_GetLockParams::K2Node_MakeStruct_VAL_InteractorLockParams' has a wrong offset!");

// Function GA_Cooking_OneOff_Base.GA_Cooking_OneOff_Base_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Cooking_OneOff_Base_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Cooking_OneOff_Base_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Cooking_OneOff_Base_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Cooking_OneOff_Base_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Cooking_OneOff_Base_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Cooking_OneOff_Base_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Cooking_OneOff_Base.GA_Cooking_OneOff_Base_C.SetMovementBlock
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Cooking_OneOff_Base_C_SetMovementBlock final
{
public:
	bool                                          bLock;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Changed;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43CD[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_InteractorLockParams              CallFunc_GetLockParams_VAL_InteractorLockParams;   // 0x0008(0x0028)(NoDestructor, ContainsInstancedReference)
	struct FVAL_InteractorLockParams              CallFunc_GetLockParams_VAL_InteractorLockParams_1; // 0x0030(0x0028)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityLockedIn_ReturnValue;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMovementBlock_Changed;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMovementBlock_Changed_1;               // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShuttingDown_NewParam;                  // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43CE[0x1];                                     // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractorComponent*                   CallFunc_GetInteractorComponent_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LockPlayerToInteractable_ReturnValue;     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUnlockCharacterDuringAnimation_CanUnlock; // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43CF[0x5];                                     // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractorComponent*                   CallFunc_GetInteractorComponent_ReturnValue_1;     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVAL_InteractorLockParams              CallFunc_GetLockParams_VAL_InteractorLockParams_2; // 0x0088(0x0028)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsPlayerLockedToInteractable_ReturnValue; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnLockPlayerFromInteractable_ReturnValue; // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayerChangeLockWith_ReturnValue;      // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_OneOff_Base_C_SetMovementBlock) == 0x000008, "Wrong alignment on GA_Cooking_OneOff_Base_C_SetMovementBlock");
static_assert(sizeof(GA_Cooking_OneOff_Base_C_SetMovementBlock) == 0x0000B8, "Wrong size on GA_Cooking_OneOff_Base_C_SetMovementBlock");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, bLock) == 0x000000, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::bLock' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, Changed) == 0x000001, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::Changed' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_GetLockParams_VAL_InteractorLockParams) == 0x000008, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_GetLockParams_VAL_InteractorLockParams' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_GetLockParams_VAL_InteractorLockParams_1) == 0x000030, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_GetLockParams_VAL_InteractorLockParams_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_IsServer_ReturnValue) == 0x000058, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_IsServer_ReturnValue_1) == 0x000059, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_IsAbilityLockedIn_ReturnValue) == 0x00005A, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_IsAbilityLockedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00005B, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_SetMovementBlock_Changed) == 0x00005C, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_SetMovementBlock_Changed' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_SetMovementBlock_Changed_1) == 0x00005D, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_SetMovementBlock_Changed_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_IsShuttingDown_NewParam) == 0x00005E, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_IsShuttingDown_NewParam' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x000060, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_GetInteractorComponent_ReturnValue) == 0x000068, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_GetInteractorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_LockPlayerToInteractable_ReturnValue) == 0x000070, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_LockPlayerToInteractable_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_CanUnlockCharacterDuringAnimation_CanUnlock) == 0x000071, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_CanUnlockCharacterDuringAnimation_CanUnlock' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_BooleanOR_ReturnValue) == 0x000072, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_1) == 0x000078, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_GetInteractorComponent_ReturnValue_1) == 0x000080, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_GetInteractorComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_GetLockParams_VAL_InteractorLockParams_2) == 0x000088, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_GetLockParams_VAL_InteractorLockParams_2' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_IsPlayerLockedToInteractable_ReturnValue) == 0x0000B0, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_IsPlayerLockedToInteractable_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_UnLockPlayerFromInteractable_ReturnValue) == 0x0000B1, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_UnLockPlayerFromInteractable_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_CanPlayerChangeLockWith_ReturnValue) == 0x0000B2, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_CanPlayerChangeLockWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_OneOff_Base_C_SetMovementBlock, CallFunc_BooleanAND_ReturnValue) == 0x0000B3, "Member 'GA_Cooking_OneOff_Base_C_SetMovementBlock::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

