#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Cooking_Minigame_Base

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.Callback_SuccessfulInputReceived
// 0x0018 (0x0018 - 0x0000)
struct GA_Cooking_Minigame_Base_C_Callback_SuccessfulInputReceived final
{
public:
	class UMinigameComponentMasterQTE*            Comp;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_Callback_SuccessfulInputReceived) == 0x000008, "Wrong alignment on GA_Cooking_Minigame_Base_C_Callback_SuccessfulInputReceived");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_Callback_SuccessfulInputReceived) == 0x000018, "Wrong size on GA_Cooking_Minigame_Base_C_Callback_SuccessfulInputReceived");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_Callback_SuccessfulInputReceived, Comp) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_Callback_SuccessfulInputReceived::Comp' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_Callback_SuccessfulInputReceived, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Cooking_Minigame_Base_C_Callback_SuccessfulInputReceived::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_Callback_SuccessfulInputReceived, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'GA_Cooking_Minigame_Base_C_Callback_SuccessfulInputReceived::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.CanPlayMontage
// 0x0005 (0x0005 - 0x0000)
struct GA_Cooking_Minigame_Base_C_CanPlayMontage final
{
public:
	bool                                          Param_CanPlayMontage;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShuttingDown_NewParam;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_CanPlayMontage) == 0x000001, "Wrong alignment on GA_Cooking_Minigame_Base_C_CanPlayMontage");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_CanPlayMontage) == 0x000005, "Wrong size on GA_Cooking_Minigame_Base_C_CanPlayMontage");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanPlayMontage, Param_CanPlayMontage) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_CanPlayMontage::Param_CanPlayMontage' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanPlayMontage, CallFunc_IsShuttingDown_NewParam) == 0x000001, "Member 'GA_Cooking_Minigame_Base_C_CanPlayMontage::CallFunc_IsShuttingDown_NewParam' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanPlayMontage, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'GA_Cooking_Minigame_Base_C_CanPlayMontage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanPlayMontage, CallFunc_Not_PreBool_ReturnValue_1) == 0x000003, "Member 'GA_Cooking_Minigame_Base_C_CanPlayMontage::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanPlayMontage, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'GA_Cooking_Minigame_Base_C_CanPlayMontage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.CanPlayMontageDuringMinigame
// 0x0018 (0x0018 - 0x0000)
struct GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame final
{
public:
	bool                                          CanPlayPenaltyMontage;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayMontage_CanPlayMontage;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4409[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame) == 0x000008, "Wrong alignment on GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame) == 0x000018, "Wrong size on GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame, CanPlayPenaltyMontage) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame::CanPlayPenaltyMontage' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame, CallFunc_CanPlayMontage_CanPlayMontage) == 0x000001, "Member 'GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame::CallFunc_CanPlayMontage_CanPlayMontage' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame, CallFunc_IsPlaying_ReturnValue) == 0x000010, "Member 'GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'GA_Cooking_Minigame_Base_C_CanPlayMontageDuringMinigame::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.CanUnlockCharacterDuringAnimation
// 0x0003 (0x0003 - 0x0000)
struct GA_Cooking_Minigame_Base_C_CanUnlockCharacterDuringAnimation final
{
public:
	bool                                          CanUnlock;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUnlockCharacterDuringAnimation_CanUnlock; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_CanUnlockCharacterDuringAnimation) == 0x000001, "Wrong alignment on GA_Cooking_Minigame_Base_C_CanUnlockCharacterDuringAnimation");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_CanUnlockCharacterDuringAnimation) == 0x000003, "Wrong size on GA_Cooking_Minigame_Base_C_CanUnlockCharacterDuringAnimation");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanUnlockCharacterDuringAnimation, CanUnlock) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_CanUnlockCharacterDuringAnimation::CanUnlock' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanUnlockCharacterDuringAnimation, CallFunc_CanUnlockCharacterDuringAnimation_CanUnlock) == 0x000001, "Member 'GA_Cooking_Minigame_Base_C_CanUnlockCharacterDuringAnimation::CallFunc_CanUnlockCharacterDuringAnimation_CanUnlock' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_CanUnlockCharacterDuringAnimation, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'GA_Cooking_Minigame_Base_C_CanUnlockCharacterDuringAnimation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.ExecuteUbergraph_GA_Cooking_Minigame_Base
// 0x0028 (0x0028 - 0x0000)
struct GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShuttingDown_NewParam;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_440A[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetMontageCurrentSectionName_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShuttingDown_NewParam_1;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base) == 0x000008, "Wrong alignment on GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base) == 0x000028, "Wrong size on GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, EntryPoint) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, CallFunc_IsShuttingDown_NewParam) == 0x000004, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::CallFunc_IsShuttingDown_NewParam' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, CallFunc_Not_PreBool_ReturnValue_1) == 0x000006, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, CallFunc_GetCurrentMontage_ReturnValue) == 0x000010, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, CallFunc_GetMontageCurrentSectionName_ReturnValue) == 0x000018, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::CallFunc_GetMontageCurrentSectionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, CallFunc_IsShuttingDown_NewParam_1) == 0x000020, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::CallFunc_IsShuttingDown_NewParam_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000021, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, CallFunc_Not_PreBool_ReturnValue_2) == 0x000022, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base, CallFunc_BooleanAND_ReturnValue_1) == 0x000024, "Member 'GA_Cooking_Minigame_Base_C_ExecuteUbergraph_GA_Cooking_Minigame_Base::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.HandleEvent
// 0x00D0 (0x00D0 - 0x0000)
struct GA_Cooking_Minigame_Base_C_HandleEvent final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_440B[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_HandleEvent) == 0x000008, "Wrong alignment on GA_Cooking_Minigame_Base_C_HandleEvent");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_HandleEvent) == 0x0000D0, "Wrong size on GA_Cooking_Minigame_Base_C_HandleEvent");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleEvent, EventTag) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_HandleEvent::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleEvent, EventData) == 0x000008, "Member 'GA_Cooking_Minigame_Base_C_HandleEvent::EventData' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleEvent, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0000B8, "Member 'GA_Cooking_Minigame_Base_C_HandleEvent::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleEvent, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_Cooking_Minigame_Base_C_HandleEvent::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleEvent, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'GA_Cooking_Minigame_Base_C_HandleEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.HandleMovementBlockChanged
// 0x0260 (0x0260 - 0x0000)
struct GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged final
{
public:
	bool                                          Param_MovementBlocked;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_440C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_440D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRecipeConfig                          CallFunc_GetRecipeConfig_ReturnValue;              // 0x0018(0x0240)(ConstParm)
	bool                                          CallFunc_Server_Collect_ReturnValue;               // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrafterState                                 CallFunc_GetCrafterState_ReturnValue;              // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x025E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged) == 0x000008, "Wrong alignment on GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged) == 0x000260, "Wrong size on GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged, Param_MovementBlocked) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged::Param_MovementBlocked' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged, CallFunc_IsServer_ReturnValue) == 0x000010, "Member 'GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged, CallFunc_GetRecipeConfig_ReturnValue) == 0x000018, "Member 'GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged::CallFunc_GetRecipeConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged, CallFunc_Server_Collect_ReturnValue) == 0x000258, "Member 'GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged::CallFunc_Server_Collect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged, CallFunc_GetCrafterState_ReturnValue) == 0x000259, "Member 'GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged::CallFunc_GetCrafterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged, CallFunc_IsValid_ReturnValue) == 0x00025A, "Member 'GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00025B, "Member 'GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged, CallFunc_BooleanAND_ReturnValue) == 0x00025C, "Member 'GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged, CallFunc_BooleanAND_ReturnValue_1) == 0x00025D, "Member 'GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged, CallFunc_BooleanAND_ReturnValue_2) == 0x00025E, "Member 'GA_Cooking_Minigame_Base_C_HandleMovementBlockChanged::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.Minigame OnStateChanged
// 0x0010 (0x0010 - 0x0000)
struct GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged final
{
public:
	class UMinigameComponentBase*                 Comp;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EMinigameState                                PrevState;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMinigameState                                NewState;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayMontage_CanPlayMontage;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayMontageDuringMinigame_CanPlayPenaltyMontage; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged) == 0x000008, "Wrong alignment on GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged) == 0x000010, "Wrong size on GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged, Comp) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged::Comp' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged, PrevState) == 0x000008, "Member 'GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged::PrevState' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged, NewState) == 0x000009, "Member 'GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged, CallFunc_CanPlayMontage_CanPlayMontage) == 0x00000A, "Member 'GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged::CallFunc_CanPlayMontage_CanPlayMontage' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged, K2Node_SwitchEnum_CmpSuccess) == 0x00000B, "Member 'GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged, CallFunc_CanPlayMontageDuringMinigame_CanPlayPenaltyMontage) == 0x00000C, "Member 'GA_Cooking_Minigame_Base_C_Minigame_OnStateChanged::CallFunc_CanPlayMontageDuringMinigame_CanPlayPenaltyMontage' has a wrong offset!");

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.OnAbilityEnd
// 0x0028 (0x0028 - 0x0000)
struct GA_Cooking_Minigame_Base_C_OnAbilityEnd final
{
public:
	TDelegate<void(class UMinigameComponentMasterQTE* Comp)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMinigameComponentBase* Comp, EMinigameState PrevState, EMinigameState NewState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_OnAbilityEnd) == 0x000008, "Wrong alignment on GA_Cooking_Minigame_Base_C_OnAbilityEnd");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_OnAbilityEnd) == 0x000028, "Wrong size on GA_Cooking_Minigame_Base_C_OnAbilityEnd");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_OnAbilityEnd, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_OnAbilityEnd::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_OnAbilityEnd, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'GA_Cooking_Minigame_Base_C_OnAbilityEnd::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_OnAbilityEnd, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x000020, "Member 'GA_Cooking_Minigame_Base_C_OnAbilityEnd::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.OnAbilityStart
// 0x0038 (0x0038 - 0x0000)
struct GA_Cooking_Minigame_Base_C_OnAbilityStart final
{
public:
	TDelegate<void(bool MovementBlocked)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMinigameComponentMasterQTE* Comp)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMinigameComponentBase* Comp, EMinigameState PrevState, EMinigameState NewState)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_OnAbilityStart) == 0x000008, "Wrong alignment on GA_Cooking_Minigame_Base_C_OnAbilityStart");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_OnAbilityStart) == 0x000038, "Wrong size on GA_Cooking_Minigame_Base_C_OnAbilityStart");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_OnAbilityStart, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_OnAbilityStart::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_OnAbilityStart, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'GA_Cooking_Minigame_Base_C_OnAbilityStart::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_OnAbilityStart, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'GA_Cooking_Minigame_Base_C_OnAbilityStart::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_OnAbilityStart, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x000030, "Member 'GA_Cooking_Minigame_Base_C_OnAbilityStart::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.PlayMontage
// 0x0018 (0x0018 - 0x0000)
struct GA_Cooking_Minigame_Base_C_PlayMontage final
{
public:
	class FName                                   Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Param_MontageSection;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndAbilityWhenFinished;                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Force__Used_by_child_outro_;                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_PlayMontage) == 0x000004, "Wrong alignment on GA_Cooking_Minigame_Base_C_PlayMontage");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_PlayMontage) == 0x000018, "Wrong size on GA_Cooking_Minigame_Base_C_PlayMontage");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_PlayMontage, Montage) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_PlayMontage::Montage' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_PlayMontage, Param_MontageSection) == 0x000008, "Member 'GA_Cooking_Minigame_Base_C_PlayMontage::Param_MontageSection' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_PlayMontage, EndAbilityWhenFinished) == 0x000010, "Member 'GA_Cooking_Minigame_Base_C_PlayMontage::EndAbilityWhenFinished' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_PlayMontage, Force__Used_by_child_outro_) == 0x000011, "Member 'GA_Cooking_Minigame_Base_C_PlayMontage::Force__Used_by_child_outro_' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_PlayMontage, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'GA_Cooking_Minigame_Base_C_PlayMontage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_PlayMontage, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'GA_Cooking_Minigame_Base_C_PlayMontage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_PlayMontage, CallFunc_BooleanOR_ReturnValue) == 0x000014, "Member 'GA_Cooking_Minigame_Base_C_PlayMontage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_Cooking_Minigame_Base.GA_Cooking_Minigame_Base_C.SetMovementBlock
// 0x0010 (0x0010 - 0x0000)
struct GA_Cooking_Minigame_Base_C_SetMovementBlock final
{
public:
	bool                                          bLock;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Changed;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMovementBlock_Changed;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_440E[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Cooking_Minigame_Base_C_SetMovementBlock) == 0x000008, "Wrong alignment on GA_Cooking_Minigame_Base_C_SetMovementBlock");
static_assert(sizeof(GA_Cooking_Minigame_Base_C_SetMovementBlock) == 0x000010, "Wrong size on GA_Cooking_Minigame_Base_C_SetMovementBlock");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_SetMovementBlock, bLock) == 0x000000, "Member 'GA_Cooking_Minigame_Base_C_SetMovementBlock::bLock' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_SetMovementBlock, Changed) == 0x000001, "Member 'GA_Cooking_Minigame_Base_C_SetMovementBlock::Changed' has a wrong offset!");
static_assert(offsetof(GA_Cooking_Minigame_Base_C_SetMovementBlock, CallFunc_SetMovementBlock_Changed) == 0x000002, "Member 'GA_Cooking_Minigame_Base_C_SetMovementBlock::CallFunc_SetMovementBlock_Changed' has a wrong offset!");
