#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DecorInteraction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_DecorInteraction.GA_DecorInteraction_C.BindEnforcedRules
// 0x0030 (0x0030 - 0x0000)
struct GA_DecorInteraction_C_BindEnforcedRules final
{
public:
	class UValeriaCharacterMoveComponent*         Move;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector& Location, const struct FRotator& Rotation)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector& Location, const struct FRotator& Rotation)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterMoveComponent*         CallFunc_GetMovement_Movement;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DecorInteraction_C_BindEnforcedRules) == 0x000008, "Wrong alignment on GA_DecorInteraction_C_BindEnforcedRules");
static_assert(sizeof(GA_DecorInteraction_C_BindEnforcedRules) == 0x000030, "Wrong size on GA_DecorInteraction_C_BindEnforcedRules");
static_assert(offsetof(GA_DecorInteraction_C_BindEnforcedRules, Move) == 0x000000, "Member 'GA_DecorInteraction_C_BindEnforcedRules::Move' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_BindEnforcedRules, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_DecorInteraction_C_BindEnforcedRules::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_BindEnforcedRules, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'GA_DecorInteraction_C_BindEnforcedRules::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_BindEnforcedRules, CallFunc_GetMovement_Movement) == 0x000028, "Member 'GA_DecorInteraction_C_BindEnforcedRules::CallFunc_GetMovement_Movement' has a wrong offset!");

// Function GA_DecorInteraction.GA_DecorInteraction_C.EnforcedEnded
// 0x0030 (0x0030 - 0x0000)
struct GA_DecorInteraction_C_EnforcedEnded final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_DecorInteraction_C_EnforcedEnded) == 0x000008, "Wrong alignment on GA_DecorInteraction_C_EnforcedEnded");
static_assert(sizeof(GA_DecorInteraction_C_EnforcedEnded) == 0x000030, "Wrong size on GA_DecorInteraction_C_EnforcedEnded");
static_assert(offsetof(GA_DecorInteraction_C_EnforcedEnded, Location) == 0x000000, "Member 'GA_DecorInteraction_C_EnforcedEnded::Location' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_EnforcedEnded, Rotation) == 0x000018, "Member 'GA_DecorInteraction_C_EnforcedEnded::Rotation' has a wrong offset!");

// Function GA_DecorInteraction.GA_DecorInteraction_C.EnforcedStarted
// 0x0030 (0x0030 - 0x0000)
struct GA_DecorInteraction_C_EnforcedStarted final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_DecorInteraction_C_EnforcedStarted) == 0x000008, "Wrong alignment on GA_DecorInteraction_C_EnforcedStarted");
static_assert(sizeof(GA_DecorInteraction_C_EnforcedStarted) == 0x000030, "Wrong size on GA_DecorInteraction_C_EnforcedStarted");
static_assert(offsetof(GA_DecorInteraction_C_EnforcedStarted, Location) == 0x000000, "Member 'GA_DecorInteraction_C_EnforcedStarted::Location' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_EnforcedStarted, Rotation) == 0x000018, "Member 'GA_DecorInteraction_C_EnforcedStarted::Rotation' has a wrong offset!");

// Function GA_DecorInteraction.GA_DecorInteraction_C.ExecuteUbergraph_GA_DecorInteraction
// 0x0390 (0x0390 - 0x0000)
struct GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4247[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterTeleportComponent*     CallFunc_GetTeleportComponent_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4248[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0060(0x00B0)(ConstParm)
	struct FTransform                             CallFunc_GetTargetDataEndPointTransform_ReturnValue; // 0x0110(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TargetDataHasEndPoint_ReturnValue;        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4249[0xF];                                     // 0x0171(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTargetDataOrigin_ReturnValue;          // 0x0180(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TargetDataHasOrigin_ReturnValue;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424A[0x5];                                     // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_1; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_2; // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue;                 // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UValeriaGASComponent*                   CallFunc_GetGAS_ReturnValue;                       // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Client_TryUnequip_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424B[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGASComponent*                   CallFunc_GetGAS_ReturnValue_1;                     // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_3; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424C[0x3];                                     // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0224(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0234(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0254(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0264(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0274(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424D[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0290(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetMappingNameByAbility_Mapping_Name;     // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FNameIsNone_ReturnValue;                  // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424E[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TaskProxy_PlayMontageAndWait*      CallFunc_PlayMontageByMappingAndWait_ReturnValue;  // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424F[0x6];                                     // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location_1;                     // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation_1;                     // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVAL_TaskProxy_PlayMontageAndWait*      CallFunc_PlayMontageByMappingAndWait_ReturnValue_1; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4250[0x3];                                     // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x032C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4251[0x3];                                     // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_4; // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterTeleportComponent*     CallFunc_GetTeleportComponent_ReturnValue_1;       // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bTeleportResult)>         K2Node_CreateDelegate_OutputDelegate_12;           // 0x0350(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bTeleportResult)>         K2Node_CreateDelegate_OutputDelegate_13;           // 0x0360(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bTeleportResult;                // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4252[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_DecorInteractSpeed_ImplicitCast; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction) == 0x000010, "Wrong alignment on GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction");
static_assert(sizeof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction) == 0x000390, "Wrong size on GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, EntryPoint) == 0x000000, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetTeleportComponent_ReturnValue) == 0x000010, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetTeleportComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, Temp_bool_Has_Been_Initd_Variable) == 0x000058, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000059, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, Temp_bool_IsClosed_Variable) == 0x00005A, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_Event_bWasCancelled) == 0x00005B, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_Event_EventData) == 0x000060, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetTargetDataEndPointTransform_ReturnValue) == 0x000110, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetTargetDataEndPointTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_TargetDataHasEndPoint_ReturnValue) == 0x000170, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_TargetDataHasEndPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetTargetDataOrigin_ReturnValue) == 0x000180, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetTargetDataOrigin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_TargetDataHasOrigin_ReturnValue) == 0x0001E0, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_TargetDataHasOrigin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_BooleanAND_ReturnValue) == 0x0001E1, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_K2_CommitAbility_ReturnValue) == 0x0001E2, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_1) == 0x0001E8, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_2) == 0x0001F0, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetEquipment_ReturnValue) == 0x0001F8, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetGAS_ReturnValue) == 0x000200, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetGAS_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_Client_TryUnequip_ReturnValue) == 0x000208, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_Client_TryUnequip_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetGAS_ReturnValue_1) == 0x000210, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetGAS_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_3) == 0x000218, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_IsLocallyControlled_ReturnValue) == 0x000220, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_4) == 0x000224, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_5) == 0x000234, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_6) == 0x000244, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_7) == 0x000254, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_8) == 0x000264, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_9) == 0x000274, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000288, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_10) == 0x000290, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetMappingNameByAbility_Mapping_Name) == 0x0002A0, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetMappingNameByAbility_Mapping_Name' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_FNameIsNone_ReturnValue) == 0x0002A8, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_FNameIsNone_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_PlayMontageByMappingAndWait_ReturnValue) == 0x0002B0, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_PlayMontageByMappingAndWait_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_IsValid_ReturnValue) == 0x0002B8, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_K2_HasAuthority_ReturnValue) == 0x0002B9, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CustomEvent_Location_1) == 0x0002C0, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CustomEvent_Location_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CustomEvent_Rotation_1) == 0x0002D8, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CustomEvent_Rotation_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CustomEvent_Location) == 0x0002F0, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CustomEvent_Rotation) == 0x000308, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_PlayMontageByMappingAndWait_ReturnValue_1) == 0x000320, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_PlayMontageByMappingAndWait_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_IsValid_ReturnValue_1) == 0x000328, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_11) == 0x00032C, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_K2_HasAuthority_ReturnValue_1) == 0x00033C, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_K2_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_4) == 0x000340, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_GetTeleportComponent_ReturnValue_1) == 0x000348, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_GetTeleportComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_12) == 0x000350, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CreateDelegate_OutputDelegate_13) == 0x000360, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_CustomEvent_bTeleportResult) == 0x000370, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_CustomEvent_bTeleportResult' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, K2Node_VariableSet_DecorInteractSpeed_ImplicitCast) == 0x000378, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::K2Node_VariableSet_DecorInteractSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction, CallFunc_Delay_Duration_ImplicitCast) == 0x000380, "Member 'GA_DecorInteraction_C_ExecuteUbergraph_GA_DecorInteraction::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function GA_DecorInteraction.GA_DecorInteraction_C.GetMovement
// 0x0018 (0x0018 - 0x0000)
struct GA_DecorInteraction_C_GetMovement final
{
public:
	class UValeriaCharacterMoveComponent*         Movement;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterMoveComponent*         CallFunc_GetValeriaCharacterMovementComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DecorInteraction_C_GetMovement) == 0x000008, "Wrong alignment on GA_DecorInteraction_C_GetMovement");
static_assert(sizeof(GA_DecorInteraction_C_GetMovement) == 0x000018, "Wrong size on GA_DecorInteraction_C_GetMovement");
static_assert(offsetof(GA_DecorInteraction_C_GetMovement, Movement) == 0x000000, "Member 'GA_DecorInteraction_C_GetMovement::Movement' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_GetMovement, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_DecorInteraction_C_GetMovement::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_GetMovement, CallFunc_GetValeriaCharacterMovementComponent_ReturnValue) == 0x000010, "Member 'GA_DecorInteraction_C_GetMovement::CallFunc_GetValeriaCharacterMovementComponent_ReturnValue' has a wrong offset!");

// Function GA_DecorInteraction.GA_DecorInteraction_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_DecorInteraction_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_DecorInteraction_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_DecorInteraction_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_DecorInteraction_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_DecorInteraction_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_DecorInteraction_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_DecorInteraction_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_DecorInteraction.GA_DecorInteraction_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_DecorInteraction_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DecorInteraction_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_DecorInteraction_C_K2_OnEndAbility");
static_assert(sizeof(GA_DecorInteraction_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_DecorInteraction_C_K2_OnEndAbility");
static_assert(offsetof(GA_DecorInteraction_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_DecorInteraction_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_DecorInteraction.GA_DecorInteraction_C.MoveIntoPosition
// 0x0068 (0x0068 - 0x0000)
struct GA_DecorInteraction_C_MoveIntoPosition final
{
public:
	class UValeriaCharacterMoveComponent*         MoveComp;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4253[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaCharacterMoveComponent*         CallFunc_GetMovement_Movement;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Server_AddSpeedScalarModifier_inSpeedScalarModifier_ImplicitCast; // 0x0060(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DecorInteraction_C_MoveIntoPosition) == 0x000008, "Wrong alignment on GA_DecorInteraction_C_MoveIntoPosition");
static_assert(sizeof(GA_DecorInteraction_C_MoveIntoPosition) == 0x000068, "Wrong size on GA_DecorInteraction_C_MoveIntoPosition");
static_assert(offsetof(GA_DecorInteraction_C_MoveIntoPosition, MoveComp) == 0x000000, "Member 'GA_DecorInteraction_C_MoveIntoPosition::MoveComp' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveIntoPosition, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'GA_DecorInteraction_C_MoveIntoPosition::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveIntoPosition, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000009, "Member 'GA_DecorInteraction_C_MoveIntoPosition::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveIntoPosition, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'GA_DecorInteraction_C_MoveIntoPosition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveIntoPosition, CallFunc_GetMovement_Movement) == 0x000010, "Member 'GA_DecorInteraction_C_MoveIntoPosition::CallFunc_GetMovement_Movement' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveIntoPosition, CallFunc_BreakTransform_Location) == 0x000018, "Member 'GA_DecorInteraction_C_MoveIntoPosition::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveIntoPosition, CallFunc_BreakTransform_Rotation) == 0x000030, "Member 'GA_DecorInteraction_C_MoveIntoPosition::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveIntoPosition, CallFunc_BreakTransform_Scale) == 0x000048, "Member 'GA_DecorInteraction_C_MoveIntoPosition::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveIntoPosition, CallFunc_Server_AddSpeedScalarModifier_inSpeedScalarModifier_ImplicitCast) == 0x000060, "Member 'GA_DecorInteraction_C_MoveIntoPosition::CallFunc_Server_AddSpeedScalarModifier_inSpeedScalarModifier_ImplicitCast' has a wrong offset!");

// Function GA_DecorInteraction.GA_DecorInteraction_C.MoveOutOfPosition
// 0x0118 (0x0118 - 0x0000)
struct GA_DecorInteraction_C_MoveOutOfPosition final
{
public:
	class UValeriaCharacterMoveComponent*         MoveComp;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterMoveComponent*         CallFunc_GetMovement_Movement;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_DecorInteraction_C_MoveOutOfPosition) == 0x000008, "Wrong alignment on GA_DecorInteraction_C_MoveOutOfPosition");
static_assert(sizeof(GA_DecorInteraction_C_MoveOutOfPosition) == 0x000118, "Wrong size on GA_DecorInteraction_C_MoveOutOfPosition");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, MoveComp) == 0x000000, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::MoveComp' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakTransform_Location) == 0x000008, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakTransform_Rotation) == 0x000020, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakTransform_Scale) == 0x000038, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakTransform_Location_1) == 0x000050, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakTransform_Rotation_1) == 0x000068, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakTransform_Scale_1) == 0x000080, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakVector_X) == 0x000098, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakVector_Y) == 0x0000A0, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakVector_X_1) == 0x0000B0, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakVector_Y_1) == 0x0000B8, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_BreakVector_Z_1) == 0x0000C0, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_GetMovement_Movement) == 0x0000C8, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_GetMovement_Movement' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_MakeVector_ReturnValue_1) == 0x0000E8, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_MoveOutOfPosition, CallFunc_FindLookAtRotation_ReturnValue) == 0x000100, "Member 'GA_DecorInteraction_C_MoveOutOfPosition::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");

// Function GA_DecorInteraction.GA_DecorInteraction_C.StopPositionEnforcement
// 0x0010 (0x0010 - 0x0000)
struct GA_DecorInteraction_C_StopPositionEnforcement final
{
public:
	class UValeriaCharacterMoveComponent*         MoveComp;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterMoveComponent*         CallFunc_GetMovement_Movement;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DecorInteraction_C_StopPositionEnforcement) == 0x000008, "Wrong alignment on GA_DecorInteraction_C_StopPositionEnforcement");
static_assert(sizeof(GA_DecorInteraction_C_StopPositionEnforcement) == 0x000010, "Wrong size on GA_DecorInteraction_C_StopPositionEnforcement");
static_assert(offsetof(GA_DecorInteraction_C_StopPositionEnforcement, MoveComp) == 0x000000, "Member 'GA_DecorInteraction_C_StopPositionEnforcement::MoveComp' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_StopPositionEnforcement, CallFunc_GetMovement_Movement) == 0x000008, "Member 'GA_DecorInteraction_C_StopPositionEnforcement::CallFunc_GetMovement_Movement' has a wrong offset!");

// Function GA_DecorInteraction.GA_DecorInteraction_C.TeleportResult
// 0x0001 (0x0001 - 0x0000)
struct GA_DecorInteraction_C_TeleportResult final
{
public:
	bool                                          bTeleportResult;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DecorInteraction_C_TeleportResult) == 0x000001, "Wrong alignment on GA_DecorInteraction_C_TeleportResult");
static_assert(sizeof(GA_DecorInteraction_C_TeleportResult) == 0x000001, "Wrong size on GA_DecorInteraction_C_TeleportResult");
static_assert(offsetof(GA_DecorInteraction_C_TeleportResult, bTeleportResult) == 0x000000, "Member 'GA_DecorInteraction_C_TeleportResult::bTeleportResult' has a wrong offset!");

// Function GA_DecorInteraction.GA_DecorInteraction_C.UnbindEnforcedRules
// 0x0030 (0x0030 - 0x0000)
struct GA_DecorInteraction_C_UnbindEnforcedRules final
{
public:
	class UValeriaCharacterMoveComponent*         Move;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector& Location, const struct FRotator& Rotation)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector& Location, const struct FRotator& Rotation)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterMoveComponent*         CallFunc_GetMovement_Movement;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DecorInteraction_C_UnbindEnforcedRules) == 0x000008, "Wrong alignment on GA_DecorInteraction_C_UnbindEnforcedRules");
static_assert(sizeof(GA_DecorInteraction_C_UnbindEnforcedRules) == 0x000030, "Wrong size on GA_DecorInteraction_C_UnbindEnforcedRules");
static_assert(offsetof(GA_DecorInteraction_C_UnbindEnforcedRules, Move) == 0x000000, "Member 'GA_DecorInteraction_C_UnbindEnforcedRules::Move' has a wrong offset!");
static_assert(offsetof(GA_DecorInteraction_C_UnbindEnforcedRules, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_DecorInteraction_C_UnbindEnforcedRules::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
