#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gardening_Harvest

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Gardening_Harvest.GA_Gardening_Harvest_C.ExecuteUbergraph_GA_Gardening_Harvest
// 0x0160 (0x0160 - 0x0000)
struct GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0034(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4586[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAnimationComponent*             CallFunc_GetAbilityAnimation_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0078(0x00B0)(ConstParm)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4587[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGardenComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4588[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_1; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_2; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventActor_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4589[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest) == 0x000008, "Wrong alignment on GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest");
static_assert(sizeof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest) == 0x000160, "Wrong size on GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, EntryPoint) == 0x000000, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, Temp_name_Variable) == 0x000034, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_K2_CommitAbility_ReturnValue) == 0x00003C, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue) == 0x000040, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_GetAbilityAnimation_ReturnValue) == 0x000048, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_GetAbilityAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, K2Node_CreateDelegate_OutputDelegate_3) == 0x000050, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_GetCSM_ReturnValue) == 0x000060, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_GetMontage_ReturnValue) == 0x000068, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_GetMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000070, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, K2Node_Event_EventData) == 0x000078, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_Round_ReturnValue) == 0x000128, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_IsValid_ReturnValue) == 0x00012C, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_GetComponentByClass_ReturnValue) == 0x000130, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_IsValid_ReturnValue_1) == 0x000138, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_IsValid_ReturnValue_2) == 0x000139, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_IsServer_ReturnValue) == 0x00013A, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, K2Node_Event_bWasCancelled) == 0x00013B, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_1) == 0x000140, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_2) == 0x000148, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_GetValeriaCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_AkEventActor_ReturnValue) == 0x000150, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_AkEventActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest, CallFunc_Round_A_ImplicitCast) == 0x000158, "Member 'GA_Gardening_Harvest_C_ExecuteUbergraph_GA_Gardening_Harvest::CallFunc_Round_A_ImplicitCast' has a wrong offset!");

// Function GA_Gardening_Harvest.GA_Gardening_Harvest_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Gardening_Harvest_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Gardening_Harvest_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Gardening_Harvest_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Gardening_Harvest_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Gardening_Harvest_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Gardening_Harvest_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Gardening_Harvest_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Gardening_Harvest.GA_Gardening_Harvest_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Gardening_Harvest_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gardening_Harvest_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Gardening_Harvest_C_K2_OnEndAbility");
static_assert(sizeof(GA_Gardening_Harvest_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Gardening_Harvest_C_K2_OnEndAbility");
static_assert(offsetof(GA_Gardening_Harvest_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Gardening_Harvest_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

