#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gather

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GA_LoopableEvent_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Gather.GA_Gather_C
// 0x00C0 (0x0610 - 0x0550)
class UGA_Gather_C final : public UGA_LoopableEvent_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Gather_C;                        // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayEventData                     GatherEventData;                                   // 0x0558(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FActiveGameplayEffectHandle            GameplayEffect_GatherBlocker;                      // 0x0608(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Gather(int32 EntryPoint, struct FGameplayEventData& K2Node_Event_EventData);
	void GetTargetActor(class AActor** Actor);
	void K2_ActivateAbilityFromEvent(struct FGameplayEventData& EventData);
	void OnGatherServer(class AActor* Actor, class ULootInteractorBaseComponent* LootInteractorComponent, class UGatherableComponent* GatherableComponent, class AActor* CallFunc_GetOwningActorFromActorInfo_ReturnValue, bool CallFunc_IsValid_ReturnValue, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Server_TriggerGather_ReturnValue, class ULootInteractorBaseComponent* CallFunc_GetComponentByClass_ReturnValue, class UGatherableComponent* CallFunc_GetComponentByClass_ReturnValue_1, class AActor* CallFunc_GetOwningActorFromActorInfo_ReturnValue_1, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue_1);
	void SetMovementBlock(bool bLock, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Gather_C">();
	}
	static class UGA_Gather_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Gather_C>();
	}
};
static_assert(alignof(UGA_Gather_C) == 0x000008, "Wrong alignment on UGA_Gather_C");
static_assert(sizeof(UGA_Gather_C) == 0x000610, "Wrong size on UGA_Gather_C");
static_assert(offsetof(UGA_Gather_C, UberGraphFrame_GA_Gather_C) == 0x000550, "Member 'UGA_Gather_C::UberGraphFrame_GA_Gather_C' has a wrong offset!");
static_assert(offsetof(UGA_Gather_C, GatherEventData) == 0x000558, "Member 'UGA_Gather_C::GatherEventData' has a wrong offset!");
static_assert(offsetof(UGA_Gather_C, GameplayEffect_GatherBlocker) == 0x000608, "Member 'UGA_Gather_C::GameplayEffect_GatherBlocker' has a wrong offset!");

}

