#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayAbilities

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MovieScene_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTasks_classes.hpp"


namespace SDK
{

// Class GameplayAbilities.GameplayEffect
// 0x0A48 (0x0A70 - 0x0028)
class UGameplayEffect : public UObject
{
public:
	uint8                                         Pad_FA2[0x8];                                      // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EGameplayEffectDurationType                   DurationPolicy;                                    // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA3[0x7];                                      // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectModifierMagnitude       DurationMagnitude;                                 // 0x0038(0x01E0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         Period;                                            // 0x0218(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bExecutePeriodicEffectOnApplication;               // 0x0240(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayEffectPeriodInhibitionRemovedPolicy  PeriodicInhibitionPolicy;                          // 0x0241(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA4[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayModifierInfo>          Modifiers;                                         // 0x0248(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FGameplayEffectExecutionDefinition> Executions;                                        // 0x0258(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ChanceToApplyToTarget;                             // 0x0268(0x0028)(Deprecated, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayEffectCustomApplicationRequirement>> ApplicationRequirements;                           // 0x0290(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FConditionalGameplayEffect>     ConditionalGameplayEffects;                        // 0x02A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayEffect>>    OverflowEffects;                                   // 0x02B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bDenyOverflowApplication;                          // 0x02C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearStackOnOverflow;                             // 0x02C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA5[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UGameplayEffect>>    PrematureExpirationEffectClasses;                  // 0x02C8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayEffect>>    RoutineExpirationEffectClasses;                    // 0x02D8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bRequireModifierSuccessToTriggerCues;              // 0x02E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuppressStackingCues;                             // 0x02E9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA6[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayEffectCue>             GameplayCues;                                      // 0x02F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UGameplayEffectUIData*                  UIData;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInheritedTagContainer                 InheritableGameplayEffectTags;                     // 0x0308(0x0060)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FInheritedTagContainer                 InheritableOwnedTagsContainer;                     // 0x0368(0x0060)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FInheritedTagContainer                 InheritableBlockedAbilityTagsContainer;            // 0x03C8(0x0060)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagRequirements               OngoingTagRequirements;                            // 0x0428(0x0088)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagRequirements               ApplicationTagRequirements;                        // 0x04B0(0x0088)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagRequirements               RemovalTagRequirements;                            // 0x0538(0x0088)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FInheritedTagContainer                 RemoveGameplayEffectsWithTags;                     // 0x05C0(0x0060)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagRequirements               GrantedApplicationImmunityTags;                    // 0x0620(0x0088)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayEffectQuery                   GrantedApplicationImmunityQuery;                   // 0x06A8(0x0198)(BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA7[0x8];                                      // 0x0840(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectQuery                   RemoveGameplayEffectQuery;                         // 0x0848(0x0198)(BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA8[0x1];                                      // 0x09E0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EGameplayEffectStackingType                   StackingType;                                      // 0x09E1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA9[0x2];                                      // 0x09E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StackLimitCount;                                   // 0x09E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayEffectStackingDurationPolicy         StackDurationRefreshPolicy;                        // 0x09E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayEffectStackingPeriodPolicy           StackPeriodResetPolicy;                            // 0x09E9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayEffectStackingExpirationPolicy       StackExpirationPolicy;                             // 0x09EA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAA[0x5];                                      // 0x09EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayAbilitySpecDef>        GrantedAbilities;                                  // 0x09F0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAB[0x60];                                     // 0x0A00(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameplayEffectComponent*>       GEComponents;                                      // 0x0A60(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayEffect">();
	}
	static class UGameplayEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayEffect>();
	}
};
static_assert(alignof(UGameplayEffect) == 0x000008, "Wrong alignment on UGameplayEffect");
static_assert(sizeof(UGameplayEffect) == 0x000A70, "Wrong size on UGameplayEffect");
static_assert(offsetof(UGameplayEffect, DurationPolicy) == 0x000030, "Member 'UGameplayEffect::DurationPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, DurationMagnitude) == 0x000038, "Member 'UGameplayEffect::DurationMagnitude' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, Period) == 0x000218, "Member 'UGameplayEffect::Period' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, bExecutePeriodicEffectOnApplication) == 0x000240, "Member 'UGameplayEffect::bExecutePeriodicEffectOnApplication' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, PeriodicInhibitionPolicy) == 0x000241, "Member 'UGameplayEffect::PeriodicInhibitionPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, Modifiers) == 0x000248, "Member 'UGameplayEffect::Modifiers' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, Executions) == 0x000258, "Member 'UGameplayEffect::Executions' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, ChanceToApplyToTarget) == 0x000268, "Member 'UGameplayEffect::ChanceToApplyToTarget' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, ApplicationRequirements) == 0x000290, "Member 'UGameplayEffect::ApplicationRequirements' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, ConditionalGameplayEffects) == 0x0002A0, "Member 'UGameplayEffect::ConditionalGameplayEffects' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, OverflowEffects) == 0x0002B0, "Member 'UGameplayEffect::OverflowEffects' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, bDenyOverflowApplication) == 0x0002C0, "Member 'UGameplayEffect::bDenyOverflowApplication' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, bClearStackOnOverflow) == 0x0002C1, "Member 'UGameplayEffect::bClearStackOnOverflow' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, PrematureExpirationEffectClasses) == 0x0002C8, "Member 'UGameplayEffect::PrematureExpirationEffectClasses' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, RoutineExpirationEffectClasses) == 0x0002D8, "Member 'UGameplayEffect::RoutineExpirationEffectClasses' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, bRequireModifierSuccessToTriggerCues) == 0x0002E8, "Member 'UGameplayEffect::bRequireModifierSuccessToTriggerCues' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, bSuppressStackingCues) == 0x0002E9, "Member 'UGameplayEffect::bSuppressStackingCues' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, GameplayCues) == 0x0002F0, "Member 'UGameplayEffect::GameplayCues' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, UIData) == 0x000300, "Member 'UGameplayEffect::UIData' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, InheritableGameplayEffectTags) == 0x000308, "Member 'UGameplayEffect::InheritableGameplayEffectTags' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, InheritableOwnedTagsContainer) == 0x000368, "Member 'UGameplayEffect::InheritableOwnedTagsContainer' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, InheritableBlockedAbilityTagsContainer) == 0x0003C8, "Member 'UGameplayEffect::InheritableBlockedAbilityTagsContainer' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, OngoingTagRequirements) == 0x000428, "Member 'UGameplayEffect::OngoingTagRequirements' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, ApplicationTagRequirements) == 0x0004B0, "Member 'UGameplayEffect::ApplicationTagRequirements' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, RemovalTagRequirements) == 0x000538, "Member 'UGameplayEffect::RemovalTagRequirements' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, RemoveGameplayEffectsWithTags) == 0x0005C0, "Member 'UGameplayEffect::RemoveGameplayEffectsWithTags' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, GrantedApplicationImmunityTags) == 0x000620, "Member 'UGameplayEffect::GrantedApplicationImmunityTags' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, GrantedApplicationImmunityQuery) == 0x0006A8, "Member 'UGameplayEffect::GrantedApplicationImmunityQuery' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, RemoveGameplayEffectQuery) == 0x000848, "Member 'UGameplayEffect::RemoveGameplayEffectQuery' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, StackingType) == 0x0009E1, "Member 'UGameplayEffect::StackingType' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, StackLimitCount) == 0x0009E4, "Member 'UGameplayEffect::StackLimitCount' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, StackDurationRefreshPolicy) == 0x0009E8, "Member 'UGameplayEffect::StackDurationRefreshPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, StackPeriodResetPolicy) == 0x0009E9, "Member 'UGameplayEffect::StackPeriodResetPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, StackExpirationPolicy) == 0x0009EA, "Member 'UGameplayEffect::StackExpirationPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, GrantedAbilities) == 0x0009F0, "Member 'UGameplayEffect::GrantedAbilities' has a wrong offset!");
static_assert(offsetof(UGameplayEffect, GEComponents) == 0x000A60, "Member 'UGameplayEffect::GEComponents' has a wrong offset!");

// Class GameplayAbilities.AbilityTask
// 0x0018 (0x0080 - 0x0068)
class UAbilityTask : public UGameplayTask
{
public:
	class UGameplayAbility*                       Ability;                                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UAbilitySystemComponent> AbilitySystemComponent;                            // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAC[0x8];                                      // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask">();
	}
	static class UAbilityTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask>();
	}
};
static_assert(alignof(UAbilityTask) == 0x000008, "Wrong alignment on UAbilityTask");
static_assert(sizeof(UAbilityTask) == 0x000080, "Wrong size on UAbilityTask");
static_assert(offsetof(UAbilityTask, Ability) == 0x000068, "Member 'UAbilityTask::Ability' has a wrong offset!");
static_assert(offsetof(UAbilityTask, AbilitySystemComponent) == 0x000070, "Member 'UAbilityTask::AbilitySystemComponent' has a wrong offset!");

// Class GameplayAbilities.AbilityTask_WaitAbilityActivate
// 0x0100 (0x0180 - 0x0080)
class UAbilityTask_WaitAbilityActivate final : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_             OnActivate;                                        // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAD[0xF0];                                     // 0x0090(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_WaitAbilityActivate* WaitForAbilityActivate(class UGameplayAbility* OwningAbility, const struct FGameplayTag& WithTag, const struct FGameplayTag& WithoutTag, bool IncludeTriggeredAbilities, bool TriggerOnce);
	static class UAbilityTask_WaitAbilityActivate* WaitForAbilityActivate_Query(class UGameplayAbility* OwningAbility, const struct FGameplayTagQuery& Query, bool IncludeTriggeredAbilities, bool TriggerOnce);
	static class UAbilityTask_WaitAbilityActivate* WaitForAbilityActivateWithTagRequirements(class UGameplayAbility* OwningAbility, const struct FGameplayTagRequirements& TagRequirements, bool IncludeTriggeredAbilities, bool TriggerOnce);

	void OnAbilityActivate(class UGameplayAbility* ActivatedAbility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_WaitAbilityActivate">();
	}
	static class UAbilityTask_WaitAbilityActivate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_WaitAbilityActivate>();
	}
};
static_assert(alignof(UAbilityTask_WaitAbilityActivate) == 0x000008, "Wrong alignment on UAbilityTask_WaitAbilityActivate");
static_assert(sizeof(UAbilityTask_WaitAbilityActivate) == 0x000180, "Wrong size on UAbilityTask_WaitAbilityActivate");
static_assert(offsetof(UAbilityTask_WaitAbilityActivate, OnActivate) == 0x000080, "Member 'UAbilityTask_WaitAbilityActivate::OnActivate' has a wrong offset!");

// Class GameplayAbilities.AbilitySystemDebugHUD
// 0x0000 (0x0398 - 0x0398)
class AAbilitySystemDebugHUD final : public AHUD
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilitySystemDebugHUD">();
	}
	static class AAbilitySystemDebugHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbilitySystemDebugHUD>();
	}
};
static_assert(alignof(AAbilitySystemDebugHUD) == 0x000008, "Wrong alignment on AAbilitySystemDebugHUD");
static_assert(sizeof(AAbilitySystemDebugHUD) == 0x000398, "Wrong size on AAbilitySystemDebugHUD");

// Class GameplayAbilities.GameplayEffectComponent
// 0x0000 (0x0028 - 0x0028)
class UGameplayEffectComponent : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayEffectComponent">();
	}
	static class UGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayEffectComponent>();
	}
};
static_assert(alignof(UGameplayEffectComponent) == 0x000008, "Wrong alignment on UGameplayEffectComponent");
static_assert(sizeof(UGameplayEffectComponent) == 0x000028, "Wrong size on UGameplayEffectComponent");

// Class GameplayAbilities.AbilitiesGameplayEffectComponent
// 0x0010 (0x0038 - 0x0028)
class UAbilitiesGameplayEffectComponent final : public UGameplayEffectComponent
{
public:
	TArray<struct FGameplayAbilitySpecConfig>     GrantAbilityConfigs;                               // 0x0028(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilitiesGameplayEffectComponent">();
	}
	static class UAbilitiesGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilitiesGameplayEffectComponent>();
	}
};
static_assert(alignof(UAbilitiesGameplayEffectComponent) == 0x000008, "Wrong alignment on UAbilitiesGameplayEffectComponent");
static_assert(sizeof(UAbilitiesGameplayEffectComponent) == 0x000038, "Wrong size on UAbilitiesGameplayEffectComponent");
static_assert(offsetof(UAbilitiesGameplayEffectComponent, GrantAbilityConfigs) == 0x000028, "Member 'UAbilitiesGameplayEffectComponent::GrantAbilityConfigs' has a wrong offset!");

// Class GameplayAbilities.AdditionalEffectsGameplayEffectComponent
// 0x0048 (0x0070 - 0x0028)
class UAdditionalEffectsGameplayEffectComponent final : public UGameplayEffectComponent
{
public:
	bool                                          bOnApplicationCopyDataFromOriginalSpec;            // 0x0028(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FB1[0x7];                                      // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConditionalGameplayEffect>     OnApplicationGameplayEffects;                      // 0x0030(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayEffect>>    OnCompleteAlways;                                  // 0x0040(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayEffect>>    OnCompleteNormal;                                  // 0x0050(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayEffect>>    OnCompletePrematurely;                             // 0x0060(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AdditionalEffectsGameplayEffectComponent">();
	}
	static class UAdditionalEffectsGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdditionalEffectsGameplayEffectComponent>();
	}
};
static_assert(alignof(UAdditionalEffectsGameplayEffectComponent) == 0x000008, "Wrong alignment on UAdditionalEffectsGameplayEffectComponent");
static_assert(sizeof(UAdditionalEffectsGameplayEffectComponent) == 0x000070, "Wrong size on UAdditionalEffectsGameplayEffectComponent");
static_assert(offsetof(UAdditionalEffectsGameplayEffectComponent, bOnApplicationCopyDataFromOriginalSpec) == 0x000028, "Member 'UAdditionalEffectsGameplayEffectComponent::bOnApplicationCopyDataFromOriginalSpec' has a wrong offset!");
static_assert(offsetof(UAdditionalEffectsGameplayEffectComponent, OnApplicationGameplayEffects) == 0x000030, "Member 'UAdditionalEffectsGameplayEffectComponent::OnApplicationGameplayEffects' has a wrong offset!");
static_assert(offsetof(UAdditionalEffectsGameplayEffectComponent, OnCompleteAlways) == 0x000040, "Member 'UAdditionalEffectsGameplayEffectComponent::OnCompleteAlways' has a wrong offset!");
static_assert(offsetof(UAdditionalEffectsGameplayEffectComponent, OnCompleteNormal) == 0x000050, "Member 'UAdditionalEffectsGameplayEffectComponent::OnCompleteNormal' has a wrong offset!");
static_assert(offsetof(UAdditionalEffectsGameplayEffectComponent, OnCompletePrematurely) == 0x000060, "Member 'UAdditionalEffectsGameplayEffectComponent::OnCompletePrematurely' has a wrong offset!");

// Class GameplayAbilities.AssetTagsGameplayEffectComponent
// 0x0060 (0x0088 - 0x0028)
class UAssetTagsGameplayEffectComponent final : public UGameplayEffectComponent
{
public:
	struct FInheritedTagContainer                 InheritableAssetTags;                              // 0x0028(0x0060)(Edit, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetTagsGameplayEffectComponent">();
	}
	static class UAssetTagsGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetTagsGameplayEffectComponent>();
	}
};
static_assert(alignof(UAssetTagsGameplayEffectComponent) == 0x000008, "Wrong alignment on UAssetTagsGameplayEffectComponent");
static_assert(sizeof(UAssetTagsGameplayEffectComponent) == 0x000088, "Wrong size on UAssetTagsGameplayEffectComponent");
static_assert(offsetof(UAssetTagsGameplayEffectComponent, InheritableAssetTags) == 0x000028, "Member 'UAssetTagsGameplayEffectComponent::InheritableAssetTags' has a wrong offset!");

// Class GameplayAbilities.BlockAbilityTagsGameplayEffectComponent
// 0x0060 (0x0088 - 0x0028)
class UBlockAbilityTagsGameplayEffectComponent final : public UGameplayEffectComponent
{
public:
	struct FInheritedTagContainer                 InheritableBlockedAbilityTagsContainer;            // 0x0028(0x0060)(Edit, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlockAbilityTagsGameplayEffectComponent">();
	}
	static class UBlockAbilityTagsGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlockAbilityTagsGameplayEffectComponent>();
	}
};
static_assert(alignof(UBlockAbilityTagsGameplayEffectComponent) == 0x000008, "Wrong alignment on UBlockAbilityTagsGameplayEffectComponent");
static_assert(sizeof(UBlockAbilityTagsGameplayEffectComponent) == 0x000088, "Wrong size on UBlockAbilityTagsGameplayEffectComponent");
static_assert(offsetof(UBlockAbilityTagsGameplayEffectComponent, InheritableBlockedAbilityTagsContainer) == 0x000028, "Member 'UBlockAbilityTagsGameplayEffectComponent::InheritableBlockedAbilityTagsContainer' has a wrong offset!");

// Class GameplayAbilities.ChanceToApplyGameplayEffectComponent
// 0x0028 (0x0050 - 0x0028)
class UChanceToApplyGameplayEffectComponent final : public UGameplayEffectComponent
{
public:
	struct FScalableFloat                         ChanceToApplyToTarget;                             // 0x0028(0x0028)(Edit, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChanceToApplyGameplayEffectComponent">();
	}
	static class UChanceToApplyGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChanceToApplyGameplayEffectComponent>();
	}
};
static_assert(alignof(UChanceToApplyGameplayEffectComponent) == 0x000008, "Wrong alignment on UChanceToApplyGameplayEffectComponent");
static_assert(sizeof(UChanceToApplyGameplayEffectComponent) == 0x000050, "Wrong size on UChanceToApplyGameplayEffectComponent");
static_assert(offsetof(UChanceToApplyGameplayEffectComponent, ChanceToApplyToTarget) == 0x000028, "Member 'UChanceToApplyGameplayEffectComponent::ChanceToApplyToTarget' has a wrong offset!");

// Class GameplayAbilities.CustomCanApplyGameplayEffectComponent
// 0x0010 (0x0038 - 0x0028)
class UCustomCanApplyGameplayEffectComponent final : public UGameplayEffectComponent
{
public:
	TArray<TSubclassOf<class UGameplayEffectCustomApplicationRequirement>> ApplicationRequirements;                           // 0x0028(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomCanApplyGameplayEffectComponent">();
	}
	static class UCustomCanApplyGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomCanApplyGameplayEffectComponent>();
	}
};
static_assert(alignof(UCustomCanApplyGameplayEffectComponent) == 0x000008, "Wrong alignment on UCustomCanApplyGameplayEffectComponent");
static_assert(sizeof(UCustomCanApplyGameplayEffectComponent) == 0x000038, "Wrong size on UCustomCanApplyGameplayEffectComponent");
static_assert(offsetof(UCustomCanApplyGameplayEffectComponent, ApplicationRequirements) == 0x000028, "Member 'UCustomCanApplyGameplayEffectComponent::ApplicationRequirements' has a wrong offset!");

// Class GameplayAbilities.GameplayEffectUIData
// 0x0000 (0x0028 - 0x0028)
class UGameplayEffectUIData : public UGameplayEffectComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayEffectUIData">();
	}
	static class UGameplayEffectUIData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayEffectUIData>();
	}
};
static_assert(alignof(UGameplayEffectUIData) == 0x000008, "Wrong alignment on UGameplayEffectUIData");
static_assert(sizeof(UGameplayEffectUIData) == 0x000028, "Wrong size on UGameplayEffectUIData");

// Class GameplayAbilities.GameplayEffectUIData_TextOnly
// 0x0018 (0x0040 - 0x0028)
class UGameplayEffectUIData_TextOnly final : public UGameplayEffectUIData
{
public:
	class FText                                   Description;                                       // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayEffectUIData_TextOnly">();
	}
	static class UGameplayEffectUIData_TextOnly* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayEffectUIData_TextOnly>();
	}
};
static_assert(alignof(UGameplayEffectUIData_TextOnly) == 0x000008, "Wrong alignment on UGameplayEffectUIData_TextOnly");
static_assert(sizeof(UGameplayEffectUIData_TextOnly) == 0x000040, "Wrong size on UGameplayEffectUIData_TextOnly");
static_assert(offsetof(UGameplayEffectUIData_TextOnly, Description) == 0x000028, "Member 'UGameplayEffectUIData_TextOnly::Description' has a wrong offset!");

// Class GameplayAbilities.ImmunityGameplayEffectComponent
// 0x0010 (0x0038 - 0x0028)
class UImmunityGameplayEffectComponent final : public UGameplayEffectComponent
{
public:
	TArray<struct FGameplayEffectQuery>           ImmunityQueries;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImmunityGameplayEffectComponent">();
	}
	static class UImmunityGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImmunityGameplayEffectComponent>();
	}
};
static_assert(alignof(UImmunityGameplayEffectComponent) == 0x000008, "Wrong alignment on UImmunityGameplayEffectComponent");
static_assert(sizeof(UImmunityGameplayEffectComponent) == 0x000038, "Wrong size on UImmunityGameplayEffectComponent");
static_assert(offsetof(UImmunityGameplayEffectComponent, ImmunityQueries) == 0x000028, "Member 'UImmunityGameplayEffectComponent::ImmunityQueries' has a wrong offset!");

// Class GameplayAbilities.RemoveOtherGameplayEffectComponent
// 0x0010 (0x0038 - 0x0028)
class URemoveOtherGameplayEffectComponent final : public UGameplayEffectComponent
{
public:
	TArray<struct FGameplayEffectQuery>           RemoveGameplayEffectQueries;                       // 0x0028(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoveOtherGameplayEffectComponent">();
	}
	static class URemoveOtherGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoveOtherGameplayEffectComponent>();
	}
};
static_assert(alignof(URemoveOtherGameplayEffectComponent) == 0x000008, "Wrong alignment on URemoveOtherGameplayEffectComponent");
static_assert(sizeof(URemoveOtherGameplayEffectComponent) == 0x000038, "Wrong size on URemoveOtherGameplayEffectComponent");
static_assert(offsetof(URemoveOtherGameplayEffectComponent, RemoveGameplayEffectQueries) == 0x000028, "Member 'URemoveOtherGameplayEffectComponent::RemoveGameplayEffectQueries' has a wrong offset!");

// Class GameplayAbilities.TargetTagRequirementsGameplayEffectComponent
// 0x0198 (0x01C0 - 0x0028)
class UTargetTagRequirementsGameplayEffectComponent final : public UGameplayEffectComponent
{
public:
	struct FGameplayTagRequirements               ApplicationTagRequirements;                        // 0x0028(0x0088)(Edit, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagRequirements               OngoingTagRequirements;                            // 0x00B0(0x0088)(Edit, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagRequirements               RemovalTagRequirements;                            // 0x0138(0x0088)(Edit, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetTagRequirementsGameplayEffectComponent">();
	}
	static class UTargetTagRequirementsGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetTagRequirementsGameplayEffectComponent>();
	}
};
static_assert(alignof(UTargetTagRequirementsGameplayEffectComponent) == 0x000008, "Wrong alignment on UTargetTagRequirementsGameplayEffectComponent");
static_assert(sizeof(UTargetTagRequirementsGameplayEffectComponent) == 0x0001C0, "Wrong size on UTargetTagRequirementsGameplayEffectComponent");
static_assert(offsetof(UTargetTagRequirementsGameplayEffectComponent, ApplicationTagRequirements) == 0x000028, "Member 'UTargetTagRequirementsGameplayEffectComponent::ApplicationTagRequirements' has a wrong offset!");
static_assert(offsetof(UTargetTagRequirementsGameplayEffectComponent, OngoingTagRequirements) == 0x0000B0, "Member 'UTargetTagRequirementsGameplayEffectComponent::OngoingTagRequirements' has a wrong offset!");
static_assert(offsetof(UTargetTagRequirementsGameplayEffectComponent, RemovalTagRequirements) == 0x000138, "Member 'UTargetTagRequirementsGameplayEffectComponent::RemovalTagRequirements' has a wrong offset!");

// Class GameplayAbilities.TargetTagsGameplayEffectComponent
// 0x0060 (0x0088 - 0x0028)
class UTargetTagsGameplayEffectComponent final : public UGameplayEffectComponent
{
public:
	struct FInheritedTagContainer                 InheritableGrantedTagsContainer;                   // 0x0028(0x0060)(Edit, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetTagsGameplayEffectComponent">();
	}
	static class UTargetTagsGameplayEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetTagsGameplayEffectComponent>();
	}
};
static_assert(alignof(UTargetTagsGameplayEffectComponent) == 0x000008, "Wrong alignment on UTargetTagsGameplayEffectComponent");
static_assert(sizeof(UTargetTagsGameplayEffectComponent) == 0x000088, "Wrong size on UTargetTagsGameplayEffectComponent");
static_assert(offsetof(UTargetTagsGameplayEffectComponent, InheritableGrantedTagsContainer) == 0x000028, "Member 'UTargetTagsGameplayEffectComponent::InheritableGrantedTagsContainer' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync
// 0x0008 (0x0038 - 0x0030)
class UAbilityAsync : public UCancellableAsyncAction
{
public:
	uint8                                         Pad_FB2[0x8];                                      // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndAction();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityAsync">();
	}
	static class UAbilityAsync* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityAsync>();
	}
};
static_assert(alignof(UAbilityAsync) == 0x000008, "Wrong alignment on UAbilityAsync");
static_assert(sizeof(UAbilityAsync) == 0x000038, "Wrong size on UAbilityAsync");

// Class GameplayAbilities.AbilityAsync_WaitAttributeChanged
// 0x0058 (0x0090 - 0x0038)
class UAbilityAsync_WaitAttributeChanged final : public UAbilityAsync
{
public:
	FMulticastInlineDelegateProperty_             Changed;                                           // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_FB3[0x48];                                     // 0x0048(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityAsync_WaitAttributeChanged* WaitForAttributeChanged(class AActor* TargetActor, const struct FGameplayAttribute& Attribute, bool OnlyTriggerOnce);

	void AsyncWaitAttributeChangedDelegate__DelegateSignature(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityAsync_WaitAttributeChanged">();
	}
	static class UAbilityAsync_WaitAttributeChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitAttributeChanged>();
	}
};
static_assert(alignof(UAbilityAsync_WaitAttributeChanged) == 0x000008, "Wrong alignment on UAbilityAsync_WaitAttributeChanged");
static_assert(sizeof(UAbilityAsync_WaitAttributeChanged) == 0x000090, "Wrong size on UAbilityAsync_WaitAttributeChanged");
static_assert(offsetof(UAbilityAsync_WaitAttributeChanged, Changed) == 0x000038, "Member 'UAbilityAsync_WaitAttributeChanged::Changed' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync_WaitGameplayEffectApplied
// 0x0150 (0x0188 - 0x0038)
class UAbilityAsync_WaitGameplayEffectApplied final : public UAbilityAsync
{
public:
	FMulticastInlineDelegateProperty_             OnApplied;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_FB5[0x140];                                    // 0x0048(0x0140)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityAsync_WaitGameplayEffectApplied* WaitGameplayEffectAppliedToActor(class AActor* TargetActor, struct FGameplayTargetDataFilterHandle& SourceFilter, const struct FGameplayTagRequirements& SourceTagRequirements, const struct FGameplayTagRequirements& TargetTagRequirements, bool TriggerOnce, bool ListenForPeriodicEffect);

	void OnAppliedDelegate__DelegateSignature(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayEffectApplied">();
	}
	static class UAbilityAsync_WaitGameplayEffectApplied* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayEffectApplied>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayEffectApplied) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayEffectApplied");
static_assert(sizeof(UAbilityAsync_WaitGameplayEffectApplied) == 0x000188, "Wrong size on UAbilityAsync_WaitGameplayEffectApplied");
static_assert(offsetof(UAbilityAsync_WaitGameplayEffectApplied, OnApplied) == 0x000038, "Member 'UAbilityAsync_WaitGameplayEffectApplied::OnApplied' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync_WaitGameplayEvent
// 0x0028 (0x0060 - 0x0038)
class UAbilityAsync_WaitGameplayEvent final : public UAbilityAsync
{
public:
	FMulticastInlineDelegateProperty_             EventReceived;                                     // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_FB7[0x18];                                     // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityAsync_WaitGameplayEvent* WaitGameplayEventToActor(class AActor* TargetActor, const struct FGameplayTag& EventTag, bool OnlyTriggerOnce, bool OnlyMatchExact);

	void EventReceivedDelegate__DelegateSignature(const struct FGameplayEventData& Payload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayEvent">();
	}
	static class UAbilityAsync_WaitGameplayEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayEvent>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayEvent) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayEvent");
static_assert(sizeof(UAbilityAsync_WaitGameplayEvent) == 0x000060, "Wrong size on UAbilityAsync_WaitGameplayEvent");
static_assert(offsetof(UAbilityAsync_WaitGameplayEvent, EventReceived) == 0x000038, "Member 'UAbilityAsync_WaitGameplayEvent::EventReceived' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync_WaitGameplayTag
// 0x0018 (0x0050 - 0x0038)
class UAbilityAsync_WaitGameplayTag : public UAbilityAsync
{
public:
	uint8                                         Pad_FB9[0x18];                                     // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayTag">();
	}
	static class UAbilityAsync_WaitGameplayTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayTag>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayTag) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayTag");
static_assert(sizeof(UAbilityAsync_WaitGameplayTag) == 0x000050, "Wrong size on UAbilityAsync_WaitGameplayTag");

// Class GameplayAbilities.AbilityAsync_WaitGameplayTagAdded
// 0x0010 (0x0060 - 0x0050)
class UAbilityAsync_WaitGameplayTagAdded final : public UAbilityAsync_WaitGameplayTag
{
public:
	FMulticastInlineDelegateProperty_             Added;                                             // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UAbilityAsync_WaitGameplayTagAdded* WaitGameplayTagAddToActor(class AActor* TargetActor, const struct FGameplayTag& Tag, bool OnlyTriggerOnce);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayTagAdded">();
	}
	static class UAbilityAsync_WaitGameplayTagAdded* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayTagAdded>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayTagAdded) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayTagAdded");
static_assert(sizeof(UAbilityAsync_WaitGameplayTagAdded) == 0x000060, "Wrong size on UAbilityAsync_WaitGameplayTagAdded");
static_assert(offsetof(UAbilityAsync_WaitGameplayTagAdded, Added) == 0x000050, "Member 'UAbilityAsync_WaitGameplayTagAdded::Added' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync_WaitGameplayTagRemoved
// 0x0010 (0x0060 - 0x0050)
class UAbilityAsync_WaitGameplayTagRemoved final : public UAbilityAsync_WaitGameplayTag
{
public:
	FMulticastInlineDelegateProperty_             Removed;                                           // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UAbilityAsync_WaitGameplayTagRemoved* WaitGameplayTagRemoveFromActor(class AActor* TargetActor, const struct FGameplayTag& Tag, bool OnlyTriggerOnce);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayTagRemoved">();
	}
	static class UAbilityAsync_WaitGameplayTagRemoved* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayTagRemoved>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayTagRemoved) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayTagRemoved");
static_assert(sizeof(UAbilityAsync_WaitGameplayTagRemoved) == 0x000060, "Wrong size on UAbilityAsync_WaitGameplayTagRemoved");
static_assert(offsetof(UAbilityAsync_WaitGameplayTagRemoved, Removed) == 0x000050, "Member 'UAbilityAsync_WaitGameplayTagRemoved::Removed' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync_WaitGameplayTagQuery
// 0x00D0 (0x0108 - 0x0038)
class UAbilityAsync_WaitGameplayTagQuery final : public UAbilityAsync
{
public:
	uint8                                         Pad_FBC[0xC0];                                     // 0x0038(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             Triggered;                                         // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UAbilityAsync_WaitGameplayTagQuery* WaitGameplayTagQueryOnActor(class AActor* TargetActor, struct FGameplayTagQuery& TagQuery, EWaitGameplayTagQueryTriggerCondition TriggerCondition, bool bOnlyTriggerOnce);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayTagQuery">();
	}
	static class UAbilityAsync_WaitGameplayTagQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayTagQuery>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayTagQuery) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayTagQuery");
static_assert(sizeof(UAbilityAsync_WaitGameplayTagQuery) == 0x000108, "Wrong size on UAbilityAsync_WaitGameplayTagQuery");
static_assert(offsetof(UAbilityAsync_WaitGameplayTagQuery, Triggered) == 0x0000F8, "Member 'UAbilityAsync_WaitGameplayTagQuery::Triggered' has a wrong offset!");

// Class GameplayAbilities.GameplayAbility
// 0x0390 (0x03B8 - 0x0028)
class UGameplayAbility : public UObject
{
public:
	uint8                                         Pad_FBE[0x80];                                     // 0x0028(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags;                                       // 0x00A8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bReplicateInputDirectly;                           // 0x00C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RemoteInstanceEnded;                               // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FBF[0x4];                                      // 0x00CA(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	EGameplayAbilityReplicationPolicy             ReplicationPolicy;                                 // 0x00CE(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGameplayAbilityInstancingPolicy              InstancingPolicy;                                  // 0x00CF(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bServerRespectsRemoteAbilityCancellation;          // 0x00D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRetriggerInstancedAbility;                        // 0x00D1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC0[0x6];                                      // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActivationInfo         CurrentActivationInfo;                             // 0x00D8(0x0020)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayEventData                     CurrentEventData;                                  // 0x00F8(0x00B0)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	EGameplayAbilityNetExecutionPolicy            NetExecutionPolicy;                                // 0x01A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGameplayAbilityNetSecurityPolicy             NetSecurityPolicy;                                 // 0x01A9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC1[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            CostGameplayEffectClass;                           // 0x01B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAbilityTriggerData>            AbilityTriggers;                                   // 0x01B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            CooldownGameplayEffectClass;                       // 0x01C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  CancelAbilitiesWithTag;                            // 0x01D0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlockAbilitiesWithTag;                             // 0x01F0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationOwnedTags;                               // 0x0210(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationRequiredTags;                            // 0x0230(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationBlockedTags;                             // 0x0250(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  SourceRequiredTags;                                // 0x0270(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  SourceBlockedTags;                                 // 0x0290(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetRequiredTags;                                // 0x02B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetBlockedTags;                                 // 0x02D0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC2[0x20];                                     // 0x02F0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameplayTask*>                  ActiveTasks;                                       // 0x0310(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC3[0x10];                                     // 0x0320(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CurrentMontage;                                    // 0x0330(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC4[0x60];                                     // 0x0338(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsActive;                                         // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAbilityEnding;                                  // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCancelable;                                     // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBlockingOtherAbilities;                         // 0x039B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC5[0x14];                                     // 0x039C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bMarkPendingKillOnAbilityEnd;                      // 0x03B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC6[0x7];                                      // 0x03B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectToOwner(TSubclassOf<class UGameplayEffect> GameplayEffectClass, int32 GameplayEffectLevel, int32 Stacks);
	TArray<struct FActiveGameplayEffectHandle> BP_ApplyGameplayEffectToTarget(const struct FGameplayAbilityTargetDataHandle& TargetData, TSubclassOf<class UGameplayEffect> GameplayEffectClass, int32 GameplayEffectLevel, int32 Stacks);
	void BP_RemoveGameplayEffectFromOwnerWithAssetTags(const struct FGameplayTagContainer& WithAssetTags, int32 StacksToRemove);
	void BP_RemoveGameplayEffectFromOwnerWithGrantedTags(const struct FGameplayTagContainer& WithGrantedTags, int32 StacksToRemove);
	void BP_RemoveGameplayEffectFromOwnerWithHandle(const struct FActiveGameplayEffectHandle& Handle, int32 StacksToRemove);
	void CancelTaskByInstanceName(class FName InstanceName);
	void ConfirmTaskByInstanceName(class FName InstanceName, bool bEndTask);
	void EndAbilityState(class FName OptionalStateNameToEnd);
	void EndTaskByInstanceName(class FName InstanceName);
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(struct FGameplayEventData& EventData);
	void K2_AddGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context, bool bRemoveOnAbilityEnd);
	void K2_AddGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameter, bool bRemoveOnAbilityEnd);
	struct FActiveGameplayEffectHandle K2_ApplyGameplayEffectSpecToOwner(struct FGameplayEffectSpecHandle& EffectSpecHandle);
	TArray<struct FActiveGameplayEffectHandle> K2_ApplyGameplayEffectSpecToTarget(struct FGameplayEffectSpecHandle& EffectSpecHandle, const struct FGameplayAbilityTargetDataHandle& TargetData);
	void K2_CancelAbility();
	bool K2_CheckAbilityCooldown();
	bool K2_CheckAbilityCost();
	bool K2_CommitAbility();
	bool K2_CommitAbilityCooldown(bool BroadcastCommitEvent, bool ForceCooldown);
	bool K2_CommitAbilityCost(bool BroadcastCommitEvent);
	void K2_CommitExecute();
	void K2_EndAbility();
	void K2_EndAbilityLocally();
	void K2_ExecuteGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context);
	void K2_ExecuteGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_RemoveGameplayCue(const struct FGameplayTag& GameplayCueTag);
	struct FGameplayAbilityTargetingLocationInfo MakeTargetLocationInfoFromOwnerActor();
	struct FGameplayAbilityTargetingLocationInfo MakeTargetLocationInfoFromOwnerSkeletalMeshComponent(class FName SocketName);
	void MontageJumpToSection(class FName SectionName);
	void MontageSetNextSectionName(class FName FromSectionName, class FName ToSectionName);
	void MontageStop(float OverrideBlendOutTime);
	void RemoveGrantedByEffect();
	void SendGameplayEvent(const struct FGameplayTag& EventTag, const struct FGameplayEventData& Payload);
	void SetCanBeCanceled(bool bCanBeCanceled);
	void SetShouldBlockOtherAbilities(bool bShouldBlockAbilities);

	int32 GetAbilityLevel() const;
	int32 GetAbilityLevel_BP(const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayAbilityActorInfo& ActorInfo) const;
	class UAbilitySystemComponent* GetAbilitySystemComponentFromActorInfo() const;
	struct FGameplayAbilityActorInfo GetActorInfo() const;
	class AActor* GetAvatarActorFromActorInfo() const;
	struct FGameplayEffectContextHandle GetContextFromOwner(const struct FGameplayAbilityTargetDataHandle& OptionalTargetData) const;
	float GetCooldownTimeRemaining() const;
	class UAnimMontage* GetCurrentMontage() const;
	class UObject* GetCurrentSourceObject() const;
	struct FGameplayEffectContextHandle GetGrantedByEffectContext() const;
	class AActor* GetOwningActorFromActorInfo() const;
	class USkeletalMeshComponent* GetOwningComponentFromActorInfo() const;
	class UObject* GetSourceObject_BP(const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayAbilityActorInfo& ActorInfo) const;
	void InvalidateClientPredictionKey() const;
	bool IsLocallyControlled() const;
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;
	bool K2_HasAuthority() const;
	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;
	struct FGameplayEffectSpecHandle MakeOutgoingGameplayEffectSpec(TSubclassOf<class UGameplayEffect> GameplayEffectClass, float Level) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayAbility">();
	}
	static class UGameplayAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayAbility>();
	}
};
static_assert(alignof(UGameplayAbility) == 0x000008, "Wrong alignment on UGameplayAbility");
static_assert(sizeof(UGameplayAbility) == 0x0003B8, "Wrong size on UGameplayAbility");
static_assert(offsetof(UGameplayAbility, AbilityTags) == 0x0000A8, "Member 'UGameplayAbility::AbilityTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bReplicateInputDirectly) == 0x0000C8, "Member 'UGameplayAbility::bReplicateInputDirectly' has a wrong offset!");
