#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Chop_Base

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GC_Chop_Base.GC_Chop_Base_C.OnExecute
// 0x0270 (0x0270 - 0x0000)
struct GC_Chop_Base_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C8E[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InstigatorActor;                                   // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x00F8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0120(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0140(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C8F[0x6];                                     // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_EffectContextGetInstigatorActor_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C90[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C91[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetComponentsByTag_ReturnValue;           // 0x01E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C92[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C93[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C94[0x3];                                     // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventComponent_ReturnValue;             // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C95[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast;          // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClientStartCameraShake_Scale_ImplicitCast; // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Chop_Base_C_OnExecute) == 0x000008, "Wrong alignment on GC_Chop_Base_C_OnExecute");
static_assert(sizeof(GC_Chop_Base_C_OnExecute) == 0x000270, "Wrong size on GC_Chop_Base_C_OnExecute");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Chop_Base_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Chop_Base_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_Chop_Base_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, InstigatorActor) == 0x0000E8, "Member 'GC_Chop_Base_C_OnExecute::InstigatorActor' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000F0, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000F4, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0000F8, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000110, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000118, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000120, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000140, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000160, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000178, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000190, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000198, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001A0, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A8, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001B0, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001B4, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B8, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001C0, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0001C1, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_EffectContextGetInstigatorActor_ReturnValue) == 0x0001C8, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_EffectContextGetInstigatorActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0001D0, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_GetFloatAttribute_ReturnValue) == 0x0001D4, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x0001D8, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x0001DC, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_GetComponentsByTag_ReturnValue) == 0x0001E0, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001F0, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_Array_Get_Item) == 0x0001F8, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000200, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x000208, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000210, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000228, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_BooleanAND_ReturnValue) == 0x000230, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, K2Node_DynamicCast_AsValeria_Character) == 0x000238, "Member 'GC_Chop_Base_C_OnExecute::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'GC_Chop_Base_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_AkEventComponent_ReturnValue) == 0x000244, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_AkEventComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000248, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_IsValid_ReturnValue_1) == 0x000250, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000258, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000260, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_SetRTPCValue_Value_ImplicitCast) == 0x000268, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_SetRTPCValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Chop_Base_C_OnExecute, CallFunc_ClientStartCameraShake_Scale_ImplicitCast) == 0x00026C, "Member 'GC_Chop_Base_C_OnExecute::CallFunc_ClientStartCameraShake_Scale_ImplicitCast' has a wrong offset!");

}

