#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_EndChapaaCarry

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GC_EndChapaaCarry.GC_EndChapaaCarry_C.OnExecute
// 0x0288 (0x0288 - 0x0000)
struct GC_EndChapaaCarry_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6083[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      ValCharacter;                                      // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x00F8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0120(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0140(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6084[0x6];                                     // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6085[0x6];                                     // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentItem                         CallFunc_GetEquippedItem_ReturnValue;              // 0x01D8(0x0050)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6086[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEquipViewActor*                        CallFunc_Array_Get_Item;                           // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6087[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent;              // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6088[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_EndChapaaCarry_C_OnExecute) == 0x000008, "Wrong alignment on GC_EndChapaaCarry_C_OnExecute");
static_assert(sizeof(GC_EndChapaaCarry_C_OnExecute) == 0x000288, "Wrong size on GC_EndChapaaCarry_C_OnExecute");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_EndChapaaCarry_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, Parameters) == 0x000008, "Member 'GC_EndChapaaCarry_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_EndChapaaCarry_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, ValCharacter) == 0x0000E8, "Member 'GC_EndChapaaCarry_C_OnExecute::ValCharacter' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000F0, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000F4, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0000F8, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000110, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000118, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000120, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000140, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000160, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000178, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000190, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000198, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001A0, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A8, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001B0, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001B4, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B8, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001C0, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0001C1, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, K2Node_DynamicCast_AsValeria_Character) == 0x0001C8, "Member 'GC_EndChapaaCarry_C_OnExecute::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'GC_EndChapaaCarry_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001D1, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_GetEquippedItem_ReturnValue) == 0x0001D8, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_GetEquippedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000228, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_Array_Get_Item) == 0x000230, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x000238, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000240, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_AkEventLocation_AkComponent) == 0x000258, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_AkEventLocation_AkComponent' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_AkEventLocation_Playing_ID) == 0x000260, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_AkEventLocation_Playing_ID' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000268, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_EndChapaaCarry_C_OnExecute, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000280, "Member 'GC_EndChapaaCarry_C_OnExecute::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

}

