#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Gardening_WaterStart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GC_AkEventActor_Looping_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Gardening_WaterStart.GC_Gardening_WaterStart_C
// 0x0068 (0x0398 - 0x0330)
class AGC_Gardening_WaterStart_C final : public AGC_AkEventActor_Looping_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AValeriaCharacter*                      ValeriaCharacterOwner;                             // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        WaterPositionXOffset;                              // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WaterPositionYOffset;                              // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      LineTraceObjectTypes;                              // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                GroundLocation;                                    // 0x0360(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ImPouring;                                         // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FDC[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WateringCan_C*                      WateringCan;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        NextWaterTime;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WaterTickTimeslice;                                // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanClientWaterWith(bool* CanWater, const struct FValeriaItem& WateringCanItem, float CallFunc_GetWateringCanRemainingAmount_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, double CallFunc_Greater_DoubleDouble_A_ImplicitCast);
	void ExecuteUbergraph_GC_Gardening_WaterStart(int32 EntryPoint, float CallFunc_GetWateringCanRemainingAmount_ReturnValue, float CallFunc_GetWateringCanTotalCapacity_ReturnValue, float CallFunc_GetWateringCanRemainingPctg_ReturnValue, bool CallFunc_CanClientWaterWith_CanWater, double CallFunc_GetTimeSeconds_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, float K2Node_Event_DeltaSeconds, const struct FVector& CallFunc_GetWaterLocation_Location, TScriptInterface<class IWaterable> CallFunc_FindWaterable_ReturnValue, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue, const struct FVector& CallFunc_GetSnapLocationFromWaterLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, double K2Node_VariableSet_waterCan_curr_ImplicitCast, double K2Node_VariableSet_waterCan_max_ImplicitCast, double K2Node_VariableSet_waterCan_fullness_ImplicitCast);
	void GetWaterLocation(struct FVector* Location, const struct FVector& CallFunc_GetActorRightVector_ReturnValue, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1);
	bool OnRemove(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, bool CallFunc_OnRemove_ReturnValue);
	void PourStart();
	void PourStop();
	void ReceiveTick(float DeltaSeconds);
	void UpdateRTPC(float CallFunc_GetWateringCanRemainingPctg_ReturnValue, double CallFunc_AkSetRTPC_Value_ImplicitCast);
	bool WhileActive(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, int32 Temp_int_Array_Index_Variable, float CallFunc_BreakGameplayCueParameters_NormalizedMagnitude, float CallFunc_BreakGameplayCueParameters_RawMagnitude, const struct FGameplayEffectContextHandle& CallFunc_BreakGameplayCueParameters_EffectContext, const struct FGameplayTag& CallFunc_BreakGameplayCueParameters_MatchedTagName, const struct FGameplayTag& CallFunc_BreakGameplayCueParameters_OriginalTag, const struct FGameplayTagContainer& CallFunc_BreakGameplayCueParameters_AggregatedSourceTags, const struct FGameplayTagContainer& CallFunc_BreakGameplayCueParameters_AggregatedTargetTags, const struct FVector& CallFunc_BreakGameplayCueParameters_Location, const struct FVector& CallFunc_BreakGameplayCueParameters_Normal, class AActor* CallFunc_BreakGameplayCueParameters_Instigator, class AActor* CallFunc_BreakGameplayCueParameters_EffectCauser, class UObject* CallFunc_BreakGameplayCueParameters_SourceObject, class UPhysicalMaterial* CallFunc_BreakGameplayCueParameters_PhysicalMaterial, int32 CallFunc_BreakGameplayCueParameters_GameplayEffectLevel, int32 CallFunc_BreakGameplayCueParameters_AbilityLevel, class USceneComponent* CallFunc_BreakGameplayCueParameters_TargetAttachComponent, bool CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy, class AActor* CallFunc_EffectContextGetInstigatorActor_ReturnValue, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UEquipmentComponent* CallFunc_GetEquipment_ReturnValue, const struct FEquipmentItem& CallFunc_GetEquippedItem_ReturnValue, class AActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class ABP_WateringCan_C* K2Node_DynamicCast_AsBP_Watering_Can, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_Less_IntInt_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Gardening_WaterStart_C">();
	}
	static class AGC_Gardening_WaterStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Gardening_WaterStart_C>();
	}
};
static_assert(alignof(AGC_Gardening_WaterStart_C) == 0x000008, "Wrong alignment on AGC_Gardening_WaterStart_C");
static_assert(sizeof(AGC_Gardening_WaterStart_C) == 0x000398, "Wrong size on AGC_Gardening_WaterStart_C");
static_assert(offsetof(AGC_Gardening_WaterStart_C, UberGraphFrame) == 0x000330, "Member 'AGC_Gardening_WaterStart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Gardening_WaterStart_C, ValeriaCharacterOwner) == 0x000338, "Member 'AGC_Gardening_WaterStart_C::ValeriaCharacterOwner' has a wrong offset!");
static_assert(offsetof(AGC_Gardening_WaterStart_C, WaterPositionXOffset) == 0x000340, "Member 'AGC_Gardening_WaterStart_C::WaterPositionXOffset' has a wrong offset!");
static_assert(offsetof(AGC_Gardening_WaterStart_C, WaterPositionYOffset) == 0x000348, "Member 'AGC_Gardening_WaterStart_C::WaterPositionYOffset' has a wrong offset!");
static_assert(offsetof(AGC_Gardening_WaterStart_C, LineTraceObjectTypes) == 0x000350, "Member 'AGC_Gardening_WaterStart_C::LineTraceObjectTypes' has a wrong offset!");
static_assert(offsetof(AGC_Gardening_WaterStart_C, GroundLocation) == 0x000360, "Member 'AGC_Gardening_WaterStart_C::GroundLocation' has a wrong offset!");
static_assert(offsetof(AGC_Gardening_WaterStart_C, ImPouring) == 0x000378, "Member 'AGC_Gardening_WaterStart_C::ImPouring' has a wrong offset!");
static_assert(offsetof(AGC_Gardening_WaterStart_C, WateringCan) == 0x000380, "Member 'AGC_Gardening_WaterStart_C::WateringCan' has a wrong offset!");
static_assert(offsetof(AGC_Gardening_WaterStart_C, NextWaterTime) == 0x000388, "Member 'AGC_Gardening_WaterStart_C::NextWaterTime' has a wrong offset!");
static_assert(offsetof(AGC_Gardening_WaterStart_C, WaterTickTimeslice) == 0x000390, "Member 'AGC_Gardening_WaterStart_C::WaterTickTimeslice' has a wrong offset!");

}

