#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_ResourceTrackerBase

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_ResourceTrackerBase.GC_ResourceTrackerBase_C.ExecuteUbergraph_GC_ResourceTrackerBase
// 0x0328 (0x0328 - 0x0000)
struct GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D3[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D4[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0068(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Vector_DistanceSquared_ReturnValue;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D5[0x2];                                     // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTrackedItemInfo                       CallFunc_FindClosestResourceTracked_OutClosestItemInfo; // 0x0180(0x0148)()
	EValeriaFuncResult                            CallFunc_FindClosestResourceTracked_OutResult;     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D6[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTrackingComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebuggingOn__IsDebuggingOn;             // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D7[0x1];                                     // 0x02DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D8[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase) == 0x000008, "Wrong alignment on GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase");
static_assert(sizeof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase) == 0x000328, "Wrong size on GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, EntryPoint) == 0x000000, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_FindLookAtRotation_ReturnValue) == 0x000048, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_Vector_Distance_ReturnValue) == 0x000060, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000068, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_Vector_DistanceSquared_ReturnValue) == 0x000150, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_Vector_DistanceSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000158, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_BooleanAND_ReturnValue) == 0x000159, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, K2Node_Event_DeltaSeconds) == 0x00015C, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000160, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_GetPlayerController_ReturnValue_1) == 0x000178, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_FindClosestResourceTracked_OutClosestItemInfo) == 0x000180, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_FindClosestResourceTracked_OutClosestItemInfo' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_FindClosestResourceTracked_OutResult) == 0x0002C8, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_FindClosestResourceTracked_OutResult' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_GetComponentByClass_ReturnValue) == 0x0002D0, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, K2Node_SwitchEnum_CmpSuccess) == 0x0002D8, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_IsValid_ReturnValue_1) == 0x0002D9, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_IsDebuggingOn__IsDebuggingOn) == 0x0002DA, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_IsDebuggingOn__IsDebuggingOn' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, K2Node_CreateDelegate_OutputDelegate) == 0x0002DC, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002F0, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0002F8, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000300, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000308, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_FClamp_ReturnValue) == 0x000310, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000318, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000320, "Member 'GC_ResourceTrackerBase_C_ExecuteUbergraph_GC_ResourceTrackerBase::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");

// Function GC_ResourceTrackerBase.GC_ResourceTrackerBase_C.OnActive
// 0x00E8 (0x00E8 - 0x0000)
struct GC_ResourceTrackerBase_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D9[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventActor_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_ResourceTrackerBase_C_OnActive) == 0x000008, "Wrong alignment on GC_ResourceTrackerBase_C_OnActive");
static_assert(sizeof(GC_ResourceTrackerBase_C_OnActive) == 0x0000E8, "Wrong size on GC_ResourceTrackerBase_C_OnActive");
static_assert(offsetof(GC_ResourceTrackerBase_C_OnActive, MyTarget) == 0x000000, "Member 'GC_ResourceTrackerBase_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_OnActive, Parameters) == 0x000008, "Member 'GC_ResourceTrackerBase_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GC_ResourceTrackerBase_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_OnActive, CallFunc_AkEventActor_ReturnValue) == 0x0000E4, "Member 'GC_ResourceTrackerBase_C_OnActive::CallFunc_AkEventActor_ReturnValue' has a wrong offset!");

// Function GC_ResourceTrackerBase.GC_ResourceTrackerBase_C.OnRemove
// 0x00E8 (0x00E8 - 0x0000)
struct GC_ResourceTrackerBase_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43DA[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventActor_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_ResourceTrackerBase_C_OnRemove) == 0x000008, "Wrong alignment on GC_ResourceTrackerBase_C_OnRemove");
static_assert(sizeof(GC_ResourceTrackerBase_C_OnRemove) == 0x0000E8, "Wrong size on GC_ResourceTrackerBase_C_OnRemove");
static_assert(offsetof(GC_ResourceTrackerBase_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_ResourceTrackerBase_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_OnRemove, Parameters) == 0x000008, "Member 'GC_ResourceTrackerBase_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GC_ResourceTrackerBase_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ResourceTrackerBase_C_OnRemove, CallFunc_AkEventActor_ReturnValue) == 0x0000E4, "Member 'GC_ResourceTrackerBase_C_OnRemove::CallFunc_AkEventActor_ReturnValue' has a wrong offset!");

// Function GC_ResourceTrackerBase.GC_ResourceTrackerBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_ResourceTrackerBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_ResourceTrackerBase_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_ResourceTrackerBase_C_ReceiveTick");
static_assert(sizeof(GC_ResourceTrackerBase_C_ReceiveTick) == 0x000004, "Wrong size on GC_ResourceTrackerBase_C_ReceiveTick");
static_assert(offsetof(GC_ResourceTrackerBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_ResourceTrackerBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GC_ResourceTrackerBase.GC_ResourceTrackerBase_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct GC_ResourceTrackerBase_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_ResourceTrackerBase_C_UserConstructionScript) == 0x000004, "Wrong alignment on GC_ResourceTrackerBase_C_UserConstructionScript");
static_assert(sizeof(GC_ResourceTrackerBase_C_UserConstructionScript) == 0x000004, "Wrong size on GC_ResourceTrackerBase_C_UserConstructionScript");
static_assert(offsetof(GC_ResourceTrackerBase_C_UserConstructionScript, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000000, "Member 'GC_ResourceTrackerBase_C_UserConstructionScript::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

}

