#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SmokeCandle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_SmokeCandle.GC_SmokeCandle_C
// 0x0028 (0x0340 - 0x0318)
class AGC_SmokeCandle_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_hideMe_idle;                                    // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Vfx_root;                                          // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_SmokeCandle(int32 EntryPoint, EEndPlayReason K2Node_Event_EndPlayReason);
	bool OnActive(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, class ABP_ValeriaCharacter_C* K2Node_DynamicCast_AsBP_Valeria_Character, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_AkEventActor_ReturnValue);
	bool OnRemove(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, int32 CallFunc_AkEventActor_ReturnValue);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_SmokeCandle_C">();
	}
	static class AGC_SmokeCandle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_SmokeCandle_C>();
	}
};
static_assert(alignof(AGC_SmokeCandle_C) == 0x000008, "Wrong alignment on AGC_SmokeCandle_C");
static_assert(sizeof(AGC_SmokeCandle_C) == 0x000340, "Wrong size on AGC_SmokeCandle_C");
static_assert(offsetof(AGC_SmokeCandle_C, UberGraphFrame) == 0x000318, "Member 'AGC_SmokeCandle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_SmokeCandle_C, NS_hideMe_idle) == 0x000320, "Member 'AGC_SmokeCandle_C::NS_hideMe_idle' has a wrong offset!");
static_assert(offsetof(AGC_SmokeCandle_C, Vfx_root) == 0x000328, "Member 'AGC_SmokeCandle_C::Vfx_root' has a wrong offset!");
static_assert(offsetof(AGC_SmokeCandle_C, Sphere) == 0x000330, "Member 'AGC_SmokeCandle_C::Sphere' has a wrong offset!");
static_assert(offsetof(AGC_SmokeCandle_C, DefaultSceneRoot) == 0x000338, "Member 'AGC_SmokeCandle_C::DefaultSceneRoot' has a wrong offset!");

}

