#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoudiniEngineRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HoudiniEngineRuntime_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Class HoudiniEngineRuntime.HoudiniAsset
// 0x0028 (0x0050 - 0x0028)
class UHoudiniAsset final : public UObject
{
public:
	class FString                                 AssetFileName;                                     // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 AssetBytes;                                        // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint32                                        AssetBytesCount;                                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetLimitedCommercial;                           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetNonCommercial;                               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetExpanded;                                    // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E74[0x1];                                     // 0x004F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAsset">();
	}
	static class UHoudiniAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAsset>();
	}
};
static_assert(alignof(UHoudiniAsset) == 0x000008, "Wrong alignment on UHoudiniAsset");
static_assert(sizeof(UHoudiniAsset) == 0x000050, "Wrong size on UHoudiniAsset");
static_assert(offsetof(UHoudiniAsset, AssetFileName) == 0x000028, "Member 'UHoudiniAsset::AssetFileName' has a wrong offset!");
static_assert(offsetof(UHoudiniAsset, AssetBytes) == 0x000038, "Member 'UHoudiniAsset::AssetBytes' has a wrong offset!");
static_assert(offsetof(UHoudiniAsset, AssetBytesCount) == 0x000048, "Member 'UHoudiniAsset::AssetBytesCount' has a wrong offset!");
static_assert(offsetof(UHoudiniAsset, bAssetLimitedCommercial) == 0x00004C, "Member 'UHoudiniAsset::bAssetLimitedCommercial' has a wrong offset!");
static_assert(offsetof(UHoudiniAsset, bAssetNonCommercial) == 0x00004D, "Member 'UHoudiniAsset::bAssetNonCommercial' has a wrong offset!");
static_assert(offsetof(UHoudiniAsset, bAssetExpanded) == 0x00004E, "Member 'UHoudiniAsset::bAssetExpanded' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniAssetActor
// 0x0008 (0x02B0 - 0x02A8)
class AHoudiniAssetActor final : public AActor
{
public:
	class UHoudiniAssetComponent*                 HoudiniAssetComponent;                             // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetActor">();
	}
	static class AHoudiniAssetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHoudiniAssetActor>();
	}
};
static_assert(alignof(AHoudiniAssetActor) == 0x000008, "Wrong alignment on AHoudiniAssetActor");
static_assert(sizeof(AHoudiniAssetActor) == 0x0002B0, "Wrong size on AHoudiniAssetActor");
static_assert(offsetof(AHoudiniAssetActor, HoudiniAssetComponent) == 0x0002A8, "Member 'AHoudiniAssetActor::HoudiniAssetComponent' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniAssetComponent
// 0x0550 (0x0AC0 - 0x0570)
class UHoudiniAssetComponent : public UPrimitiveComponent
{
public:
	uint8                                         Pad_2E75[0x8];                                     // 0x0570(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UHoudiniAsset*                          HoudiniAsset;                                      // 0x0578(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnParameterChange;                            // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUploadTransformsToHoudiniEngine;                  // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnTransformChange;                            // 0x0582(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnAssetInputCook;                             // 0x0583(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputless;                                       // 0x0584(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputTemplateGeos;                               // 0x0585(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOutputNodes;                                   // 0x0586(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E76[0x1];                                     // 0x0587(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         TemporaryCookFolder;                               // 0x0588(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         BakeFolder;                                        // 0x0598(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniStaticMeshMethod                      StaticMeshMethod;                                  // 0x05A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSplitMeshSupport;                                 // 0x05A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E77[0x6];                                     // 0x05AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHoudiniStaticMeshGenerationProperties StaticMeshGenerationProperties;                    // 0x05B0(0x01E0)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMeshBuildSettings                     StaticMeshBuildSettings;                           // 0x0790(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideGlobalProxyStaticMeshSettings;            // 0x07D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshOverride;                    // 0x07D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementByTimerOverride;   // 0x07DA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E78[0x1];                                     // 0x07DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProxyMeshAutoRefineTimeoutSecondsOverride;         // 0x07DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementOnPreSaveWorldOverride; // 0x07E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementOnPreBeginPIEOverride; // 0x07E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E79[0x2];                                     // 0x07E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AssetId;                                           // 0x07E4(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                 NodeIdsToCook;                                     // 0x07E8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TMap<int32, int32>                            OutputNodeCookCounts;                              // 0x07F8(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TSet<class UHoudiniAssetComponent*>           DownstreamHoudiniAssets;                           // 0x0848(0x0050)(ExportObject, DuplicateTransient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  ComponentGUID;                                     // 0x0898(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  HapiGUID;                                          // 0x08A8(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 HapiAssetName;                                     // 0x08B8(0x0010)(ZeroConstructor, DuplicateTransient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetState                            AssetState;                                        // 0x08C8(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetState                            DebugLastAssetState;                               // 0x08C9(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetStateResult                      AssetStateResult;                                  // 0x08CA(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E7A[0x5];                                     // 0x08CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LastComponentTransform;                            // 0x08D0(0x0060)(DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        SubAssetIndex;                                     // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AssetCookCount;                                    // 0x0934(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasBeenLoaded;                                    // 0x0938(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasBeenDuplicated;                                // 0x0939(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPendingDelete;                                    // 0x093A(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRecookRequested;                                  // 0x093B(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRebuildRequested;                                 // 0x093C(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableCooking;                                    // 0x093D(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceNeedUpdate;                                  // 0x093E(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLastCookSuccess;                                  // 0x093F(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bParameterDefinitionUpdateNeeded;                  // 0x0940(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlueprintStructureModified;                       // 0x0941(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlueprintModified;                                // 0x0942(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E7B[0x5];                                     // 0x0943(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniParameter*>              Parameters;                                        // 0x0948(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniInput*>                  Inputs;                                            // 0x0958(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniOutput*>                 Outputs;                                           // 0x0968(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FHoudiniBakedOutput>            BakedOutputs;                                      // 0x0978(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          UntrackedOutputs;                                  // 0x0988(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UHoudiniHandleComponent*>        HandleComponents;                                  // 0x0998(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasComponentTransformChanged;                     // 0x09A8(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFullyLoaded;                                      // 0x09A9(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E7C[0x6];                                     // 0x09AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHoudiniPDGAssetLink*                   PDGAssetLink;                                      // 0x09B0(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           RefineMeshesTimer;                                 // 0x09B8(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E7D[0x18];                                    // 0x09C0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bNoProxyMeshNextCookRequested;                     // 0x09D8(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBakeAfterNextCook;                                // 0x09D9(0x0001)(ZeroConstructor, DuplicateTransient, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniBakeAfterNextCook                     BakeAfterNextCook;                                 // 0x09DA(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E7E[0xAD];                                    // 0x09DB(0x00AD)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCachedIsPreview;                                  // 0x0A88(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E7F[0x7];                                     // 0x0A89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastTickTime;                                      // 0x0A90(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E80[0x28];                                    // 0x0A98(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetComponent">();
	}
	static class UHoudiniAssetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetComponent>();
	}
};
static_assert(alignof(UHoudiniAssetComponent) == 0x000010, "Wrong alignment on UHoudiniAssetComponent");
static_assert(sizeof(UHoudiniAssetComponent) == 0x000AC0, "Wrong size on UHoudiniAssetComponent");
static_assert(offsetof(UHoudiniAssetComponent, HoudiniAsset) == 0x000578, "Member 'UHoudiniAssetComponent::HoudiniAsset' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bCookOnParameterChange) == 0x000580, "Member 'UHoudiniAssetComponent::bCookOnParameterChange' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bUploadTransformsToHoudiniEngine) == 0x000581, "Member 'UHoudiniAssetComponent::bUploadTransformsToHoudiniEngine' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bCookOnTransformChange) == 0x000582, "Member 'UHoudiniAssetComponent::bCookOnTransformChange' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bCookOnAssetInputCook) == 0x000583, "Member 'UHoudiniAssetComponent::bCookOnAssetInputCook' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bOutputless) == 0x000584, "Member 'UHoudiniAssetComponent::bOutputless' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bOutputTemplateGeos) == 0x000585, "Member 'UHoudiniAssetComponent::bOutputTemplateGeos' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bUseOutputNodes) == 0x000586, "Member 'UHoudiniAssetComponent::bUseOutputNodes' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, TemporaryCookFolder) == 0x000588, "Member 'UHoudiniAssetComponent::TemporaryCookFolder' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, BakeFolder) == 0x000598, "Member 'UHoudiniAssetComponent::BakeFolder' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, StaticMeshMethod) == 0x0005A8, "Member 'UHoudiniAssetComponent::StaticMeshMethod' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bSplitMeshSupport) == 0x0005A9, "Member 'UHoudiniAssetComponent::bSplitMeshSupport' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, StaticMeshGenerationProperties) == 0x0005B0, "Member 'UHoudiniAssetComponent::StaticMeshGenerationProperties' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, StaticMeshBuildSettings) == 0x000790, "Member 'UHoudiniAssetComponent::StaticMeshBuildSettings' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bOverrideGlobalProxyStaticMeshSettings) == 0x0007D8, "Member 'UHoudiniAssetComponent::bOverrideGlobalProxyStaticMeshSettings' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bEnableProxyStaticMeshOverride) == 0x0007D9, "Member 'UHoudiniAssetComponent::bEnableProxyStaticMeshOverride' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bEnableProxyStaticMeshRefinementByTimerOverride) == 0x0007DA, "Member 'UHoudiniAssetComponent::bEnableProxyStaticMeshRefinementByTimerOverride' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, ProxyMeshAutoRefineTimeoutSecondsOverride) == 0x0007DC, "Member 'UHoudiniAssetComponent::ProxyMeshAutoRefineTimeoutSecondsOverride' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bEnableProxyStaticMeshRefinementOnPreSaveWorldOverride) == 0x0007E0, "Member 'UHoudiniAssetComponent::bEnableProxyStaticMeshRefinementOnPreSaveWorldOverride' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bEnableProxyStaticMeshRefinementOnPreBeginPIEOverride) == 0x0007E1, "Member 'UHoudiniAssetComponent::bEnableProxyStaticMeshRefinementOnPreBeginPIEOverride' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, AssetId) == 0x0007E4, "Member 'UHoudiniAssetComponent::AssetId' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, NodeIdsToCook) == 0x0007E8, "Member 'UHoudiniAssetComponent::NodeIdsToCook' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, OutputNodeCookCounts) == 0x0007F8, "Member 'UHoudiniAssetComponent::OutputNodeCookCounts' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, DownstreamHoudiniAssets) == 0x000848, "Member 'UHoudiniAssetComponent::DownstreamHoudiniAssets' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, ComponentGUID) == 0x000898, "Member 'UHoudiniAssetComponent::ComponentGUID' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, HapiGUID) == 0x0008A8, "Member 'UHoudiniAssetComponent::HapiGUID' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, HapiAssetName) == 0x0008B8, "Member 'UHoudiniAssetComponent::HapiAssetName' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, AssetState) == 0x0008C8, "Member 'UHoudiniAssetComponent::AssetState' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, DebugLastAssetState) == 0x0008C9, "Member 'UHoudiniAssetComponent::DebugLastAssetState' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, AssetStateResult) == 0x0008CA, "Member 'UHoudiniAssetComponent::AssetStateResult' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, LastComponentTransform) == 0x0008D0, "Member 'UHoudiniAssetComponent::LastComponentTransform' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, SubAssetIndex) == 0x000930, "Member 'UHoudiniAssetComponent::SubAssetIndex' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, AssetCookCount) == 0x000934, "Member 'UHoudiniAssetComponent::AssetCookCount' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bHasBeenLoaded) == 0x000938, "Member 'UHoudiniAssetComponent::bHasBeenLoaded' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bHasBeenDuplicated) == 0x000939, "Member 'UHoudiniAssetComponent::bHasBeenDuplicated' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bPendingDelete) == 0x00093A, "Member 'UHoudiniAssetComponent::bPendingDelete' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bRecookRequested) == 0x00093B, "Member 'UHoudiniAssetComponent::bRecookRequested' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bRebuildRequested) == 0x00093C, "Member 'UHoudiniAssetComponent::bRebuildRequested' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bEnableCooking) == 0x00093D, "Member 'UHoudiniAssetComponent::bEnableCooking' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bForceNeedUpdate) == 0x00093E, "Member 'UHoudiniAssetComponent::bForceNeedUpdate' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bLastCookSuccess) == 0x00093F, "Member 'UHoudiniAssetComponent::bLastCookSuccess' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bParameterDefinitionUpdateNeeded) == 0x000940, "Member 'UHoudiniAssetComponent::bParameterDefinitionUpdateNeeded' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bBlueprintStructureModified) == 0x000941, "Member 'UHoudiniAssetComponent::bBlueprintStructureModified' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bBlueprintModified) == 0x000942, "Member 'UHoudiniAssetComponent::bBlueprintModified' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, Parameters) == 0x000948, "Member 'UHoudiniAssetComponent::Parameters' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, Inputs) == 0x000958, "Member 'UHoudiniAssetComponent::Inputs' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, Outputs) == 0x000968, "Member 'UHoudiniAssetComponent::Outputs' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, BakedOutputs) == 0x000978, "Member 'UHoudiniAssetComponent::BakedOutputs' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, UntrackedOutputs) == 0x000988, "Member 'UHoudiniAssetComponent::UntrackedOutputs' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, HandleComponents) == 0x000998, "Member 'UHoudiniAssetComponent::HandleComponents' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bHasComponentTransformChanged) == 0x0009A8, "Member 'UHoudiniAssetComponent::bHasComponentTransformChanged' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bFullyLoaded) == 0x0009A9, "Member 'UHoudiniAssetComponent::bFullyLoaded' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, PDGAssetLink) == 0x0009B0, "Member 'UHoudiniAssetComponent::PDGAssetLink' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, RefineMeshesTimer) == 0x0009B8, "Member 'UHoudiniAssetComponent::RefineMeshesTimer' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bNoProxyMeshNextCookRequested) == 0x0009D8, "Member 'UHoudiniAssetComponent::bNoProxyMeshNextCookRequested' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bBakeAfterNextCook) == 0x0009D9, "Member 'UHoudiniAssetComponent::bBakeAfterNextCook' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, BakeAfterNextCook) == 0x0009DA, "Member 'UHoudiniAssetComponent::BakeAfterNextCook' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bCachedIsPreview) == 0x000A88, "Member 'UHoudiniAssetComponent::bCachedIsPreview' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, LastTickTime) == 0x000A90, "Member 'UHoudiniAssetComponent::LastTickTime' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniAssetBlueprintComponent
// 0x0100 (0x0BC0 - 0x0AC0)
class UHoudiniAssetBlueprintComponent final : public UHoudiniAssetComponent
{
public:
	uint8                                         Pad_2E81[0x48];                                    // 0x0AC0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          FauxBPProperty;                                    // 0x0B08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHoudiniAssetChanged;                              // 0x0B09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdatedFromTemplate;                              // 0x0B0A(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInBlueprintEditor;                              // 0x0B0B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanDeleteHoudiniNodes;                            // 0x0B0C(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasRegisteredComponentTemplate;                   // 0x0B0D(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E82[0xA];                                     // 0x0B0E(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FHoudiniOutputObjectIdentifier, struct FGuid> CachedOutputNodes;                                 // 0x0B18(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, struct FGuid>              CachedInputNodes;                                  // 0x0B68(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E83[0x8];                                     // 0x0BB8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool HasParameter(const class FString& Param_Name);
	void SetFloatParameter(const class FString& Param_Name, float Value, int32 Param_Index);
	void SetToggleValueAt(const class FString& Param_Name, bool Value, int32 Param_Index);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetBlueprintComponent">();
	}
	static class UHoudiniAssetBlueprintComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetBlueprintComponent>();
	}
};
static_assert(alignof(UHoudiniAssetBlueprintComponent) == 0x000010, "Wrong alignment on UHoudiniAssetBlueprintComponent");
static_assert(sizeof(UHoudiniAssetBlueprintComponent) == 0x000BC0, "Wrong size on UHoudiniAssetBlueprintComponent");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, FauxBPProperty) == 0x000B08, "Member 'UHoudiniAssetBlueprintComponent::FauxBPProperty' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, bHoudiniAssetChanged) == 0x000B09, "Member 'UHoudiniAssetBlueprintComponent::bHoudiniAssetChanged' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, bUpdatedFromTemplate) == 0x000B0A, "Member 'UHoudiniAssetBlueprintComponent::bUpdatedFromTemplate' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, bIsInBlueprintEditor) == 0x000B0B, "Member 'UHoudiniAssetBlueprintComponent::bIsInBlueprintEditor' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, bCanDeleteHoudiniNodes) == 0x000B0C, "Member 'UHoudiniAssetBlueprintComponent::bCanDeleteHoudiniNodes' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, bHasRegisteredComponentTemplate) == 0x000B0D, "Member 'UHoudiniAssetBlueprintComponent::bHasRegisteredComponentTemplate' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, CachedOutputNodes) == 0x000B18, "Member 'UHoudiniAssetBlueprintComponent::CachedOutputNodes' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, CachedInputNodes) == 0x000B68, "Member 'UHoudiniAssetBlueprintComponent::CachedInputNodes' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniEngineCopyPropertiesInterface
// 0x0000 (0x0028 - 0x0028)
class IHoudiniEngineCopyPropertiesInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniEngineCopyPropertiesInterface">();
	}
	static class IHoudiniEngineCopyPropertiesInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHoudiniEngineCopyPropertiesInterface>();
	}
};
static_assert(alignof(IHoudiniEngineCopyPropertiesInterface) == 0x000008, "Wrong alignment on IHoudiniEngineCopyPropertiesInterface");
static_assert(sizeof(IHoudiniEngineCopyPropertiesInterface) == 0x000028, "Wrong size on IHoudiniEngineCopyPropertiesInterface");

// Class HoudiniEngineRuntime.HoudiniEngineEditorSettings
// 0x0000 (0x0038 - 0x0038)
class UHoudiniEngineEditorSettings final : public UDeveloperSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniEngineEditorSettings">();
	}
	static class UHoudiniEngineEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniEngineEditorSettings>();
	}
};
static_assert(alignof(UHoudiniEngineEditorSettings) == 0x000008, "Wrong alignment on UHoudiniEngineEditorSettings");
static_assert(sizeof(UHoudiniEngineEditorSettings) == 0x000038, "Wrong size on UHoudiniEngineEditorSettings");

// Class HoudiniEngineRuntime.HoudiniHandleParameter
// 0x0010 (0x0038 - 0x0028)
class UHoudiniHandleParameter final : public UObject
{
public:
	class UHoudiniParameter*                      AssetParameter;                                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TupleIndex;                                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E86[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniHandleParameter">();
	}
	static class UHoudiniHandleParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniHandleParameter>();
	}
};
static_assert(alignof(UHoudiniHandleParameter) == 0x000008, "Wrong alignment on UHoudiniHandleParameter");
static_assert(sizeof(UHoudiniHandleParameter) == 0x000038, "Wrong size on UHoudiniHandleParameter");
static_assert(offsetof(UHoudiniHandleParameter, AssetParameter) == 0x000028, "Member 'UHoudiniHandleParameter::AssetParameter' has a wrong offset!");
static_assert(offsetof(UHoudiniHandleParameter, TupleIndex) == 0x000030, "Member 'UHoudiniHandleParameter::TupleIndex' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniHandleComponent
// 0x0040 (0x02E0 - 0x02A0)
class UHoudiniHandleComponent final : public USceneComponent
{
public:
	TArray<class UHoudiniHandleParameter*>        XformParms;                                        // 0x02A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UHoudiniHandleParameter*                RSTParm;                                           // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHoudiniHandleParameter*                RotOrderParm;                                      // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniHandleType                            HandleType;                                        // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E87[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 HandleName;                                        // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E88[0x8];                                     // 0x02D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniHandleComponent">();
	}
	static class UHoudiniHandleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniHandleComponent>();
	}
};
static_assert(alignof(UHoudiniHandleComponent) == 0x000010, "Wrong alignment on UHoudiniHandleComponent");
static_assert(sizeof(UHoudiniHandleComponent) == 0x0002E0, "Wrong size on UHoudiniHandleComponent");
static_assert(offsetof(UHoudiniHandleComponent, XformParms) == 0x0002A0, "Member 'UHoudiniHandleComponent::XformParms' has a wrong offset!");
static_assert(offsetof(UHoudiniHandleComponent, RSTParm) == 0x0002B0, "Member 'UHoudiniHandleComponent::RSTParm' has a wrong offset!");
static_assert(offsetof(UHoudiniHandleComponent, RotOrderParm) == 0x0002B8, "Member 'UHoudiniHandleComponent::RotOrderParm' has a wrong offset!");
static_assert(offsetof(UHoudiniHandleComponent, HandleType) == 0x0002C0, "Member 'UHoudiniHandleComponent::HandleType' has a wrong offset!");
static_assert(offsetof(UHoudiniHandleComponent, HandleName) == 0x0002C8, "Member 'UHoudiniHandleComponent::HandleName' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniInput
// 0x0248 (0x0270 - 0x0028)
class UHoudiniInput final : public UObject
{
public:
	class FString                                 Name_HoudiniInput;                                 // 0x0028(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 Label;                                             // 0x0038(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniInputType                             Type;                                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniInputType                             PreviousType;                                      // 0x0049(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E89[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AssetNodeId;                                       // 0x004C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InputNodeId;                                       // 0x0050(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InputIndex;                                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ParmId;                                            // 0x0058(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsObjectPathParameter;                            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8A[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CreatedDataNodeIds;                                // 0x0060(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasChanged;                                       // 0x0070(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeedsToTriggerUpdate;                             // 0x0071(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8B[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CachedBounds;                                      // 0x0078(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FString                                 Help;                                              // 0x00B0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniXformType                             KeepWorldTransform;                                // 0x00C0(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPackBeforeMerge;                                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bImportAsReference;                                // 0x00C2(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bImportAsReferenceRotScaleEnabled;                 // 0x00C3(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bImportAsReferenceBboxEnabled;                     // 0x00C4(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bImportAsReferenceMaterialEnabled;                 // 0x00C5(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportLODs;                                       // 0x00C6(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportSockets;                                    // 0x00C7(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPreferNaniteFallbackMesh;                         // 0x00C8(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportColliders;                                  // 0x00C9(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportMaterialParameters;                         // 0x00CA(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDirectlyConnectHdas;                              // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportOptionsMenuExpanded;                        // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGeometryInputsMenuExpanded;                       // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLandscapeOptionsMenuExpanded;                     // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWorldInputsMenuExpanded;                          // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCurveInputsMenuExpanded;                          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCurvePointSelectionMenuExpanded;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCurvePointSelectionUseAbsLocation;                // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCurvePointSelectionUseAbsRotation;                // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCookOnCurveChanged;                               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8C[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            GeometryInputObjects;                              // 0x00D8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bStaticMeshChanged;                                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8D[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            AssetInputObjects;                                 // 0x00F0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bInputAssetConnectedInHoudini;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8E[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            CurveInputObjects;                                 // 0x0108(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         DefaultCurveOffset;                                // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAddRotAndScaleAttributesOnCurves;                 // 0x011C(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseLegacyInputCurves;                             // 0x011D(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8F[0x2];                                     // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            LandscapeInputObjects;                             // 0x0120(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bLandscapeHasExportTypeChanged;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E90[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            WorldInputObjects;                                 // 0x0138(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         WorldInputBoundSelectorObjects;                    // 0x0148(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsWorldInputBoundSelector;                        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWorldInputBoundSelectorAutoUpdate;                // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E91[0x2];                                     // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UnrealSplineResolution;                            // 0x015C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UHoudiniInputObject*>            SkeletalInputObjects;                              // 0x0160(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniInputObject*>            GeometryCollectionInputObjects;                    // 0x0170(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSet<class ULandscapeComponent*>              LandscapeSelectedComponents;                       // 0x0180(0x0050)(ExportObject, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSet<int32>                                   InputNodesPendingDelete;                           // 0x01D0(0x0050)(Transient, DuplicateTransient, NonTransactional, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniInputHoudiniSplineComponent*> LastInsertedInputs;                                // 0x0220(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	TArray<class UHoudiniInputObject*>            LastUndoDeletedInputs;                             // 0x0230(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NativeAccessSpecifierPublic)
	bool                                          bUpdateInputLandscape;                             // 0x0240(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniLandscapeExportType                   LandscapeExportType;                               // 0x0241(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportSelectionOnly;                     // 0x0242(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeControlVisiblity;                        // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeAutoSelectComponent;                     // 0x0244(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportMaterials;                         // 0x0245(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportLighting;                          // 0x0246(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportNormalizedUVs;                     // 0x0247(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportTileUVs;                           // 0x0248(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanDeleteHoudiniNodes;                            // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeAutoSelectSplines;                       // 0x024A(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLandscapeSplinesExportOptionsMenuExpanded;        // 0x024B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLandscapeSplinesExportControlPoints;              // 0x024C(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLandscapeSplinesExportLeftRightCurves;            // 0x024D(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLandscapeSplinesExportSplineMeshComponents;       // 0x024E(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMergeSplineMeshComponents;                        // 0x024F(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FHoudiniInputObjectSettings            InputSettings;                                     // 0x0250(0x0020)(NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniInput">();
	}
	static class UHoudiniInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInput>();
	}
};
static_assert(alignof(UHoudiniInput) == 0x000008, "Wrong alignment on UHoudiniInput");
static_assert(sizeof(UHoudiniInput) == 0x000270, "Wrong size on UHoudiniInput");
static_assert(offsetof(UHoudiniInput, Name_HoudiniInput) == 0x000028, "Member 'UHoudiniInput::Name_HoudiniInput' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, Label) == 0x000038, "Member 'UHoudiniInput::Label' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, Type) == 0x000048, "Member 'UHoudiniInput::Type' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, PreviousType) == 0x000049, "Member 'UHoudiniInput::PreviousType' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, AssetNodeId) == 0x00004C, "Member 'UHoudiniInput::AssetNodeId' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, InputNodeId) == 0x000050, "Member 'UHoudiniInput::InputNodeId' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, InputIndex) == 0x000054, "Member 'UHoudiniInput::InputIndex' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, ParmId) == 0x000058, "Member 'UHoudiniInput::ParmId' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, bIsObjectPathParameter) == 0x00005C, "Member 'UHoudiniInput::bIsObjectPathParameter' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, CreatedDataNodeIds) == 0x000060, "Member 'UHoudiniInput::CreatedDataNodeIds' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, bHasChanged) == 0x000070, "Member 'UHoudiniInput::bHasChanged' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, bNeedsToTriggerUpdate) == 0x000071, "Member 'UHoudiniInput::bNeedsToTriggerUpdate' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, CachedBounds) == 0x000078, "Member 'UHoudiniInput::CachedBounds' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, Help) == 0x0000B0, "Member 'UHoudiniInput::Help' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, KeepWorldTransform) == 0x0000C0, "Member 'UHoudiniInput::KeepWorldTransform' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, bPackBeforeMerge) == 0x0000C1, "Member 'UHoudiniInput::bPackBeforeMerge' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, bImportAsReference) == 0x0000C2, "Member 'UHoudiniInput::bImportAsReference' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, bImportAsReferenceRotScaleEnabled) == 0x0000C3, "Member 'UHoudiniInput::bImportAsReferenceRotScaleEnabled' has a wrong offset!");
static_assert(offsetof(UHoudiniInput, bImportAsReferenceBboxEnabled) == 0x0000C4, "Member 'UHoudiniInput::bImportAsReferenceBboxEnabled' has a wrong offset!");
