#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lib_Audio

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Palia_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "E_Footwear_structs.hpp"


namespace SDK::Params
{

// Function Lib_Audio.Lib_Audio_C.ReturnToAreaMusic
// 0x0060 (0x0060 - 0x0000)
struct Lib_Audio_C_ReturnToAreaMusic final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaSpatialAudioVolume*             LHighestVolume;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	float                                         LHighestPriority;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452B[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAkRoomComponent*>               CallFunc_GetAudioRoomComponents_ReturnValue;       // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452C[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkRoomComponent*                       CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UComp_CV_Local_Music_C*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452D[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_Audio_C_ReturnToAreaMusic) == 0x000008, "Wrong alignment on Lib_Audio_C_ReturnToAreaMusic");
static_assert(sizeof(Lib_Audio_C_ReturnToAreaMusic) == 0x000060, "Wrong size on Lib_Audio_C_ReturnToAreaMusic");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, __WorldContext) == 0x000000, "Member 'Lib_Audio_C_ReturnToAreaMusic::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, LHighestVolume) == 0x000008, "Member 'Lib_Audio_C_ReturnToAreaMusic::LHighestVolume' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, LHighestPriority) == 0x000010, "Member 'Lib_Audio_C_ReturnToAreaMusic::LHighestPriority' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, Temp_bool_True_if_break_was_hit_Variable) == 0x000014, "Member 'Lib_Audio_C_ReturnToAreaMusic::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_GetAudioRoomComponents_ReturnValue) == 0x000018, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_GetAudioRoomComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_Greater_IntInt_ReturnValue) == 0x000031, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, Temp_int_Array_Index_Variable) == 0x000034, "Member 'Lib_Audio_C_ReturnToAreaMusic::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_Array_Get_Item) == 0x000038, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'Lib_Audio_C_ReturnToAreaMusic::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_BooleanAND_ReturnValue) == 0x00005C, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_ReturnToAreaMusic, CallFunc_IsValid_ReturnValue) == 0x00005D, "Member 'Lib_Audio_C_ReturnToAreaMusic::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Lib_Audio.Lib_Audio_C.GetMusicManager
// 0x0040 (0x0040 - 0x0000)
struct Lib_Audio_C_GetMusicManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MusicManager_C*                     AsBP_Music_Manager;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameInstance*                   K2Node_DynamicCast_AsValeria_Game_Instance;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMusicManager*                          CallFunc_GetMusicManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MusicManager_C*                     K2Node_DynamicCast_AsBP_Music_Manager;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_Audio_C_GetMusicManager) == 0x000008, "Wrong alignment on Lib_Audio_C_GetMusicManager");
static_assert(sizeof(Lib_Audio_C_GetMusicManager) == 0x000040, "Wrong size on Lib_Audio_C_GetMusicManager");
static_assert(offsetof(Lib_Audio_C_GetMusicManager, __WorldContext) == 0x000000, "Member 'Lib_Audio_C_GetMusicManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetMusicManager, AsBP_Music_Manager) == 0x000008, "Member 'Lib_Audio_C_GetMusicManager::AsBP_Music_Manager' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetMusicManager, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'Lib_Audio_C_GetMusicManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetMusicManager, K2Node_DynamicCast_AsValeria_Game_Instance) == 0x000018, "Member 'Lib_Audio_C_GetMusicManager::K2Node_DynamicCast_AsValeria_Game_Instance' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetMusicManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Lib_Audio_C_GetMusicManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetMusicManager, CallFunc_GetMusicManager_ReturnValue) == 0x000028, "Member 'Lib_Audio_C_GetMusicManager::CallFunc_GetMusicManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetMusicManager, K2Node_DynamicCast_AsBP_Music_Manager) == 0x000030, "Member 'Lib_Audio_C_GetMusicManager::K2Node_DynamicCast_AsBP_Music_Manager' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetMusicManager, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'Lib_Audio_C_GetMusicManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function Lib_Audio.Lib_Audio_C.Try to Propagate Rtpcs
// 0x0030 (0x0030 - 0x0000)
struct Lib_Audio_C_Try_to_Propagate_Rtpcs final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           AkComponent;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UComp_RtpcTracker_C*                    Tracker;                                           // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryToPropagateRtpcs_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_Audio_C_Try_to_Propagate_Rtpcs) == 0x000008, "Wrong alignment on Lib_Audio_C_Try_to_Propagate_Rtpcs");
static_assert(sizeof(Lib_Audio_C_Try_to_Propagate_Rtpcs) == 0x000030, "Wrong size on Lib_Audio_C_Try_to_Propagate_Rtpcs");
static_assert(offsetof(Lib_Audio_C_Try_to_Propagate_Rtpcs, Actor) == 0x000000, "Member 'Lib_Audio_C_Try_to_Propagate_Rtpcs::Actor' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Try_to_Propagate_Rtpcs, AkComponent) == 0x000008, "Member 'Lib_Audio_C_Try_to_Propagate_Rtpcs::AkComponent' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Try_to_Propagate_Rtpcs, __WorldContext) == 0x000010, "Member 'Lib_Audio_C_Try_to_Propagate_Rtpcs::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Try_to_Propagate_Rtpcs, Success) == 0x000018, "Member 'Lib_Audio_C_Try_to_Propagate_Rtpcs::Success' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Try_to_Propagate_Rtpcs, Tracker) == 0x000020, "Member 'Lib_Audio_C_Try_to_Propagate_Rtpcs::Tracker' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Try_to_Propagate_Rtpcs, CallFunc_TryToPropagateRtpcs_ReturnValue) == 0x000028, "Member 'Lib_Audio_C_Try_to_Propagate_Rtpcs::CallFunc_TryToPropagateRtpcs_ReturnValue' has a wrong offset!");

// Function Lib_Audio.Lib_Audio_C.AkGetComponent
// 0x0058 (0x0058 - 0x0000)
struct Lib_Audio_C_AkGetComponent final
{
public:
	class USceneComponent*                        AttachToComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachPointName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachLocation                               LocationType;                                      // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoDestroy;                                      // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4530[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ComponentCreated;                                  // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4531[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           AkComponent;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VAkGetComponent_ComponentCreated;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4532[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_VAkGetComponent_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_Audio_C_AkGetComponent) == 0x000008, "Wrong alignment on Lib_Audio_C_AkGetComponent");
static_assert(sizeof(Lib_Audio_C_AkGetComponent) == 0x000058, "Wrong size on Lib_Audio_C_AkGetComponent");
static_assert(offsetof(Lib_Audio_C_AkGetComponent, AttachToComponent) == 0x000000, "Member 'Lib_Audio_C_AkGetComponent::AttachToComponent' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkGetComponent, AttachPointName) == 0x000008, "Member 'Lib_Audio_C_AkGetComponent::AttachPointName' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkGetComponent, Location) == 0x000010, "Member 'Lib_Audio_C_AkGetComponent::Location' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkGetComponent, LocationType) == 0x000028, "Member 'Lib_Audio_C_AkGetComponent::LocationType' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkGetComponent, bAutoDestroy) == 0x000029, "Member 'Lib_Audio_C_AkGetComponent::bAutoDestroy' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkGetComponent, __WorldContext) == 0x000030, "Member 'Lib_Audio_C_AkGetComponent::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkGetComponent, ComponentCreated) == 0x000038, "Member 'Lib_Audio_C_AkGetComponent::ComponentCreated' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkGetComponent, AkComponent) == 0x000040, "Member 'Lib_Audio_C_AkGetComponent::AkComponent' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkGetComponent, CallFunc_VAkGetComponent_ComponentCreated) == 0x000048, "Member 'Lib_Audio_C_AkGetComponent::CallFunc_VAkGetComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkGetComponent, CallFunc_VAkGetComponent_ReturnValue) == 0x000050, "Member 'Lib_Audio_C_AkGetComponent::CallFunc_VAkGetComponent_ReturnValue' has a wrong offset!");

// Function Lib_Audio.Lib_Audio_C.AkExecuteActionOnPlayingID
// 0x0018 (0x0018 - 0x0000)
struct Lib_Audio_C_AkExecuteActionOnPlayingID final
{
public:
	EAkActionOnEventType                          ActionType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4533[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayingID;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TransitionDuration;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkCurveInterpolation                         FadeCurve;                                         // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4534[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_Audio_C_AkExecuteActionOnPlayingID) == 0x000008, "Wrong alignment on Lib_Audio_C_AkExecuteActionOnPlayingID");
static_assert(sizeof(Lib_Audio_C_AkExecuteActionOnPlayingID) == 0x000018, "Wrong size on Lib_Audio_C_AkExecuteActionOnPlayingID");
static_assert(offsetof(Lib_Audio_C_AkExecuteActionOnPlayingID, ActionType) == 0x000000, "Member 'Lib_Audio_C_AkExecuteActionOnPlayingID::ActionType' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkExecuteActionOnPlayingID, PlayingID) == 0x000004, "Member 'Lib_Audio_C_AkExecuteActionOnPlayingID::PlayingID' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkExecuteActionOnPlayingID, TransitionDuration) == 0x000008, "Member 'Lib_Audio_C_AkExecuteActionOnPlayingID::TransitionDuration' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkExecuteActionOnPlayingID, FadeCurve) == 0x00000C, "Member 'Lib_Audio_C_AkExecuteActionOnPlayingID::FadeCurve' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_AkExecuteActionOnPlayingID, __WorldContext) == 0x000010, "Member 'Lib_Audio_C_AkExecuteActionOnPlayingID::__WorldContext' has a wrong offset!");

// Function Lib_Audio.Lib_Audio_C.IsWet
// 0x0068 (0x0068 - 0x0000)
struct Lib_Audio_C_IsWet final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsWet;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4535[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaWeather*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInside_IsInside;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4536[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeatherStateProperties                CallFunc_GetCurrentWorldWeatherState_ReturnValue;  // 0x0038(0x0028)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_Audio_C_IsWet) == 0x000008, "Wrong alignment on Lib_Audio_C_IsWet");
static_assert(sizeof(Lib_Audio_C_IsWet) == 0x000068, "Wrong size on Lib_Audio_C_IsWet");
static_assert(offsetof(Lib_Audio_C_IsWet, Location) == 0x000000, "Member 'Lib_Audio_C_IsWet::Location' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_IsWet, __WorldContext) == 0x000018, "Member 'Lib_Audio_C_IsWet::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_IsWet, Param_IsWet) == 0x000020, "Member 'Lib_Audio_C_IsWet::Param_IsWet' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_IsWet, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000028, "Member 'Lib_Audio_C_IsWet::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_IsWet, CallFunc_IsInside_IsInside) == 0x000030, "Member 'Lib_Audio_C_IsWet::CallFunc_IsInside_IsInside' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_IsWet, CallFunc_GetCurrentWorldWeatherState_ReturnValue) == 0x000038, "Member 'Lib_Audio_C_IsWet::CallFunc_GetCurrentWorldWeatherState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_IsWet, CallFunc_HasTag_ReturnValue) == 0x000060, "Member 'Lib_Audio_C_IsWet::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function Lib_Audio.Lib_Audio_C.GetAkAudioRoomAtLocation
// 0x0170 (0x0170 - 0x0000)
struct Lib_Audio_C_GetAkAudioRoomAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkRoomComponent*                       HighestPriorityRoom;                               // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UAkRoomComponent*>               AllRooms;                                          // 0x0028(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UAkRoomComponent*>               LRoomComponents;                                   // 0x0038(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UAkRoomComponent*                       LHighestPriorityRoom;                              // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        LHighestPriority;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkRoomComponent*                       CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4537[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0098(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	TArray<class UPrimitiveComponent*>            CallFunc_SphereOverlapComponents_OutComponents;    // 0x00C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereOverlapComponents_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4538[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4539[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_2;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_453A[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkRoomComponent*                       K2Node_DynamicCast_AsAk_Room_Component;            // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_453B[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_453C[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0128(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_453D[0x6];                                     // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaSpatialAudioVolume*             K2Node_DynamicCast_AsValeria_Spatial_Audio_Volume; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_453E[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_453F[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_LHighestPriority_ImplicitCast;  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_Audio_C_GetAkAudioRoomAtLocation) == 0x000008, "Wrong alignment on Lib_Audio_C_GetAkAudioRoomAtLocation");
static_assert(sizeof(Lib_Audio_C_GetAkAudioRoomAtLocation) == 0x000170, "Wrong size on Lib_Audio_C_GetAkAudioRoomAtLocation");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, Location) == 0x000000, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::Location' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, __WorldContext) == 0x000018, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, HighestPriorityRoom) == 0x000020, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::HighestPriorityRoom' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, AllRooms) == 0x000028, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::AllRooms' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, LRoomComponents) == 0x000038, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::LRoomComponents' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, LHighestPriorityRoom) == 0x000048, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::LHighestPriorityRoom' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, LHighestPriority) == 0x000050, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::LHighestPriority' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, Temp_int_Loop_Counter_Variable_1) == 0x00005C, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, Temp_int_Loop_Counter_Variable_2) == 0x000068, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Add_IntInt_ReturnValue_2) == 0x00006C, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, Temp_int_Array_Index_Variable) == 0x000070, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, Temp_int_Array_Index_Variable_1) == 0x000074, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, Temp_int_Array_Index_Variable_2) == 0x000078, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, Temp_int_Loop_Counter_Variable_3) == 0x00007C, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Add_IntInt_ReturnValue_3) == 0x000080, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, Temp_int_Array_Index_Variable_3) == 0x000084, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Array_Get_Item) == 0x000088, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, Temp_object_Variable) == 0x000098, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, Temp_object_Variable_1) == 0x0000A8, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, K2Node_MakeArray_Array) == 0x0000B8, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_SphereOverlapComponents_OutComponents) == 0x0000C8, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_SphereOverlapComponents_OutComponents' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_SphereOverlapComponents_ReturnValue) == 0x0000D8, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_SphereOverlapComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000D9, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_GetChildrenComponents_Children) == 0x0000E8, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Array_Length_ReturnValue_1) == 0x0000F8, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Array_Get_Item_2) == 0x000100, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Less_IntInt_ReturnValue_1) == 0x000108, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, K2Node_DynamicCast_AsAk_Room_Component) == 0x000110, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::K2Node_DynamicCast_AsAk_Room_Component' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Array_AddUnique_ReturnValue) == 0x00011C, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Array_Length_ReturnValue_2) == 0x000120, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_SphereOverlapActors_OutActors) == 0x000128, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_SphereOverlapActors_ReturnValue) == 0x000138, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Less_IntInt_ReturnValue_2) == 0x000139, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Array_Get_Item_3) == 0x000140, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, K2Node_DynamicCast_AsValeria_Spatial_Audio_Volume) == 0x000148, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::K2Node_DynamicCast_AsValeria_Spatial_Audio_Volume' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Array_Length_ReturnValue_3) == 0x000154, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Less_IntInt_ReturnValue_3) == 0x000158, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Array_AddUnique_ReturnValue_1) == 0x00015C, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000160, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_GetAkAudioRoomAtLocation, K2Node_VariableSet_LHighestPriority_ImplicitCast) == 0x000168, "Member 'Lib_Audio_C_GetAkAudioRoomAtLocation::K2Node_VariableSet_LHighestPriority_ImplicitCast' has a wrong offset!");

// Function Lib_Audio.Lib_Audio_C.PlayTempBeep
// 0x0040 (0x0040 - 0x0000)
struct Lib_Audio_C_PlayTempBeep final
{
public:
	bool                                          Global;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4540[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BuildIsShipping_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4541[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_AkEventLocation_AkComponent;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventLocation_Playing_ID;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_Audio_C_PlayTempBeep) == 0x000008, "Wrong alignment on Lib_Audio_C_PlayTempBeep");
static_assert(sizeof(Lib_Audio_C_PlayTempBeep) == 0x000040, "Wrong size on Lib_Audio_C_PlayTempBeep");
static_assert(offsetof(Lib_Audio_C_PlayTempBeep, Global) == 0x000000, "Member 'Lib_Audio_C_PlayTempBeep::Global' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_PlayTempBeep, Location) == 0x000008, "Member 'Lib_Audio_C_PlayTempBeep::Location' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_PlayTempBeep, __WorldContext) == 0x000020, "Member 'Lib_Audio_C_PlayTempBeep::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_PlayTempBeep, ReturnValue) == 0x000028, "Member 'Lib_Audio_C_PlayTempBeep::ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_PlayTempBeep, CallFunc_BuildIsShipping_ReturnValue) == 0x00002C, "Member 'Lib_Audio_C_PlayTempBeep::CallFunc_BuildIsShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_PlayTempBeep, CallFunc_AkEventLocation_AkComponent) == 0x000030, "Member 'Lib_Audio_C_PlayTempBeep::CallFunc_AkEventLocation_AkComponent' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_PlayTempBeep, CallFunc_AkEventLocation_Playing_ID) == 0x000038, "Member 'Lib_Audio_C_PlayTempBeep::CallFunc_AkEventLocation_Playing_ID' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_PlayTempBeep, CallFunc_AkEventGlobal_ReturnValue) == 0x00003C, "Member 'Lib_Audio_C_PlayTempBeep::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");

// Function Lib_Audio.Lib_Audio_C.LoadAudioUserSettings
// 0x0070 (0x0070 - 0x0000)
struct Lib_Audio_C_LoadAudioUserSettings final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkStateValue*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkStateValue*                          Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkStateValue*                          Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAudioMixProfiles                             Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4542[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4543[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkStateValue*                          K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AkSetRTPC_Value_ImplicitCast;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AkSetRTPC_Value_ImplicitCast_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AkSetRTPC_Value_ImplicitCast_2;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AkSetRTPC_Value_ImplicitCast_3;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_Audio_C_LoadAudioUserSettings) == 0x000008, "Wrong alignment on Lib_Audio_C_LoadAudioUserSettings");
static_assert(sizeof(Lib_Audio_C_LoadAudioUserSettings) == 0x000070, "Wrong size on Lib_Audio_C_LoadAudioUserSettings");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, __WorldContext) == 0x000000, "Member 'Lib_Audio_C_LoadAudioUserSettings::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, Temp_object_Variable) == 0x000008, "Member 'Lib_Audio_C_LoadAudioUserSettings::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, Temp_object_Variable_1) == 0x000010, "Member 'Lib_Audio_C_LoadAudioUserSettings::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, Temp_object_Variable_2) == 0x000018, "Member 'Lib_Audio_C_LoadAudioUserSettings::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, Temp_byte_Variable) == 0x000020, "Member 'Lib_Audio_C_LoadAudioUserSettings::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000028, "Member 'Lib_Audio_C_LoadAudioUserSettings::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Lib_Audio_C_LoadAudioUserSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, K2Node_Select_Default) == 0x000038, "Member 'Lib_Audio_C_LoadAudioUserSettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, CallFunc_SelectFloat_ReturnValue) == 0x000040, "Member 'Lib_Audio_C_LoadAudioUserSettings::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, CallFunc_AkSetRTPC_Value_ImplicitCast) == 0x000048, "Member 'Lib_Audio_C_LoadAudioUserSettings::CallFunc_AkSetRTPC_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, CallFunc_AkSetRTPC_Value_ImplicitCast_1) == 0x000050, "Member 'Lib_Audio_C_LoadAudioUserSettings::CallFunc_AkSetRTPC_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, CallFunc_AkSetRTPC_Value_ImplicitCast_2) == 0x000058, "Member 'Lib_Audio_C_LoadAudioUserSettings::CallFunc_AkSetRTPC_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, CallFunc_AkSetRTPC_Value_ImplicitCast_3) == 0x000060, "Member 'Lib_Audio_C_LoadAudioUserSettings::CallFunc_AkSetRTPC_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_LoadAudioUserSettings, CallFunc_SelectFloat_A_ImplicitCast) == 0x000068, "Member 'Lib_Audio_C_LoadAudioUserSettings::CallFunc_SelectFloat_A_ImplicitCast' has a wrong offset!");

// Function Lib_Audio.Lib_Audio_C.Ak Music Switch
// 0x0050 (0x0050 - 0x0000)
struct Lib_Audio_C_Ak_Music_Switch final
{
public:
	class UAkSwitchValue*                         SwitchValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreTimeOfDay;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4544[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4545[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MusicManager_C*                     CallFunc_GetMusicManager_AsBP_Music_Manager;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4546[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UComp_Listener_Padding_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_Audio_C_Ak_Music_Switch) == 0x000008, "Wrong alignment on Lib_Audio_C_Ak_Music_Switch");
static_assert(sizeof(Lib_Audio_C_Ak_Music_Switch) == 0x000050, "Wrong size on Lib_Audio_C_Ak_Music_Switch");
static_assert(offsetof(Lib_Audio_C_Ak_Music_Switch, SwitchValue) == 0x000000, "Member 'Lib_Audio_C_Ak_Music_Switch::SwitchValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Ak_Music_Switch, IgnoreTimeOfDay) == 0x000008, "Member 'Lib_Audio_C_Ak_Music_Switch::IgnoreTimeOfDay' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Ak_Music_Switch, __WorldContext) == 0x000010, "Member 'Lib_Audio_C_Ak_Music_Switch::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Ak_Music_Switch, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'Lib_Audio_C_Ak_Music_Switch::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Ak_Music_Switch, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'Lib_Audio_C_Ak_Music_Switch::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Ak_Music_Switch, CallFunc_K2_GetPawn_ReturnValue) == 0x000028, "Member 'Lib_Audio_C_Ak_Music_Switch::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Ak_Music_Switch, CallFunc_GetMusicManager_AsBP_Music_Manager) == 0x000030, "Member 'Lib_Audio_C_Ak_Music_Switch::CallFunc_GetMusicManager_AsBP_Music_Manager' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Ak_Music_Switch, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'Lib_Audio_C_Ak_Music_Switch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_Audio_C_Ak_Music_Switch, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'Lib_Audio_C_Ak_Music_Switch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
