#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ListEntry_CharacterCustomization_FilteringDropdownMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function ListEntry_CharacterCustomization_FilteringDropdownMenu.ListEntry_CharacterCustomization_FilteringDropdownMenu_C.HasTagOptions
// 0x000C (0x000C - 0x0000)
struct ListEntry_CharacterCustomization_FilteringDropdownMenu_C_HasTagOptions final
{
public:
	bool                                          HasOptions;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ListEntry_CharacterCustomization_FilteringDropdownMenu_C_HasTagOptions) == 0x000004, "Wrong alignment on ListEntry_CharacterCustomization_FilteringDropdownMenu_C_HasTagOptions");
static_assert(sizeof(ListEntry_CharacterCustomization_FilteringDropdownMenu_C_HasTagOptions) == 0x00000C, "Wrong size on ListEntry_CharacterCustomization_FilteringDropdownMenu_C_HasTagOptions");
static_assert(offsetof(ListEntry_CharacterCustomization_FilteringDropdownMenu_C_HasTagOptions, HasOptions) == 0x000000, "Member 'ListEntry_CharacterCustomization_FilteringDropdownMenu_C_HasTagOptions::HasOptions' has a wrong offset!");
static_assert(offsetof(ListEntry_CharacterCustomization_FilteringDropdownMenu_C_HasTagOptions, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'ListEntry_CharacterCustomization_FilteringDropdownMenu_C_HasTagOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ListEntry_CharacterCustomization_FilteringDropdownMenu_C_HasTagOptions, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'ListEntry_CharacterCustomization_FilteringDropdownMenu_C_HasTagOptions::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

