#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ListEntry_CharacterCustomization_FilterOption

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ListEntry_CharacterCustomization_FilterOption.ListEntry_CharacterCustomization_FilterOption_C
// 0x0050 (0x0078 - 0x0028)
class UListEntry_CharacterCustomization_FilterOption_C final : public UObject
{
public:
	int32                                         Index_ListEntry_CharacterCustomization_FilterOption_C; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4E7E[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharacterCustomization_CosmeticTagFilterStruct Tag;                                               // 0x0030(0x0038)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             OnOptionSelected;                                  // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnOptionSelected__DelegateSignature(bool IsSelected, const struct FVAL_CharacterCustomization_CosmeticTagFilterStruct& SelectedCosmeticTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ListEntry_CharacterCustomization_FilterOption_C">();
	}
	static class UListEntry_CharacterCustomization_FilterOption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UListEntry_CharacterCustomization_FilterOption_C>();
	}
};
static_assert(alignof(UListEntry_CharacterCustomization_FilterOption_C) == 0x000008, "Wrong alignment on UListEntry_CharacterCustomization_FilterOption_C");
static_assert(sizeof(UListEntry_CharacterCustomization_FilterOption_C) == 0x000078, "Wrong size on UListEntry_CharacterCustomization_FilterOption_C");
static_assert(offsetof(UListEntry_CharacterCustomization_FilterOption_C, Index_ListEntry_CharacterCustomization_FilterOption_C) == 0x000028, "Member 'UListEntry_CharacterCustomization_FilterOption_C::Index_ListEntry_CharacterCustomization_FilterOption_C' has a wrong offset!");
static_assert(offsetof(UListEntry_CharacterCustomization_FilterOption_C, Tag) == 0x000030, "Member 'UListEntry_CharacterCustomization_FilterOption_C::Tag' has a wrong offset!");
static_assert(offsetof(UListEntry_CharacterCustomization_FilterOption_C, OnOptionSelected) == 0x000068, "Member 'UListEntry_CharacterCustomization_FilterOption_C::OnOptionSelected' has a wrong offset!");

}

