#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuHubListEntryStruct

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "MenuHubOtherMenuType_structs.hpp"


namespace SDK
{

// UserDefinedStruct MenuHubListEntryStruct.MenuHubListEntryStruct
// 0x0068 (0x0068 - 0x0000)
struct FMenuHubListEntryStruct final
{
public:
	bool                                          Hidden_22_FAA223B141E130D3DCAE949F4B6AC119;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CAB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Icon_2_919401524512D58F2733A9B70F30FB02;           // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   Text_7_67045605440CDD584F4B30AAAE9375F7;           // 0x0030(0x0018)(Edit, BlueprintVisible)
	EVAL_GameplayMenuMode                         PlayerMenuType_30_F823B8524121F48BAB2525AC1578D407; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_OpenStoreContext                         PremiumStoreMenu_19_78391AB245CAEEEA28C1C091D4F80FB8; // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CAC[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocialTabName_26_2B6F01D54CAD02BF11352DA9C62931F5; // 0x004C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnterHousingMode_29_EB5129E54F4DEF0B13BFAD942BDEEE17; // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuHubOtherMenuType                         OtherMenuType_33_70C18EFA4428E8900597F8803DCD48A6; // 0x0055(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CAD[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           DirectBindInputAction_38_2A3997574F891601059628B15ECA2112; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugOnly_40_FBCFF18245804C521758B288AA7690D0;     // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FMenuHubListEntryStruct) == 0x000008, "Wrong alignment on FMenuHubListEntryStruct");
static_assert(sizeof(FMenuHubListEntryStruct) == 0x000068, "Wrong size on FMenuHubListEntryStruct");
static_assert(offsetof(FMenuHubListEntryStruct, Hidden_22_FAA223B141E130D3DCAE949F4B6AC119) == 0x000000, "Member 'FMenuHubListEntryStruct::Hidden_22_FAA223B141E130D3DCAE949F4B6AC119' has a wrong offset!");
static_assert(offsetof(FMenuHubListEntryStruct, Icon_2_919401524512D58F2733A9B70F30FB02) == 0x000008, "Member 'FMenuHubListEntryStruct::Icon_2_919401524512D58F2733A9B70F30FB02' has a wrong offset!");
static_assert(offsetof(FMenuHubListEntryStruct, Text_7_67045605440CDD584F4B30AAAE9375F7) == 0x000030, "Member 'FMenuHubListEntryStruct::Text_7_67045605440CDD584F4B30AAAE9375F7' has a wrong offset!");
static_assert(offsetof(FMenuHubListEntryStruct, PlayerMenuType_30_F823B8524121F48BAB2525AC1578D407) == 0x000048, "Member 'FMenuHubListEntryStruct::PlayerMenuType_30_F823B8524121F48BAB2525AC1578D407' has a wrong offset!");
static_assert(offsetof(FMenuHubListEntryStruct, PremiumStoreMenu_19_78391AB245CAEEEA28C1C091D4F80FB8) == 0x000049, "Member 'FMenuHubListEntryStruct::PremiumStoreMenu_19_78391AB245CAEEEA28C1C091D4F80FB8' has a wrong offset!");
static_assert(offsetof(FMenuHubListEntryStruct, SocialTabName_26_2B6F01D54CAD02BF11352DA9C62931F5) == 0x00004C, "Member 'FMenuHubListEntryStruct::SocialTabName_26_2B6F01D54CAD02BF11352DA9C62931F5' has a wrong offset!");
static_assert(offsetof(FMenuHubListEntryStruct, EnterHousingMode_29_EB5129E54F4DEF0B13BFAD942BDEEE17) == 0x000054, "Member 'FMenuHubListEntryStruct::EnterHousingMode_29_EB5129E54F4DEF0B13BFAD942BDEEE17' has a wrong offset!");
static_assert(offsetof(FMenuHubListEntryStruct, OtherMenuType_33_70C18EFA4428E8900597F8803DCD48A6) == 0x000055, "Member 'FMenuHubListEntryStruct::OtherMenuType_33_70C18EFA4428E8900597F8803DCD48A6' has a wrong offset!");
static_assert(offsetof(FMenuHubListEntryStruct, DirectBindInputAction_38_2A3997574F891601059628B15ECA2112) == 0x000058, "Member 'FMenuHubListEntryStruct::DirectBindInputAction_38_2A3997574F891601059628B15ECA2112' has a wrong offset!");
static_assert(offsetof(FMenuHubListEntryStruct, DebugOnly_40_FBCFF18245804C521758B288AA7690D0) == 0x000060, "Member 'FMenuHubListEntryStruct::DebugOnly_40_FBCFF18245804C521758B288AA7690D0' has a wrong offset!");

}

