#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Palia

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "S6Core_structs.hpp"
#include "S6Core_classes.hpp"
#include "AkAudio_structs.hpp"
#include "AkAudio_classes.hpp"
#include "S6EnhancedInputExtended_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Niagara_classes.hpp"
#include "ValeriaDTOs_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CinematicCamera_classes.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "ReplicationGraph_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class Palia.ViewComponent
// 0x0000 (0x02A0 - 0x02A0)
class UViewComponent final : public USceneComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViewComponent">();
	}
	static class UViewComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViewComponent>();
	}
};
static_assert(alignof(UViewComponent) == 0x000010, "Wrong alignment on UViewComponent");
static_assert(sizeof(UViewComponent) == 0x0002A0, "Wrong size on UViewComponent");

// Class Palia.AbilityAnimationComponent
// 0x0228 (0x02C8 - 0x00A0)
class UAbilityAnimationComponent final : public UActorComponent
{
public:
	class UDataTable*                             AnimationMappings;                                 // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UDataTable*>          ExtraAnimationMappings;                            // 0x00A8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAnimationMappingConfig> ExtraAnimationRows;                                // 0x00F8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   LastUsedAnimMappingName;                           // 0x0148(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLastUsedAnimWasBlendSpace;                        // 0x0150(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_238B[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UDataTable*>          AudioAnimNotifyMappings;                           // 0x0158(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnMontageNotify;                                   // 0x01A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnNotifyStateBegin;                                // 0x01B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnNotifyStateEnd;                                  // 0x01C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnChanged;                                         // 0x01D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLocomotionTagChanged;                            // 0x01E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCombatTagChanged;                                // 0x01F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class FName>                           ActiveMontageNotifyStates;                         // 0x0208(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UAICombatStateComponent*                AiCombatState;                                     // 0x0218(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAnimState                             AnimState;                                         // 0x0228(0x0018)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           LocomotionTag;                                     // 0x0240(0x0008)(Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           CombatTag;                                         // 0x0248(0x0008)(Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayAbilityRepAnimMontage         RepAnimMontageInfo;                                // 0x0250(0x0038)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGameplayAbilityLocalAnimMontage       LocalAnimMontageInfo;                              // 0x0288(0x0030)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_238C[0x10];                                    // 0x02B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Client_OnAnimStateChange(struct FAnimState& OldAnimState);
	void HandleAnimNotifyStateBegin(class FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
	void HandleAnimNotifyStateEnd(class FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
	void HandleEquipmentChanged(class UEquipmentComponent* InEquipmentComponent, const struct FEquipmentItem& Item);
	void HandleEquipmentVisibilityChanged(class UEquipmentComponent* InEquipmentComponent, bool bHidden);
	void HandleOnAnimInitialized();
	void HandleStateChanged(class UCharacterStateMachineComponent* Csm, const struct FCharacterStateChangeParams& Params_0);
	void MontageAction(ERpcMontageAction Event, class UAnimMontage* Montage);
	void MontageActionFromContext(struct FMontageActionContext& Context);
	void OnAbilityEnded(class UGameplayAbility* EndedAbility);
	void OnAbilityStarted(class UGameplayAbility* ActivatedAbility);
	void OnRep_CombatTag(struct FGameplayTag& OldTag);
	void OnRep_LocomotionTag(struct FGameplayTag& OldTag);
	void OnRep_ReplicatedAnimMontage();
	void PlayAnimation(struct FGameplayTag& AnimTag);
	bool PlayMontage(const struct FMontageInfo& MontageInfo);
	void RpcClient_TryChangeState(struct FAnimState& Context, ERpcAction RpcAction);
	void RpcMontageAction(struct FMontageActionContext& Context);
	void RpcServer_MontageAction(struct FMontageActionContext& Context);
	void RpcServer_TryChangeState(struct FAnimState& Context, ERpcAction RpcAction);
	void StopAll(float BlendOut);
	void StopAnimation(struct FGameplayTag& AnimTag);
	bool StopMontage(class UAnimMontage* AnimMontage);
	void TryChangeState(struct FAnimState& Context, ERpcAction RpcAction);

	class UBlendSpace* GetBlendSpace(const struct FGameplayTag& Tag, class FName& MappingQualifier) const;
	class UBlendSpace* GetBlendSpaceByName(class FName& Param_Name, class FName& MappingQualifier) const;
	struct FGameplayTag GetCombatTag() const;
	struct FGameplayTag GetLocomotionTag() const;
	class FName GetMappingNameByTag(const struct FGameplayTag& Tag, class FName& MappingQualifier) const;
	class UAnimMontage* GetMontage(const struct FGameplayTag& Tag, class FName& MappingQualifier) const;
	class UAnimMontage* GetMontageByName(class FName& Param_Name, class FName& MappingQualifier) const;
	class FName GetRowNameAssociatedWithTag(const struct FGameplayTag& Tag) const;
	class UAnimSequence* GetSequence(const struct FGameplayTag& Tag, class FName& MappingQualifier) const;
	class UAnimSequence* GetSequenceByName(class FName& Param_Name, class FName& MappingQualifier) const;
	struct FGameplayTag GetTagAssociatedWithRowName(class FName Param_Name) const;
	bool IsNotifyStateActive(class FName& NotifyStateName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityAnimationComponent">();
	}
	static class UAbilityAnimationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityAnimationComponent>();
	}
};
static_assert(alignof(UAbilityAnimationComponent) == 0x000008, "Wrong alignment on UAbilityAnimationComponent");
static_assert(sizeof(UAbilityAnimationComponent) == 0x0002C8, "Wrong size on UAbilityAnimationComponent");
static_assert(offsetof(UAbilityAnimationComponent, AnimationMappings) == 0x0000A0, "Member 'UAbilityAnimationComponent::AnimationMappings' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, ExtraAnimationMappings) == 0x0000A8, "Member 'UAbilityAnimationComponent::ExtraAnimationMappings' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, ExtraAnimationRows) == 0x0000F8, "Member 'UAbilityAnimationComponent::ExtraAnimationRows' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, LastUsedAnimMappingName) == 0x000148, "Member 'UAbilityAnimationComponent::LastUsedAnimMappingName' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, bLastUsedAnimWasBlendSpace) == 0x000150, "Member 'UAbilityAnimationComponent::bLastUsedAnimWasBlendSpace' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, AudioAnimNotifyMappings) == 0x000158, "Member 'UAbilityAnimationComponent::AudioAnimNotifyMappings' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, OnMontageNotify) == 0x0001A8, "Member 'UAbilityAnimationComponent::OnMontageNotify' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, OnNotifyStateBegin) == 0x0001B8, "Member 'UAbilityAnimationComponent::OnNotifyStateBegin' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, OnNotifyStateEnd) == 0x0001C8, "Member 'UAbilityAnimationComponent::OnNotifyStateEnd' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, OnChanged) == 0x0001D8, "Member 'UAbilityAnimationComponent::OnChanged' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, OnLocomotionTagChanged) == 0x0001E8, "Member 'UAbilityAnimationComponent::OnLocomotionTagChanged' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, OnCombatTagChanged) == 0x0001F8, "Member 'UAbilityAnimationComponent::OnCombatTagChanged' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, ActiveMontageNotifyStates) == 0x000208, "Member 'UAbilityAnimationComponent::ActiveMontageNotifyStates' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, AiCombatState) == 0x000218, "Member 'UAbilityAnimationComponent::AiCombatState' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, EquipmentComponent) == 0x000220, "Member 'UAbilityAnimationComponent::EquipmentComponent' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, AnimState) == 0x000228, "Member 'UAbilityAnimationComponent::AnimState' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, LocomotionTag) == 0x000240, "Member 'UAbilityAnimationComponent::LocomotionTag' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, CombatTag) == 0x000248, "Member 'UAbilityAnimationComponent::CombatTag' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, RepAnimMontageInfo) == 0x000250, "Member 'UAbilityAnimationComponent::RepAnimMontageInfo' has a wrong offset!");
static_assert(offsetof(UAbilityAnimationComponent, LocalAnimMontageInfo) == 0x000288, "Member 'UAbilityAnimationComponent::LocalAnimMontageInfo' has a wrong offset!");

// Class Palia.VAL_DataAsset
// 0x0030 (0x0058 - 0x0028)
class UVAL_DataAsset : public UObject
{
public:
	uint8                                         Pad_2395[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTagList                               Tags;                                              // 0x0030(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          IsArchived;                                        // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2396[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PersistId;                                         // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static int32 GetInvalidItemPersistId();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_DataAsset">();
	}
	static class UVAL_DataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_DataAsset>();
	}
};
static_assert(alignof(UVAL_DataAsset) == 0x000008, "Wrong alignment on UVAL_DataAsset");
static_assert(sizeof(UVAL_DataAsset) == 0x000058, "Wrong size on UVAL_DataAsset");
static_assert(offsetof(UVAL_DataAsset, Tags) == 0x000030, "Member 'UVAL_DataAsset::Tags' has a wrong offset!");
static_assert(offsetof(UVAL_DataAsset, IsArchived) == 0x000050, "Member 'UVAL_DataAsset::IsArchived' has a wrong offset!");
static_assert(offsetof(UVAL_DataAsset, PersistId) == 0x000054, "Member 'UVAL_DataAsset::PersistId' has a wrong offset!");

// Class Palia.EquipViewActor
// 0x0000 (0x02A8 - 0x02A8)
class AEquipViewActor : public AActor
{
public:
	void OnOwnerAnimNotifyBeginReceived(class FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
	void ReceiveNamedNotify(class FName& NotifyName, class FName& QualifierName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EquipViewActor">();
	}
	static class AEquipViewActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEquipViewActor>();
	}
};
static_assert(alignof(AEquipViewActor) == 0x000008, "Wrong alignment on AEquipViewActor");
static_assert(sizeof(AEquipViewActor) == 0x0002A8, "Wrong size on AEquipViewActor");

// Class Palia.ValeriaAccomplishmentsManager
// 0x00D8 (0x0108 - 0x0030)
class UValeriaAccomplishmentsManager final : public UGameInstanceSubsystem
{
public:
	FMulticastInlineDelegateProperty_             OnBatchAccomplishmentStatsUpdated;                 // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnBatchAccomplishmentsUpdated;                     // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnStatUpdated;                                     // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnAccomplishmentUnlocked;                          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnAccomplishmentRedeemed;                          // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2397[0x88];                                    // 0x0080(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void IncrementCollectionStatForPlayer(class APlayerController* Player, const class FString& StatName, int32 PersistId, int32 Value);
	void SetBooleanStatForPlayer(class APlayerController* Player, const class FString& StatName, bool NewValue);
	void UpdateDoubleStatForPlayer(class APlayerController* Player, const class FString& StatName, EValeriaStatModificationType ModificationType, double Value);
	void UpdateFloatStatForPlayer(class APlayerController* Player, const class FString& StatName, EValeriaStatModificationType ModificationType, float Value);
	void UpdateIntegerStatForPlayer(class APlayerController* Player, const class FString& StatName, EValeriaStatModificationType ModificationType, int32 Value);

	bool CanPlayerRedeemAchievement(class APlayerController* Player, const class FString& AchievementID) const;
	const struct FValeriaOnlineAchievementDefinition GetAchievementDefinition(const class FString& AchievementID) const;
	TArray<struct FValeriaOnlineAchievementDefinition> GetAchievementDefinitions() const;
	TArray<class FString> GetAchievementGroup(const class FString& AccomplishmentId, const class FString& GroupID) const;
	class FString GetAchievementInGroupByTier(int32 Tier, const class FString& GroupID) const;
	TArray<struct FValeriaOnlineAchievement> GetAchievementsForNetId(struct FUniqueNetIdRepl& AccountId) const;
	TArray<struct FValeriaOnlineAchievement> GetAchievementsForPlayer(class APlayerController* Player) const;
	void GetAllStatsForPlayer(class APlayerController* Player, TMap<class FString, class FString>* OutStatNameValueTable) const;
	bool GetBooleanStatForPlayer(class APlayerController* Player, const class FString& StatName, bool* Value) const;
	bool GetCollectionStatForPlayer(class APlayerController* Player, const class FString& StatName, int32 PersistId, int32* Value) const;
	int32 GetCurrentTierOfAchievementGroup(class APlayerController* Player, const class FString& GroupID) const;
	bool GetFloatStatForPlayer(class APlayerController* Player, const class FString& StatName, float* Value) const;
	bool GetIntegerStatForPlayer(class APlayerController* Player, const class FString& StatName, int32* Value) const;
	TArray<struct FAchievementRewards> GetRewardsForAchievement(const class FString& AchievementID) const;
	bool GetStatValueForPlayerAsString(class APlayerController* Player, const class FString& StatName, class FString* Value) const;
	TArray<struct FAchievementUnlockRule> GetUnlockRulesForAchievement(const class FString& AchievementID) const;
	bool HasAchievementUnlocked(class APlayerController* Player, const class FString& AchievementID) const;
	bool HasRedeemedAchievementRewards(class APlayerController* Player, const class FString& AchievementID) const;
	bool HasSetCollectionStatForPlayer(class APlayerController* Player, const class FString& StatName, int32 PersistId, bool* Value) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValeriaAccomplishmentsManager">();
	}
	static class UValeriaAccomplishmentsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValeriaAccomplishmentsManager>();
	}
};
static_assert(alignof(UValeriaAccomplishmentsManager) == 0x000008, "Wrong alignment on UValeriaAccomplishmentsManager");
static_assert(sizeof(UValeriaAccomplishmentsManager) == 0x000108, "Wrong size on UValeriaAccomplishmentsManager");
static_assert(offsetof(UValeriaAccomplishmentsManager, OnBatchAccomplishmentStatsUpdated) == 0x000030, "Member 'UValeriaAccomplishmentsManager::OnBatchAccomplishmentStatsUpdated' has a wrong offset!");
static_assert(offsetof(UValeriaAccomplishmentsManager, OnBatchAccomplishmentsUpdated) == 0x000040, "Member 'UValeriaAccomplishmentsManager::OnBatchAccomplishmentsUpdated' has a wrong offset!");
static_assert(offsetof(UValeriaAccomplishmentsManager, OnStatUpdated) == 0x000050, "Member 'UValeriaAccomplishmentsManager::OnStatUpdated' has a wrong offset!");
static_assert(offsetof(UValeriaAccomplishmentsManager, OnAccomplishmentUnlocked) == 0x000060, "Member 'UValeriaAccomplishmentsManager::OnAccomplishmentUnlocked' has a wrong offset!");
static_assert(offsetof(UValeriaAccomplishmentsManager, OnAccomplishmentRedeemed) == 0x000070, "Member 'UValeriaAccomplishmentsManager::OnAccomplishmentRedeemed' has a wrong offset!");

// Class Palia.VAL_WwiseMotionBase
// 0x0008 (0x0030 - 0x0028)
class UVAL_WwiseMotionBase : public UObject
{
public:
	uint8                                         Pad_23A7[0x8];                                     // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_WwiseMotionBase">();
	}
	static class UVAL_WwiseMotionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_WwiseMotionBase>();
	}
};
static_assert(alignof(UVAL_WwiseMotionBase) == 0x000008, "Wrong alignment on UVAL_WwiseMotionBase");
static_assert(sizeof(UVAL_WwiseMotionBase) == 0x000030, "Wrong size on UVAL_WwiseMotionBase");

// Class Palia.Activatable
// 0x0000 (0x0028 - 0x0028)
class IActivatable final : public IInterface
{
public:
	void Activate();
	void Deactivate();

	bool CanActivate() const;
	bool IsActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Activatable">();
	}
	static class IActivatable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IActivatable>();
	}
};
static_assert(alignof(IActivatable) == 0x000008, "Wrong alignment on IActivatable");
static_assert(sizeof(IActivatable) == 0x000028, "Wrong size on IActivatable");

// Class Palia.ActivationManager
// 0x0028 (0x02D0 - 0x02A8)
class AActivationManager final : public AActor
{
public:
	TArray<TSoftClassPtr<class UClass>>           ManagedActorClasses;                               // 0x02A8(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayTag>                   RequiredActorTags;                                 // 0x02B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         MaxActivationsAllowed;                             // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_23A8[0x4];                                     // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PerformActivation(int32 NumToActivate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivationManager">();
	}
	static class AActivationManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AActivationManager>();
	}
};
static_assert(alignof(AActivationManager) == 0x000008, "Wrong alignment on AActivationManager");
static_assert(sizeof(AActivationManager) == 0x0002D0, "Wrong size on AActivationManager");
static_assert(offsetof(AActivationManager, ManagedActorClasses) == 0x0002A8, "Member 'AActivationManager::ManagedActorClasses' has a wrong offset!");
static_assert(offsetof(AActivationManager, RequiredActorTags) == 0x0002B8, "Member 'AActivationManager::RequiredActorTags' has a wrong offset!");
static_assert(offsetof(AActivationManager, MaxActivationsAllowed) == 0x0002C8, "Member 'AActivationManager::MaxActivationsAllowed' has a wrong offset!");

// Class Palia.VAL_GameplayEvent
// 0x0140 (0x0168 - 0x0028)
class UVAL_GameplayEvent : public UObject
{
public:
	EVAL_GameplayEventSourceTargetType            SourceType;                                        // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23A9[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SourcePlayerRelationship;                          // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      SourceTagRequirements;                             // 0x0030(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	EVAL_GameplayEventSourceTargetType            TargetType;                                        // 0x0078(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23AA[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetPlayerRelationship;                          // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      TargetTagRequirements;                             // 0x0080(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasSource;                                        // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23AB[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      SourceCharacter;                                   // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaPlayerController*               SourcePlayerController;                            // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaVillagerCharacter*              SourceVillagerCharacter;                           // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaVillagerController*             SourceVillagerController;                          // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACreatureCharacter*                     SourceCreatureCharacter;                           // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  SourceTags;                                        // 0x00F8(0x0020)(NativeAccessSpecifierPublic)
	bool                                          bHasTarget;                                        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23AC[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      TargetCharacter;                                   // 0x0120(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaPlayerController*               TargetPlayerController;                            // 0x0128(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaVillagerCharacter*              TargetVillagerCharacter;                           // 0x0130(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaVillagerController*             TargetVillagerController;                          // 0x0138(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACreatureCharacter*                     TargetCreatureCharacter;                           // 0x0140(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TargetTags;                                        // 0x0148(0x0020)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_GameplayEvent">();
	}
	static class UVAL_GameplayEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_GameplayEvent>();
	}
};
static_assert(alignof(UVAL_GameplayEvent) == 0x000008, "Wrong alignment on UVAL_GameplayEvent");
static_assert(sizeof(UVAL_GameplayEvent) == 0x000168, "Wrong size on UVAL_GameplayEvent");
static_assert(offsetof(UVAL_GameplayEvent, SourceType) == 0x000028, "Member 'UVAL_GameplayEvent::SourceType' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, SourcePlayerRelationship) == 0x00002C, "Member 'UVAL_GameplayEvent::SourcePlayerRelationship' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, SourceTagRequirements) == 0x000030, "Member 'UVAL_GameplayEvent::SourceTagRequirements' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, TargetType) == 0x000078, "Member 'UVAL_GameplayEvent::TargetType' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, TargetPlayerRelationship) == 0x00007C, "Member 'UVAL_GameplayEvent::TargetPlayerRelationship' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, TargetTagRequirements) == 0x000080, "Member 'UVAL_GameplayEvent::TargetTagRequirements' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, Count) == 0x0000C8, "Member 'UVAL_GameplayEvent::Count' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, bHasSource) == 0x0000CC, "Member 'UVAL_GameplayEvent::bHasSource' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, SourceCharacter) == 0x0000D0, "Member 'UVAL_GameplayEvent::SourceCharacter' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, SourcePlayerController) == 0x0000D8, "Member 'UVAL_GameplayEvent::SourcePlayerController' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, SourceVillagerCharacter) == 0x0000E0, "Member 'UVAL_GameplayEvent::SourceVillagerCharacter' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, SourceVillagerController) == 0x0000E8, "Member 'UVAL_GameplayEvent::SourceVillagerController' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, SourceCreatureCharacter) == 0x0000F0, "Member 'UVAL_GameplayEvent::SourceCreatureCharacter' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, SourceTags) == 0x0000F8, "Member 'UVAL_GameplayEvent::SourceTags' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, bHasTarget) == 0x000118, "Member 'UVAL_GameplayEvent::bHasTarget' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, TargetCharacter) == 0x000120, "Member 'UVAL_GameplayEvent::TargetCharacter' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, TargetPlayerController) == 0x000128, "Member 'UVAL_GameplayEvent::TargetPlayerController' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, TargetVillagerCharacter) == 0x000130, "Member 'UVAL_GameplayEvent::TargetVillagerCharacter' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, TargetVillagerController) == 0x000138, "Member 'UVAL_GameplayEvent::TargetVillagerController' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, TargetCreatureCharacter) == 0x000140, "Member 'UVAL_GameplayEvent::TargetCreatureCharacter' has a wrong offset!");
static_assert(offsetof(UVAL_GameplayEvent, TargetTags) == 0x000148, "Member 'UVAL_GameplayEvent::TargetTags' has a wrong offset!");

// Class Palia.VAL_GameplayEvent_WaterPlant
// 0x0000 (0x0168 - 0x0168)
class UVAL_GameplayEvent_WaterPlant final : public UVAL_GameplayEvent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_GameplayEvent_WaterPlant">();
	}
	static class UVAL_GameplayEvent_WaterPlant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_GameplayEvent_WaterPlant>();
	}
};
static_assert(alignof(UVAL_GameplayEvent_WaterPlant) == 0x000008, "Wrong alignment on UVAL_GameplayEvent_WaterPlant");
static_assert(sizeof(UVAL_GameplayEvent_WaterPlant) == 0x000168, "Wrong size on UVAL_GameplayEvent_WaterPlant");

// Class Palia.VAL_TimerInstance
// 0x0088 (0x00B0 - 0x0028)
class UVAL_TimerInstance final : public UObject
{
public:
	struct FVAL_TimerStateStruct                  TimerState;                                        // 0x0028(0x0030)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_23AD[0x58];                                    // 0x0058(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_TimerInstance">();
	}
	static class UVAL_TimerInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_TimerInstance>();
	}
};
static_assert(alignof(UVAL_TimerInstance) == 0x000008, "Wrong alignment on UVAL_TimerInstance");
static_assert(sizeof(UVAL_TimerInstance) == 0x0000B0, "Wrong size on UVAL_TimerInstance");
static_assert(offsetof(UVAL_TimerInstance, TimerState) == 0x000028, "Member 'UVAL_TimerInstance::TimerState' has a wrong offset!");

// Class Palia.ActorSpawnPointsManager
// 0x00A0 (0x00D0 - 0x0030)
class UActorSpawnPointsManager final : public UGameInstanceSubsystem
{
public:
	TMap<class UClass*, struct FActorSpawnPointList> ActorSpawnPointsAvailable;                         // 0x0030(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<class AActor*, class AActor*>            ActorSpawnPointsUsed;                              // 0x0080(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	void OnOccupierActorDestroyed(class AActor* OccupierActor);
	void OnSpawnPointActorDestroyed(class AActor* SpawnPointActor);
	void RemoveSpawnPoint(class AActor* SpawnPointActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorSpawnPointsManager">();
	}
	static class UActorSpawnPointsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorSpawnPointsManager>();
	}
};
static_assert(alignof(UActorSpawnPointsManager) == 0x000008, "Wrong alignment on UActorSpawnPointsManager");
static_assert(sizeof(UActorSpawnPointsManager) == 0x0000D0, "Wrong size on UActorSpawnPointsManager");
static_assert(offsetof(UActorSpawnPointsManager, ActorSpawnPointsAvailable) == 0x000030, "Member 'UActorSpawnPointsManager::ActorSpawnPointsAvailable' has a wrong offset!");
static_assert(offsetof(UActorSpawnPointsManager, ActorSpawnPointsUsed) == 0x000080, "Member 'UActorSpawnPointsManager::ActorSpawnPointsUsed' has a wrong offset!");

// Class Palia.PrivateSpaceVillagerDeterminantConfig
// 0x0018 (0x0048 - 0x0030)
class UPrivateSpaceVillagerDeterminantConfig final : public UDataAsset
{
public:
	bool                                          bAllowSimultaneousVisits;                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23AE[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UPrivateSpaceVillagerVisitConfig>> VillagerVisits;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	TArray<class UPrivateSpaceVillagerVisitConfig*> DeterminePrivateSpaceVillagerVisits(class AValeriaCharacter* InValeriaCharacter);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrivateSpaceVillagerDeterminantConfig">();
	}
	static class UPrivateSpaceVillagerDeterminantConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrivateSpaceVillagerDeterminantConfig>();
	}
};
static_assert(alignof(UPrivateSpaceVillagerDeterminantConfig) == 0x000008, "Wrong alignment on UPrivateSpaceVillagerDeterminantConfig");
static_assert(sizeof(UPrivateSpaceVillagerDeterminantConfig) == 0x000048, "Wrong size on UPrivateSpaceVillagerDeterminantConfig");
static_assert(offsetof(UPrivateSpaceVillagerDeterminantConfig, bAllowSimultaneousVisits) == 0x000030, "Member 'UPrivateSpaceVillagerDeterminantConfig::bAllowSimultaneousVisits' has a wrong offset!");
static_assert(offsetof(UPrivateSpaceVillagerDeterminantConfig, VillagerVisits) == 0x000038, "Member 'UPrivateSpaceVillagerDeterminantConfig::VillagerVisits' has a wrong offset!");

// Class Palia.ActorTagComponent
// 0x0078 (0x0118 - 0x00A0)
class UActorTagComponent final : public UActorComponent
{
public:
	uint8                                         Pad_23AF[0x58];                                    // 0x00A0(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnActorTagComponentUpdatedDel;                     // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FTagEntry>                      TagValues;                                         // 0x0108(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)

public:
	void OnRep_TagValues();

	int32 GetTagValue(struct FGameplayTag& Tag) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorTagComponent">();
	}
	static class UActorTagComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorTagComponent>();
	}
};
static_assert(alignof(UActorTagComponent) == 0x000008, "Wrong alignment on UActorTagComponent");
static_assert(sizeof(UActorTagComponent) == 0x000118, "Wrong size on UActorTagComponent");
static_assert(offsetof(UActorTagComponent, OnActorTagComponentUpdatedDel) == 0x0000F8, "Member 'UActorTagComponent::OnActorTagComponentUpdatedDel' has a wrong offset!");
static_assert(offsetof(UActorTagComponent, TagValues) == 0x000108, "Member 'UActorTagComponent::TagValues' has a wrong offset!");

// Class Palia.VAL_BatchedDataAsset
// 0x0028 (0x0080 - 0x0058)
class UVAL_BatchedDataAsset : public UVAL_DataAsset
{
public:
	TSoftObjectPtr<class UVAL_ContentBatchAsset>  ContentBatch;                                      // 0x0058(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_BatchedDataAsset">();
	}
	static class UVAL_BatchedDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_BatchedDataAsset>();
	}
};
static_assert(alignof(UVAL_BatchedDataAsset) == 0x000008, "Wrong alignment on UVAL_BatchedDataAsset");
static_assert(sizeof(UVAL_BatchedDataAsset) == 0x000080, "Wrong size on UVAL_BatchedDataAsset");
static_assert(offsetof(UVAL_BatchedDataAsset, ContentBatch) == 0x000058, "Member 'UVAL_BatchedDataAsset::ContentBatch' has a wrong offset!");

// Class Palia.VAL_PlayingCardStack
// 0x0010 (0x0038 - 0x0028)
class UVAL_PlayingCardStack : public UObject
{
public:
	TArray<class UVAL_PlayingCard*>               Cards;                                             // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_PlayingCardStack">();
	}
	static class UVAL_PlayingCardStack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_PlayingCardStack>();
	}
};
static_assert(alignof(UVAL_PlayingCardStack) == 0x000008, "Wrong alignment on UVAL_PlayingCardStack");
static_assert(sizeof(UVAL_PlayingCardStack) == 0x000038, "Wrong size on UVAL_PlayingCardStack");
static_assert(offsetof(UVAL_PlayingCardStack, Cards) == 0x000028, "Member 'UVAL_PlayingCardStack::Cards' has a wrong offset!");

// Class Palia.HotPotTileStack
// 0x0000 (0x0038 - 0x0038)
class UHotPotTileStack final : public UVAL_PlayingCardStack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HotPotTileStack">();
	}
	static class UHotPotTileStack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHotPotTileStack>();
	}
};
static_assert(alignof(UHotPotTileStack) == 0x000008, "Wrong alignment on UHotPotTileStack");
static_assert(sizeof(UHotPotTileStack) == 0x000038, "Wrong size on UHotPotTileStack");

// Class Palia.ActorTestHarnessComponent
// 0x0020 (0x00C0 - 0x00A0)
class UActorTestHarnessComponent : public UActorComponent
{
public:
	float                                         SecondsBeforeSwitchingServer;                      // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLoadTestClient;                                 // 0x00A4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFPSChartEnabled;                                  // 0x00A5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_23B0[0x2];                                     // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LoadTestBotID;                                     // 0x00A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_23B1[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurrentTestCase;                                   // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnTestStarted(const class FString& TestCase);
	void OnTestStopped(const class FString& TestCase);
	bool StartLoadTestClient();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorTestHarnessComponent">();
	}
	static class UActorTestHarnessComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorTestHarnessComponent>();
	}
};
static_assert(alignof(UActorTestHarnessComponent) == 0x000008, "Wrong alignment on UActorTestHarnessComponent");
static_assert(sizeof(UActorTestHarnessComponent) == 0x0000C0, "Wrong size on UActorTestHarnessComponent");
static_assert(offsetof(UActorTestHarnessComponent, SecondsBeforeSwitchingServer) == 0x0000A0, "Member 'UActorTestHarnessComponent::SecondsBeforeSwitchingServer' has a wrong offset!");
static_assert(offsetof(UActorTestHarnessComponent, bIsLoadTestClient) == 0x0000A4, "Member 'UActorTestHarnessComponent::bIsLoadTestClient' has a wrong offset!");
static_assert(offsetof(UActorTestHarnessComponent, bFPSChartEnabled) == 0x0000A5, "Member 'UActorTestHarnessComponent::bFPSChartEnabled' has a wrong offset!");
static_assert(offsetof(UActorTestHarnessComponent, LoadTestBotID) == 0x0000A8, "Member 'UActorTestHarnessComponent::LoadTestBotID' has a wrong offset!");
static_assert(offsetof(UActorTestHarnessComponent, CurrentTestCase) == 0x0000B0, "Member 'UActorTestHarnessComponent::CurrentTestCase' has a wrong offset!");

// Class Palia.PlayerCraftingHistoryComponent
// 0x0070 (0x0110 - 0x00A0)
class UPlayerCraftingHistoryComponent final : public UActorComponent
{
public:
	uint8                                         Pad_23B2[0x8];                                     // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCraftingHistoryPersistBlock           CraftingHistoryPersistBlock;                       // 0x00A8(0x0058)(Net, NativeAccessSpecifierPrivate)
	uint8                                         Pad_23B3[0x10];                                    // 0x0100(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool HasRecipeBeenCraftedBefore(int32 RecipeConfigId) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerCraftingHistoryComponent">();
	}
	static class UPlayerCraftingHistoryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerCraftingHistoryComponent>();
	}
};
static_assert(alignof(UPlayerCraftingHistoryComponent) == 0x000008, "Wrong alignment on UPlayerCraftingHistoryComponent");
static_assert(sizeof(UPlayerCraftingHistoryComponent) == 0x000110, "Wrong size on UPlayerCraftingHistoryComponent");
static_assert(offsetof(UPlayerCraftingHistoryComponent, CraftingHistoryPersistBlock) == 0x0000A8, "Member 'UPlayerCraftingHistoryComponent::CraftingHistoryPersistBlock' has a wrong offset!");

// Class Palia.ActorWithGAS
// 0x0018 (0x02C0 - 0x02A8)
class AActorWithGAS final : public AActor
{
public:
	uint8                                         Pad_23B5[0x8];                                     // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGASComponent*                   ValeriaGAS;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValeriaGASAttributeSet*                AttributeSet;                                      // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorWithGAS">();
	}
	static class AActorWithGAS* GetDefaultObj()
	{
		return GetDefaultObjImpl<AActorWithGAS>();
	}
};
static_assert(alignof(AActorWithGAS) == 0x000008, "Wrong alignment on AActorWithGAS");
static_assert(sizeof(AActorWithGAS) == 0x0002C0, "Wrong size on AActorWithGAS");
static_assert(offsetof(AActorWithGAS, ValeriaGAS) == 0x0002B0, "Member 'AActorWithGAS::ValeriaGAS' has a wrong offset!");
static_assert(offsetof(AActorWithGAS, AttributeSet) == 0x0002B8, "Member 'AActorWithGAS::AttributeSet' has a wrong offset!");

// Class Palia.GearConfig
// 0x00B8 (0x00E8 - 0x0030)
class UGearConfig final : public UDataAsset
{
public:
	class UGearSlotTypeConfig*                    GearSlotTypeConfig;                                // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            GameplayEffectToApplyOnEquip;                      // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGearAssetToLoad>               AssetsToLoadOnEquip;                               // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0050(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TagsGrantedOnEquip;                                // 0x0070(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TagsGrantedOnRemove;                               // 0x0090(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   EquipView;                                         // 0x00B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    VillagerCore;                                      // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GearConfig">();
	}
	static class UGearConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGearConfig>();
	}
};
static_assert(alignof(UGearConfig) == 0x000008, "Wrong alignment on UGearConfig");
static_assert(sizeof(UGearConfig) == 0x0000E8, "Wrong size on UGearConfig");
static_assert(offsetof(UGearConfig, GearSlotTypeConfig) == 0x000030, "Member 'UGearConfig::GearSlotTypeConfig' has a wrong offset!");
static_assert(offsetof(UGearConfig, GameplayEffectToApplyOnEquip) == 0x000038, "Member 'UGearConfig::GameplayEffectToApplyOnEquip' has a wrong offset!");
static_assert(offsetof(UGearConfig, AssetsToLoadOnEquip) == 0x000040, "Member 'UGearConfig::AssetsToLoadOnEquip' has a wrong offset!");
static_assert(offsetof(UGearConfig, GameplayTags) == 0x000050, "Member 'UGearConfig::GameplayTags' has a wrong offset!");
static_assert(offsetof(UGearConfig, TagsGrantedOnEquip) == 0x000070, "Member 'UGearConfig::TagsGrantedOnEquip' has a wrong offset!");
static_assert(offsetof(UGearConfig, TagsGrantedOnRemove) == 0x000090, "Member 'UGearConfig::TagsGrantedOnRemove' has a wrong offset!");
static_assert(offsetof(UGearConfig, EquipView) == 0x0000B0, "Member 'UGearConfig::EquipView' has a wrong offset!");
static_assert(offsetof(UGearConfig, VillagerCore) == 0x0000D8, "Member 'UGearConfig::VillagerCore' has a wrong offset!");

// Class Palia.ValeriaGameSession
// 0x0198 (0x0458 - 0x02C0)
class AValeriaGameSession final : public AGameSession
{
public:
	uint8                                         Pad_23B6[0xC0];                                    // 0x02C0(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class AOnlineBeaconHost*                      BeaconHost;                                        // 0x0380(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AOSSVAL_BeaconHostObject*               BeaconHostObject;                                  // 0x0388(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_23B7[0x68];                                    // 0x0390(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class UAgonesComponent*                       AgonesComponent;                                   // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_23B8[0x8];                                     // 0x0400(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ServerReserveRequestAsyncStream*   ServerAllocatedRequestAsyncStream;                 // 0x0408(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVAL_ServerRegistrationRequestAsyncStream* ServerRegistrationRequestAsyncStream;              // 0x0410(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVAL_ServerKickAllAsyncStream*          ServerKickAllAsyncStream;                          // 0x0418(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVAL_ServerMaintenanceCancelledAsyncStream* ServerMaintenanceCancelledAsyncStream;             // 0x0420(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVAL_ServerMaintenanceScheduledAsyncStream* ServerMaintenanceScheduledAsyncStream;             // 0x0428(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_23B9[0x18];                                    // 0x0430(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_ServerMaintenanceData             MaintenanceData;                                   // 0x0448(0x0010)(Transient, NoDestructor, NativeAccessSpecifierPrivate)

public:
	void HandleAgonesAllocatedFailed(struct FAgonesError& Error);
	void HandleAgonesAllocatedSucceeded(struct FEmptyResponse& Response);
	void HandleAgonesReadyFailed(struct FAgonesError& Error);
	void HandleAgonesReadySucceeded(struct FEmptyResponse& Response);
	void HandleAgonesReservedFailed(struct FAgonesError& Error);
	void HandleAgonesReservedSucceeded(struct FEmptyResponse& Response);
	void HandleMqttConnect(bool bSuccess);
	void HandleOnAgonesConnectionFailed(struct FAgonesError& Error);
	void HandleOnAgonesConnectionSucceeded(struct FGameServerResponse& Response);
	void HandleOnPlayerCharacterLoaded(struct FGuid& CharacterId, struct FUniqueNetIdRepl& NetId);
	void HandleOnServerAuthTokenReady();
	void HandleOnServerSpaceRegistered(struct FVAL_ServerSpace& ServerSpace);
	void HandleOnServerSpaceUnregistered(struct FVAL_ServerSpace& ServerSpace);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValeriaGameSession">();
	}
	static class AValeriaGameSession* GetDefaultObj()
	{
		return GetDefaultObjImpl<AValeriaGameSession>();
	}
};
static_assert(alignof(AValeriaGameSession) == 0x000008, "Wrong alignment on AValeriaGameSession");
static_assert(sizeof(AValeriaGameSession) == 0x000458, "Wrong size on AValeriaGameSession");
static_assert(offsetof(AValeriaGameSession, BeaconHost) == 0x000380, "Member 'AValeriaGameSession::BeaconHost' has a wrong offset!");
static_assert(offsetof(AValeriaGameSession, BeaconHostObject) == 0x000388, "Member 'AValeriaGameSession::BeaconHostObject' has a wrong offset!");
static_assert(offsetof(AValeriaGameSession, AgonesComponent) == 0x0003F8, "Member 'AValeriaGameSession::AgonesComponent' has a wrong offset!");
static_assert(offsetof(AValeriaGameSession, ServerAllocatedRequestAsyncStream) == 0x000408, "Member 'AValeriaGameSession::ServerAllocatedRequestAsyncStream' has a wrong offset!");
static_assert(offsetof(AValeriaGameSession, ServerRegistrationRequestAsyncStream) == 0x000410, "Member 'AValeriaGameSession::ServerRegistrationRequestAsyncStream' has a wrong offset!");
static_assert(offsetof(AValeriaGameSession, ServerKickAllAsyncStream) == 0x000418, "Member 'AValeriaGameSession::ServerKickAllAsyncStream' has a wrong offset!");
static_assert(offsetof(AValeriaGameSession, ServerMaintenanceCancelledAsyncStream) == 0x000420, "Member 'AValeriaGameSession::ServerMaintenanceCancelledAsyncStream' has a wrong offset!");
static_assert(offsetof(AValeriaGameSession, ServerMaintenanceScheduledAsyncStream) == 0x000428, "Member 'AValeriaGameSession::ServerMaintenanceScheduledAsyncStream' has a wrong offset!");
static_assert(offsetof(AValeriaGameSession, MaintenanceData) == 0x000448, "Member 'AValeriaGameSession::MaintenanceData' has a wrong offset!");

// Class Palia.VAL_BundleShrineConfigAsset
// 0x00B8 (0x0110 - 0x0058)
class UVAL_BundleShrineConfigAsset final : public UVAL_DataAsset
{
public:
	int32                                         OldBundleConfigId;                                 // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23BA[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BundleName;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0070(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   BundleCompleteDesc;                                // 0x0088(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              BundleImage;                                       // 0x00A0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      BundleIconPositions;                               // 0x00C8(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSubBundleNavExplicitData>      BundleExplicitData;                                // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FQuestRewardConfig>             BundleRewards;                                     // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSubBundleShrineConfig>         SubBundles;                                        // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bShowBundleComplete;                               // 0x0108(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowSubBundleComplete;                            // 0x0109(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowBundleTutorial;                               // 0x010A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23BB[0x5];                                     // 0x010B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TSoftObjectPtr<class UVAL_BundleShrineConfigAsset> GetAssetByName_Cast(class FName& AssetName);
	static TSoftObjectPtr<class UVAL_BundleShrineConfigAsset> GetAssetByPersistId_Cast(int32 PersistIdToGet);
	static TArray<TSoftObjectPtr<class UVAL_BundleShrineConfigAsset>> GetAssetsOfType_Cast();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_BundleShrineConfigAsset">();
	}
	static class UVAL_BundleShrineConfigAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_BundleShrineConfigAsset>();
	}
};
static_assert(alignof(UVAL_BundleShrineConfigAsset) == 0x000008, "Wrong alignment on UVAL_BundleShrineConfigAsset");
static_assert(sizeof(UVAL_BundleShrineConfigAsset) == 0x000110, "Wrong size on UVAL_BundleShrineConfigAsset");
static_assert(offsetof(UVAL_BundleShrineConfigAsset, OldBundleConfigId) == 0x000058, "Member 'UVAL_BundleShrineConfigAsset::OldBundleConfigId' has a wrong offset!");
