#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PublicHousingPlot_Root

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PublicHousingPlot_Root.PublicHousingPlot_Root_C
// 0x0058 (0x0308 - 0x02B0)
class APublicHousingPlot_Root_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_CharacterPreview_C*                 CharacterPreviewer_Thumbnail;                      // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterPreview_C*                 CharacterPreviewer_Inventory;                      // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSpot;                                            // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6060[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_HousingLight_C*>             LightActors;                                       // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class USceneComponent*>                DefaultLightComponents;                            // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AVAL_CharacterRenderStudio*             CharacterRenderStudio;                             // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CharacterPreviewerHelper_Thumbnail_1_GetCharacterPreviewer_MERGED_RefProperty; // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CharacterPreviewerHelper_Inventory_0_GetCharacterInventoryPreviewer_MERGED_RefProperty; // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Housing_Lighting_Uselight();
	void Housing_Lighting_UseCard();
	void Housing_Lighting_ToggleVisibility();
	void Housing_Lighting_ToggleMaxDistance();
	void Housing_Lighting_Reset();
	void Housing_Lighting_CreateLightComponent();
	struct FVector GetRenderStudioSpawnLocation();
	class AValeriaCharacter* GetLobbyCharacter();
	struct FVector GetItemPreviewerSpawnLocation();
	class AVAL_CharacterRenderStudio* GetCharacterRenderStudio(const struct FTransform& CallFunc_MakeTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABP_CharacterRenderStudio_C* CallFunc_FinishSpawningActor_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	class AVAL_CharacterPreviewer* GetCharacterPreviewer(bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, struct FTransform& CallFunc_GetTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABP_CharacterPreview_C* CallFunc_FinishSpawningActor_ReturnValue);
	class AVAL_CharacterPreviewer* GetCharacterInventoryPreviewer(bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, struct FTransform& CallFunc_GetTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABP_CharacterPreview_C* CallFunc_FinishSpawningActor_ReturnValue);
	void ExecuteUbergraph_PublicHousingPlot_Root(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_2, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_3, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_3, int32 Temp_int_Loop_Counter_Variable_4, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Array_Index_Variable_4, int32 Temp_int_Loop_Counter_Variable_5, int32 CallFunc_Add_IntInt_ReturnValue_5, int32 Temp_int_Array_Index_Variable_5, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable_6, bool CallFunc_Less_IntInt_ReturnValue, class ABP_HousingLight_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_6, bool CallFunc_Less_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_6, class ABP_HousingLight_C* CallFunc_Array_Get_Item_1, class USceneComponent* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_7, class ABP_HousingLight_C* CallFunc_Array_Get_Item_3, int32 CallFunc_Array_Length_ReturnValue_3, class ABP_HousingLight_C* CallFunc_Array_Get_Item_4, int32 CallFunc_Array_Length_ReturnValue_4, bool CallFunc_Less_IntInt_ReturnValue_3, class ABP_HousingLight_C* CallFunc_Array_Get_Item_5, int32 CallFunc_Array_Length_ReturnValue_5, bool CallFunc_Less_IntInt_ReturnValue_4, int32 Temp_int_Loop_Counter_Variable_7, bool CallFunc_Less_IntInt_ReturnValue_5, int32 CallFunc_Add_IntInt_ReturnValue_7, TArray<class ABP_DecorValeriaGatherable_C*>& CallFunc_GetAllActorsOfClass_OutActors, int32 CallFunc_Array_Length_ReturnValue_6, class ABP_DecorValeriaGatherable_C* CallFunc_Array_Get_Item_6, bool CallFunc_Less_IntInt_ReturnValue_6, TArray<class USceneComponent*>& CallFunc_GetChildrenComponents_Children, int32 CallFunc_Array_Length_ReturnValue_7, class USceneComponent* CallFunc_Array_Get_Item_7, bool CallFunc_Less_IntInt_ReturnValue_7, class UPointLightComponent* K2Node_DynamicCast_AsPoint_Light_Component, bool K2Node_DynamicCast_bSuccess, const struct FLinearColor& CallFunc_GetLightColor_ReturnValue, class USpotLightComponent* K2Node_DynamicCast_AsSpot_Light_Component, bool K2Node_DynamicCast_bSuccess_1, const struct FLinearColor& CallFunc_GetLightColor_ReturnValue_1, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, class UClass* CallFunc_GetObjectClass_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, bool CallFunc_EqualEqual_ClassClass_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABP_HousingLight_C* CallFunc_FinishSpawningActor_ReturnValue, bool CallFunc_EqualEqual_ClassClass_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PublicHousingPlot_Root_C">();
	}
	static class APublicHousingPlot_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APublicHousingPlot_Root_C>();
	}
};
static_assert(alignof(APublicHousingPlot_Root_C) == 0x000008, "Wrong alignment on APublicHousingPlot_Root_C");
static_assert(sizeof(APublicHousingPlot_Root_C) == 0x000308, "Wrong size on APublicHousingPlot_Root_C");
static_assert(offsetof(APublicHousingPlot_Root_C, UberGraphFrame) == 0x0002B0, "Member 'APublicHousingPlot_Root_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APublicHousingPlot_Root_C, CharacterPreviewer_Thumbnail) == 0x0002B8, "Member 'APublicHousingPlot_Root_C::CharacterPreviewer_Thumbnail' has a wrong offset!");
static_assert(offsetof(APublicHousingPlot_Root_C, CharacterPreviewer_Inventory) == 0x0002C0, "Member 'APublicHousingPlot_Root_C::CharacterPreviewer_Inventory' has a wrong offset!");
static_assert(offsetof(APublicHousingPlot_Root_C, IsSpot) == 0x0002C8, "Member 'APublicHousingPlot_Root_C::IsSpot' has a wrong offset!");
static_assert(offsetof(APublicHousingPlot_Root_C, LightActors) == 0x0002D0, "Member 'APublicHousingPlot_Root_C::LightActors' has a wrong offset!");
static_assert(offsetof(APublicHousingPlot_Root_C, DefaultLightComponents) == 0x0002E0, "Member 'APublicHousingPlot_Root_C::DefaultLightComponents' has a wrong offset!");
static_assert(offsetof(APublicHousingPlot_Root_C, CharacterRenderStudio) == 0x0002F0, "Member 'APublicHousingPlot_Root_C::CharacterRenderStudio' has a wrong offset!");
static_assert(offsetof(APublicHousingPlot_Root_C, CharacterPreviewerHelper_Thumbnail_1_GetCharacterPreviewer_MERGED_RefProperty) == 0x0002F8, "Member 'APublicHousingPlot_Root_C::CharacterPreviewerHelper_Thumbnail_1_GetCharacterPreviewer_MERGED_RefProperty' has a wrong offset!");
static_assert(offsetof(APublicHousingPlot_Root_C, CharacterPreviewerHelper_Inventory_0_GetCharacterInventoryPreviewer_MERGED_RefProperty) == 0x000300, "Member 'APublicHousingPlot_Root_C::CharacterPreviewerHelper_Inventory_0_GetCharacterInventoryPreviewer_MERGED_RefProperty' has a wrong offset!");

}

