#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S6AssetReleaseTargetingDeveloper

#include "Basic.hpp"

#include "S6AssetReleaseTargetingDeveloper_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function S6AssetReleaseTargetingDeveloper.S6AssetReleaseTargetingLibrary.GetAssetReleaseTargetingInfo_AssetData
// 0x00C8 (0x00C8 - 0x0000)
struct S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_AssetData final
{
public:
	struct FAssetData                             AssetData;                                         // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FS6AssetReleaseTargetingInfo           ReturnValue;                                       // 0x0068(0x0060)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_AssetData) == 0x000008, "Wrong alignment on S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_AssetData");
static_assert(sizeof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_AssetData) == 0x0000C8, "Wrong size on S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_AssetData");
static_assert(offsetof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_AssetData, AssetData) == 0x000000, "Member 'S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_AssetData::AssetData' has a wrong offset!");
static_assert(offsetof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_AssetData, ReturnValue) == 0x000068, "Member 'S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_AssetData::ReturnValue' has a wrong offset!");

// Function S6AssetReleaseTargetingDeveloper.S6AssetReleaseTargetingLibrary.GetAssetReleaseTargetingInfo_Object
// 0x0068 (0x0068 - 0x0000)
struct S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_Object final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FS6AssetReleaseTargetingInfo           ReturnValue;                                       // 0x0008(0x0060)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_Object) == 0x000008, "Wrong alignment on S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_Object");
static_assert(sizeof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_Object) == 0x000068, "Wrong size on S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_Object");
static_assert(offsetof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_Object, Object) == 0x000000, "Member 'S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_Object::Object' has a wrong offset!");
static_assert(offsetof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_Object, ReturnValue) == 0x000008, "Member 'S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_Object::ReturnValue' has a wrong offset!");

// Function S6AssetReleaseTargetingDeveloper.S6AssetReleaseTargetingLibrary.GetAssetReleaseTargetingInfo_ObjectPath
// 0x0080 (0x0080 - 0x0000)
struct S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_ObjectPath final
{
public:
	struct FSoftObjectPath                        SoftObjectPath;                                    // 0x0000(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FS6AssetReleaseTargetingInfo           ReturnValue;                                       // 0x0020(0x0060)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_ObjectPath) == 0x000008, "Wrong alignment on S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_ObjectPath");
static_assert(sizeof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_ObjectPath) == 0x000080, "Wrong size on S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_ObjectPath");
static_assert(offsetof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_ObjectPath, SoftObjectPath) == 0x000000, "Member 'S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_ObjectPath::SoftObjectPath' has a wrong offset!");
static_assert(offsetof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_ObjectPath, ReturnValue) == 0x000020, "Member 'S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_ObjectPath::ReturnValue' has a wrong offset!");

// Function S6AssetReleaseTargetingDeveloper.S6AssetReleaseTargetingLibrary.GetAssetReleaseTargetingInfo_PrimaryAssetId
// 0x0070 (0x0070 - 0x0000)
struct S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_PrimaryAssetId final
{
public:
	struct FPrimaryAssetId                        AssetId;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FS6AssetReleaseTargetingInfo           ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_PrimaryAssetId) == 0x000008, "Wrong alignment on S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_PrimaryAssetId");
static_assert(sizeof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_PrimaryAssetId) == 0x000070, "Wrong size on S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_PrimaryAssetId");
static_assert(offsetof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_PrimaryAssetId, AssetId) == 0x000000, "Member 'S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_PrimaryAssetId::AssetId' has a wrong offset!");
static_assert(offsetof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_PrimaryAssetId, ReturnValue) == 0x000010, "Member 'S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_PrimaryAssetId::ReturnValue' has a wrong offset!");

// Function S6AssetReleaseTargetingDeveloper.S6AssetReleaseTargetingLibrary.GetAssetReleaseTargetingInfo_SoftObject
// 0x0088 (0x0088 - 0x0000)
struct S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_SoftObject final
{
public:
	TSoftObjectPtr<class UObject>                 SoftObject;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FS6AssetReleaseTargetingInfo           ReturnValue;                                       // 0x0028(0x0060)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_SoftObject) == 0x000008, "Wrong alignment on S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_SoftObject");
static_assert(sizeof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_SoftObject) == 0x000088, "Wrong size on S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_SoftObject");
static_assert(offsetof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_SoftObject, SoftObject) == 0x000000, "Member 'S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_SoftObject::SoftObject' has a wrong offset!");
static_assert(offsetof(S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_SoftObject, ReturnValue) == 0x000028, "Member 'S6AssetReleaseTargetingLibrary_GetAssetReleaseTargetingInfo_SoftObject::ReturnValue' has a wrong offset!");

}

