#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S6Automation

#include "Basic.hpp"


namespace SDK
{

// Enum S6Automation.ES6Auto_SuiteSearchType
// NumValues: 0x0003
enum class ES6Auto_SuiteSearchType : uint8
{
	SuiteId                                  = 0,
	AssetName                                = 1,
	ES6Auto_MAX                              = 2,
};

// ScriptStruct S6Automation.S6Auto_SuiteCollection
// 0x0010 (0x0010 - 0x0000)
struct FS6Auto_SuiteCollection final
{
public:
	TArray<class US6Auto_Suite*>                  Suites;                                            // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FS6Auto_SuiteCollection) == 0x000008, "Wrong alignment on FS6Auto_SuiteCollection");
static_assert(sizeof(FS6Auto_SuiteCollection) == 0x000010, "Wrong size on FS6Auto_SuiteCollection");
static_assert(offsetof(FS6Auto_SuiteCollection, Suites) == 0x000000, "Member 'FS6Auto_SuiteCollection::Suites' has a wrong offset!");

// ScriptStruct S6Automation.S6Auto_SuiteStep
// 0x0018 (0x0018 - 0x0000)
struct FS6Auto_SuiteStep final
{
public:
	double                                        TimeoutSeconds;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class US6Auto_SuiteStepScript>    ScriptClass;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class US6Auto_SuiteStepPayload*               Payload;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FS6Auto_SuiteStep) == 0x000008, "Wrong alignment on FS6Auto_SuiteStep");
static_assert(sizeof(FS6Auto_SuiteStep) == 0x000018, "Wrong size on FS6Auto_SuiteStep");
static_assert(offsetof(FS6Auto_SuiteStep, TimeoutSeconds) == 0x000000, "Member 'FS6Auto_SuiteStep::TimeoutSeconds' has a wrong offset!");
static_assert(offsetof(FS6Auto_SuiteStep, ScriptClass) == 0x000008, "Member 'FS6Auto_SuiteStep::ScriptClass' has a wrong offset!");
static_assert(offsetof(FS6Auto_SuiteStep, Payload) == 0x000010, "Member 'FS6Auto_SuiteStep::Payload' has a wrong offset!");

}

