#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S6Automation

#include "Basic.hpp"


namespace SDK::Params
{

// Function S6Automation.S6Auto_SuiteSubsystem.RunSuites
// 0x0010 (0x0010 - 0x0000)
struct S6Auto_SuiteSubsystem_RunSuites final
{
public:
	TArray<class US6Auto_Suite*>                  Suites;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Auto_SuiteSubsystem_RunSuites) == 0x000008, "Wrong alignment on S6Auto_SuiteSubsystem_RunSuites");
static_assert(sizeof(S6Auto_SuiteSubsystem_RunSuites) == 0x000010, "Wrong size on S6Auto_SuiteSubsystem_RunSuites");
static_assert(offsetof(S6Auto_SuiteSubsystem_RunSuites, Suites) == 0x000000, "Member 'S6Auto_SuiteSubsystem_RunSuites::Suites' has a wrong offset!");

// Function S6Automation.S6Auto_SuiteStepScript.MarkStepFailed
// 0x0010 (0x0010 - 0x0000)
struct S6Auto_SuiteStepScript_MarkStepFailed final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Auto_SuiteStepScript_MarkStepFailed) == 0x000008, "Wrong alignment on S6Auto_SuiteStepScript_MarkStepFailed");
static_assert(sizeof(S6Auto_SuiteStepScript_MarkStepFailed) == 0x000010, "Wrong size on S6Auto_SuiteStepScript_MarkStepFailed");
static_assert(offsetof(S6Auto_SuiteStepScript_MarkStepFailed, ErrorMessage) == 0x000000, "Member 'S6Auto_SuiteStepScript_MarkStepFailed::ErrorMessage' has a wrong offset!");

// Function S6Automation.S6Auto_SuiteStepScript.GetScriptDisplayName
// 0x0018 (0x0018 - 0x0000)
struct S6Auto_SuiteStepScript_GetScriptDisplayName final
{
public:
	const class US6Auto_SuiteStepPayload*         ScriptPayload;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Auto_SuiteStepScript_GetScriptDisplayName) == 0x000008, "Wrong alignment on S6Auto_SuiteStepScript_GetScriptDisplayName");
static_assert(sizeof(S6Auto_SuiteStepScript_GetScriptDisplayName) == 0x000018, "Wrong size on S6Auto_SuiteStepScript_GetScriptDisplayName");
static_assert(offsetof(S6Auto_SuiteStepScript_GetScriptDisplayName, ScriptPayload) == 0x000000, "Member 'S6Auto_SuiteStepScript_GetScriptDisplayName::ScriptPayload' has a wrong offset!");
static_assert(offsetof(S6Auto_SuiteStepScript_GetScriptDisplayName, ReturnValue) == 0x000008, "Member 'S6Auto_SuiteStepScript_GetScriptDisplayName::ReturnValue' has a wrong offset!");

// Function S6Automation.S6AutoStatics.GetAllSuites
// 0x0010 (0x0010 - 0x0000)
struct S6AutoStatics_GetAllSuites final
{
public:
	TArray<TSoftObjectPtr<class US6Auto_Suite>>   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6AutoStatics_GetAllSuites) == 0x000008, "Wrong alignment on S6AutoStatics_GetAllSuites");
static_assert(sizeof(S6AutoStatics_GetAllSuites) == 0x000010, "Wrong size on S6AutoStatics_GetAllSuites");
static_assert(offsetof(S6AutoStatics_GetAllSuites, ReturnValue) == 0x000000, "Member 'S6AutoStatics_GetAllSuites::ReturnValue' has a wrong offset!");

// Function S6Automation.S6AutoStatics.GetSuitesFromAssetName
// 0x0018 (0x0018 - 0x0000)
struct S6AutoStatics_GetSuitesFromAssetName final
{
public:
	class FName                                   SuiteAssetName;                                    // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class US6Auto_Suite>>   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6AutoStatics_GetSuitesFromAssetName) == 0x000008, "Wrong alignment on S6AutoStatics_GetSuitesFromAssetName");
static_assert(sizeof(S6AutoStatics_GetSuitesFromAssetName) == 0x000018, "Wrong size on S6AutoStatics_GetSuitesFromAssetName");
static_assert(offsetof(S6AutoStatics_GetSuitesFromAssetName, SuiteAssetName) == 0x000000, "Member 'S6AutoStatics_GetSuitesFromAssetName::SuiteAssetName' has a wrong offset!");
static_assert(offsetof(S6AutoStatics_GetSuitesFromAssetName, ReturnValue) == 0x000008, "Member 'S6AutoStatics_GetSuitesFromAssetName::ReturnValue' has a wrong offset!");

// Function S6Automation.S6AutoStatics.GetSuitesFromId
// 0x0020 (0x0020 - 0x0000)
struct S6AutoStatics_GetSuitesFromId final
{
public:
	class FString                                 SuiteId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class US6Auto_Suite>>   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6AutoStatics_GetSuitesFromId) == 0x000008, "Wrong alignment on S6AutoStatics_GetSuitesFromId");
static_assert(sizeof(S6AutoStatics_GetSuitesFromId) == 0x000020, "Wrong size on S6AutoStatics_GetSuitesFromId");
static_assert(offsetof(S6AutoStatics_GetSuitesFromId, SuiteId) == 0x000000, "Member 'S6AutoStatics_GetSuitesFromId::SuiteId' has a wrong offset!");
static_assert(offsetof(S6AutoStatics_GetSuitesFromId, ReturnValue) == 0x000010, "Member 'S6AutoStatics_GetSuitesFromId::ReturnValue' has a wrong offset!");

}

