#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S6Core

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S6Core_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function S6Core.CommandLineHelper.DoesCommandlineHaveSwitch
// 0x0018 (0x0018 - 0x0000)
struct CommandLineHelper_DoesCommandlineHaveSwitch final
{
public:
	class FString                                 SWITCH;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD6[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommandLineHelper_DoesCommandlineHaveSwitch) == 0x000008, "Wrong alignment on CommandLineHelper_DoesCommandlineHaveSwitch");
static_assert(sizeof(CommandLineHelper_DoesCommandlineHaveSwitch) == 0x000018, "Wrong size on CommandLineHelper_DoesCommandlineHaveSwitch");
static_assert(offsetof(CommandLineHelper_DoesCommandlineHaveSwitch, SWITCH) == 0x000000, "Member 'CommandLineHelper_DoesCommandlineHaveSwitch::SWITCH' has a wrong offset!");
static_assert(offsetof(CommandLineHelper_DoesCommandlineHaveSwitch, ReturnValue) == 0x000010, "Member 'CommandLineHelper_DoesCommandlineHaveSwitch::ReturnValue' has a wrong offset!");

// Function S6Core.CommandLineHelper.TryGetCommandlineKeyValuePair
// 0x0028 (0x0028 - 0x0000)
struct CommandLineHelper_TryGetCommandlineKeyValuePair final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD7[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommandLineHelper_TryGetCommandlineKeyValuePair) == 0x000008, "Wrong alignment on CommandLineHelper_TryGetCommandlineKeyValuePair");
static_assert(sizeof(CommandLineHelper_TryGetCommandlineKeyValuePair) == 0x000028, "Wrong size on CommandLineHelper_TryGetCommandlineKeyValuePair");
static_assert(offsetof(CommandLineHelper_TryGetCommandlineKeyValuePair, Key) == 0x000000, "Member 'CommandLineHelper_TryGetCommandlineKeyValuePair::Key' has a wrong offset!");
static_assert(offsetof(CommandLineHelper_TryGetCommandlineKeyValuePair, Value) == 0x000010, "Member 'CommandLineHelper_TryGetCommandlineKeyValuePair::Value' has a wrong offset!");
static_assert(offsetof(CommandLineHelper_TryGetCommandlineKeyValuePair, ReturnValue) == 0x000020, "Member 'CommandLineHelper_TryGetCommandlineKeyValuePair::ReturnValue' has a wrong offset!");

// Function S6Core.S6DataAssetManager.FindConfigByGuid
// 0x0018 (0x0018 - 0x0000)
struct S6DataAssetManager_FindConfigByGuid final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGuidDataAsset*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6DataAssetManager_FindConfigByGuid) == 0x000008, "Wrong alignment on S6DataAssetManager_FindConfigByGuid");
static_assert(sizeof(S6DataAssetManager_FindConfigByGuid) == 0x000018, "Wrong size on S6DataAssetManager_FindConfigByGuid");
static_assert(offsetof(S6DataAssetManager_FindConfigByGuid, Guid) == 0x000000, "Member 'S6DataAssetManager_FindConfigByGuid::Guid' has a wrong offset!");
static_assert(offsetof(S6DataAssetManager_FindConfigByGuid, ReturnValue) == 0x000010, "Member 'S6DataAssetManager_FindConfigByGuid::ReturnValue' has a wrong offset!");

// Function S6Core.S6DataAssetManager.GetAllGuidDataAssets
// 0x0010 (0x0010 - 0x0000)
struct S6DataAssetManager_GetAllGuidDataAssets final
{
public:
	TArray<class UGuidDataAsset*>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6DataAssetManager_GetAllGuidDataAssets) == 0x000008, "Wrong alignment on S6DataAssetManager_GetAllGuidDataAssets");
static_assert(sizeof(S6DataAssetManager_GetAllGuidDataAssets) == 0x000010, "Wrong size on S6DataAssetManager_GetAllGuidDataAssets");
static_assert(offsetof(S6DataAssetManager_GetAllGuidDataAssets, ReturnValue) == 0x000000, "Member 'S6DataAssetManager_GetAllGuidDataAssets::ReturnValue' has a wrong offset!");

// Function S6Core.S6VersioningFunctionLibrary.GetNetworkCompatibilityString
// 0x0010 (0x0010 - 0x0000)
struct S6VersioningFunctionLibrary_GetNetworkCompatibilityString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6VersioningFunctionLibrary_GetNetworkCompatibilityString) == 0x000008, "Wrong alignment on S6VersioningFunctionLibrary_GetNetworkCompatibilityString");
static_assert(sizeof(S6VersioningFunctionLibrary_GetNetworkCompatibilityString) == 0x000010, "Wrong size on S6VersioningFunctionLibrary_GetNetworkCompatibilityString");
static_assert(offsetof(S6VersioningFunctionLibrary_GetNetworkCompatibilityString, ReturnValue) == 0x000000, "Member 'S6VersioningFunctionLibrary_GetNetworkCompatibilityString::ReturnValue' has a wrong offset!");

// Function S6Core.S6VersioningFunctionLibrary.GetVersionString
// 0x0010 (0x0010 - 0x0000)
struct S6VersioningFunctionLibrary_GetVersionString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6VersioningFunctionLibrary_GetVersionString) == 0x000008, "Wrong alignment on S6VersioningFunctionLibrary_GetVersionString");
static_assert(sizeof(S6VersioningFunctionLibrary_GetVersionString) == 0x000010, "Wrong size on S6VersioningFunctionLibrary_GetVersionString");
static_assert(offsetof(S6VersioningFunctionLibrary_GetVersionString, ReturnValue) == 0x000000, "Member 'S6VersioningFunctionLibrary_GetVersionString::ReturnValue' has a wrong offset!");

// Function S6Core.S6VersioningFunctionLibrary.IsValidVersionString
// 0x0018 (0x0018 - 0x0000)
struct S6VersioningFunctionLibrary_IsValidVersionString final
{
public:
	class FString                                 InVersion;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CDB[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S6VersioningFunctionLibrary_IsValidVersionString) == 0x000008, "Wrong alignment on S6VersioningFunctionLibrary_IsValidVersionString");
static_assert(sizeof(S6VersioningFunctionLibrary_IsValidVersionString) == 0x000018, "Wrong size on S6VersioningFunctionLibrary_IsValidVersionString");
static_assert(offsetof(S6VersioningFunctionLibrary_IsValidVersionString, InVersion) == 0x000000, "Member 'S6VersioningFunctionLibrary_IsValidVersionString::InVersion' has a wrong offset!");
static_assert(offsetof(S6VersioningFunctionLibrary_IsValidVersionString, ReturnValue) == 0x000010, "Member 'S6VersioningFunctionLibrary_IsValidVersionString::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.DeleteFileAtPath
// 0x0018 (0x0018 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_DeleteFileAtPath final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CDC[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_DeleteFileAtPath) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_DeleteFileAtPath");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_DeleteFileAtPath) == 0x000018, "Wrong size on S6Core_General_BlueprintFunctionLibrary_DeleteFileAtPath");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_DeleteFileAtPath, FilePath) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_DeleteFileAtPath::FilePath' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_DeleteFileAtPath, ReturnValue) == 0x000010, "Member 'S6Core_General_BlueprintFunctionLibrary_DeleteFileAtPath::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.DoesFunctionExist
// 0x0018 (0x0018 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_DoesFunctionExist final
{
public:
	class UObject*                                Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FunctionName;                                      // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CDD[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_DoesFunctionExist) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_DoesFunctionExist");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_DoesFunctionExist) == 0x000018, "Wrong size on S6Core_General_BlueprintFunctionLibrary_DoesFunctionExist");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_DoesFunctionExist, Instance) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_DoesFunctionExist::Instance' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_DoesFunctionExist, FunctionName) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_DoesFunctionExist::FunctionName' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_DoesFunctionExist, ReturnValue) == 0x000010, "Member 'S6Core_General_BlueprintFunctionLibrary_DoesFunctionExist::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.FindDefaultComponentByClass
// 0x0018 (0x0018 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentByClass final
{
public:
	TSubclassOf<class AActor>                     InActorClass;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorComponent>            InComponentClass;                                  // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentByClass) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentByClass");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentByClass) == 0x000018, "Wrong size on S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentByClass");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentByClass, InActorClass) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentByClass::InActorClass' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentByClass, InComponentClass) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentByClass::InComponentClass' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentByClass, ReturnValue) == 0x000010, "Member 'S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentByClass::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.FindDefaultComponentsByClass
// 0x0020 (0x0020 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentsByClass final
{
public:
	TSubclassOf<class AActor>                     InActorClass;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorComponent>            InComponentClass;                                  // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>                ReturnValue;                                       // 0x0010(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentsByClass) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentsByClass");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentsByClass) == 0x000020, "Wrong size on S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentsByClass");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentsByClass, InActorClass) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentsByClass::InActorClass' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentsByClass, InComponentClass) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentsByClass::InComponentClass' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentsByClass, ReturnValue) == 0x000010, "Member 'S6Core_General_BlueprintFunctionLibrary_FindDefaultComponentsByClass::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.GetActorBounds
// 0x0048 (0x0048 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_GetActorBounds final
{
public:
	TSubclassOf<class AActor>                     InActorClass;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyCollidingComponents;                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CDE[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   OutBounds;                                         // 0x0010(0x0038)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_GetActorBounds) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_GetActorBounds");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_GetActorBounds) == 0x000048, "Wrong size on S6Core_General_BlueprintFunctionLibrary_GetActorBounds");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetActorBounds, InActorClass) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_GetActorBounds::InActorClass' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetActorBounds, bOnlyCollidingComponents) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_GetActorBounds::bOnlyCollidingComponents' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetActorBounds, OutBounds) == 0x000010, "Member 'S6Core_General_BlueprintFunctionLibrary_GetActorBounds::OutBounds' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.GetAllKnownPlayerPawns
// 0x0060 (0x0060 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_GetAllKnownPlayerPawns final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FUniqueNetIdRepl, class APawn*>   PlayerPawns;                                       // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bIncludeLocalPawn;                                 // 0x0058(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CDF[0x7];                                     // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_GetAllKnownPlayerPawns) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_GetAllKnownPlayerPawns");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_GetAllKnownPlayerPawns) == 0x000060, "Wrong size on S6Core_General_BlueprintFunctionLibrary_GetAllKnownPlayerPawns");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetAllKnownPlayerPawns, LocalPlayer) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_GetAllKnownPlayerPawns::LocalPlayer' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetAllKnownPlayerPawns, PlayerPawns) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_GetAllKnownPlayerPawns::PlayerPawns' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetAllKnownPlayerPawns, bIncludeLocalPawn) == 0x000058, "Member 'S6Core_General_BlueprintFunctionLibrary_GetAllKnownPlayerPawns::bIncludeLocalPawn' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.GetAllStatDataForStatGroup
// 0x0058 (0x0058 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_GetAllStatDataForStatGroup final
{
public:
	class FName                                   StatGroupName;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FS6Core_StatData>    ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_GetAllStatDataForStatGroup) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_GetAllStatDataForStatGroup");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_GetAllStatDataForStatGroup) == 0x000058, "Wrong size on S6Core_General_BlueprintFunctionLibrary_GetAllStatDataForStatGroup");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetAllStatDataForStatGroup, StatGroupName) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_GetAllStatDataForStatGroup::StatGroupName' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetAllStatDataForStatGroup, ReturnValue) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_GetAllStatDataForStatGroup::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.GetComponentByInterface
// 0x0018 (0x0018 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_GetComponentByInterface final
{
public:
	const class AActor*                           InActor;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class IInterface>                 Interface;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_GetComponentByInterface) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_GetComponentByInterface");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_GetComponentByInterface) == 0x000018, "Wrong size on S6Core_General_BlueprintFunctionLibrary_GetComponentByInterface");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetComponentByInterface, InActor) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_GetComponentByInterface::InActor' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetComponentByInterface, Interface) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_GetComponentByInterface::Interface' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetComponentByInterface, ReturnValue) == 0x000010, "Member 'S6Core_General_BlueprintFunctionLibrary_GetComponentByInterface::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.GetCurrentDrawCalls
// 0x0004 (0x0004 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_GetCurrentDrawCalls final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_GetCurrentDrawCalls) == 0x000004, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_GetCurrentDrawCalls");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_GetCurrentDrawCalls) == 0x000004, "Wrong size on S6Core_General_BlueprintFunctionLibrary_GetCurrentDrawCalls");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetCurrentDrawCalls, ReturnValue) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_GetCurrentDrawCalls::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.GetCurrentMapName
// 0x0010 (0x0010 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_GetCurrentMapName final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_GetCurrentMapName) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_GetCurrentMapName");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_GetCurrentMapName) == 0x000010, "Wrong size on S6Core_General_BlueprintFunctionLibrary_GetCurrentMapName");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetCurrentMapName, WorldContextObject) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_GetCurrentMapName::WorldContextObject' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetCurrentMapName, ReturnValue) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_GetCurrentMapName::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.GetLocalPlayerFromController
// 0x0010 (0x0010 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_GetLocalPlayerFromController final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalPlayer*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_GetLocalPlayerFromController) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_GetLocalPlayerFromController");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_GetLocalPlayerFromController) == 0x000010, "Wrong size on S6Core_General_BlueprintFunctionLibrary_GetLocalPlayerFromController");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetLocalPlayerFromController, Controller) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_GetLocalPlayerFromController::Controller' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetLocalPlayerFromController, ReturnValue) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_GetLocalPlayerFromController::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.GetStatDataFromName
// 0x0014 (0x0014 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_GetStatDataFromName final
{
public:
	class FName                                   StatName;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FS6Core_StatData                       ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_GetStatDataFromName) == 0x000004, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_GetStatDataFromName");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_GetStatDataFromName) == 0x000014, "Wrong size on S6Core_General_BlueprintFunctionLibrary_GetStatDataFromName");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetStatDataFromName, StatName) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_GetStatDataFromName::StatName' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_GetStatDataFromName, ReturnValue) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_GetStatDataFromName::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.HasBegunPlay
// 0x0010 (0x0010 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_HasBegunPlay final
{
public:
	const class AActor*                           InActor;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CE0[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_HasBegunPlay) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_HasBegunPlay");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_HasBegunPlay) == 0x000010, "Wrong size on S6Core_General_BlueprintFunctionLibrary_HasBegunPlay");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_HasBegunPlay, InActor) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_HasBegunPlay::InActor' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_HasBegunPlay, ReturnValue) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_HasBegunPlay::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.IsStatGroupToggled
// 0x000C (0x000C - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_IsStatGroupToggled final
{
public:
	class FName                                   StatGroupName;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CE1[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_IsStatGroupToggled) == 0x000004, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_IsStatGroupToggled");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_IsStatGroupToggled) == 0x00000C, "Wrong size on S6Core_General_BlueprintFunctionLibrary_IsStatGroupToggled");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_IsStatGroupToggled, StatGroupName) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_IsStatGroupToggled::StatGroupName' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_IsStatGroupToggled, ReturnValue) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_IsStatGroupToggled::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.PrintToConsoleWindow
// 0x0010 (0x0010 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_PrintToConsoleWindow final
{
public:
	class FString                                 Msg;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_PrintToConsoleWindow) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_PrintToConsoleWindow");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_PrintToConsoleWindow) == 0x000010, "Wrong size on S6Core_General_BlueprintFunctionLibrary_PrintToConsoleWindow");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_PrintToConsoleWindow, Msg) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_PrintToConsoleWindow::Msg' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.ShowSimpleNotification
// 0x0018 (0x0018 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_ShowSimpleNotification final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bErrorMessage;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CE2[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WidthOverride;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_ShowSimpleNotification) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_ShowSimpleNotification");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_ShowSimpleNotification) == 0x000018, "Wrong size on S6Core_General_BlueprintFunctionLibrary_ShowSimpleNotification");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_ShowSimpleNotification, Text) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_ShowSimpleNotification::Text' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_ShowSimpleNotification, bErrorMessage) == 0x000010, "Member 'S6Core_General_BlueprintFunctionLibrary_ShowSimpleNotification::bErrorMessage' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_ShowSimpleNotification, WidthOverride) == 0x000014, "Member 'S6Core_General_BlueprintFunctionLibrary_ShowSimpleNotification::WidthOverride' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.TakeHighResScreenshotOfGameViewport
// 0x0018 (0x0018 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport final
{
public:
	const class UGameInstance*                    GameInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ImageSize_X;                                       // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ImageSize_Y;                                       // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImageResolution;                                   // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseHDR;                                            // 0x0014(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MaskBackground;                                    // 0x0015(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CE3[0x2];                                     // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport) == 0x000018, "Wrong size on S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport, GameInstance) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport::GameInstance' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport, ImageSize_X) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport::ImageSize_X' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport, ImageSize_Y) == 0x00000C, "Member 'S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport::ImageSize_Y' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport, ImageResolution) == 0x000010, "Member 'S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport::ImageResolution' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport, UseHDR) == 0x000014, "Member 'S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport::UseHDR' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport, MaskBackground) == 0x000015, "Member 'S6Core_General_BlueprintFunctionLibrary_TakeHighResScreenshotOfGameViewport::MaskBackground' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.ToggleScreenshotMaskOnCurrentGameViewport
// 0x0010 (0x0010 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_ToggleScreenshotMaskOnCurrentGameViewport final
{
public:
	const class UGameInstance*                    GameInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MaskEnabled;                                       // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CE4[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_ToggleScreenshotMaskOnCurrentGameViewport) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_ToggleScreenshotMaskOnCurrentGameViewport");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_ToggleScreenshotMaskOnCurrentGameViewport) == 0x000010, "Wrong size on S6Core_General_BlueprintFunctionLibrary_ToggleScreenshotMaskOnCurrentGameViewport");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_ToggleScreenshotMaskOnCurrentGameViewport, GameInstance) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_ToggleScreenshotMaskOnCurrentGameViewport::GameInstance' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_ToggleScreenshotMaskOnCurrentGameViewport, MaskEnabled) == 0x000008, "Member 'S6Core_General_BlueprintFunctionLibrary_ToggleScreenshotMaskOnCurrentGameViewport::MaskEnabled' has a wrong offset!");

// Function S6Core.S6Core_General_BlueprintFunctionLibrary.ToInt64
// 0x0018 (0x0018 - 0x0000)
struct S6Core_General_BlueprintFunctionLibrary_ToInt64 final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_General_BlueprintFunctionLibrary_ToInt64) == 0x000008, "Wrong alignment on S6Core_General_BlueprintFunctionLibrary_ToInt64");
static_assert(sizeof(S6Core_General_BlueprintFunctionLibrary_ToInt64) == 0x000018, "Wrong size on S6Core_General_BlueprintFunctionLibrary_ToInt64");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_ToInt64, InString) == 0x000000, "Member 'S6Core_General_BlueprintFunctionLibrary_ToInt64::InString' has a wrong offset!");
static_assert(offsetof(S6Core_General_BlueprintFunctionLibrary_ToInt64, ReturnValue) == 0x000010, "Member 'S6Core_General_BlueprintFunctionLibrary_ToInt64::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_AsyncAction_LevelTravel.LevelTravel
// 0x0020 (0x0020 - 0x0000)
struct S6Core_AsyncAction_LevelTravel_LevelTravel final
{
public:
	class FString                                 LevelName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InWorldContextObject;                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class US6Core_AsyncAction_LevelTravel*        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_AsyncAction_LevelTravel_LevelTravel) == 0x000008, "Wrong alignment on S6Core_AsyncAction_LevelTravel_LevelTravel");
static_assert(sizeof(S6Core_AsyncAction_LevelTravel_LevelTravel) == 0x000020, "Wrong size on S6Core_AsyncAction_LevelTravel_LevelTravel");
static_assert(offsetof(S6Core_AsyncAction_LevelTravel_LevelTravel, LevelName) == 0x000000, "Member 'S6Core_AsyncAction_LevelTravel_LevelTravel::LevelName' has a wrong offset!");
static_assert(offsetof(S6Core_AsyncAction_LevelTravel_LevelTravel, InWorldContextObject) == 0x000010, "Member 'S6Core_AsyncAction_LevelTravel_LevelTravel::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(S6Core_AsyncAction_LevelTravel_LevelTravel, ReturnValue) == 0x000018, "Member 'S6Core_AsyncAction_LevelTravel_LevelTravel::ReturnValue' has a wrong offset!");

// Function S6Core.S6Core_AsyncAction_LoadSublevel.LoadSublevel
// 0x0028 (0x0028 - 0x0000)
struct S6Core_AsyncAction_LoadSublevel_LoadSublevel final
{
public:
	class FString                                 InLevelName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InWorldContextObject;                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInShouldBeVisible;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CE7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6Core_AsyncAction_LoadSublevel*       ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6Core_AsyncAction_LoadSublevel_LoadSublevel) == 0x000008, "Wrong alignment on S6Core_AsyncAction_LoadSublevel_LoadSublevel");
static_assert(sizeof(S6Core_AsyncAction_LoadSublevel_LoadSublevel) == 0x000028, "Wrong size on S6Core_AsyncAction_LoadSublevel_LoadSublevel");
static_assert(offsetof(S6Core_AsyncAction_LoadSublevel_LoadSublevel, InLevelName) == 0x000000, "Member 'S6Core_AsyncAction_LoadSublevel_LoadSublevel::InLevelName' has a wrong offset!");
static_assert(offsetof(S6Core_AsyncAction_LoadSublevel_LoadSublevel, InWorldContextObject) == 0x000010, "Member 'S6Core_AsyncAction_LoadSublevel_LoadSublevel::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(S6Core_AsyncAction_LoadSublevel_LoadSublevel, bInShouldBeVisible) == 0x000018, "Member 'S6Core_AsyncAction_LoadSublevel_LoadSublevel::bInShouldBeVisible' has a wrong offset!");
static_assert(offsetof(S6Core_AsyncAction_LoadSublevel_LoadSublevel, ReturnValue) == 0x000020, "Member 'S6Core_AsyncAction_LoadSublevel_LoadSublevel::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.GetEnvironment
// 0x0010 (0x0010 - 0x0000)
struct S6PlatformUtils_GetEnvironment final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_GetEnvironment) == 0x000008, "Wrong alignment on S6PlatformUtils_GetEnvironment");
static_assert(sizeof(S6PlatformUtils_GetEnvironment) == 0x000010, "Wrong size on S6PlatformUtils_GetEnvironment");
static_assert(offsetof(S6PlatformUtils_GetEnvironment, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_GetEnvironment::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.GetPlatformString
// 0x0010 (0x0010 - 0x0000)
struct S6PlatformUtils_GetPlatformString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_GetPlatformString) == 0x000008, "Wrong alignment on S6PlatformUtils_GetPlatformString");
static_assert(sizeof(S6PlatformUtils_GetPlatformString) == 0x000010, "Wrong size on S6PlatformUtils_GetPlatformString");
static_assert(offsetof(S6PlatformUtils_GetPlatformString, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_GetPlatformString::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.GetPlatformType
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_GetPlatformType final
{
public:
	ERedirectsPlatform                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_GetPlatformType) == 0x000001, "Wrong alignment on S6PlatformUtils_GetPlatformType");
static_assert(sizeof(S6PlatformUtils_GetPlatformType) == 0x000001, "Wrong size on S6PlatformUtils_GetPlatformType");
static_assert(offsetof(S6PlatformUtils_GetPlatformType, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_GetPlatformType::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.GetPlatformTypeFromString
// 0x0018 (0x0018 - 0x0000)
struct S6PlatformUtils_GetPlatformTypeFromString final
{
public:
	class FString                                 PlatformName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERedirectsPlatform                            ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CEC[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S6PlatformUtils_GetPlatformTypeFromString) == 0x000008, "Wrong alignment on S6PlatformUtils_GetPlatformTypeFromString");
static_assert(sizeof(S6PlatformUtils_GetPlatformTypeFromString) == 0x000018, "Wrong size on S6PlatformUtils_GetPlatformTypeFromString");
static_assert(offsetof(S6PlatformUtils_GetPlatformTypeFromString, PlatformName) == 0x000000, "Member 'S6PlatformUtils_GetPlatformTypeFromString::PlatformName' has a wrong offset!");
static_assert(offsetof(S6PlatformUtils_GetPlatformTypeFromString, ReturnValue) == 0x000010, "Member 'S6PlatformUtils_GetPlatformTypeFromString::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.GetSonyPlayerIdsAtLocalUserIndex
// 0x0020 (0x0020 - 0x0000)
struct S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex final
{
public:
	int32                                         LocalUserIndex;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CED[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         OutAccountId;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         OutUserId;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CEE[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex) == 0x000008, "Wrong alignment on S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex");
static_assert(sizeof(S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex) == 0x000020, "Wrong size on S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex");
static_assert(offsetof(S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex, LocalUserIndex) == 0x000000, "Member 'S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex::LocalUserIndex' has a wrong offset!");
static_assert(offsetof(S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex, OutAccountId) == 0x000008, "Member 'S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex::OutAccountId' has a wrong offset!");
static_assert(offsetof(S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex, OutUserId) == 0x000010, "Member 'S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex::OutUserId' has a wrong offset!");
static_assert(offsetof(S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex, ReturnValue) == 0x000018, "Member 'S6PlatformUtils_GetSonyPlayerIdsAtLocalUserIndex::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.IsConsole
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_IsConsole final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_IsConsole) == 0x000001, "Wrong alignment on S6PlatformUtils_IsConsole");
static_assert(sizeof(S6PlatformUtils_IsConsole) == 0x000001, "Wrong size on S6PlatformUtils_IsConsole");
static_assert(offsetof(S6PlatformUtils_IsConsole, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_IsConsole::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.IsConsolePlatform
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_IsConsolePlatform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_IsConsolePlatform) == 0x000001, "Wrong alignment on S6PlatformUtils_IsConsolePlatform");
static_assert(sizeof(S6PlatformUtils_IsConsolePlatform) == 0x000001, "Wrong size on S6PlatformUtils_IsConsolePlatform");
static_assert(offsetof(S6PlatformUtils_IsConsolePlatform, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_IsConsolePlatform::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.IsConstrainedPlatform
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_IsConstrainedPlatform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_IsConstrainedPlatform) == 0x000001, "Wrong alignment on S6PlatformUtils_IsConstrainedPlatform");
static_assert(sizeof(S6PlatformUtils_IsConstrainedPlatform) == 0x000001, "Wrong size on S6PlatformUtils_IsConstrainedPlatform");
static_assert(offsetof(S6PlatformUtils_IsConstrainedPlatform, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_IsConstrainedPlatform::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.IsDesktop
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_IsDesktop final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_IsDesktop) == 0x000001, "Wrong alignment on S6PlatformUtils_IsDesktop");
static_assert(sizeof(S6PlatformUtils_IsDesktop) == 0x000001, "Wrong size on S6PlatformUtils_IsDesktop");
static_assert(offsetof(S6PlatformUtils_IsDesktop, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_IsDesktop::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.IsInParentalControl
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_IsInParentalControl final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_IsInParentalControl) == 0x000001, "Wrong alignment on S6PlatformUtils_IsInParentalControl");
static_assert(sizeof(S6PlatformUtils_IsInParentalControl) == 0x000001, "Wrong size on S6PlatformUtils_IsInParentalControl");
static_assert(offsetof(S6PlatformUtils_IsInParentalControl, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_IsInParentalControl::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.IsMobile
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_IsMobile final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_IsMobile) == 0x000001, "Wrong alignment on S6PlatformUtils_IsMobile");
static_assert(sizeof(S6PlatformUtils_IsMobile) == 0x000001, "Wrong size on S6PlatformUtils_IsMobile");
static_assert(offsetof(S6PlatformUtils_IsMobile, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_IsMobile::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.IsMobilePlatform
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_IsMobilePlatform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_IsMobilePlatform) == 0x000001, "Wrong alignment on S6PlatformUtils_IsMobilePlatform");
static_assert(sizeof(S6PlatformUtils_IsMobilePlatform) == 0x000001, "Wrong size on S6PlatformUtils_IsMobilePlatform");
static_assert(offsetof(S6PlatformUtils_IsMobilePlatform, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_IsMobilePlatform::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.IsPS5Platform
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_IsPS5Platform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_IsPS5Platform) == 0x000001, "Wrong alignment on S6PlatformUtils_IsPS5Platform");
static_assert(sizeof(S6PlatformUtils_IsPS5Platform) == 0x000001, "Wrong size on S6PlatformUtils_IsPS5Platform");
static_assert(offsetof(S6PlatformUtils_IsPS5Platform, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_IsPS5Platform::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.IsSwitchPlatform
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_IsSwitchPlatform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_IsSwitchPlatform) == 0x000001, "Wrong alignment on S6PlatformUtils_IsSwitchPlatform");
static_assert(sizeof(S6PlatformUtils_IsSwitchPlatform) == 0x000001, "Wrong size on S6PlatformUtils_IsSwitchPlatform");
static_assert(offsetof(S6PlatformUtils_IsSwitchPlatform, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_IsSwitchPlatform::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.IsWindowsPlatform
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_IsWindowsPlatform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(S6PlatformUtils_IsWindowsPlatform) == 0x000001, "Wrong alignment on S6PlatformUtils_IsWindowsPlatform");
static_assert(sizeof(S6PlatformUtils_IsWindowsPlatform) == 0x000001, "Wrong size on S6PlatformUtils_IsWindowsPlatform");
static_assert(offsetof(S6PlatformUtils_IsWindowsPlatform, ReturnValue) == 0x000000, "Member 'S6PlatformUtils_IsWindowsPlatform::ReturnValue' has a wrong offset!");

// Function S6Core.S6PlatformUtils.IsXSXPlatform
// 0x0001 (0x0001 - 0x0000)
struct S6PlatformUtils_IsXSXPlatform final
{
public:
