#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S6PlatformAuthentication

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class S6PlatformAuthentication.S6TokenProviderConfiguration
// 0x0010 (0x0048 - 0x0038)
class US6TokenProviderConfiguration final : public UDeveloperSettings
{
public:
	float                                         ExpiryRefreshPercent;                              // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialBackOffInterval;                            // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BackOffMultiplier;                                 // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxBackOffInterval;                                // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S6TokenProviderConfiguration">();
	}
	static class US6TokenProviderConfiguration* GetDefaultObj()
	{
		return GetDefaultObjImpl<US6TokenProviderConfiguration>();
	}
};
static_assert(alignof(US6TokenProviderConfiguration) == 0x000008, "Wrong alignment on US6TokenProviderConfiguration");
static_assert(sizeof(US6TokenProviderConfiguration) == 0x000048, "Wrong size on US6TokenProviderConfiguration");
static_assert(offsetof(US6TokenProviderConfiguration, ExpiryRefreshPercent) == 0x000038, "Member 'US6TokenProviderConfiguration::ExpiryRefreshPercent' has a wrong offset!");
static_assert(offsetof(US6TokenProviderConfiguration, InitialBackOffInterval) == 0x00003C, "Member 'US6TokenProviderConfiguration::InitialBackOffInterval' has a wrong offset!");
static_assert(offsetof(US6TokenProviderConfiguration, BackOffMultiplier) == 0x000040, "Member 'US6TokenProviderConfiguration::BackOffMultiplier' has a wrong offset!");
static_assert(offsetof(US6TokenProviderConfiguration, MaxBackOffInterval) == 0x000044, "Member 'US6TokenProviderConfiguration::MaxBackOffInterval' has a wrong offset!");

// Class S6PlatformAuthentication.S6TokenProvider
// 0x0060 (0x0090 - 0x0030)
class US6TokenProvider final : public UGameInstanceSubsystem
{
public:
	FMulticastInlineDelegateProperty_             OnTokenReady;                                      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D05[0x50];                                    // 0x0040(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FetchTokenWithRetries();
	void OnTokenReady__DelegateSignature();

	class FString GetToken() const;
	bool IsReady() const;
	bool IsTokenValid() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S6TokenProvider">();
	}
	static class US6TokenProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<US6TokenProvider>();
	}
};
static_assert(alignof(US6TokenProvider) == 0x000008, "Wrong alignment on US6TokenProvider");
static_assert(sizeof(US6TokenProvider) == 0x000090, "Wrong size on US6TokenProvider");
static_assert(offsetof(US6TokenProvider, OnTokenReady) == 0x000030, "Member 'US6TokenProvider::OnTokenReady' has a wrong offset!");

}

