#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S6Sentry

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class S6Sentry.S6SentryConfig
// 0x0030 (0x0068 - 0x0038)
class US6SentryConfig final : public UDeveloperSettings
{
public:
	class FString                                 DSN;                                               // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientDSN;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DatabasePath;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S6SentryConfig">();
	}
	static class US6SentryConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<US6SentryConfig>();
	}
};
static_assert(alignof(US6SentryConfig) == 0x000008, "Wrong alignment on US6SentryConfig");
static_assert(sizeof(US6SentryConfig) == 0x000068, "Wrong size on US6SentryConfig");
static_assert(offsetof(US6SentryConfig, DSN) == 0x000038, "Member 'US6SentryConfig::DSN' has a wrong offset!");
static_assert(offsetof(US6SentryConfig, ClientDSN) == 0x000048, "Member 'US6SentryConfig::ClientDSN' has a wrong offset!");
static_assert(offsetof(US6SentryConfig, DatabasePath) == 0x000058, "Member 'US6SentryConfig::DatabasePath' has a wrong offset!");

}

