#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S6StaticMeshPresets

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class S6StaticMeshPresets.S6StaticMeshAssetData
// 0x0000 (0x0028 - 0x0028)
class US6StaticMeshAssetData final : public UAssetUserData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S6StaticMeshAssetData">();
	}
	static class US6StaticMeshAssetData* GetDefaultObj()
	{
		return GetDefaultObjImpl<US6StaticMeshAssetData>();
	}
};
static_assert(alignof(US6StaticMeshAssetData) == 0x000008, "Wrong alignment on US6StaticMeshAssetData");
static_assert(sizeof(US6StaticMeshAssetData) == 0x000028, "Wrong size on US6StaticMeshAssetData");

// Class S6StaticMeshPresets.S6StaticMeshAssetPreset
// 0x0008 (0x0038 - 0x0030)
class US6StaticMeshAssetPreset final : public UDataAsset
{
public:
	uint8                                         bOverride_Mobility : 1;                            // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MinScale : 1;                            // 0x0030(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MaxScale : 1;                            // 0x0030(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_IncludeInHLODs : 1;                      // 0x0030(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ForcedLODModel : 1;                      // 0x0030(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MinLOD : 1;                              // 0x0030(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OverrideMinLOD : 1;                      // 0x0030(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DetailMode : 1;                          // 0x0030(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MaxDrawDistance : 1;                     // 0x0031(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CollisionPreset : 1;                     // 0x0031(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CastShadow : 1;                          // 0x0031(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_UseAsOccluder : 1;                       // 0x0031(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_IsEditorOnly : 1;                        // 0x0031(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RuntimeGrid : 1;                         // 0x0031(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_IsSpatiallyLoaded : 1;                   // 0x0031(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_38A8[0x6];                                     // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S6StaticMeshAssetPreset">();
	}
	static class US6StaticMeshAssetPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<US6StaticMeshAssetPreset>();
	}
};
static_assert(alignof(US6StaticMeshAssetPreset) == 0x000008, "Wrong alignment on US6StaticMeshAssetPreset");
static_assert(sizeof(US6StaticMeshAssetPreset) == 0x000038, "Wrong size on US6StaticMeshAssetPreset");

// Class S6StaticMeshPresets.S6StaticMeshActorOverride
// 0x0008 (0x0038 - 0x0030)
class US6StaticMeshActorOverride final : public UDataAsset
{
public:
	uint8                                         bOverride_IsEditorOnly : 1;                        // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RuntimeGrid : 1;                         // 0x0030(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_IsSpatiallyLoaded : 1;                   // 0x0030(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_38A9[0x7];                                     // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S6StaticMeshActorOverride">();
	}
	static class US6StaticMeshActorOverride* GetDefaultObj()
	{
		return GetDefaultObjImpl<US6StaticMeshActorOverride>();
	}
};
static_assert(alignof(US6StaticMeshActorOverride) == 0x000008, "Wrong alignment on US6StaticMeshActorOverride");
static_assert(sizeof(US6StaticMeshActorOverride) == 0x000038, "Wrong size on US6StaticMeshActorOverride");

// Class S6StaticMeshPresets.S6StaticMeshComponentOverride
// 0x0008 (0x0038 - 0x0030)
class US6StaticMeshComponentOverride final : public UDataAsset
{
public:
	uint8                                         bOverride_Mobility : 1;                            // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_IncludeInHLODs : 1;                      // 0x0030(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ForcedLODModel : 1;                      // 0x0030(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MinLOD : 1;                              // 0x0030(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OverrideMinLOD : 1;                      // 0x0030(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DetailMode : 1;                          // 0x0030(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MaxDrawDistanceMin : 1;                  // 0x0030(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MaxDrawDistanceMax : 1;                  // 0x0030(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CollisionPreset : 1;                     // 0x0031(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CastShadow : 1;                          // 0x0031(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_UseAsOccluder : 1;                       // 0x0031(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_38AA[0x6];                                     // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S6StaticMeshComponentOverride">();
	}
	static class US6StaticMeshComponentOverride* GetDefaultObj()
	{
		return GetDefaultObjImpl<US6StaticMeshComponentOverride>();
	}
};
static_assert(alignof(US6StaticMeshComponentOverride) == 0x000008, "Wrong alignment on US6StaticMeshComponentOverride");
static_assert(sizeof(US6StaticMeshComponentOverride) == 0x000038, "Wrong size on US6StaticMeshComponentOverride");

}

