#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S6Vivox

#include "Basic.hpp"

#include "S6VivoxShared_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class S6Vivox.S6VivoxSubsystem
// 0x00D8 (0x0108 - 0x0030)
class US6VivoxSubsystem final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_1D02[0x8];                                     // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnLoggedIn;                                        // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLoginFailed;                                     // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLoggedOut;                                       // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnChannelMsgReceived;                              // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnDirectMsgReceived;                               // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D03[0x10];                                    // 0x0088(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS6Vivox_AccountId                     VivoxAccountId;                                    // 0x0098(0x0048)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D04[0x28];                                    // 0x00E0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"S6VivoxSubsystem">();
	}
	static class US6VivoxSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<US6VivoxSubsystem>();
	}
};
static_assert(alignof(US6VivoxSubsystem) == 0x000008, "Wrong alignment on US6VivoxSubsystem");
static_assert(sizeof(US6VivoxSubsystem) == 0x000108, "Wrong size on US6VivoxSubsystem");
static_assert(offsetof(US6VivoxSubsystem, OnLoggedIn) == 0x000038, "Member 'US6VivoxSubsystem::OnLoggedIn' has a wrong offset!");
static_assert(offsetof(US6VivoxSubsystem, OnLoginFailed) == 0x000048, "Member 'US6VivoxSubsystem::OnLoginFailed' has a wrong offset!");
static_assert(offsetof(US6VivoxSubsystem, OnLoggedOut) == 0x000058, "Member 'US6VivoxSubsystem::OnLoggedOut' has a wrong offset!");
static_assert(offsetof(US6VivoxSubsystem, OnChannelMsgReceived) == 0x000068, "Member 'US6VivoxSubsystem::OnChannelMsgReceived' has a wrong offset!");
static_assert(offsetof(US6VivoxSubsystem, OnDirectMsgReceived) == 0x000078, "Member 'US6VivoxSubsystem::OnDirectMsgReceived' has a wrong offset!");
static_assert(offsetof(US6VivoxSubsystem, VivoxAccountId) == 0x000098, "Member 'US6VivoxSubsystem::VivoxAccountId' has a wrong offset!");

}

