#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialActivityFeedRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct SocialActivityFeedRuntime.VAL_NewValeriagramPostInfo
// 0x0070 (0x0070 - 0x0000)
struct FVAL_NewValeriagramPostInfo final
{
public:
	class FString                                 PostText;                                          // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<struct FUniqueNetIdRepl>                 TaggedUserIds;                                     // 0x0010(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          OnlinePhotoIds;                                    // 0x0060(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVAL_NewValeriagramPostInfo) == 0x000008, "Wrong alignment on FVAL_NewValeriagramPostInfo");
static_assert(sizeof(FVAL_NewValeriagramPostInfo) == 0x000070, "Wrong size on FVAL_NewValeriagramPostInfo");
static_assert(offsetof(FVAL_NewValeriagramPostInfo, PostText) == 0x000000, "Member 'FVAL_NewValeriagramPostInfo::PostText' has a wrong offset!");
static_assert(offsetof(FVAL_NewValeriagramPostInfo, TaggedUserIds) == 0x000010, "Member 'FVAL_NewValeriagramPostInfo::TaggedUserIds' has a wrong offset!");
static_assert(offsetof(FVAL_NewValeriagramPostInfo, OnlinePhotoIds) == 0x000060, "Member 'FVAL_NewValeriagramPostInfo::OnlinePhotoIds' has a wrong offset!");

}

