#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialActivityFeedRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class SocialActivityFeedRuntime.VAL_SocialActivityFeedManager
// 0x0030 (0x0060 - 0x0030)
class UVAL_SocialActivityFeedManager final : public ULocalPlayerSubsystem
{
public:
	FMulticastInlineDelegateProperty_             OnPostsRefreshed;                                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UVAL_EventBusViaChatSubsystem*          EventBusSubsystem;                                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3394[0x8];                                     // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVAL_ValeriagramPost*>           CachedPosts;                                       // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void OnPostsRefreshed__DelegateSignature(class UVAL_SocialActivityFeedManager* SocialActivityFeedManager);
	bool TryPostPhoto(struct FVAL_NewValeriagramPostInfo& NewPostInfo);

	TSet<struct FGuid> GetOurAlreadyPostedPhotos() const;
	TArray<class UVAL_ValeriagramPost*> GetPosts() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_SocialActivityFeedManager">();
	}
	static class UVAL_SocialActivityFeedManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_SocialActivityFeedManager>();
	}
};
static_assert(alignof(UVAL_SocialActivityFeedManager) == 0x000008, "Wrong alignment on UVAL_SocialActivityFeedManager");
static_assert(sizeof(UVAL_SocialActivityFeedManager) == 0x000060, "Wrong size on UVAL_SocialActivityFeedManager");
static_assert(offsetof(UVAL_SocialActivityFeedManager, OnPostsRefreshed) == 0x000030, "Member 'UVAL_SocialActivityFeedManager::OnPostsRefreshed' has a wrong offset!");
static_assert(offsetof(UVAL_SocialActivityFeedManager, EventBusSubsystem) == 0x000040, "Member 'UVAL_SocialActivityFeedManager::EventBusSubsystem' has a wrong offset!");
static_assert(offsetof(UVAL_SocialActivityFeedManager, CachedPosts) == 0x000050, "Member 'UVAL_SocialActivityFeedManager::CachedPosts' has a wrong offset!");

// Class SocialActivityFeedRuntime.VAL_ValeriagramPost
// 0x00C8 (0x00F0 - 0x0028)
class UVAL_ValeriagramPost final : public UObject
{
public:
	struct FGuid                                  PostId;                                            // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PosterId;                                          // 0x0038(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              PostTimestamp;                                     // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PostText;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          PhotographIds;                                     // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     PhotographTextures;                                // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<struct FUniqueNetIdRepl>                 TaggedUserIds;                                     // 0x00A0(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_ValeriagramPost">();
	}
	static class UVAL_ValeriagramPost* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_ValeriagramPost>();
	}
};
static_assert(alignof(UVAL_ValeriagramPost) == 0x000008, "Wrong alignment on UVAL_ValeriagramPost");
static_assert(sizeof(UVAL_ValeriagramPost) == 0x0000F0, "Wrong size on UVAL_ValeriagramPost");
static_assert(offsetof(UVAL_ValeriagramPost, PostId) == 0x000028, "Member 'UVAL_ValeriagramPost::PostId' has a wrong offset!");
static_assert(offsetof(UVAL_ValeriagramPost, PosterId) == 0x000038, "Member 'UVAL_ValeriagramPost::PosterId' has a wrong offset!");
static_assert(offsetof(UVAL_ValeriagramPost, PostTimestamp) == 0x000068, "Member 'UVAL_ValeriagramPost::PostTimestamp' has a wrong offset!");
static_assert(offsetof(UVAL_ValeriagramPost, PostText) == 0x000070, "Member 'UVAL_ValeriagramPost::PostText' has a wrong offset!");
static_assert(offsetof(UVAL_ValeriagramPost, PhotographIds) == 0x000080, "Member 'UVAL_ValeriagramPost::PhotographIds' has a wrong offset!");
static_assert(offsetof(UVAL_ValeriagramPost, PhotographTextures) == 0x000090, "Member 'UVAL_ValeriagramPost::PhotographTextures' has a wrong offset!");
static_assert(offsetof(UVAL_ValeriagramPost, TaggedUserIds) == 0x0000A0, "Member 'UVAL_ValeriagramPost::TaggedUserIds' has a wrong offset!");

// Class SocialActivityFeedRuntime.VAL_SocialActivityFeedSettings
// 0x0020 (0x0058 - 0x0038)
class UVAL_SocialActivityFeedSettings final : public UDeveloperSettings
{
public:
	int32                                         MaxCachedPaliagramPostCount;                       // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3396[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NewPaliagramPostReceivedMessageFormat;             // 0x0040(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_SocialActivityFeedSettings">();
	}
	static class UVAL_SocialActivityFeedSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_SocialActivityFeedSettings>();
	}
};
static_assert(alignof(UVAL_SocialActivityFeedSettings) == 0x000008, "Wrong alignment on UVAL_SocialActivityFeedSettings");
static_assert(sizeof(UVAL_SocialActivityFeedSettings) == 0x000058, "Wrong size on UVAL_SocialActivityFeedSettings");
static_assert(offsetof(UVAL_SocialActivityFeedSettings, MaxCachedPaliagramPostCount) == 0x000038, "Member 'UVAL_SocialActivityFeedSettings::MaxCachedPaliagramPostCount' has a wrong offset!");
static_assert(offsetof(UVAL_SocialActivityFeedSettings, NewPaliagramPostReceivedMessageFormat) == 0x000040, "Member 'UVAL_SocialActivityFeedSettings::NewPaliagramPostReceivedMessageFormat' has a wrong offset!");

}

