#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_DialogBookendConfig

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_DialogBookendConfig.Struct_DialogBookendConfig
// 0x0140 (0x0140 - 0x0000)
struct FStruct_DialogBookendConfig final
{
public:
	class FString                                 Notes_29_7CA812A042F76F5396D5E987B73CE070;         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UDialogBookendAudioSet_C*               DialogAudioSet_20_1D112E924B348835575048A1E5619B97; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDialogueRequirements                  DialogRequirements_33_D9E26DFE431A9D76BB0566850525F92A; // 0x0018(0x0128)(Edit, BlueprintVisible)
};
static_assert(alignof(FStruct_DialogBookendConfig) == 0x000008, "Wrong alignment on FStruct_DialogBookendConfig");
static_assert(sizeof(FStruct_DialogBookendConfig) == 0x000140, "Wrong size on FStruct_DialogBookendConfig");
static_assert(offsetof(FStruct_DialogBookendConfig, Notes_29_7CA812A042F76F5396D5E987B73CE070) == 0x000000, "Member 'FStruct_DialogBookendConfig::Notes_29_7CA812A042F76F5396D5E987B73CE070' has a wrong offset!");
static_assert(offsetof(FStruct_DialogBookendConfig, DialogAudioSet_20_1D112E924B348835575048A1E5619B97) == 0x000010, "Member 'FStruct_DialogBookendConfig::DialogAudioSet_20_1D112E924B348835575048A1E5619B97' has a wrong offset!");
static_assert(offsetof(FStruct_DialogBookendConfig, DialogRequirements_33_D9E26DFE431A9D76BB0566850525F92A) == 0x000018, "Member 'FStruct_DialogBookendConfig::DialogRequirements_33_D9E26DFE431A9D76BB0566850525F92A' has a wrong offset!");

}

