#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Physmat

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Physmat.Struct_Physmat
// 0x0020 (0x0020 - 0x0000)
struct FStruct_Physmat final
{
public:
	class UAkAudioEvent*                          Sound_51_79124317478F43585C4ED08EC5B12898;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      DecalLeftFoot_47_4113F9314D25E3BD1C0A00812BC35316; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      DecalRightFoot_48_F6A6AB3A418FB4528AB46EB31B3D99D4; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NiagaraSystem_56_5FD31872498E806E48AC3E8AAA675F0A; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_Physmat) == 0x000008, "Wrong alignment on FStruct_Physmat");
static_assert(sizeof(FStruct_Physmat) == 0x000020, "Wrong size on FStruct_Physmat");
static_assert(offsetof(FStruct_Physmat, Sound_51_79124317478F43585C4ED08EC5B12898) == 0x000000, "Member 'FStruct_Physmat::Sound_51_79124317478F43585C4ED08EC5B12898' has a wrong offset!");
static_assert(offsetof(FStruct_Physmat, DecalLeftFoot_47_4113F9314D25E3BD1C0A00812BC35316) == 0x000008, "Member 'FStruct_Physmat::DecalLeftFoot_47_4113F9314D25E3BD1C0A00812BC35316' has a wrong offset!");
static_assert(offsetof(FStruct_Physmat, DecalRightFoot_48_F6A6AB3A418FB4528AB46EB31B3D99D4) == 0x000010, "Member 'FStruct_Physmat::DecalRightFoot_48_F6A6AB3A418FB4528AB46EB31B3D99D4' has a wrong offset!");
static_assert(offsetof(FStruct_Physmat, NiagaraSystem_56_5FD31872498E806E48AC3E8AAA675F0A) == 0x000018, "Member 'FStruct_Physmat::NiagaraSystem_56_5FD31872498E806E48AC3E8AAA675F0A' has a wrong offset!");

}

