#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_CrossPlatformFTUEPopin_CM

#include "Basic.hpp"

#include "S6Core_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_CrossPlatformFTUEPopin_CM.Struct_CrossPlatformFTUEPopin_CM
// 0x00F0 (0x00F0 - 0x0000)
struct FStruct_CrossPlatformFTUEPopin_CM final
{
public:
	TMap<ERedirectsPlatform, class FText>         RedirectFTUEPopinTitleType_36_5109F9C6423FA03E7195FEBD433A4D98; // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<ERedirectsPlatform, class FText>         RedirectFTUEPopinContentTypes_37_987D69EA420660593E58C493D36D052D; // 0x0050(0x0050)(Edit, BlueprintVisible)
	TMap<ECommonInputType, class FText>           RedirectInputType_42_C4B1933D42BE69D2EDAA369A64C5501C; // 0x00A0(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FStruct_CrossPlatformFTUEPopin_CM) == 0x000008, "Wrong alignment on FStruct_CrossPlatformFTUEPopin_CM");
static_assert(sizeof(FStruct_CrossPlatformFTUEPopin_CM) == 0x0000F0, "Wrong size on FStruct_CrossPlatformFTUEPopin_CM");
static_assert(offsetof(FStruct_CrossPlatformFTUEPopin_CM, RedirectFTUEPopinTitleType_36_5109F9C6423FA03E7195FEBD433A4D98) == 0x000000, "Member 'FStruct_CrossPlatformFTUEPopin_CM::RedirectFTUEPopinTitleType_36_5109F9C6423FA03E7195FEBD433A4D98' has a wrong offset!");
static_assert(offsetof(FStruct_CrossPlatformFTUEPopin_CM, RedirectFTUEPopinContentTypes_37_987D69EA420660593E58C493D36D052D) == 0x000050, "Member 'FStruct_CrossPlatformFTUEPopin_CM::RedirectFTUEPopinContentTypes_37_987D69EA420660593E58C493D36D052D' has a wrong offset!");
static_assert(offsetof(FStruct_CrossPlatformFTUEPopin_CM, RedirectInputType_42_C4B1933D42BE69D2EDAA369A64C5501C) == 0x0000A0, "Member 'FStruct_CrossPlatformFTUEPopin_CM::RedirectInputType_42_C4B1933D42BE69D2EDAA369A64C5501C' has a wrong offset!");

}

