#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipFunctionLibrary

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.CloseBasicTooltip
// 0x0028 (0x0028 - 0x0000)
struct TooltipFunctionLibrary_C_CloseBasicTooltip final
{
public:
	class UWidget*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BasicTooltip_C*                    BasicTooltip;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_CloseBasicTooltip) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_CloseBasicTooltip");
static_assert(sizeof(TooltipFunctionLibrary_C_CloseBasicTooltip) == 0x000028, "Wrong size on TooltipFunctionLibrary_C_CloseBasicTooltip");
static_assert(offsetof(TooltipFunctionLibrary_C_CloseBasicTooltip, Context) == 0x000000, "Member 'TooltipFunctionLibrary_C_CloseBasicTooltip::Context' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_CloseBasicTooltip, BasicTooltip) == 0x000008, "Member 'TooltipFunctionLibrary_C_CloseBasicTooltip::BasicTooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_CloseBasicTooltip, MenuAnchor) == 0x000010, "Member 'TooltipFunctionLibrary_C_CloseBasicTooltip::MenuAnchor' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_CloseBasicTooltip, __WorldContext) == 0x000018, "Member 'TooltipFunctionLibrary_C_CloseBasicTooltip::__WorldContext' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_CloseBasicTooltip, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'TooltipFunctionLibrary_C_CloseBasicTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.CloseItemTooltip
// 0x0028 (0x0028 - 0x0000)
struct TooltipFunctionLibrary_C_CloseItemTooltip final
{
public:
	class UWidget*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemTooltip_C*                     ItemTooltip;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_CloseItemTooltip) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_CloseItemTooltip");
static_assert(sizeof(TooltipFunctionLibrary_C_CloseItemTooltip) == 0x000028, "Wrong size on TooltipFunctionLibrary_C_CloseItemTooltip");
static_assert(offsetof(TooltipFunctionLibrary_C_CloseItemTooltip, Context) == 0x000000, "Member 'TooltipFunctionLibrary_C_CloseItemTooltip::Context' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_CloseItemTooltip, ItemTooltip) == 0x000008, "Member 'TooltipFunctionLibrary_C_CloseItemTooltip::ItemTooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_CloseItemTooltip, MenuAnchor) == 0x000010, "Member 'TooltipFunctionLibrary_C_CloseItemTooltip::MenuAnchor' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_CloseItemTooltip, __WorldContext) == 0x000018, "Member 'TooltipFunctionLibrary_C_CloseItemTooltip::__WorldContext' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_CloseItemTooltip, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'TooltipFunctionLibrary_C_CloseItemTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.FetchBasicTooltipFromPool
// 0x0038 (0x0038 - 0x0000)
struct TooltipFunctionLibrary_C_FetchBasicTooltipFromPool final
{
public:
	class UWidget*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BasicTooltip_C*                    BasicTooltip;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D8[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidgetFromPool_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BasicTooltip_C*                    K2Node_DynamicCast_AsWBP_Basic_Tooltip;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_FetchBasicTooltipFromPool) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_FetchBasicTooltipFromPool");
static_assert(sizeof(TooltipFunctionLibrary_C_FetchBasicTooltipFromPool) == 0x000038, "Wrong size on TooltipFunctionLibrary_C_FetchBasicTooltipFromPool");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchBasicTooltipFromPool, Context) == 0x000000, "Member 'TooltipFunctionLibrary_C_FetchBasicTooltipFromPool::Context' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchBasicTooltipFromPool, BasicTooltip) == 0x000008, "Member 'TooltipFunctionLibrary_C_FetchBasicTooltipFromPool::BasicTooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchBasicTooltipFromPool, __WorldContext) == 0x000010, "Member 'TooltipFunctionLibrary_C_FetchBasicTooltipFromPool::__WorldContext' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchBasicTooltipFromPool, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'TooltipFunctionLibrary_C_FetchBasicTooltipFromPool::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchBasicTooltipFromPool, CallFunc_GetWidgetFromPool_ReturnValue) == 0x000020, "Member 'TooltipFunctionLibrary_C_FetchBasicTooltipFromPool::CallFunc_GetWidgetFromPool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchBasicTooltipFromPool, K2Node_DynamicCast_AsWBP_Basic_Tooltip) == 0x000028, "Member 'TooltipFunctionLibrary_C_FetchBasicTooltipFromPool::K2Node_DynamicCast_AsWBP_Basic_Tooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchBasicTooltipFromPool, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TooltipFunctionLibrary_C_FetchBasicTooltipFromPool::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.FetchItemTooltipFromPool
// 0x0038 (0x0038 - 0x0000)
struct TooltipFunctionLibrary_C_FetchItemTooltipFromPool final
{
public:
	class UWidget*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemTooltip_C*                     ItemTooltip;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D9[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidgetFromPool_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemTooltip_C*                     K2Node_DynamicCast_AsWBP_Item_Tooltip;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_FetchItemTooltipFromPool) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_FetchItemTooltipFromPool");
static_assert(sizeof(TooltipFunctionLibrary_C_FetchItemTooltipFromPool) == 0x000038, "Wrong size on TooltipFunctionLibrary_C_FetchItemTooltipFromPool");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchItemTooltipFromPool, Context) == 0x000000, "Member 'TooltipFunctionLibrary_C_FetchItemTooltipFromPool::Context' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchItemTooltipFromPool, ItemTooltip) == 0x000008, "Member 'TooltipFunctionLibrary_C_FetchItemTooltipFromPool::ItemTooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchItemTooltipFromPool, __WorldContext) == 0x000010, "Member 'TooltipFunctionLibrary_C_FetchItemTooltipFromPool::__WorldContext' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchItemTooltipFromPool, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'TooltipFunctionLibrary_C_FetchItemTooltipFromPool::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchItemTooltipFromPool, CallFunc_GetWidgetFromPool_ReturnValue) == 0x000020, "Member 'TooltipFunctionLibrary_C_FetchItemTooltipFromPool::CallFunc_GetWidgetFromPool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchItemTooltipFromPool, K2Node_DynamicCast_AsWBP_Item_Tooltip) == 0x000028, "Member 'TooltipFunctionLibrary_C_FetchItemTooltipFromPool::K2Node_DynamicCast_AsWBP_Item_Tooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_FetchItemTooltipFromPool, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TooltipFunctionLibrary_C_FetchItemTooltipFromPool::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.OpenBasicTooltip
// 0x0060 (0x0060 - 0x0000)
struct TooltipFunctionLibrary_C_OpenBasicTooltip final
{
public:
	class UWidget*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BasicTooltip_C*                    BasicTooltip;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Image;                                             // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Header;                                            // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_OpenBasicTooltip) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_OpenBasicTooltip");
static_assert(sizeof(TooltipFunctionLibrary_C_OpenBasicTooltip) == 0x000060, "Wrong size on TooltipFunctionLibrary_C_OpenBasicTooltip");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenBasicTooltip, Context) == 0x000000, "Member 'TooltipFunctionLibrary_C_OpenBasicTooltip::Context' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenBasicTooltip, BasicTooltip) == 0x000008, "Member 'TooltipFunctionLibrary_C_OpenBasicTooltip::BasicTooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenBasicTooltip, MenuAnchor) == 0x000010, "Member 'TooltipFunctionLibrary_C_OpenBasicTooltip::MenuAnchor' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenBasicTooltip, Text) == 0x000018, "Member 'TooltipFunctionLibrary_C_OpenBasicTooltip::Text' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenBasicTooltip, Image) == 0x000030, "Member 'TooltipFunctionLibrary_C_OpenBasicTooltip::Image' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenBasicTooltip, Header) == 0x000038, "Member 'TooltipFunctionLibrary_C_OpenBasicTooltip::Header' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenBasicTooltip, __WorldContext) == 0x000050, "Member 'TooltipFunctionLibrary_C_OpenBasicTooltip::__WorldContext' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenBasicTooltip, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'TooltipFunctionLibrary_C_OpenBasicTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.OpenItemTooltip
// 0x0090 (0x0090 - 0x0000)
struct TooltipFunctionLibrary_C_OpenItemTooltip final
{
public:
	class UWidget*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemTooltip_C*                     ItemTooltip;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           ValeriaItem;                                       // 0x0018(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         RecipeConfigId;                                    // 0x0078(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowDestroyWarning;                               // 0x007C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52DA[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_OpenItemTooltip) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_OpenItemTooltip");
static_assert(sizeof(TooltipFunctionLibrary_C_OpenItemTooltip) == 0x000090, "Wrong size on TooltipFunctionLibrary_C_OpenItemTooltip");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenItemTooltip, Context) == 0x000000, "Member 'TooltipFunctionLibrary_C_OpenItemTooltip::Context' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenItemTooltip, ItemTooltip) == 0x000008, "Member 'TooltipFunctionLibrary_C_OpenItemTooltip::ItemTooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenItemTooltip, MenuAnchor) == 0x000010, "Member 'TooltipFunctionLibrary_C_OpenItemTooltip::MenuAnchor' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenItemTooltip, ValeriaItem) == 0x000018, "Member 'TooltipFunctionLibrary_C_OpenItemTooltip::ValeriaItem' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenItemTooltip, RecipeConfigId) == 0x000078, "Member 'TooltipFunctionLibrary_C_OpenItemTooltip::RecipeConfigId' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenItemTooltip, bShowDestroyWarning) == 0x00007C, "Member 'TooltipFunctionLibrary_C_OpenItemTooltip::bShowDestroyWarning' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenItemTooltip, __WorldContext) == 0x000080, "Member 'TooltipFunctionLibrary_C_OpenItemTooltip::__WorldContext' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenItemTooltip, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'TooltipFunctionLibrary_C_OpenItemTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.OpenStoreItemTooltip
// 0x0120 (0x0120 - 0x0000)
struct TooltipFunctionLibrary_C_OpenStoreItemTooltip final
{
public:
	class UWidget*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemTooltip_C*                     ItemTooltip;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStoreItem                             StoreItem;                                         // 0x0018(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0110(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_OpenStoreItemTooltip) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_OpenStoreItemTooltip");
static_assert(sizeof(TooltipFunctionLibrary_C_OpenStoreItemTooltip) == 0x000120, "Wrong size on TooltipFunctionLibrary_C_OpenStoreItemTooltip");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenStoreItemTooltip, Context) == 0x000000, "Member 'TooltipFunctionLibrary_C_OpenStoreItemTooltip::Context' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenStoreItemTooltip, ItemTooltip) == 0x000008, "Member 'TooltipFunctionLibrary_C_OpenStoreItemTooltip::ItemTooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenStoreItemTooltip, MenuAnchor) == 0x000010, "Member 'TooltipFunctionLibrary_C_OpenStoreItemTooltip::MenuAnchor' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenStoreItemTooltip, StoreItem) == 0x000018, "Member 'TooltipFunctionLibrary_C_OpenStoreItemTooltip::StoreItem' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenStoreItemTooltip, __WorldContext) == 0x000110, "Member 'TooltipFunctionLibrary_C_OpenStoreItemTooltip::__WorldContext' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_OpenStoreItemTooltip, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'TooltipFunctionLibrary_C_OpenStoreItemTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.ReturnBasicTooltipToPool
// 0x0020 (0x0020 - 0x0000)
struct TooltipFunctionLibrary_C_ReturnBasicTooltipToPool final
{
public:
	class UWidget*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BasicTooltip_C*                    BasicTooltip;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_ReturnBasicTooltipToPool) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_ReturnBasicTooltipToPool");
static_assert(sizeof(TooltipFunctionLibrary_C_ReturnBasicTooltipToPool) == 0x000020, "Wrong size on TooltipFunctionLibrary_C_ReturnBasicTooltipToPool");
static_assert(offsetof(TooltipFunctionLibrary_C_ReturnBasicTooltipToPool, Context) == 0x000000, "Member 'TooltipFunctionLibrary_C_ReturnBasicTooltipToPool::Context' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_ReturnBasicTooltipToPool, BasicTooltip) == 0x000008, "Member 'TooltipFunctionLibrary_C_ReturnBasicTooltipToPool::BasicTooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_ReturnBasicTooltipToPool, __WorldContext) == 0x000010, "Member 'TooltipFunctionLibrary_C_ReturnBasicTooltipToPool::__WorldContext' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_ReturnBasicTooltipToPool, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'TooltipFunctionLibrary_C_ReturnBasicTooltipToPool::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.ReturnItemTooltipToPool
// 0x0020 (0x0020 - 0x0000)
struct TooltipFunctionLibrary_C_ReturnItemTooltipToPool final
{
public:
	class UWidget*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemTooltip_C*                     ItemTooltip;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_ReturnItemTooltipToPool) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_ReturnItemTooltipToPool");
static_assert(sizeof(TooltipFunctionLibrary_C_ReturnItemTooltipToPool) == 0x000020, "Wrong size on TooltipFunctionLibrary_C_ReturnItemTooltipToPool");
static_assert(offsetof(TooltipFunctionLibrary_C_ReturnItemTooltipToPool, Context) == 0x000000, "Member 'TooltipFunctionLibrary_C_ReturnItemTooltipToPool::Context' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_ReturnItemTooltipToPool, ItemTooltip) == 0x000008, "Member 'TooltipFunctionLibrary_C_ReturnItemTooltipToPool::ItemTooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_ReturnItemTooltipToPool, __WorldContext) == 0x000010, "Member 'TooltipFunctionLibrary_C_ReturnItemTooltipToPool::__WorldContext' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_ReturnItemTooltipToPool, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'TooltipFunctionLibrary_C_ReturnItemTooltipToPool::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.SetBasicTooltipHeader
// 0x0030 (0x0030 - 0x0000)
struct TooltipFunctionLibrary_C_SetBasicTooltipHeader final
{
public:
	class UWBP_BasicTooltip_C*                    Tooltip;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class FText                                   Header;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_SetBasicTooltipHeader) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_SetBasicTooltipHeader");
static_assert(sizeof(TooltipFunctionLibrary_C_SetBasicTooltipHeader) == 0x000030, "Wrong size on TooltipFunctionLibrary_C_SetBasicTooltipHeader");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipHeader, Tooltip) == 0x000000, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipHeader::Tooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipHeader, Header) == 0x000008, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipHeader::Header' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipHeader, __WorldContext) == 0x000020, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipHeader::__WorldContext' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipHeader, CallFunc_TextIsEmpty_ReturnValue) == 0x000028, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipHeader::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipHeader, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipHeader::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.SetBasicTooltipImage
// 0x0020 (0x0020 - 0x0000)
struct TooltipFunctionLibrary_C_SetBasicTooltipImage final
{
public:
	class UWBP_BasicTooltip_C*                    Tooltip;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Image;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_SetBasicTooltipImage) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_SetBasicTooltipImage");
static_assert(sizeof(TooltipFunctionLibrary_C_SetBasicTooltipImage) == 0x000020, "Wrong size on TooltipFunctionLibrary_C_SetBasicTooltipImage");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipImage, Tooltip) == 0x000000, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipImage::Tooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipImage, Image) == 0x000008, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipImage::Image' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipImage, __WorldContext) == 0x000010, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipImage::__WorldContext' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipImage, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipImage::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TooltipFunctionLibrary.TooltipFunctionLibrary_C.SetBasicTooltipText
// 0x0030 (0x0030 - 0x0000)
struct TooltipFunctionLibrary_C_SetBasicTooltipText final
{
public:
	class UWBP_BasicTooltip_C*                    Tooltip;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TooltipFunctionLibrary_C_SetBasicTooltipText) == 0x000008, "Wrong alignment on TooltipFunctionLibrary_C_SetBasicTooltipText");
static_assert(sizeof(TooltipFunctionLibrary_C_SetBasicTooltipText) == 0x000030, "Wrong size on TooltipFunctionLibrary_C_SetBasicTooltipText");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipText, Tooltip) == 0x000000, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipText::Tooltip' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipText, Text) == 0x000008, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipText::Text' has a wrong offset!");
static_assert(offsetof(TooltipFunctionLibrary_C_SetBasicTooltipText, __WorldContext) == 0x000020, "Member 'TooltipFunctionLibrary_C_SetBasicTooltipText::__WorldContext' has a wrong offset!");
