#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValeriaUI

#include "Basic.hpp"

#include "ValeriaDTOs_structs.hpp"
#include "Palia_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S6UICommonWidgets_structs.hpp"
#include "S6PlatformServiceSubsystems_structs.hpp"
#include "FieldNotification_structs.hpp"
#include "UMG_structs.hpp"
#include "S6Core_structs.hpp"


namespace SDK::Params
{

// Function ValeriaUI.BaitUserWidget.OnBaitSelected
// 0x0060 (0x0060 - 0x0000)
struct BaitUserWidget_OnBaitSelected final
{
public:
	struct FValeriaItem                           baitItem;                                          // 0x0000(0x0060)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaitUserWidget_OnBaitSelected) == 0x000008, "Wrong alignment on BaitUserWidget_OnBaitSelected");
static_assert(sizeof(BaitUserWidget_OnBaitSelected) == 0x000060, "Wrong size on BaitUserWidget_OnBaitSelected");
static_assert(offsetof(BaitUserWidget_OnBaitSelected, baitItem) == 0x000000, "Member 'BaitUserWidget_OnBaitSelected::baitItem' has a wrong offset!");

// Function ValeriaUI.BaitUserWidget.OnShown
// 0x0001 (0x0001 - 0x0000)
struct BaitUserWidget_OnShown final
{
public:
	EAmmoType                                     AmmoType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaitUserWidget_OnShown) == 0x000001, "Wrong alignment on BaitUserWidget_OnShown");
static_assert(sizeof(BaitUserWidget_OnShown) == 0x000001, "Wrong size on BaitUserWidget_OnShown");
static_assert(offsetof(BaitUserWidget_OnShown, AmmoType) == 0x000000, "Member 'BaitUserWidget_OnShown::AmmoType' has a wrong offset!");

// Function ValeriaUI.BaitUserWidget.ShowAmmoType
// 0x0001 (0x0001 - 0x0000)
struct BaitUserWidget_ShowAmmoType final
{
public:
	EAmmoType                                     AmmoType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaitUserWidget_ShowAmmoType) == 0x000001, "Wrong alignment on BaitUserWidget_ShowAmmoType");
static_assert(sizeof(BaitUserWidget_ShowAmmoType) == 0x000001, "Wrong size on BaitUserWidget_ShowAmmoType");
static_assert(offsetof(BaitUserWidget_ShowAmmoType, AmmoType) == 0x000000, "Member 'BaitUserWidget_ShowAmmoType::AmmoType' has a wrong offset!");

// Function ValeriaUI.VAL_LocalizationUtils.GetGreetingLanguageSuffix
// 0x0010 (0x0010 - 0x0000)
struct VAL_LocalizationUtils_GetGreetingLanguageSuffix final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VAL_LocalizationUtils_GetGreetingLanguageSuffix) == 0x000008, "Wrong alignment on VAL_LocalizationUtils_GetGreetingLanguageSuffix");
static_assert(sizeof(VAL_LocalizationUtils_GetGreetingLanguageSuffix) == 0x000010, "Wrong size on VAL_LocalizationUtils_GetGreetingLanguageSuffix");
static_assert(offsetof(VAL_LocalizationUtils_GetGreetingLanguageSuffix, ReturnValue) == 0x000000, "Member 'VAL_LocalizationUtils_GetGreetingLanguageSuffix::ReturnValue' has a wrong offset!");

// Function ValeriaUI.VAL_LocalizationUtils.GetGreetingStorageLocation
// 0x0010 (0x0010 - 0x0000)
struct VAL_LocalizationUtils_GetGreetingStorageLocation final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VAL_LocalizationUtils_GetGreetingStorageLocation) == 0x000008, "Wrong alignment on VAL_LocalizationUtils_GetGreetingStorageLocation");
static_assert(sizeof(VAL_LocalizationUtils_GetGreetingStorageLocation) == 0x000010, "Wrong size on VAL_LocalizationUtils_GetGreetingStorageLocation");
static_assert(offsetof(VAL_LocalizationUtils_GetGreetingStorageLocation, ReturnValue) == 0x000000, "Member 'VAL_LocalizationUtils_GetGreetingStorageLocation::ReturnValue' has a wrong offset!");

// Function ValeriaUI.BookViewerWidget.MarkPageAsRead
// 0x0004 (0x0004 - 0x0000)
struct BookViewerWidget_MarkPageAsRead final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BookViewerWidget_MarkPageAsRead) == 0x000004, "Wrong alignment on BookViewerWidget_MarkPageAsRead");
static_assert(sizeof(BookViewerWidget_MarkPageAsRead) == 0x000004, "Wrong size on BookViewerWidget_MarkPageAsRead");
static_assert(offsetof(BookViewerWidget_MarkPageAsRead, Param_Index) == 0x000000, "Member 'BookViewerWidget_MarkPageAsRead::Param_Index' has a wrong offset!");

// Function ValeriaUI.BookViewerWidget.GetContentForPage
// 0x0020 (0x0020 - 0x0000)
struct BookViewerWidget_GetContentForPage final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CD0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BookViewerWidget_GetContentForPage) == 0x000008, "Wrong alignment on BookViewerWidget_GetContentForPage");
static_assert(sizeof(BookViewerWidget_GetContentForPage) == 0x000020, "Wrong size on BookViewerWidget_GetContentForPage");
static_assert(offsetof(BookViewerWidget_GetContentForPage, Param_Index) == 0x000000, "Member 'BookViewerWidget_GetContentForPage::Param_Index' has a wrong offset!");
static_assert(offsetof(BookViewerWidget_GetContentForPage, ReturnValue) == 0x000008, "Member 'BookViewerWidget_GetContentForPage::ReturnValue' has a wrong offset!");

// Function ValeriaUI.BookViewerWidget.GetNumberOfPages
// 0x0004 (0x0004 - 0x0000)
struct BookViewerWidget_GetNumberOfPages final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BookViewerWidget_GetNumberOfPages) == 0x000004, "Wrong alignment on BookViewerWidget_GetNumberOfPages");
static_assert(sizeof(BookViewerWidget_GetNumberOfPages) == 0x000004, "Wrong size on BookViewerWidget_GetNumberOfPages");
static_assert(offsetof(BookViewerWidget_GetNumberOfPages, ReturnValue) == 0x000000, "Member 'BookViewerWidget_GetNumberOfPages::ReturnValue' has a wrong offset!");

// Function ValeriaUI.BookViewerWidget.GetSubTitle
// 0x0018 (0x0018 - 0x0000)
struct BookViewerWidget_GetSubTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BookViewerWidget_GetSubTitle) == 0x000008, "Wrong alignment on BookViewerWidget_GetSubTitle");
static_assert(sizeof(BookViewerWidget_GetSubTitle) == 0x000018, "Wrong size on BookViewerWidget_GetSubTitle");
static_assert(offsetof(BookViewerWidget_GetSubTitle, ReturnValue) == 0x000000, "Member 'BookViewerWidget_GetSubTitle::ReturnValue' has a wrong offset!");

// Function ValeriaUI.BookViewerWidget.GetTitle
// 0x0018 (0x0018 - 0x0000)
struct BookViewerWidget_GetTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BookViewerWidget_GetTitle) == 0x000008, "Wrong alignment on BookViewerWidget_GetTitle");
static_assert(sizeof(BookViewerWidget_GetTitle) == 0x000018, "Wrong size on BookViewerWidget_GetTitle");
static_assert(offsetof(BookViewerWidget_GetTitle, ReturnValue) == 0x000000, "Member 'BookViewerWidget_GetTitle::ReturnValue' has a wrong offset!");

// Function ValeriaUI.DetailUserWidget.UpdateDetail
// 0x0030 (0x0030 - 0x0000)
struct DetailUserWidget_UpdateDetail final
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CD2[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DetailUserWidget_UpdateDetail) == 0x000008, "Wrong alignment on DetailUserWidget_UpdateDetail");
static_assert(sizeof(DetailUserWidget_UpdateDetail) == 0x000030, "Wrong size on DetailUserWidget_UpdateDetail");
static_assert(offsetof(DetailUserWidget_UpdateDetail, ItemType) == 0x000000, "Member 'DetailUserWidget_UpdateDetail::ItemType' has a wrong offset!");
static_assert(offsetof(DetailUserWidget_UpdateDetail, ReturnValue) == 0x000028, "Member 'DetailUserWidget_UpdateDetail::ReturnValue' has a wrong offset!");

// DelegateFunction ValeriaUI.VALUI_ListView_Styled.OnListItemsChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct VALUI_ListView_Styled_OnListItemsChanged__DelegateSignature final
{
public:
	TArray<class UObject*>                        AddedItems;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        RemovedItems;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_ListView_Styled_OnListItemsChanged__DelegateSignature) == 0x000008, "Wrong alignment on VALUI_ListView_Styled_OnListItemsChanged__DelegateSignature");
static_assert(sizeof(VALUI_ListView_Styled_OnListItemsChanged__DelegateSignature) == 0x000020, "Wrong size on VALUI_ListView_Styled_OnListItemsChanged__DelegateSignature");
static_assert(offsetof(VALUI_ListView_Styled_OnListItemsChanged__DelegateSignature, AddedItems) == 0x000000, "Member 'VALUI_ListView_Styled_OnListItemsChanged__DelegateSignature::AddedItems' has a wrong offset!");
static_assert(offsetof(VALUI_ListView_Styled_OnListItemsChanged__DelegateSignature, RemovedItems) == 0x000010, "Member 'VALUI_ListView_Styled_OnListItemsChanged__DelegateSignature::RemovedItems' has a wrong offset!");

// DelegateFunction ValeriaUI.VALUI_ListView_Styled.OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct VALUI_ListView_Styled_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESelectInfo                                   SelectType;                                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CD6[0x6];                                     // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VALUI_ListView_Styled_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature) == 0x000008, "Wrong alignment on VALUI_ListView_Styled_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature");
static_assert(sizeof(VALUI_ListView_Styled_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature) == 0x000010, "Wrong size on VALUI_ListView_Styled_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature");
static_assert(offsetof(VALUI_ListView_Styled_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature, Item) == 0x000000, "Member 'VALUI_ListView_Styled_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(VALUI_ListView_Styled_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'VALUI_ListView_Styled_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature::bIsSelected' has a wrong offset!");
static_assert(offsetof(VALUI_ListView_Styled_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature, SelectType) == 0x000009, "Member 'VALUI_ListView_Styled_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature::SelectType' has a wrong offset!");

// Function ValeriaUI.VALUI_ListView_Styled.ResetPoolAndSetListItems
// 0x0010 (0x0010 - 0x0000)
struct VALUI_ListView_Styled_ResetPoolAndSetListItems final
{
public:
	TArray<class UObject*>                        InListItems;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_ListView_Styled_ResetPoolAndSetListItems) == 0x000008, "Wrong alignment on VALUI_ListView_Styled_ResetPoolAndSetListItems");
static_assert(sizeof(VALUI_ListView_Styled_ResetPoolAndSetListItems) == 0x000010, "Wrong size on VALUI_ListView_Styled_ResetPoolAndSetListItems");
static_assert(offsetof(VALUI_ListView_Styled_ResetPoolAndSetListItems, InListItems) == 0x000000, "Member 'VALUI_ListView_Styled_ResetPoolAndSetListItems::InListItems' has a wrong offset!");

// Function ValeriaUI.VALUI_ListView_Styled.SetEntryWidgetClass
// 0x0008 (0x0008 - 0x0000)
struct VALUI_ListView_Styled_SetEntryWidgetClass final
{
public:
	TSubclassOf<class UUserWidget>                NewWidgetClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_ListView_Styled_SetEntryWidgetClass) == 0x000008, "Wrong alignment on VALUI_ListView_Styled_SetEntryWidgetClass");
static_assert(sizeof(VALUI_ListView_Styled_SetEntryWidgetClass) == 0x000008, "Wrong size on VALUI_ListView_Styled_SetEntryWidgetClass");
static_assert(offsetof(VALUI_ListView_Styled_SetEntryWidgetClass, NewWidgetClass) == 0x000000, "Member 'VALUI_ListView_Styled_SetEntryWidgetClass::NewWidgetClass' has a wrong offset!");

// DelegateFunction ValeriaUI.VALUI_ListView_Styled.VALUI_OnListViewUserMouseWheelScrolled__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct VALUI_ListView_Styled_VALUI_OnListViewUserMouseWheelScrolled__DelegateSignature final
{
public:
	float                                         DesiredOffset;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_ListView_Styled_VALUI_OnListViewUserMouseWheelScrolled__DelegateSignature) == 0x000004, "Wrong alignment on VALUI_ListView_Styled_VALUI_OnListViewUserMouseWheelScrolled__DelegateSignature");
static_assert(sizeof(VALUI_ListView_Styled_VALUI_OnListViewUserMouseWheelScrolled__DelegateSignature) == 0x000004, "Wrong size on VALUI_ListView_Styled_VALUI_OnListViewUserMouseWheelScrolled__DelegateSignature");
static_assert(offsetof(VALUI_ListView_Styled_VALUI_OnListViewUserMouseWheelScrolled__DelegateSignature, DesiredOffset) == 0x000000, "Member 'VALUI_ListView_Styled_VALUI_OnListViewUserMouseWheelScrolled__DelegateSignature::DesiredOffset' has a wrong offset!");

// DelegateFunction ValeriaUI.VALUI_ListView_Styled.VALUI_OnListViewUserScrolled__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct VALUI_ListView_Styled_VALUI_OnListViewUserScrolled__DelegateSignature final
{
public:
	float                                         ScrollFraction;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_ListView_Styled_VALUI_OnListViewUserScrolled__DelegateSignature) == 0x000004, "Wrong alignment on VALUI_ListView_Styled_VALUI_OnListViewUserScrolled__DelegateSignature");
static_assert(sizeof(VALUI_ListView_Styled_VALUI_OnListViewUserScrolled__DelegateSignature) == 0x000004, "Wrong size on VALUI_ListView_Styled_VALUI_OnListViewUserScrolled__DelegateSignature");
static_assert(offsetof(VALUI_ListView_Styled_VALUI_OnListViewUserScrolled__DelegateSignature, ScrollFraction) == 0x000000, "Member 'VALUI_ListView_Styled_VALUI_OnListViewUserScrolled__DelegateSignature::ScrollFraction' has a wrong offset!");

// Function ValeriaUI.VALUI_ListView_Styled.GetItemsWithinRange
// 0x0018 (0x0018 - 0x0000)
struct VALUI_ListView_Styled_GetItemsWithinRange final
{
public:
	int32                                         StartingIndex;                                     // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Range;                                             // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_ListView_Styled_GetItemsWithinRange) == 0x000008, "Wrong alignment on VALUI_ListView_Styled_GetItemsWithinRange");
static_assert(sizeof(VALUI_ListView_Styled_GetItemsWithinRange) == 0x000018, "Wrong size on VALUI_ListView_Styled_GetItemsWithinRange");
static_assert(offsetof(VALUI_ListView_Styled_GetItemsWithinRange, StartingIndex) == 0x000000, "Member 'VALUI_ListView_Styled_GetItemsWithinRange::StartingIndex' has a wrong offset!");
static_assert(offsetof(VALUI_ListView_Styled_GetItemsWithinRange, Range) == 0x000004, "Member 'VALUI_ListView_Styled_GetItemsWithinRange::Range' has a wrong offset!");
static_assert(offsetof(VALUI_ListView_Styled_GetItemsWithinRange, ReturnValue) == 0x000008, "Member 'VALUI_ListView_Styled_GetItemsWithinRange::ReturnValue' has a wrong offset!");

// Function ValeriaUI.VALUI_ListView_Styled.GetScrollbarDistanceFromBottom
// 0x0004 (0x0004 - 0x0000)
struct VALUI_ListView_Styled_GetScrollbarDistanceFromBottom final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_ListView_Styled_GetScrollbarDistanceFromBottom) == 0x000004, "Wrong alignment on VALUI_ListView_Styled_GetScrollbarDistanceFromBottom");
static_assert(sizeof(VALUI_ListView_Styled_GetScrollbarDistanceFromBottom) == 0x000004, "Wrong size on VALUI_ListView_Styled_GetScrollbarDistanceFromBottom");
static_assert(offsetof(VALUI_ListView_Styled_GetScrollbarDistanceFromBottom, ReturnValue) == 0x000000, "Member 'VALUI_ListView_Styled_GetScrollbarDistanceFromBottom::ReturnValue' has a wrong offset!");

// Function ValeriaUI.VALUI_ListView_Styled.ShouldScrollBarBeVisible
// 0x0001 (0x0001 - 0x0000)
struct VALUI_ListView_Styled_ShouldScrollBarBeVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_ListView_Styled_ShouldScrollBarBeVisible) == 0x000001, "Wrong alignment on VALUI_ListView_Styled_ShouldScrollBarBeVisible");
static_assert(sizeof(VALUI_ListView_Styled_ShouldScrollBarBeVisible) == 0x000001, "Wrong size on VALUI_ListView_Styled_ShouldScrollBarBeVisible");
static_assert(offsetof(VALUI_ListView_Styled_ShouldScrollBarBeVisible, ReturnValue) == 0x000000, "Member 'VALUI_ListView_Styled_ShouldScrollBarBeVisible::ReturnValue' has a wrong offset!");

// Function ValeriaUI.VALUI_TileView_Styled.SetEntryHeight
// 0x0004 (0x0004 - 0x0000)
struct VALUI_TileView_Styled_SetEntryHeight final
{
public:
	float                                         NewHeight;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_TileView_Styled_SetEntryHeight) == 0x000004, "Wrong alignment on VALUI_TileView_Styled_SetEntryHeight");
static_assert(sizeof(VALUI_TileView_Styled_SetEntryHeight) == 0x000004, "Wrong size on VALUI_TileView_Styled_SetEntryHeight");
static_assert(offsetof(VALUI_TileView_Styled_SetEntryHeight, NewHeight) == 0x000000, "Member 'VALUI_TileView_Styled_SetEntryHeight::NewHeight' has a wrong offset!");

// Function ValeriaUI.VALUI_TileView_Styled.SetEntryWidth
// 0x0004 (0x0004 - 0x0000)
struct VALUI_TileView_Styled_SetEntryWidth final
{
public:
	float                                         NewWidth;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_TileView_Styled_SetEntryWidth) == 0x000004, "Wrong alignment on VALUI_TileView_Styled_SetEntryWidth");
static_assert(sizeof(VALUI_TileView_Styled_SetEntryWidth) == 0x000004, "Wrong size on VALUI_TileView_Styled_SetEntryWidth");
static_assert(offsetof(VALUI_TileView_Styled_SetEntryWidth, NewWidth) == 0x000000, "Member 'VALUI_TileView_Styled_SetEntryWidth::NewWidth' has a wrong offset!");

// Function ValeriaUI.VALUI_TileView_Styled.GetEntryHeight
// 0x0004 (0x0004 - 0x0000)
struct VALUI_TileView_Styled_GetEntryHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_TileView_Styled_GetEntryHeight) == 0x000004, "Wrong alignment on VALUI_TileView_Styled_GetEntryHeight");
static_assert(sizeof(VALUI_TileView_Styled_GetEntryHeight) == 0x000004, "Wrong size on VALUI_TileView_Styled_GetEntryHeight");
static_assert(offsetof(VALUI_TileView_Styled_GetEntryHeight, ReturnValue) == 0x000000, "Member 'VALUI_TileView_Styled_GetEntryHeight::ReturnValue' has a wrong offset!");

// Function ValeriaUI.VALUI_TileView_Styled.GetEntryWidth
// 0x0004 (0x0004 - 0x0000)
struct VALUI_TileView_Styled_GetEntryWidth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_TileView_Styled_GetEntryWidth) == 0x000004, "Wrong alignment on VALUI_TileView_Styled_GetEntryWidth");
static_assert(sizeof(VALUI_TileView_Styled_GetEntryWidth) == 0x000004, "Wrong size on VALUI_TileView_Styled_GetEntryWidth");
static_assert(offsetof(VALUI_TileView_Styled_GetEntryWidth, ReturnValue) == 0x000000, "Member 'VALUI_TileView_Styled_GetEntryWidth::ReturnValue' has a wrong offset!");

// Function ValeriaUI.HeadlessSteamAccountFlowBase.GetErrorMessageFromResponse
// 0x0020 (0x0020 - 0x0000)
struct HeadlessSteamAccountFlowBase_GetErrorMessageFromResponse final
{
public:
	class FString                                 Response;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadlessSteamAccountFlowBase_GetErrorMessageFromResponse) == 0x000008, "Wrong alignment on HeadlessSteamAccountFlowBase_GetErrorMessageFromResponse");
static_assert(sizeof(HeadlessSteamAccountFlowBase_GetErrorMessageFromResponse) == 0x000020, "Wrong size on HeadlessSteamAccountFlowBase_GetErrorMessageFromResponse");
static_assert(offsetof(HeadlessSteamAccountFlowBase_GetErrorMessageFromResponse, Response) == 0x000000, "Member 'HeadlessSteamAccountFlowBase_GetErrorMessageFromResponse::Response' has a wrong offset!");
static_assert(offsetof(HeadlessSteamAccountFlowBase_GetErrorMessageFromResponse, ReturnValue) == 0x000010, "Member 'HeadlessSteamAccountFlowBase_GetErrorMessageFromResponse::ReturnValue' has a wrong offset!");

// Function ValeriaUI.HeadlessSteamAccountFlowBase.IsErrorRetriable
// 0x0020 (0x0020 - 0x0000)
struct HeadlessSteamAccountFlowBase_IsErrorRetriable final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CD8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CD9[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadlessSteamAccountFlowBase_IsErrorRetriable) == 0x000008, "Wrong alignment on HeadlessSteamAccountFlowBase_IsErrorRetriable");
static_assert(sizeof(HeadlessSteamAccountFlowBase_IsErrorRetriable) == 0x000020, "Wrong size on HeadlessSteamAccountFlowBase_IsErrorRetriable");
static_assert(offsetof(HeadlessSteamAccountFlowBase_IsErrorRetriable, Code) == 0x000000, "Member 'HeadlessSteamAccountFlowBase_IsErrorRetriable::Code' has a wrong offset!");
static_assert(offsetof(HeadlessSteamAccountFlowBase_IsErrorRetriable, Message) == 0x000008, "Member 'HeadlessSteamAccountFlowBase_IsErrorRetriable::Message' has a wrong offset!");
static_assert(offsetof(HeadlessSteamAccountFlowBase_IsErrorRetriable, ReturnValue) == 0x000018, "Member 'HeadlessSteamAccountFlowBase_IsErrorRetriable::ReturnValue' has a wrong offset!");

// Function ValeriaUI.HeadlessSteamAccountFlowBase.LoginErrorMessage
// 0x0030 (0x0030 - 0x0000)
struct HeadlessSteamAccountFlowBase_LoginErrorMessage final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CDA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadlessSteamAccountFlowBase_LoginErrorMessage) == 0x000008, "Wrong alignment on HeadlessSteamAccountFlowBase_LoginErrorMessage");
static_assert(sizeof(HeadlessSteamAccountFlowBase_LoginErrorMessage) == 0x000030, "Wrong size on HeadlessSteamAccountFlowBase_LoginErrorMessage");
static_assert(offsetof(HeadlessSteamAccountFlowBase_LoginErrorMessage, Code) == 0x000000, "Member 'HeadlessSteamAccountFlowBase_LoginErrorMessage::Code' has a wrong offset!");
static_assert(offsetof(HeadlessSteamAccountFlowBase_LoginErrorMessage, Message) == 0x000008, "Member 'HeadlessSteamAccountFlowBase_LoginErrorMessage::Message' has a wrong offset!");
static_assert(offsetof(HeadlessSteamAccountFlowBase_LoginErrorMessage, ReturnValue) == 0x000018, "Member 'HeadlessSteamAccountFlowBase_LoginErrorMessage::ReturnValue' has a wrong offset!");

// Function ValeriaUI.HeadlessSteamAccountFlowBase.OnPlatformLoggedInFailure
// 0x0018 (0x0018 - 0x0000)
struct HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CDB[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure) == 0x000008, "Wrong alignment on HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure");
static_assert(sizeof(HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure) == 0x000018, "Wrong size on HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure");
static_assert(offsetof(HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure, ErrorMessage) == 0x000000, "Member 'HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure::ErrorMessage' has a wrong offset!");
static_assert(offsetof(HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure, ErrorCode) == 0x000010, "Member 'HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure::ErrorCode' has a wrong offset!");

// Function ValeriaUI.HeadlessSteamAccountFlowBase.OnPlatformLoggedInFailure2
// 0x0018 (0x0018 - 0x0000)
struct HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure2 final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CDC[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure2) == 0x000008, "Wrong alignment on HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure2");
static_assert(sizeof(HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure2) == 0x000018, "Wrong size on HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure2");
static_assert(offsetof(HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure2, ErrorMessage) == 0x000000, "Member 'HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure2::ErrorMessage' has a wrong offset!");
static_assert(offsetof(HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure2, ErrorCode) == 0x000010, "Member 'HeadlessSteamAccountFlowBase_OnPlatformLoggedInFailure2::ErrorCode' has a wrong offset!");

// Function ValeriaUI.HeadlessSteamAccountFlowBase.OnPlatformRegisterFailure
// 0x0018 (0x0018 - 0x0000)
struct HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CDD[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure) == 0x000008, "Wrong alignment on HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure");
static_assert(sizeof(HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure) == 0x000018, "Wrong size on HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure");
static_assert(offsetof(HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure, ErrorMessage) == 0x000000, "Member 'HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure::ErrorMessage' has a wrong offset!");
static_assert(offsetof(HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure, ErrorCode) == 0x000010, "Member 'HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure::ErrorCode' has a wrong offset!");

// Function ValeriaUI.HeadlessSteamAccountFlowBase.OnPlatformRegisterFailure2
// 0x0018 (0x0018 - 0x0000)
struct HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure2 final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CDE[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure2) == 0x000008, "Wrong alignment on HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure2");
static_assert(sizeof(HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure2) == 0x000018, "Wrong size on HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure2");
static_assert(offsetof(HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure2, ErrorMessage) == 0x000000, "Member 'HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure2::ErrorMessage' has a wrong offset!");
static_assert(offsetof(HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure2, ErrorCode) == 0x000010, "Member 'HeadlessSteamAccountFlowBase_OnPlatformRegisterFailure2::ErrorCode' has a wrong offset!");

// Function ValeriaUI.HeadlessSteamAccountFlowBase.RegistrationErrorMessage
// 0x0030 (0x0030 - 0x0000)
struct HeadlessSteamAccountFlowBase_RegistrationErrorMessage final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CDF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadlessSteamAccountFlowBase_RegistrationErrorMessage) == 0x000008, "Wrong alignment on HeadlessSteamAccountFlowBase_RegistrationErrorMessage");
static_assert(sizeof(HeadlessSteamAccountFlowBase_RegistrationErrorMessage) == 0x000030, "Wrong size on HeadlessSteamAccountFlowBase_RegistrationErrorMessage");
static_assert(offsetof(HeadlessSteamAccountFlowBase_RegistrationErrorMessage, Code) == 0x000000, "Member 'HeadlessSteamAccountFlowBase_RegistrationErrorMessage::Code' has a wrong offset!");
static_assert(offsetof(HeadlessSteamAccountFlowBase_RegistrationErrorMessage, Message) == 0x000008, "Member 'HeadlessSteamAccountFlowBase_RegistrationErrorMessage::Message' has a wrong offset!");
static_assert(offsetof(HeadlessSteamAccountFlowBase_RegistrationErrorMessage, ReturnValue) == 0x000018, "Member 'HeadlessSteamAccountFlowBase_RegistrationErrorMessage::ReturnValue' has a wrong offset!");

// Function ValeriaUI.LinkSteamAccountFlowBase.GetErrorMessageFromResponse
// 0x0020 (0x0020 - 0x0000)
struct LinkSteamAccountFlowBase_GetErrorMessageFromResponse final
{
public:
	class FString                                 Response;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LinkSteamAccountFlowBase_GetErrorMessageFromResponse) == 0x000008, "Wrong alignment on LinkSteamAccountFlowBase_GetErrorMessageFromResponse");
static_assert(sizeof(LinkSteamAccountFlowBase_GetErrorMessageFromResponse) == 0x000020, "Wrong size on LinkSteamAccountFlowBase_GetErrorMessageFromResponse");
static_assert(offsetof(LinkSteamAccountFlowBase_GetErrorMessageFromResponse, Response) == 0x000000, "Member 'LinkSteamAccountFlowBase_GetErrorMessageFromResponse::Response' has a wrong offset!");
static_assert(offsetof(LinkSteamAccountFlowBase_GetErrorMessageFromResponse, ReturnValue) == 0x000010, "Member 'LinkSteamAccountFlowBase_GetErrorMessageFromResponse::ReturnValue' has a wrong offset!");

// Function ValeriaUI.LinkSteamAccountFlowBase.LinkErrorMessage
// 0x0030 (0x0030 - 0x0000)
struct LinkSteamAccountFlowBase_LinkErrorMessage final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CE0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LinkSteamAccountFlowBase_LinkErrorMessage) == 0x000008, "Wrong alignment on LinkSteamAccountFlowBase_LinkErrorMessage");
static_assert(sizeof(LinkSteamAccountFlowBase_LinkErrorMessage) == 0x000030, "Wrong size on LinkSteamAccountFlowBase_LinkErrorMessage");
static_assert(offsetof(LinkSteamAccountFlowBase_LinkErrorMessage, Code) == 0x000000, "Member 'LinkSteamAccountFlowBase_LinkErrorMessage::Code' has a wrong offset!");
static_assert(offsetof(LinkSteamAccountFlowBase_LinkErrorMessage, Message) == 0x000008, "Member 'LinkSteamAccountFlowBase_LinkErrorMessage::Message' has a wrong offset!");
static_assert(offsetof(LinkSteamAccountFlowBase_LinkErrorMessage, ReturnValue) == 0x000018, "Member 'LinkSteamAccountFlowBase_LinkErrorMessage::ReturnValue' has a wrong offset!");

// Function ValeriaUI.LinkSteamAccountFlowBase.OnPlatformLinkFailure
// 0x0018 (0x0018 - 0x0000)
struct LinkSteamAccountFlowBase_OnPlatformLinkFailure final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CE1[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LinkSteamAccountFlowBase_OnPlatformLinkFailure) == 0x000008, "Wrong alignment on LinkSteamAccountFlowBase_OnPlatformLinkFailure");
static_assert(sizeof(LinkSteamAccountFlowBase_OnPlatformLinkFailure) == 0x000018, "Wrong size on LinkSteamAccountFlowBase_OnPlatformLinkFailure");
static_assert(offsetof(LinkSteamAccountFlowBase_OnPlatformLinkFailure, ErrorMessage) == 0x000000, "Member 'LinkSteamAccountFlowBase_OnPlatformLinkFailure::ErrorMessage' has a wrong offset!");
static_assert(offsetof(LinkSteamAccountFlowBase_OnPlatformLinkFailure, ErrorCode) == 0x000010, "Member 'LinkSteamAccountFlowBase_OnPlatformLinkFailure::ErrorCode' has a wrong offset!");

// Function ValeriaUI.LinkSteamAccountFlowBase.OnPlatformLinkFailure2
// 0x0018 (0x0018 - 0x0000)
struct LinkSteamAccountFlowBase_OnPlatformLinkFailure2 final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CE2[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LinkSteamAccountFlowBase_OnPlatformLinkFailure2) == 0x000008, "Wrong alignment on LinkSteamAccountFlowBase_OnPlatformLinkFailure2");
static_assert(sizeof(LinkSteamAccountFlowBase_OnPlatformLinkFailure2) == 0x000018, "Wrong size on LinkSteamAccountFlowBase_OnPlatformLinkFailure2");
static_assert(offsetof(LinkSteamAccountFlowBase_OnPlatformLinkFailure2, ErrorMessage) == 0x000000, "Member 'LinkSteamAccountFlowBase_OnPlatformLinkFailure2::ErrorMessage' has a wrong offset!");
static_assert(offsetof(LinkSteamAccountFlowBase_OnPlatformLinkFailure2, ErrorCode) == 0x000010, "Member 'LinkSteamAccountFlowBase_OnPlatformLinkFailure2::ErrorCode' has a wrong offset!");

// Function ValeriaUI.LinkSteamAccountFlowBase.OnPlatformLoggedInFailure
// 0x0018 (0x0018 - 0x0000)
struct LinkSteamAccountFlowBase_OnPlatformLoggedInFailure final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CE3[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LinkSteamAccountFlowBase_OnPlatformLoggedInFailure) == 0x000008, "Wrong alignment on LinkSteamAccountFlowBase_OnPlatformLoggedInFailure");
static_assert(sizeof(LinkSteamAccountFlowBase_OnPlatformLoggedInFailure) == 0x000018, "Wrong size on LinkSteamAccountFlowBase_OnPlatformLoggedInFailure");
static_assert(offsetof(LinkSteamAccountFlowBase_OnPlatformLoggedInFailure, ErrorMessage) == 0x000000, "Member 'LinkSteamAccountFlowBase_OnPlatformLoggedInFailure::ErrorMessage' has a wrong offset!");
static_assert(offsetof(LinkSteamAccountFlowBase_OnPlatformLoggedInFailure, ErrorCode) == 0x000010, "Member 'LinkSteamAccountFlowBase_OnPlatformLoggedInFailure::ErrorCode' has a wrong offset!");

// Function ValeriaUI.LinkSteamAccountFlowBase.OnPlatformLoggedInFailure2
// 0x0018 (0x0018 - 0x0000)
struct LinkSteamAccountFlowBase_OnPlatformLoggedInFailure2 final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CE4[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LinkSteamAccountFlowBase_OnPlatformLoggedInFailure2) == 0x000008, "Wrong alignment on LinkSteamAccountFlowBase_OnPlatformLoggedInFailure2");
static_assert(sizeof(LinkSteamAccountFlowBase_OnPlatformLoggedInFailure2) == 0x000018, "Wrong size on LinkSteamAccountFlowBase_OnPlatformLoggedInFailure2");
static_assert(offsetof(LinkSteamAccountFlowBase_OnPlatformLoggedInFailure2, ErrorMessage) == 0x000000, "Member 'LinkSteamAccountFlowBase_OnPlatformLoggedInFailure2::ErrorMessage' has a wrong offset!");
static_assert(offsetof(LinkSteamAccountFlowBase_OnPlatformLoggedInFailure2, ErrorCode) == 0x000010, "Member 'LinkSteamAccountFlowBase_OnPlatformLoggedInFailure2::ErrorCode' has a wrong offset!");

// Function ValeriaUI.VALUI_LoadingScreenUserWidget.HandleOnPawnChanged
// 0x0008 (0x0008 - 0x0000)
struct VALUI_LoadingScreenUserWidget_HandleOnPawnChanged final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_LoadingScreenUserWidget_HandleOnPawnChanged) == 0x000008, "Wrong alignment on VALUI_LoadingScreenUserWidget_HandleOnPawnChanged");
static_assert(sizeof(VALUI_LoadingScreenUserWidget_HandleOnPawnChanged) == 0x000008, "Wrong size on VALUI_LoadingScreenUserWidget_HandleOnPawnChanged");
static_assert(offsetof(VALUI_LoadingScreenUserWidget_HandleOnPawnChanged, Pawn) == 0x000000, "Member 'VALUI_LoadingScreenUserWidget_HandleOnPawnChanged::Pawn' has a wrong offset!");

// Function ValeriaUI.VALUI_LoadingScreenUserWidget.HandleSetBackgroundImage
// 0x0008 (0x0008 - 0x0000)
struct VALUI_LoadingScreenUserWidget_HandleSetBackgroundImage final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_LoadingScreenUserWidget_HandleSetBackgroundImage) == 0x000008, "Wrong alignment on VALUI_LoadingScreenUserWidget_HandleSetBackgroundImage");
static_assert(sizeof(VALUI_LoadingScreenUserWidget_HandleSetBackgroundImage) == 0x000008, "Wrong size on VALUI_LoadingScreenUserWidget_HandleSetBackgroundImage");
static_assert(offsetof(VALUI_LoadingScreenUserWidget_HandleSetBackgroundImage, Texture) == 0x000000, "Member 'VALUI_LoadingScreenUserWidget_HandleSetBackgroundImage::Texture' has a wrong offset!");

// Function ValeriaUI.VALUI_LoadingScreenUserWidget.HandleSetLoadingScreenTip
// 0x0030 (0x0030 - 0x0000)
struct VALUI_LoadingScreenUserWidget_HandleSetLoadingScreenTip final
{
public:
	struct FPaliaLoadingScreenTip                 Tip;                                               // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VALUI_LoadingScreenUserWidget_HandleSetLoadingScreenTip) == 0x000008, "Wrong alignment on VALUI_LoadingScreenUserWidget_HandleSetLoadingScreenTip");
static_assert(sizeof(VALUI_LoadingScreenUserWidget_HandleSetLoadingScreenTip) == 0x000030, "Wrong size on VALUI_LoadingScreenUserWidget_HandleSetLoadingScreenTip");
static_assert(offsetof(VALUI_LoadingScreenUserWidget_HandleSetLoadingScreenTip, Tip) == 0x000000, "Member 'VALUI_LoadingScreenUserWidget_HandleSetLoadingScreenTip::Tip' has a wrong offset!");

// Function ValeriaUI.MailboxViewerUserWidget.CanAllRewardsBeCollected
// 0x0008 (0x0008 - 0x0000)
struct MailboxViewerUserWidget_CanAllRewardsBeCollected final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CE8[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MailboxViewerUserWidget_CanAllRewardsBeCollected) == 0x000004, "Wrong alignment on MailboxViewerUserWidget_CanAllRewardsBeCollected");
static_assert(sizeof(MailboxViewerUserWidget_CanAllRewardsBeCollected) == 0x000008, "Wrong size on MailboxViewerUserWidget_CanAllRewardsBeCollected");
static_assert(offsetof(MailboxViewerUserWidget_CanAllRewardsBeCollected, Param_Index) == 0x000000, "Member 'MailboxViewerUserWidget_CanAllRewardsBeCollected::Param_Index' has a wrong offset!");
static_assert(offsetof(MailboxViewerUserWidget_CanAllRewardsBeCollected, ReturnValue) == 0x000004, "Member 'MailboxViewerUserWidget_CanAllRewardsBeCollected::ReturnValue' has a wrong offset!");

// Function ValeriaUI.MailboxViewerUserWidget.HideMessage
// 0x0004 (0x0004 - 0x0000)
struct MailboxViewerUserWidget_HideMessage final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MailboxViewerUserWidget_HideMessage) == 0x000004, "Wrong alignment on MailboxViewerUserWidget_HideMessage");
static_assert(sizeof(MailboxViewerUserWidget_HideMessage) == 0x000004, "Wrong size on MailboxViewerUserWidget_HideMessage");
static_assert(offsetof(MailboxViewerUserWidget_HideMessage, Param_Index) == 0x000000, "Member 'MailboxViewerUserWidget_HideMessage::Param_Index' has a wrong offset!");

// Function ValeriaUI.MailboxViewerUserWidget.MarkAsRead
// 0x0004 (0x0004 - 0x0000)
struct MailboxViewerUserWidget_MarkAsRead final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MailboxViewerUserWidget_MarkAsRead) == 0x000004, "Wrong alignment on MailboxViewerUserWidget_MarkAsRead");
static_assert(sizeof(MailboxViewerUserWidget_MarkAsRead) == 0x000004, "Wrong size on MailboxViewerUserWidget_MarkAsRead");
static_assert(offsetof(MailboxViewerUserWidget_MarkAsRead, Param_Index) == 0x000000, "Member 'MailboxViewerUserWidget_MarkAsRead::Param_Index' has a wrong offset!");

// Function ValeriaUI.MailboxViewerUserWidget.OnPlayerToPlayerMailFailed
// 0x0010 (0x0010 - 0x0000)
struct MailboxViewerUserWidget_OnPlayerToPlayerMailFailed final
{
public:
	class FString                                 Error;                                             // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MailboxViewerUserWidget_OnPlayerToPlayerMailFailed) == 0x000008, "Wrong alignment on MailboxViewerUserWidget_OnPlayerToPlayerMailFailed");
static_assert(sizeof(MailboxViewerUserWidget_OnPlayerToPlayerMailFailed) == 0x000010, "Wrong size on MailboxViewerUserWidget_OnPlayerToPlayerMailFailed");
static_assert(offsetof(MailboxViewerUserWidget_OnPlayerToPlayerMailFailed, Error) == 0x000000, "Member 'MailboxViewerUserWidget_OnPlayerToPlayerMailFailed::Error' has a wrong offset!");

// Function ValeriaUI.MailboxViewerUserWidget.OnPlayerToPlayerMailSuccess
// 0x0010 (0x0010 - 0x0000)
struct MailboxViewerUserWidget_OnPlayerToPlayerMailSuccess final
{
public:
	struct FMailbox                               Mailbox;                                           // 0x0000(0x0010)(ConstParm, Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MailboxViewerUserWidget_OnPlayerToPlayerMailSuccess) == 0x000008, "Wrong alignment on MailboxViewerUserWidget_OnPlayerToPlayerMailSuccess");
static_assert(sizeof(MailboxViewerUserWidget_OnPlayerToPlayerMailSuccess) == 0x000010, "Wrong size on MailboxViewerUserWidget_OnPlayerToPlayerMailSuccess");
static_assert(offsetof(MailboxViewerUserWidget_OnPlayerToPlayerMailSuccess, Mailbox) == 0x000000, "Member 'MailboxViewerUserWidget_OnPlayerToPlayerMailSuccess::Mailbox' has a wrong offset!");

// Function ValeriaUI.MailboxViewerUserWidget.OnVillagerMailChanged
// 0x0008 (0x0008 - 0x0000)
struct MailboxViewerUserWidget_OnVillagerMailChanged final
{
public:
	class UVillagerMailInboxComponent*            VillagerMail;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MailboxViewerUserWidget_OnVillagerMailChanged) == 0x000008, "Wrong alignment on MailboxViewerUserWidget_OnVillagerMailChanged");
static_assert(sizeof(MailboxViewerUserWidget_OnVillagerMailChanged) == 0x000008, "Wrong size on MailboxViewerUserWidget_OnVillagerMailChanged");
static_assert(offsetof(MailboxViewerUserWidget_OnVillagerMailChanged, VillagerMail) == 0x000000, "Member 'MailboxViewerUserWidget_OnVillagerMailChanged::VillagerMail' has a wrong offset!");

// Function ValeriaUI.MailboxViewerUserWidget.RefreshMailMessages
// 0x0001 (0x0001 - 0x0000)
struct MailboxViewerUserWidget_RefreshMailMessages final
{
public:
	bool                                          AllowRemoval;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MailboxViewerUserWidget_RefreshMailMessages) == 0x000001, "Wrong alignment on MailboxViewerUserWidget_RefreshMailMessages");
static_assert(sizeof(MailboxViewerUserWidget_RefreshMailMessages) == 0x000001, "Wrong size on MailboxViewerUserWidget_RefreshMailMessages");
static_assert(offsetof(MailboxViewerUserWidget_RefreshMailMessages, AllowRemoval) == 0x000000, "Member 'MailboxViewerUserWidget_RefreshMailMessages::AllowRemoval' has a wrong offset!");

// Function ValeriaUI.MailboxViewerUserWidget.RemoveLoadedMessage
// 0x0004 (0x0004 - 0x0000)
struct MailboxViewerUserWidget_RemoveLoadedMessage final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MailboxViewerUserWidget_RemoveLoadedMessage) == 0x000004, "Wrong alignment on MailboxViewerUserWidget_RemoveLoadedMessage");
static_assert(sizeof(MailboxViewerUserWidget_RemoveLoadedMessage) == 0x000004, "Wrong size on MailboxViewerUserWidget_RemoveLoadedMessage");
static_assert(offsetof(MailboxViewerUserWidget_RemoveLoadedMessage, Param_Index) == 0x000000, "Member 'MailboxViewerUserWidget_RemoveLoadedMessage::Param_Index' has a wrong offset!");

// Function ValeriaUI.MailboxViewerUserWidget.TryCollectAllRewards
// 0x0008 (0x0008 - 0x0000)
struct MailboxViewerUserWidget_TryCollectAllRewards final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EValeriaFuncResult                            OutResult;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CE9[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MailboxViewerUserWidget_TryCollectAllRewards) == 0x000004, "Wrong alignment on MailboxViewerUserWidget_TryCollectAllRewards");
static_assert(sizeof(MailboxViewerUserWidget_TryCollectAllRewards) == 0x000008, "Wrong size on MailboxViewerUserWidget_TryCollectAllRewards");
static_assert(offsetof(MailboxViewerUserWidget_TryCollectAllRewards, Param_Index) == 0x000000, "Member 'MailboxViewerUserWidget_TryCollectAllRewards::Param_Index' has a wrong offset!");
static_assert(offsetof(MailboxViewerUserWidget_TryCollectAllRewards, OutResult) == 0x000004, "Member 'MailboxViewerUserWidget_TryCollectAllRewards::OutResult' has a wrong offset!");
static_assert(offsetof(MailboxViewerUserWidget_TryCollectAllRewards, ReturnValue) == 0x000005, "Member 'MailboxViewerUserWidget_TryCollectAllRewards::ReturnValue' has a wrong offset!");

// Function ValeriaUI.MailboxViewerUserWidget.TryCollectReward
// 0x000C (0x000C - 0x0000)
struct MailboxViewerUserWidget_TryCollectReward final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RewardIndex;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CEA[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MailboxViewerUserWidget_TryCollectReward) == 0x000004, "Wrong alignment on MailboxViewerUserWidget_TryCollectReward");
static_assert(sizeof(MailboxViewerUserWidget_TryCollectReward) == 0x00000C, "Wrong size on MailboxViewerUserWidget_TryCollectReward");
static_assert(offsetof(MailboxViewerUserWidget_TryCollectReward, Param_Index) == 0x000000, "Member 'MailboxViewerUserWidget_TryCollectReward::Param_Index' has a wrong offset!");
static_assert(offsetof(MailboxViewerUserWidget_TryCollectReward, RewardIndex) == 0x000004, "Member 'MailboxViewerUserWidget_TryCollectReward::RewardIndex' has a wrong offset!");
static_assert(offsetof(MailboxViewerUserWidget_TryCollectReward, ReturnValue) == 0x000008, "Member 'MailboxViewerUserWidget_TryCollectReward::ReturnValue' has a wrong offset!");

