#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValeriaUI

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "S6UICore_classes.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonWidgetInputExtended_classes.hpp"
#include "ValeriaUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "S6Core_structs.hpp"
#include "S6Core_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "S6UICommonWidgets_classes.hpp"
#include "InputCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "WebBrowserWidget_classes.hpp"


namespace SDK
{

// Class ValeriaUI.VALUI_ModalWidgetBase
// 0x0000 (0x0558 - 0x0558)
class UVALUI_ModalWidgetBase : public US6UI_ModalWidgetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_ModalWidgetBase">();
	}
	static class UVALUI_ModalWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_ModalWidgetBase>();
	}
};
static_assert(alignof(UVALUI_ModalWidgetBase) == 0x000008, "Wrong alignment on UVALUI_ModalWidgetBase");
static_assert(sizeof(UVALUI_ModalWidgetBase) == 0x000558, "Wrong size on UVALUI_ModalWidgetBase");

// Class ValeriaUI.BaitUserWidget
// 0x0078 (0x05D0 - 0x0558)
class UBaitUserWidget final : public UVALUI_ModalWidgetBase
{
public:
	TArray<struct FValeriaItem>                   Bait;                                              // 0x0558(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FValeriaItem                           SelectedBait;                                      // 0x0568(0x0060)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CCE[0x8];                                     // 0x05C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndBaitSelection();
	void OnBaitSelected(const struct FValeriaItem& baitItem);
	void OnHidden();
	void OnRightMouseReleased();
	void OnShown(EAmmoType AmmoType);
	void ShowAmmoType(EAmmoType AmmoType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaitUserWidget">();
	}
	static class UBaitUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaitUserWidget>();
	}
};
static_assert(alignof(UBaitUserWidget) == 0x000008, "Wrong alignment on UBaitUserWidget");
static_assert(sizeof(UBaitUserWidget) == 0x0005D0, "Wrong size on UBaitUserWidget");
static_assert(offsetof(UBaitUserWidget, Bait) == 0x000558, "Member 'UBaitUserWidget::Bait' has a wrong offset!");
static_assert(offsetof(UBaitUserWidget, SelectedBait) == 0x000568, "Member 'UBaitUserWidget::SelectedBait' has a wrong offset!");

// Class ValeriaUI.VAL_LocalizationUtils
// 0x0000 (0x0028 - 0x0028)
class UVAL_LocalizationUtils final : public UBlueprintFunctionLibrary
{
public:
	static class FString GetGreetingLanguageSuffix();
	static class FString GetGreetingStorageLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_LocalizationUtils">();
	}
	static class UVAL_LocalizationUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_LocalizationUtils>();
	}
};
static_assert(alignof(UVAL_LocalizationUtils) == 0x000008, "Wrong alignment on UVAL_LocalizationUtils");
static_assert(sizeof(UVAL_LocalizationUtils) == 0x000028, "Wrong size on UVAL_LocalizationUtils");

// Class ValeriaUI.BookViewerWidget
// 0x0008 (0x0560 - 0x0558)
class UBookViewerWidget final : public UVALUI_ModalWidgetBase
{
public:
	int32                                         CurrentBookId;                                     // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CCF[0x4];                                     // 0x055C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MarkPageAsRead(int32 Param_Index);

	class FText GetContentForPage(int32 Param_Index) const;
	int32 GetNumberOfPages() const;
	class FText GetSubTitle() const;
	class FText GetTitle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BookViewerWidget">();
	}
	static class UBookViewerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBookViewerWidget>();
	}
};
static_assert(alignof(UBookViewerWidget) == 0x000008, "Wrong alignment on UBookViewerWidget");
static_assert(sizeof(UBookViewerWidget) == 0x000560, "Wrong size on UBookViewerWidget");
static_assert(offsetof(UBookViewerWidget, CurrentBookId) == 0x000558, "Member 'UBookViewerWidget::CurrentBookId' has a wrong offset!");

// Class ValeriaUI.DetailUserWidget
// 0x0050 (0x0310 - 0x02C0)
class UDetailUserWidget final : public UUserWidget
{
public:
	class UTextBlock*                             DetailName;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             DetailCategory;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             DetailDescription;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 DetailIcon;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CD1[0x30];                                    // 0x02E0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool UpdateDetail(TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DetailUserWidget">();
	}
	static class UDetailUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDetailUserWidget>();
	}
};
static_assert(alignof(UDetailUserWidget) == 0x000008, "Wrong alignment on UDetailUserWidget");
static_assert(sizeof(UDetailUserWidget) == 0x000310, "Wrong size on UDetailUserWidget");
static_assert(offsetof(UDetailUserWidget, DetailName) == 0x0002C0, "Member 'UDetailUserWidget::DetailName' has a wrong offset!");
static_assert(offsetof(UDetailUserWidget, DetailCategory) == 0x0002C8, "Member 'UDetailUserWidget::DetailCategory' has a wrong offset!");
static_assert(offsetof(UDetailUserWidget, DetailDescription) == 0x0002D0, "Member 'UDetailUserWidget::DetailDescription' has a wrong offset!");
static_assert(offsetof(UDetailUserWidget, DetailIcon) == 0x0002D8, "Member 'UDetailUserWidget::DetailIcon' has a wrong offset!");

// Class ValeriaUI.VALUI_ListView_Styled
// 0x0070 (0x0CE0 - 0x0C70)
#pragma pack(push, 0x1)
class alignas(0x10) UVALUI_ListView_Styled : public UListView
{
public:
	uint8                                         Pad_2CD3[0x8];                                     // 0x0C70(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ListViewStyle*                   Style;                                             // 0x0C78(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHandleDirectionalNavigation;                      // 0x0C80(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProvideInputType;                                 // 0x0C81(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CD4[0x6];                                     // 0x0C82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnUserScrolled;                                    // 0x0C88(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnUserMouseWheelScrolled;                          // 0x0C98(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnListItemsChanged;                                // 0x0CA8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CD5[0x10];                                    // 0x0CB8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             BP_OnListItemSelectionChangedWithInputType;        // 0x0CC8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)

public:
	void OnListItemsChanged__DelegateSignature(TArray<class UObject*>& AddedItems, TArray<class UObject*>& RemovedItems);
	void OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature(class UObject* Item, bool bIsSelected, ESelectInfo SelectType);
	void ResetPoolAndSetListItems(TArray<class UObject*>& InListItems);
	void SetEntryWidgetClass(TSubclassOf<class UUserWidget> NewWidgetClass);
	void VALUI_OnListViewUserMouseWheelScrolled__DelegateSignature(float DesiredOffset);
	void VALUI_OnListViewUserScrolled__DelegateSignature(float ScrollFraction);

	TArray<class UObject*> GetItemsWithinRange(int32& StartingIndex, int32& Range) const;
	float GetScrollbarDistanceFromBottom() const;
	bool ShouldScrollBarBeVisible() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_ListView_Styled">();
	}
	static class UVALUI_ListView_Styled* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_ListView_Styled>();
	}
};
#pragma pack(pop)
static_assert(alignof(UVALUI_ListView_Styled) == 0x000010, "Wrong alignment on UVALUI_ListView_Styled");
static_assert(sizeof(UVALUI_ListView_Styled) == 0x000CE0, "Wrong size on UVALUI_ListView_Styled");
static_assert(offsetof(UVALUI_ListView_Styled, Style) == 0x000C78, "Member 'UVALUI_ListView_Styled::Style' has a wrong offset!");
static_assert(offsetof(UVALUI_ListView_Styled, bHandleDirectionalNavigation) == 0x000C80, "Member 'UVALUI_ListView_Styled::bHandleDirectionalNavigation' has a wrong offset!");
static_assert(offsetof(UVALUI_ListView_Styled, bProvideInputType) == 0x000C81, "Member 'UVALUI_ListView_Styled::bProvideInputType' has a wrong offset!");
static_assert(offsetof(UVALUI_ListView_Styled, OnUserScrolled) == 0x000C88, "Member 'UVALUI_ListView_Styled::OnUserScrolled' has a wrong offset!");
static_assert(offsetof(UVALUI_ListView_Styled, OnUserMouseWheelScrolled) == 0x000C98, "Member 'UVALUI_ListView_Styled::OnUserMouseWheelScrolled' has a wrong offset!");
static_assert(offsetof(UVALUI_ListView_Styled, OnListItemsChanged) == 0x000CA8, "Member 'UVALUI_ListView_Styled::OnListItemsChanged' has a wrong offset!");
static_assert(offsetof(UVALUI_ListView_Styled, BP_OnListItemSelectionChangedWithInputType) == 0x000CC8, "Member 'UVALUI_ListView_Styled::BP_OnListItemSelectionChangedWithInputType' has a wrong offset!");

// Class ValeriaUI.VALUI_TileView_Styled
// 0x0020 (0x0D00 - 0x0CE0)
class UVALUI_TileView_Styled final : public UVALUI_ListView_Styled
{
public:
	float                                         EntryHeight;                                       // 0x0CD8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EntryWidth;                                        // 0x0CDC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EListItemAlignment                            TileAlignment;                                     // 0x0CE0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWrapHorizontalNavigation;                         // 0x0CE1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CD7[0x1E];                                    // 0x0CE2(0x001E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetEntryHeight(float NewHeight);
	void SetEntryWidth(float NewWidth);

	float GetEntryHeight() const;
	float GetEntryWidth() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_TileView_Styled">();
	}
	static class UVALUI_TileView_Styled* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_TileView_Styled>();
	}
};
static_assert(alignof(UVALUI_TileView_Styled) == 0x000010, "Wrong alignment on UVALUI_TileView_Styled");
static_assert(sizeof(UVALUI_TileView_Styled) == 0x000D00, "Wrong size on UVALUI_TileView_Styled");
static_assert(offsetof(UVALUI_TileView_Styled, EntryHeight) == 0x000CD8, "Member 'UVALUI_TileView_Styled::EntryHeight' has a wrong offset!");
static_assert(offsetof(UVALUI_TileView_Styled, EntryWidth) == 0x000CDC, "Member 'UVALUI_TileView_Styled::EntryWidth' has a wrong offset!");
static_assert(offsetof(UVALUI_TileView_Styled, TileAlignment) == 0x000CE0, "Member 'UVALUI_TileView_Styled::TileAlignment' has a wrong offset!");
static_assert(offsetof(UVALUI_TileView_Styled, bWrapHorizontalNavigation) == 0x000CE1, "Member 'UVALUI_TileView_Styled::bWrapHorizontalNavigation' has a wrong offset!");

// Class ValeriaUI.HeadlessSteamAccountFlowBase
// 0x0000 (0x0510 - 0x0510)
class UHeadlessSteamAccountFlowBase : public UCommonActivatableWidgetInputExtended
{
public:
	void BindDelegates();
	class FString GetErrorMessageFromResponse(const class FString& Response);
	bool IsErrorRetriable(int32 Code, const class FString& Message);
	class FText LoginErrorMessage(int32 Code, const class FString& Message);
	void OnPlatformLoggedInFailure(const class FString& ErrorMessage, int32 ErrorCode);
	void OnPlatformLoggedInFailure2(const class FString& ErrorMessage, int32 ErrorCode);
	void OnPlatformLoggedInSuccess();
	void OnPlatformRegisterFailure(const class FString& ErrorMessage, int32 ErrorCode);
	void OnPlatformRegisterFailure2(const class FString& ErrorMessage, int32 ErrorCode);
	void OnPlatformRegisterSuccess();
	class FText RegistrationErrorMessage(int32 Code, const class FString& Message);
	void UnbindDelegates();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HeadlessSteamAccountFlowBase">();
	}
	static class UHeadlessSteamAccountFlowBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeadlessSteamAccountFlowBase>();
	}
};
static_assert(alignof(UHeadlessSteamAccountFlowBase) == 0x000008, "Wrong alignment on UHeadlessSteamAccountFlowBase");
static_assert(sizeof(UHeadlessSteamAccountFlowBase) == 0x000510, "Wrong size on UHeadlessSteamAccountFlowBase");

// Class ValeriaUI.LinkSteamAccountFlowBase
// 0x0000 (0x0510 - 0x0510)
class ULinkSteamAccountFlowBase : public UCommonActivatableWidgetInputExtended
{
public:
	void BindDelegates();
	class FString GetErrorMessageFromResponse(const class FString& Response);
	class FText LinkErrorMessage(int32 Code, const class FString& Message);
	void OnPlatformLinkFailure(const class FString& ErrorMessage, int32 ErrorCode);
	void OnPlatformLinkFailure2(const class FString& ErrorMessage, int32 ErrorCode);
	void OnPlatformLinkSuccess();
	void OnPlatformLoggedInFailure(const class FString& ErrorMessage, int32 ErrorCode);
	void OnPlatformLoggedInFailure2(const class FString& ErrorMessage, int32 ErrorCode);
	void OnPlatformLoggedInSuccess();
	void UnbindDelegates();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LinkSteamAccountFlowBase">();
	}
	static class ULinkSteamAccountFlowBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULinkSteamAccountFlowBase>();
	}
};
static_assert(alignof(ULinkSteamAccountFlowBase) == 0x000008, "Wrong alignment on ULinkSteamAccountFlowBase");
static_assert(sizeof(ULinkSteamAccountFlowBase) == 0x000510, "Wrong size on ULinkSteamAccountFlowBase");

// Class ValeriaUI.VALUI_LoadingScreenUserWidget
// 0x0048 (0x0308 - 0x02C0)
class UVALUI_LoadingScreenUserWidget : public UUserWidget
{
public:
	class UVALUI_LoadingScreenBlackWidget*        LoadingScreenBlackWidget;                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             CurrentBackgroundTexture;                          // 0x02C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CE5[0x38];                                    // 0x02D0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnPawnChanged(class APawn* Pawn);
	void HandleSetBackgroundImage(class UTexture2D* Texture);
	void HandleSetLoadingScreenTip(struct FPaliaLoadingScreenTip& Tip);
	void ShowFadeToBlack();
	void ShowLoadingScreenBackground();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_LoadingScreenUserWidget">();
	}
	static class UVALUI_LoadingScreenUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_LoadingScreenUserWidget>();
	}
};
static_assert(alignof(UVALUI_LoadingScreenUserWidget) == 0x000008, "Wrong alignment on UVALUI_LoadingScreenUserWidget");
static_assert(sizeof(UVALUI_LoadingScreenUserWidget) == 0x000308, "Wrong size on UVALUI_LoadingScreenUserWidget");
static_assert(offsetof(UVALUI_LoadingScreenUserWidget, LoadingScreenBlackWidget) == 0x0002C0, "Member 'UVALUI_LoadingScreenUserWidget::LoadingScreenBlackWidget' has a wrong offset!");
static_assert(offsetof(UVALUI_LoadingScreenUserWidget, CurrentBackgroundTexture) == 0x0002C8, "Member 'UVALUI_LoadingScreenUserWidget::CurrentBackgroundTexture' has a wrong offset!");

// Class ValeriaUI.MailboxViewerUserWidget
// 0x0030 (0x0588 - 0x0558)
class UMailboxViewerUserWidget final : public UVALUI_ModalWidgetBase
{
public:
	bool                                          bIsLoadingMail;                                    // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CE6[0x7];                                     // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMailMessageWidgetData>         MailMessages;                                      // 0x0560(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	EMailboxViewerFilter                          CurrentFilter;                                     // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CE7[0x7];                                     // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMailbox                               LoadedMailbox;                                     // 0x0578(0x0010)(NativeAccessSpecifierPrivate)

public:
	bool CanAllRewardsBeCollected(int32 Param_Index);
	void HideMessage(int32 Param_Index);
	void LoadMail();
	void MarkAsRead(int32 Param_Index);
	void OnMailChanged();
	void OnMailLoaded();
	void OnPlayerToPlayerMailFailed(class FString& Error);
	void OnPlayerToPlayerMailSuccess(struct FMailbox& Mailbox);
	void OnVillagerMailChanged(class UVillagerMailInboxComponent* VillagerMail);
	void RefreshMailMessages(bool AllowRemoval);
	void RemoveLoadedMessage(int32 Param_Index);
	bool TryCollectAllRewards(int32 Param_Index, EValeriaFuncResult* OutResult);
	bool TryCollectReward(int32 Param_Index, int32 RewardIndex);
	void UpdateMailFilter(EMailboxViewerFilter Filter);

	bool AreAllRewardsCollected(int32 Param_Index) const;
	EMailboxViewerFilter GetCurrentFilter() const;
	int32 GetIndexOfMailMessage(const struct FMailMessageWidgetData& Data) const;
	struct FMailMessageWidgetData GetMailMessage(int32 Param_Index) const;
	int32 GetNextNonHiddenMessage(int32 StartIndex) const;
	int32 GetNumberOfMessages() const;
	int32 GetNumberOfMessagesForFilter(EMailboxViewerFilter Filter) const;
	int32 GetNumberOfNonHiddenMessages() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MailboxViewerUserWidget">();
	}
	static class UMailboxViewerUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMailboxViewerUserWidget>();
	}
};
static_assert(alignof(UMailboxViewerUserWidget) == 0x000008, "Wrong alignment on UMailboxViewerUserWidget");
static_assert(sizeof(UMailboxViewerUserWidget) == 0x000588, "Wrong size on UMailboxViewerUserWidget");
static_assert(offsetof(UMailboxViewerUserWidget, bIsLoadingMail) == 0x000558, "Member 'UMailboxViewerUserWidget::bIsLoadingMail' has a wrong offset!");
static_assert(offsetof(UMailboxViewerUserWidget, MailMessages) == 0x000560, "Member 'UMailboxViewerUserWidget::MailMessages' has a wrong offset!");
static_assert(offsetof(UMailboxViewerUserWidget, CurrentFilter) == 0x000570, "Member 'UMailboxViewerUserWidget::CurrentFilter' has a wrong offset!");
static_assert(offsetof(UMailboxViewerUserWidget, LoadedMailbox) == 0x000578, "Member 'UMailboxViewerUserWidget::LoadedMailbox' has a wrong offset!");

// Class ValeriaUI.MainLobbyBase
// 0x0000 (0x0510 - 0x0510)
class UMainLobbyBase : public UCommonActivatableWidgetInputExtended
{
public:
	void HandleInitialSteamLoginFailure(int32 Code, const class FString& Msg);
	void OnSteamInitializationFailure();
	void OnSteamLoginError(class FText& Msg);
	void OnSteamLoginNotFound();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MainLobbyBase">();
	}
	static class UMainLobbyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainLobbyBase>();
	}
};
static_assert(alignof(UMainLobbyBase) == 0x000008, "Wrong alignment on UMainLobbyBase");
static_assert(sizeof(UMainLobbyBase) == 0x000510, "Wrong size on UMainLobbyBase");

// Class ValeriaUI.ValeriaViewportClient
// 0x0060 (0x0450 - 0x03F0)
class UValeriaViewportClient final : public US6UI_GameViewportClient
{
public:
	uint8                                         Pad_2CF0[0x50];                                    // 0x03F0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_LoadingScreenUserWidget*         LoadingScreenWidget;                               // 0x0440(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CF1[0x8];                                     // 0x0448(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnFadeInBlack(float DurationSeconds);
	void HandleOnFadeOutBlack(float DurationSeconds);
	void ReceiveOnFadeOutBlack();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValeriaViewportClient">();
	}
	static class UValeriaViewportClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValeriaViewportClient>();
	}
};
static_assert(alignof(UValeriaViewportClient) == 0x000008, "Wrong alignment on UValeriaViewportClient");
static_assert(sizeof(UValeriaViewportClient) == 0x000450, "Wrong size on UValeriaViewportClient");
static_assert(offsetof(UValeriaViewportClient, LoadingScreenWidget) == 0x000440, "Member 'UValeriaViewportClient::LoadingScreenWidget' has a wrong offset!");

// Class ValeriaUI.VALUI_AnnouncementsMessageModalDialog
// 0x0038 (0x0590 - 0x0558)
class UVALUI_AnnouncementsMessageModalDialog : public UVALUI_ModalWidgetBase
{
public:
	bool                                          bIsFromLogin;                                      // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CF2[0x7];                                     // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PrefetchedMessage;                                 // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnConfirm;                                         // 0x0570(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x0580(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class FString GetAnnouncementUrl();
	void HandleRefreshedMessageFromWeb(const class FString& Message);
	void NotifyConfirmComplete();
	void OnConfirmDelegate__DelegateSignature();
	void RefreshMessageFromWeb();
	void SetURL(const class FString& NewURL);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_AnnouncementsMessageModalDialog">();
	}
	static class UVALUI_AnnouncementsMessageModalDialog* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_AnnouncementsMessageModalDialog>();
	}
};
static_assert(alignof(UVALUI_AnnouncementsMessageModalDialog) == 0x000008, "Wrong alignment on UVALUI_AnnouncementsMessageModalDialog");
static_assert(sizeof(UVALUI_AnnouncementsMessageModalDialog) == 0x000590, "Wrong size on UVALUI_AnnouncementsMessageModalDialog");
static_assert(offsetof(UVALUI_AnnouncementsMessageModalDialog, bIsFromLogin) == 0x000558, "Member 'UVALUI_AnnouncementsMessageModalDialog::bIsFromLogin' has a wrong offset!");
static_assert(offsetof(UVALUI_AnnouncementsMessageModalDialog, PrefetchedMessage) == 0x000560, "Member 'UVALUI_AnnouncementsMessageModalDialog::PrefetchedMessage' has a wrong offset!");
static_assert(offsetof(UVALUI_AnnouncementsMessageModalDialog, OnConfirm) == 0x000570, "Member 'UVALUI_AnnouncementsMessageModalDialog::OnConfirm' has a wrong offset!");
static_assert(offsetof(UVALUI_AnnouncementsMessageModalDialog, URL) == 0x000580, "Member 'UVALUI_AnnouncementsMessageModalDialog::URL' has a wrong offset!");

// Class ValeriaUI.VAL_AsyncActionRequestStorefront
// 0x0028 (0x0058 - 0x0030)
class UVAL_AsyncActionRequestStorefront final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             Successful;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             Failure;                                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CF3[0x8];                                     // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UVAL_AsyncActionRequestStorefront* RequestStorefront(class ULocalPlayer* LP);

	void OnRequestStorefrontFailure__DelegateSignature();
	void OnRequestStorefrontSuccess__DelegateSignature(const struct FVALUI_PremiumStorefrontResponse& Response);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAL_AsyncActionRequestStorefront">();
	}
	static class UVAL_AsyncActionRequestStorefront* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAL_AsyncActionRequestStorefront>();
	}
};
static_assert(alignof(UVAL_AsyncActionRequestStorefront) == 0x000008, "Wrong alignment on UVAL_AsyncActionRequestStorefront");
static_assert(sizeof(UVAL_AsyncActionRequestStorefront) == 0x000058, "Wrong size on UVAL_AsyncActionRequestStorefront");
static_assert(offsetof(UVAL_AsyncActionRequestStorefront, Successful) == 0x000030, "Member 'UVAL_AsyncActionRequestStorefront::Successful' has a wrong offset!");
static_assert(offsetof(UVAL_AsyncActionRequestStorefront, Failure) == 0x000040, "Member 'UVAL_AsyncActionRequestStorefront::Failure' has a wrong offset!");

// Class ValeriaUI.WishViewWidget
// 0x0000 (0x0558 - 0x0558)
class UWishViewWidget final : public UVALUI_ModalWidgetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WishViewWidget">();
	}
	static class UWishViewWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWishViewWidget>();
	}
};
static_assert(alignof(UWishViewWidget) == 0x000008, "Wrong alignment on UWishViewWidget");
static_assert(sizeof(UWishViewWidget) == 0x000558, "Wrong size on UWishViewWidget");

// Class ValeriaUI.VALUI_AsyncUpdateLoadout
// 0x0990 (0x09C0 - 0x0030)
class UVALUI_AsyncUpdateLoadout final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             Completed;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             Failed;                                            // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CF4[0x970];                                   // 0x0050(0x0970)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UVALUI_AsyncUpdateLoadout* UpdateLoadout(class UVALUI_CharacterCustomizationPanelBase* CustPanel, struct FVAL_CharacterCustomizationLoadout& NewLoadout, struct FVALUI_CharCustomization_UpdateLoadoutContextPayload& ContextPayload);

	void OnUpdateLoadoutFailed__DelegateSignature(struct FVALUI_CharCustomization_UpdateLoadoutContextPayload& ContextPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_AsyncUpdateLoadout">();
	}
	static class UVALUI_AsyncUpdateLoadout* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_AsyncUpdateLoadout>();
	}
};
static_assert(alignof(UVALUI_AsyncUpdateLoadout) == 0x000008, "Wrong alignment on UVALUI_AsyncUpdateLoadout");
static_assert(sizeof(UVALUI_AsyncUpdateLoadout) == 0x0009C0, "Wrong size on UVALUI_AsyncUpdateLoadout");
static_assert(offsetof(UVALUI_AsyncUpdateLoadout, Completed) == 0x000030, "Member 'UVALUI_AsyncUpdateLoadout::Completed' has a wrong offset!");
static_assert(offsetof(UVALUI_AsyncUpdateLoadout, Failed) == 0x000040, "Member 'UVALUI_AsyncUpdateLoadout::Failed' has a wrong offset!");

// Class ValeriaUI.VALUI_WidgetStyleBase
// 0x0000 (0x0030 - 0x0030)
class UVALUI_WidgetStyleBase : public UDataAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_WidgetStyleBase">();
	}
	static class UVALUI_WidgetStyleBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_WidgetStyleBase>();
	}
};
static_assert(alignof(UVALUI_WidgetStyleBase) == 0x000008, "Wrong alignment on UVALUI_WidgetStyleBase");
static_assert(sizeof(UVALUI_WidgetStyleBase) == 0x000030, "Wrong size on UVALUI_WidgetStyleBase");

// Class ValeriaUI.VALUI_BorderStyle
// 0x02C0 (0x02F0 - 0x0030)
class UVALUI_BorderStyle final : public UVALUI_WidgetStyleBase
{
public:
	bool                                          bShowEffectWhenDisabled;                           // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CF5[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Padding;                                           // 0x0034(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           ContentColorAndOpacity;                            // 0x0044(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CF6[0xC];                                     // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Background;                                        // 0x0060(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Background_Light;                                  // 0x0130(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Background_Dark;                                   // 0x0200(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FLinearColor                           BrushColor;                                        // 0x02D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlipForRightToLeftFlowDirection;                  // 0x02E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CF7[0xF];                                     // 0x02E1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Apply(class UBorder* Border) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_BorderStyle">();
	}
	static class UVALUI_BorderStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_BorderStyle>();
	}
};
static_assert(alignof(UVALUI_BorderStyle) == 0x000010, "Wrong alignment on UVALUI_BorderStyle");
static_assert(sizeof(UVALUI_BorderStyle) == 0x0002F0, "Wrong size on UVALUI_BorderStyle");
static_assert(offsetof(UVALUI_BorderStyle, bShowEffectWhenDisabled) == 0x000030, "Member 'UVALUI_BorderStyle::bShowEffectWhenDisabled' has a wrong offset!");
static_assert(offsetof(UVALUI_BorderStyle, Padding) == 0x000034, "Member 'UVALUI_BorderStyle::Padding' has a wrong offset!");
static_assert(offsetof(UVALUI_BorderStyle, ContentColorAndOpacity) == 0x000044, "Member 'UVALUI_BorderStyle::ContentColorAndOpacity' has a wrong offset!");
static_assert(offsetof(UVALUI_BorderStyle, Background) == 0x000060, "Member 'UVALUI_BorderStyle::Background' has a wrong offset!");
static_assert(offsetof(UVALUI_BorderStyle, Background_Light) == 0x000130, "Member 'UVALUI_BorderStyle::Background_Light' has a wrong offset!");
static_assert(offsetof(UVALUI_BorderStyle, Background_Dark) == 0x000200, "Member 'UVALUI_BorderStyle::Background_Dark' has a wrong offset!");
static_assert(offsetof(UVALUI_BorderStyle, BrushColor) == 0x0002D0, "Member 'UVALUI_BorderStyle::BrushColor' has a wrong offset!");
static_assert(offsetof(UVALUI_BorderStyle, bFlipForRightToLeftFlowDirection) == 0x0002E0, "Member 'UVALUI_BorderStyle::bFlipForRightToLeftFlowDirection' has a wrong offset!");

// Class ValeriaUI.VALUI_Border_Styled
// 0x0070 (0x03B0 - 0x0340)
class UVALUI_Border_Styled final : public UBorder
{
public:
	bool                                          bSupportCrossPlatform;                             // 0x0338(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowHUDOpacitySettings;                          // 0x0339(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CF8[0x6];                                     // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_BorderStyle*                     Style;                                             // 0x0340(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<ERedirectsPlatform, TSoftObjectPtr<class UVALUI_BorderStyle>> CrossPlatformStyles;                               // 0x0348(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CF9[0x18];                                    // 0x0398(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAccessbilitySettingsChanged(struct FValeriaAccessibilitySettings& AccessbilitySettings);
	void SetBorderStyle(class UVALUI_BorderStyle* NewStyle);
	void StyleLoadComplete();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_Border_Styled">();
	}
	static class UVALUI_Border_Styled* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_Border_Styled>();
	}
};
static_assert(alignof(UVALUI_Border_Styled) == 0x000010, "Wrong alignment on UVALUI_Border_Styled");
static_assert(sizeof(UVALUI_Border_Styled) == 0x0003B0, "Wrong size on UVALUI_Border_Styled");
static_assert(offsetof(UVALUI_Border_Styled, bSupportCrossPlatform) == 0x000338, "Member 'UVALUI_Border_Styled::bSupportCrossPlatform' has a wrong offset!");
static_assert(offsetof(UVALUI_Border_Styled, bAllowHUDOpacitySettings) == 0x000339, "Member 'UVALUI_Border_Styled::bAllowHUDOpacitySettings' has a wrong offset!");
static_assert(offsetof(UVALUI_Border_Styled, Style) == 0x000340, "Member 'UVALUI_Border_Styled::Style' has a wrong offset!");
static_assert(offsetof(UVALUI_Border_Styled, CrossPlatformStyles) == 0x000348, "Member 'UVALUI_Border_Styled::CrossPlatformStyles' has a wrong offset!");

// Class ValeriaUI.VALUI_BoundInputActionStateWidget
// 0x0058 (0x0318 - 0x02C0)
class UVALUI_BoundInputActionStateWidget : public UUserWidget
{
public:
	class UInputAction*                           InputAction;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CFA[0x50];                                    // 0x02C8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetInputAction(class UInputAction* InInputAction);
	void UpdateInputActionState_Implementation(struct FKey& Key, ETriggerEvent LatestTriggerEvent, float OngoingDuration, float HoldTimeThreshold);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_BoundInputActionStateWidget">();
	}
	static class UVALUI_BoundInputActionStateWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_BoundInputActionStateWidget>();
	}
};
static_assert(alignof(UVALUI_BoundInputActionStateWidget) == 0x000008, "Wrong alignment on UVALUI_BoundInputActionStateWidget");
static_assert(sizeof(UVALUI_BoundInputActionStateWidget) == 0x000318, "Wrong size on UVALUI_BoundInputActionStateWidget");
static_assert(offsetof(UVALUI_BoundInputActionStateWidget, InputAction) == 0x0002C0, "Member 'UVALUI_BoundInputActionStateWidget::InputAction' has a wrong offset!");

// Class ValeriaUI.VALUI_BoxDropShadow
// 0x0038 (0x01D0 - 0x0198)
class UVALUI_BoxDropShadow final : public UContentWidget
{
public:
	struct FVector2D                              ShadowOffset;                                      // 0x0198(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowHardness;                                    // 0x01A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CornerRadius;                                      // 0x01AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColor;                                       // 0x01B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CFD[0x10];                                    // 0x01C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_BoxDropShadow">();
	}
	static class UVALUI_BoxDropShadow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_BoxDropShadow>();
	}
};
static_assert(alignof(UVALUI_BoxDropShadow) == 0x000008, "Wrong alignment on UVALUI_BoxDropShadow");
static_assert(sizeof(UVALUI_BoxDropShadow) == 0x0001D0, "Wrong size on UVALUI_BoxDropShadow");
static_assert(offsetof(UVALUI_BoxDropShadow, ShadowOffset) == 0x000198, "Member 'UVALUI_BoxDropShadow::ShadowOffset' has a wrong offset!");
static_assert(offsetof(UVALUI_BoxDropShadow, ShadowHardness) == 0x0001A8, "Member 'UVALUI_BoxDropShadow::ShadowHardness' has a wrong offset!");
static_assert(offsetof(UVALUI_BoxDropShadow, CornerRadius) == 0x0001AC, "Member 'UVALUI_BoxDropShadow::CornerRadius' has a wrong offset!");
static_assert(offsetof(UVALUI_BoxDropShadow, ShadowColor) == 0x0001B0, "Member 'UVALUI_BoxDropShadow::ShadowColor' has a wrong offset!");

// Class ValeriaUI.VALUI_ButtonStyle
// 0x0460 (0x0490 - 0x0030)
class UVALUI_ButtonStyle : public UVALUI_WidgetStyleBase
{
public:
	struct FButtonStyle                           WidgetStyle;                                       // 0x0030(0x03F0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorAndOpacity;                                   // 0x0420(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BackgroundColor;                                   // 0x0430(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DropShadowCornerRadius;                            // 0x0440(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CFE[0x4];                                     // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ShadowOffset_Normal;                               // 0x0448(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ShadowOffset_Pressed;                              // 0x0458(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowHardness_Normal;                             // 0x0468(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowHardness_Pressed;                            // 0x046C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColor_Normal;                                // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColor_Pressed;                               // 0x0480(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Apply(class UVALUI_Button_Styled* Button) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_ButtonStyle">();
	}
	static class UVALUI_ButtonStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_ButtonStyle>();
	}
};
static_assert(alignof(UVALUI_ButtonStyle) == 0x000010, "Wrong alignment on UVALUI_ButtonStyle");
static_assert(sizeof(UVALUI_ButtonStyle) == 0x000490, "Wrong size on UVALUI_ButtonStyle");
static_assert(offsetof(UVALUI_ButtonStyle, WidgetStyle) == 0x000030, "Member 'UVALUI_ButtonStyle::WidgetStyle' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle, ColorAndOpacity) == 0x000420, "Member 'UVALUI_ButtonStyle::ColorAndOpacity' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle, BackgroundColor) == 0x000430, "Member 'UVALUI_ButtonStyle::BackgroundColor' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle, DropShadowCornerRadius) == 0x000440, "Member 'UVALUI_ButtonStyle::DropShadowCornerRadius' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle, ShadowOffset_Normal) == 0x000448, "Member 'UVALUI_ButtonStyle::ShadowOffset_Normal' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle, ShadowOffset_Pressed) == 0x000458, "Member 'UVALUI_ButtonStyle::ShadowOffset_Pressed' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle, ShadowHardness_Normal) == 0x000468, "Member 'UVALUI_ButtonStyle::ShadowHardness_Normal' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle, ShadowHardness_Pressed) == 0x00046C, "Member 'UVALUI_ButtonStyle::ShadowHardness_Pressed' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle, ShadowColor_Normal) == 0x000470, "Member 'UVALUI_ButtonStyle::ShadowColor_Normal' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle, ShadowColor_Pressed) == 0x000480, "Member 'UVALUI_ButtonStyle::ShadowColor_Pressed' has a wrong offset!");

// Class ValeriaUI.VALUI_ButtonStyle_WithBG
// 0x04E0 (0x0970 - 0x0490)
class UVALUI_ButtonStyle_WithBG final : public UVALUI_ButtonStyle
{
public:
	bool                                          bUseBackgroundImage;                               // 0x0490(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CFF[0xF];                                     // 0x0491(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BackgroundImage;                                   // 0x04A0(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bUseBackgroundStyle;                               // 0x0570(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D00[0xF];                                     // 0x0571(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           BackgroundStyle;                                   // 0x0580(0x03F0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_ButtonStyle_WithBG">();
	}
	static class UVALUI_ButtonStyle_WithBG* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_ButtonStyle_WithBG>();
	}
};
static_assert(alignof(UVALUI_ButtonStyle_WithBG) == 0x000010, "Wrong alignment on UVALUI_ButtonStyle_WithBG");
static_assert(sizeof(UVALUI_ButtonStyle_WithBG) == 0x000970, "Wrong size on UVALUI_ButtonStyle_WithBG");
static_assert(offsetof(UVALUI_ButtonStyle_WithBG, bUseBackgroundImage) == 0x000490, "Member 'UVALUI_ButtonStyle_WithBG::bUseBackgroundImage' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle_WithBG, BackgroundImage) == 0x0004A0, "Member 'UVALUI_ButtonStyle_WithBG::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle_WithBG, bUseBackgroundStyle) == 0x000570, "Member 'UVALUI_ButtonStyle_WithBG::bUseBackgroundStyle' has a wrong offset!");
static_assert(offsetof(UVALUI_ButtonStyle_WithBG, BackgroundStyle) == 0x000580, "Member 'UVALUI_ButtonStyle_WithBG::BackgroundStyle' has a wrong offset!");

// Class ValeriaUI.VALUI_Button_Styled
// 0x0060 (0x0680 - 0x0620)
class UVALUI_Button_Styled : public UButton
{
public:
	class UVALUI_ButtonStyle*                     Style;                                             // 0x0618(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEffectWhenReleased;                               // 0x0620(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D01[0x3];                                     // 0x0621(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FEffectTime;                                       // 0x0624(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D02[0x38];                                    // 0x0628(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	ECursorState                                  CursorState;                                       // 0x0660(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFocusDirection                               DirectionOfCursorOnButton;                         // 0x0661(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D03[0x1E];                                    // 0x0662(0x001E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Construct();
	void Destruct();
	void HandlePressed();
	void HandleReleased();
	bool HasFocus();
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void RemoveCursor(class UWidget* InCursor);
	void SetButtonFocus();
	void SetButtonStyle(class UVALUI_ButtonStyle* NewStyle);
	bool ShowCursor(class UWidget* InCursor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_Button_Styled">();
	}
	static class UVALUI_Button_Styled* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_Button_Styled>();
	}
};
static_assert(alignof(UVALUI_Button_Styled) == 0x000010, "Wrong alignment on UVALUI_Button_Styled");
static_assert(sizeof(UVALUI_Button_Styled) == 0x000680, "Wrong size on UVALUI_Button_Styled");
static_assert(offsetof(UVALUI_Button_Styled, Style) == 0x000618, "Member 'UVALUI_Button_Styled::Style' has a wrong offset!");
static_assert(offsetof(UVALUI_Button_Styled, bEffectWhenReleased) == 0x000620, "Member 'UVALUI_Button_Styled::bEffectWhenReleased' has a wrong offset!");
static_assert(offsetof(UVALUI_Button_Styled, FEffectTime) == 0x000624, "Member 'UVALUI_Button_Styled::FEffectTime' has a wrong offset!");
static_assert(offsetof(UVALUI_Button_Styled, CursorState) == 0x000660, "Member 'UVALUI_Button_Styled::CursorState' has a wrong offset!");
static_assert(offsetof(UVALUI_Button_Styled, DirectionOfCursorOnButton) == 0x000661, "Member 'UVALUI_Button_Styled::DirectionOfCursorOnButton' has a wrong offset!");

// Class ValeriaUI.VALUI_Button_Styled_WithBG
// 0x0220 (0x08A0 - 0x0680)
class UVALUI_Button_Styled_WithBG final : public UVALUI_Button_Styled
{
public:
	uint8                                         Pad_2D05[0x10];                                    // 0x0680(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            GamepadKeyHint;                                    // 0x0690(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EGamepadKeyHintLocation                       HintShowLocation;                                  // 0x0760(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D06[0x7];                                     // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              HintMargin;                                        // 0x0768(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D07[0xD8];                                    // 0x0778(0x00D8)(Fixing Size After Last Property [ Dumper-7 ])
	EFocusDirection                               DirectionOfCursorOnBG;                             // 0x0850(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D08[0x4F];                                    // 0x0851(0x004F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleHovered();
	void HandleUnhovered();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_Button_Styled_WithBG">();
	}
	static class UVALUI_Button_Styled_WithBG* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_Button_Styled_WithBG>();
	}
};
static_assert(alignof(UVALUI_Button_Styled_WithBG) == 0x000010, "Wrong alignment on UVALUI_Button_Styled_WithBG");
static_assert(sizeof(UVALUI_Button_Styled_WithBG) == 0x0008A0, "Wrong size on UVALUI_Button_Styled_WithBG");
static_assert(offsetof(UVALUI_Button_Styled_WithBG, GamepadKeyHint) == 0x000690, "Member 'UVALUI_Button_Styled_WithBG::GamepadKeyHint' has a wrong offset!");
static_assert(offsetof(UVALUI_Button_Styled_WithBG, HintShowLocation) == 0x000760, "Member 'UVALUI_Button_Styled_WithBG::HintShowLocation' has a wrong offset!");
static_assert(offsetof(UVALUI_Button_Styled_WithBG, HintMargin) == 0x000768, "Member 'UVALUI_Button_Styled_WithBG::HintMargin' has a wrong offset!");
static_assert(offsetof(UVALUI_Button_Styled_WithBG, DirectionOfCursorOnBG) == 0x000850, "Member 'UVALUI_Button_Styled_WithBG::DirectionOfCursorOnBG' has a wrong offset!");

// Class ValeriaUI.VALUI_CameraVirtualMoveHooker_Mobile
// 0x0000 (0x0028 - 0x0028)
class UVALUI_CameraVirtualMoveHooker_Mobile final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_CameraVirtualMoveHooker_Mobile">();
	}
	static class UVALUI_CameraVirtualMoveHooker_Mobile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_CameraVirtualMoveHooker_Mobile>();
	}
};
static_assert(alignof(UVALUI_CameraVirtualMoveHooker_Mobile) == 0x000008, "Wrong alignment on UVALUI_CameraVirtualMoveHooker_Mobile");
static_assert(sizeof(UVALUI_CameraVirtualMoveHooker_Mobile) == 0x000028, "Wrong size on UVALUI_CameraVirtualMoveHooker_Mobile");

// Class ValeriaUI.VALUI_NameValidator
// 0x0068 (0x0090 - 0x0028)
class UVALUI_NameValidator : public UObject
{
public:
	TSet<EVAL_CharacterNameType>                  NameTypesToValidate;                               // 0x0028(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   ErrorMessage;                                      // 0x0078(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	bool IsNameValid(const class FString& InCharacterName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_NameValidator">();
	}
	static class UVALUI_NameValidator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_NameValidator>();
	}
};
static_assert(alignof(UVALUI_NameValidator) == 0x000008, "Wrong alignment on UVALUI_NameValidator");
static_assert(sizeof(UVALUI_NameValidator) == 0x000090, "Wrong size on UVALUI_NameValidator");
static_assert(offsetof(UVALUI_NameValidator, NameTypesToValidate) == 0x000028, "Member 'UVALUI_NameValidator::NameTypesToValidate' has a wrong offset!");
static_assert(offsetof(UVALUI_NameValidator, ErrorMessage) == 0x000078, "Member 'UVALUI_NameValidator::ErrorMessage' has a wrong offset!");

// Class ValeriaUI.VALUI_NameValidator_Regex
// 0x0010 (0x00A0 - 0x0090)
class UVALUI_NameValidator_Regex : public UVALUI_NameValidator
{
public:
	class FString                                 RegexPattern;                                      // 0x0090(0x0010)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_NameValidator_Regex">();
	}
	static class UVALUI_NameValidator_Regex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_NameValidator_Regex>();
	}
};
static_assert(alignof(UVALUI_NameValidator_Regex) == 0x000008, "Wrong alignment on UVALUI_NameValidator_Regex");
static_assert(sizeof(UVALUI_NameValidator_Regex) == 0x0000A0, "Wrong size on UVALUI_NameValidator_Regex");
static_assert(offsetof(UVALUI_NameValidator_Regex, RegexPattern) == 0x000090, "Member 'UVALUI_NameValidator_Regex::RegexPattern' has a wrong offset!");

// Class ValeriaUI.VALUI_NameValidator_Regex_PerWord
// 0x0000 (0x00A0 - 0x00A0)
class UVALUI_NameValidator_Regex_PerWord : public UVALUI_NameValidator_Regex
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_NameValidator_Regex_PerWord">();
	}
	static class UVALUI_NameValidator_Regex_PerWord* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_NameValidator_Regex_PerWord>();
	}
};
static_assert(alignof(UVALUI_NameValidator_Regex_PerWord) == 0x000008, "Wrong alignment on UVALUI_NameValidator_Regex_PerWord");
static_assert(sizeof(UVALUI_NameValidator_Regex_PerWord) == 0x0000A0, "Wrong size on UVALUI_NameValidator_Regex_PerWord");

// Class ValeriaUI.VALUI_NameValidatorDataAsset
// 0x0050 (0x0080 - 0x0030)
class UVALUI_NameValidatorDataAsset final : public UPrimaryDataAsset
{
public:
	TSet<TSubclassOf<class UObject>>              ValidatorClasses;                                  // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VALUI_NameValidatorDataAsset">();
	}
	static class UVALUI_NameValidatorDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVALUI_NameValidatorDataAsset>();
	}
};
static_assert(alignof(UVALUI_NameValidatorDataAsset) == 0x000008, "Wrong alignment on UVALUI_NameValidatorDataAsset");
static_assert(sizeof(UVALUI_NameValidatorDataAsset) == 0x000080, "Wrong size on UVALUI_NameValidatorDataAsset");
