#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValeriaDTOs

#include "Basic.hpp"

#include "ValeriaDTOs_structs.hpp"


namespace SDK::Params
{

// Function ValeriaDTOs.VALDTOS_MetaCharacterCustomizationFuncLib.CharacterCreationOptions_EqualEqual
// 0x0578 (0x0578 - 0x0000)
struct VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual final
{
public:
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Stable A;                                                 // 0x0000(0x02B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Stable B;                                                 // 0x02B8(0x02B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0570(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CF7[0x7];                                     // 0x0571(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual) == 0x000008, "Wrong alignment on VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual");
static_assert(sizeof(VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual) == 0x000578, "Wrong size on VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual");
static_assert(offsetof(VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual, A) == 0x000000, "Member 'VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual::A' has a wrong offset!");
static_assert(offsetof(VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual, B) == 0x0002B8, "Member 'VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual::B' has a wrong offset!");
static_assert(offsetof(VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual, ReturnValue) == 0x000570, "Member 'VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual::ReturnValue' has a wrong offset!");

// Function ValeriaDTOs.VALDTOS_MetaCharacterCustomizationFuncLib.CharacterCustomizationOptions_EqualEqual
// 0x0908 (0x0908 - 0x0000)
struct VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual final
{
public:
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Volatile A;                                                 // 0x0000(0x0480)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Volatile B;                                                 // 0x0480(0x0480)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0900(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CF8[0x7];                                     // 0x0901(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual) == 0x000008, "Wrong alignment on VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual");
static_assert(sizeof(VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual) == 0x000908, "Wrong size on VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual");
static_assert(offsetof(VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual, A) == 0x000000, "Member 'VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual::A' has a wrong offset!");
static_assert(offsetof(VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual, B) == 0x000480, "Member 'VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual::B' has a wrong offset!");
static_assert(offsetof(VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual, ReturnValue) == 0x000900, "Member 'VALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual::ReturnValue' has a wrong offset!");

// Function ValeriaDTOs.VALDTOS_MetaCharacterCustomizationFuncLib.MetaCharacterFormat_EqualEqual
// 0x0EF8 (0x0EF8 - 0x0000)
struct VALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual final
{
public:
	struct FVALDTOS_MetaCharacterFormat           A;                                                 // 0x0000(0x0778)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVALDTOS_MetaCharacterFormat           B;                                                 // 0x0778(0x0778)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0EF0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CF9[0x7];                                     // 0x0EF1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual) == 0x000008, "Wrong alignment on VALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual");
static_assert(sizeof(VALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual) == 0x000EF8, "Wrong size on VALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual");
static_assert(offsetof(VALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual, A) == 0x000000, "Member 'VALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual::A' has a wrong offset!");
static_assert(offsetof(VALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual, B) == 0x000778, "Member 'VALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual::B' has a wrong offset!");
static_assert(offsetof(VALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual, ReturnValue) == 0x000EF0, "Member 'VALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual::ReturnValue' has a wrong offset!");

}

