#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrafterRecipe_RadialCountdown_Staged

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CrafterRecipe_RadialCountdown_Staged.WBP_CrafterRecipe_RadialCountdown_Staged_C
// 0x00A0 (0x0360 - 0x02C0)
class UWBP_CrafterRecipe_RadialCountdown_Staged_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             NamedSlot_Icon_Done;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Icon_RedZone;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Icon_Start;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CrafterRecipe_RadialCountdownTimer_C* RadialCountdownTimer;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Icon;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            IconBaseStartColor;                                // 0x02F0(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            IconBaseRedZoneColor;                              // 0x0304(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            IconBaseDoneColor;                                 // 0x0318(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            ProgressStartColor;                                // 0x032C(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            ProgressRedZoneColor;                              // 0x0340(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_618F[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RedZoneThresholdPercent;                           // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, bool K2Node_Event_IsDesignTime, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TimerDone();
	void TimerStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CrafterRecipe_RadialCountdown_Staged_C">();
	}
	static class UWBP_CrafterRecipe_RadialCountdown_Staged_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CrafterRecipe_RadialCountdown_Staged_C>();
	}
};
static_assert(alignof(UWBP_CrafterRecipe_RadialCountdown_Staged_C) == 0x000008, "Wrong alignment on UWBP_CrafterRecipe_RadialCountdown_Staged_C");
static_assert(sizeof(UWBP_CrafterRecipe_RadialCountdown_Staged_C) == 0x000360, "Wrong size on UWBP_CrafterRecipe_RadialCountdown_Staged_C");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, NamedSlot_Icon_Done) == 0x0002C8, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::NamedSlot_Icon_Done' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, NamedSlot_Icon_RedZone) == 0x0002D0, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::NamedSlot_Icon_RedZone' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, NamedSlot_Icon_Start) == 0x0002D8, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::NamedSlot_Icon_Start' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, RadialCountdownTimer) == 0x0002E0, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::RadialCountdownTimer' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, WidgetSwitcher_Icon) == 0x0002E8, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::WidgetSwitcher_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, IconBaseStartColor) == 0x0002F0, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::IconBaseStartColor' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, IconBaseRedZoneColor) == 0x000304, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::IconBaseRedZoneColor' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, IconBaseDoneColor) == 0x000318, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::IconBaseDoneColor' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, ProgressStartColor) == 0x00032C, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::ProgressStartColor' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, ProgressRedZoneColor) == 0x000340, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::ProgressRedZoneColor' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdown_Staged_C, RedZoneThresholdPercent) == 0x000358, "Member 'UWBP_CrafterRecipe_RadialCountdown_Staged_C::RedZoneThresholdPercent' has a wrong offset!");

}

