#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FocusTip_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FocusTip_CM.WBP_FocusTip_CM_C
// 0x0020 (0x0308 - 0x02E8)
class UWBP_FocusTip_CM_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 FocusTipImage;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                FocusTipImagePadding;                              // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void Construct();
	void ExecuteUbergraph_WBP_FocusTip_CM(int32 EntryPoint, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, bool K2Node_Event_IsDesignTime, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue, ECommonInputType K2Node_CustomEvent_bNewInputType, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void HandledOnInputMethodChanged(ECommonInputType bNewInputType);
	void PreConstruct(bool IsDesignTime);
	void SetFocusTip(class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FocusTip_CM_C">();
	}
	static class UWBP_FocusTip_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FocusTip_CM_C>();
	}
};
static_assert(alignof(UWBP_FocusTip_CM_C) == 0x000008, "Wrong alignment on UWBP_FocusTip_CM_C");
static_assert(sizeof(UWBP_FocusTip_CM_C) == 0x000308, "Wrong size on UWBP_FocusTip_CM_C");
static_assert(offsetof(UWBP_FocusTip_CM_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_FocusTip_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FocusTip_CM_C, FocusTipImage) == 0x0002F0, "Member 'UWBP_FocusTip_CM_C::FocusTipImage' has a wrong offset!");
static_assert(offsetof(UWBP_FocusTip_CM_C, FocusTipImagePadding) == 0x0002F8, "Member 'UWBP_FocusTip_CM_C::FocusTipImagePadding' has a wrong offset!");

}

