#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_Notification_Minor

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Template_Notification_Minor.WBP_Template_Notification_Minor_C.ExecuteUbergraph_WBP_Template_Notification_Minor
// 0x0018 (0x0018 - 0x0000)
struct WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CA8[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor) == 0x000008, "Wrong alignment on WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor");
static_assert(sizeof(WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor) == 0x000018, "Wrong size on WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor");
static_assert(offsetof(WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor, EntryPoint) == 0x000000, "Member 'WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor, Temp_bool_Variable) == 0x000004, "Member 'WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor, Temp_byte_Variable) == 0x000010, "Member 'WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor, CallFunc_HasAnyChildren_ReturnValue) == 0x000012, "Member 'WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor, K2Node_Select_Default) == 0x000013, "Member 'WBP_Template_Notification_Minor_C_ExecuteUbergraph_WBP_Template_Notification_Minor::K2Node_Select_Default' has a wrong offset!");

}

