#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCustomization_BodyPanel_CM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_RadioSliderPregisteredElement_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Checkmark_SnapToBinary_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Checkmark_SnapToBinary_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Checkmark_SnapToBinary_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Checkmark_SnapToBinary_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Checkmark_SnapToBinary_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Checkmark_SnapToBinary_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Checkmark_SnapToBinary_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Checkmark_SnapToBinary_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.BndEvt__WBP_CharacterCustomization_BodyPanel_CM_RadioSlider_Gender_CM_K2Node_ComponentBoundEvent_7_OnSliderMoved__DelegateSignature
// 0x0060 (0x0060 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_RadioSlider_Gender_CM_K2Node_ComponentBoundEvent_7_OnSliderMoved__DelegateSignature final
{
public:
	class UUserWidget*                            ElementWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBP_RadioSliderPregisteredElement      ElementData;                                       // 0x0008(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_RadioSlider_Gender_CM_K2Node_ComponentBoundEvent_7_OnSliderMoved__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_RadioSlider_Gender_CM_K2Node_ComponentBoundEvent_7_OnSliderMoved__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_RadioSlider_Gender_CM_K2Node_ComponentBoundEvent_7_OnSliderMoved__DelegateSignature) == 0x000060, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_RadioSlider_Gender_CM_K2Node_ComponentBoundEvent_7_OnSliderMoved__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_RadioSlider_Gender_CM_K2Node_ComponentBoundEvent_7_OnSliderMoved__DelegateSignature, ElementWidget) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_RadioSlider_Gender_CM_K2Node_ComponentBoundEvent_7_OnSliderMoved__DelegateSignature::ElementWidget' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_RadioSlider_Gender_CM_K2Node_ComponentBoundEvent_7_OnSliderMoved__DelegateSignature, ElementData) == 0x000008, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_RadioSlider_Gender_CM_K2Node_ComponentBoundEvent_7_OnSliderMoved__DelegateSignature::ElementData' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Slider_Gender_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Slider_Gender_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Slider_Gender_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Slider_Gender_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Slider_Gender_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Slider_Gender_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Slider_Gender_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_CM_Slider_Gender_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEventSynth2D__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEventSynth2D__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEventSynth2D__DelegateSignature) == 0x000004, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEventSynth2D__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEventSynth2D__DelegateSignature) == 0x000004, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEventSynth2D__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEventSynth2D__DelegateSignature, Value) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEventSynth2D__DelegateSignature::Value' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEventSynth2D__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEventSynth2D__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEventSynth2D__DelegateSignature) == 0x000004, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEventSynth2D__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEventSynth2D__DelegateSignature) == 0x000004, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEventSynth2D__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEventSynth2D__DelegateSignature, Value) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_BndEvt__WBP_CharacterCustomization_BodyPanel_Slider_ThicknessGenderExpression_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEventSynth2D__DelegateSignature::Value' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F02[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_ElementWidget;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBP_RadioSliderPregisteredElement      K2Node_ComponentBoundEvent_ElementData;            // 0x0010(0x0058)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F03[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F04[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetValue_ReturnValue;                     // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetValue_ReturnValue_1;                   // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F05[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM) == 0x0000D0, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, EntryPoint) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, K2Node_ComponentBoundEvent_ElementWidget) == 0x000008, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::K2Node_ComponentBoundEvent_ElementWidget' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, K2Node_ComponentBoundEvent_ElementData) == 0x000010, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::K2Node_ComponentBoundEvent_ElementData' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, CallFunc_MakeVector2D_ReturnValue) == 0x000068, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, Temp_bool_Variable) == 0x000078, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000079, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, CallFunc_SelectFloat_ReturnValue) == 0x000080, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, K2Node_ComponentBoundEvent_Value_2) == 0x000088, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, K2Node_ComponentBoundEvent_Value_1) == 0x00008C, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, K2Node_Event_IsDesignTime) == 0x000090, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, CallFunc_GetValue_ReturnValue) == 0x000098, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, CallFunc_GetValue_ReturnValue_1) == 0x0000A8, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, K2Node_ComponentBoundEvent_Checked) == 0x0000B8, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::K2Node_ComponentBoundEvent_Checked' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, K2Node_ComponentBoundEvent_Value) == 0x0000C0, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_BodyPanel_CM::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.OnBodyExpressionChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_OnBodyExpressionChanged__DelegateSignature final
{
public:
	struct FVector2D                              BodyExpression;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_OnBodyExpressionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_OnBodyExpressionChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_OnBodyExpressionChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_OnBodyExpressionChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_OnBodyExpressionChanged__DelegateSignature, BodyExpression) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_OnBodyExpressionChanged__DelegateSignature::BodyExpression' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.OnGenderExpressionChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_OnGenderExpressionChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_OnGenderExpressionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_OnGenderExpressionChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_OnGenderExpressionChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_OnGenderExpressionChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_OnGenderExpressionChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_OnGenderExpressionChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.OnMuscularExpressionChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_OnMuscularExpressionChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_OnMuscularExpressionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_OnMuscularExpressionChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_OnMuscularExpressionChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_OnMuscularExpressionChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_OnMuscularExpressionChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_OnMuscularExpressionChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.OnThicknessChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_OnThicknessChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_OnThicknessChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_OnThicknessChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_OnThicknessChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_OnThicknessChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_OnThicknessChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_OnThicknessChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_PreConstruct");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_PreConstruct");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.SetBodyExpression
// 0x0010 (0x0010 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_SetBodyExpression final
{
public:
	struct FVector2D                              BodyExpression;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_SetBodyExpression) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_SetBodyExpression");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_SetBodyExpression) == 0x000010, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_SetBodyExpression");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_SetBodyExpression, BodyExpression) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_SetBodyExpression::BodyExpression' has a wrong offset!");

// Function WBP_CharacterCustomization_BodyPanel_CM.WBP_CharacterCustomization_BodyPanel_CM_C.SetGenderExpression
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_BodyPanel_CM_C_SetGenderExpression final
{
public:
	double                                        Scalar;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_BodyPanel_CM_C_SetGenderExpression) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_BodyPanel_CM_C_SetGenderExpression");
static_assert(sizeof(WBP_CharacterCustomization_BodyPanel_CM_C_SetGenderExpression) == 0x000008, "Wrong size on WBP_CharacterCustomization_BodyPanel_CM_C_SetGenderExpression");
static_assert(offsetof(WBP_CharacterCustomization_BodyPanel_CM_C_SetGenderExpression, Scalar) == 0x000000, "Member 'WBP_CharacterCustomization_BodyPanel_CM_C_SetGenderExpression::Scalar' has a wrong offset!");

}

