#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SimpleModalDialog_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SimpleModalDialog_CM.WBP_SimpleModalDialog_CM_C
// 0x0038 (0x0590 - 0x0558)
class UWBP_SimpleModalDialog_CM_C final : public UVALUI_ModalWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Primary_Dismiss;                            // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Message;                                 // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MessageText;                                       // 0x0570(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UWidget*                                FocusWidget;                                       // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_SimpleModalDialog_CM_Button_Primary_Dismiss_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature();
	void ExecuteUbergraph_WBP_SimpleModalDialog_CM(int32 EntryPoint, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, class UInputAction* Temp_object_Variable, double Temp_real_Variable, double Temp_real_Variable_0, double Temp_real_Variable_1, bool Temp_bool_Variable, double Temp_real_Variable_1_0, bool K2Node_Event_IsDesignTime, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, bool CallFunc_TextIsEmpty_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SimpleModalDialog_CM_C">();
	}
	static class UWBP_SimpleModalDialog_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SimpleModalDialog_CM_C>();
	}
};
static_assert(alignof(UWBP_SimpleModalDialog_CM_C) == 0x000008, "Wrong alignment on UWBP_SimpleModalDialog_CM_C");
static_assert(sizeof(UWBP_SimpleModalDialog_CM_C) == 0x000590, "Wrong size on UWBP_SimpleModalDialog_CM_C");
static_assert(offsetof(UWBP_SimpleModalDialog_CM_C, UberGraphFrame) == 0x000558, "Member 'UWBP_SimpleModalDialog_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleModalDialog_CM_C, Button_Primary_Dismiss) == 0x000560, "Member 'UWBP_SimpleModalDialog_CM_C::Button_Primary_Dismiss' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleModalDialog_CM_C, TextBlock_Message) == 0x000568, "Member 'UWBP_SimpleModalDialog_CM_C::TextBlock_Message' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleModalDialog_CM_C, MessageText) == 0x000570, "Member 'UWBP_SimpleModalDialog_CM_C::MessageText' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleModalDialog_CM_C, FocusWidget) == 0x000588, "Member 'UWBP_SimpleModalDialog_CM_C::FocusWidget' has a wrong offset!");

}

