#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListEntry_SocialConnection_CM

#include "Basic.hpp"

#include "F_CommonUIButtonPrompt_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ListEntry_SocialConnection_CM.WBP_ListEntry_SocialConnection_CM_C.BndEvt__WBP_ListEntry_SocialConnection_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_ListEntry_SocialConnection_CM.WBP_ListEntry_SocialConnection_CM_C.BndEvt__WBP_ListEntry_SocialConnection_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_0_OnCharacterProfileImageClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_0_OnCharacterProfileImageClicked__DelegateSignature final
{
public:
	class UWBP_PlayerCharacterProfileImage_CM_C*  CharacterProfileImageWidget;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_0_OnCharacterProfileImageClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_0_OnCharacterProfileImageClicked__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_0_OnCharacterProfileImageClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_0_OnCharacterProfileImageClicked__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_0_OnCharacterProfileImageClicked__DelegateSignature, CharacterProfileImageWidget) == 0x000000, "Member 'WBP_ListEntry_SocialConnection_CM_C_BndEvt__WBP_ListEntry_SocialConnection_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_0_OnCharacterProfileImageClicked__DelegateSignature::CharacterProfileImageWidget' has a wrong offset!");

// Function WBP_ListEntry_SocialConnection_CM.WBP_ListEntry_SocialConnection_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_SocialConnection_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_SocialConnection_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_SocialConnection_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_ListEntry_SocialConnection_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_ListEntry_SocialConnection_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_ListEntry_SocialConnection_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_ListEntry_SocialConnection_CM.WBP_ListEntry_SocialConnection_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_SocialConnection_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_SocialConnection_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_SocialConnection_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_ListEntry_SocialConnection_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_ListEntry_SocialConnection_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ListEntry_SocialConnection_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ListEntry_SocialConnection_CM.WBP_ListEntry_SocialConnection_CM_C.ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM
// 0x0058 (0x0058 - 0x0000)
struct WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* Widget, TArray<struct FF_CommonUIButtonPrompt>& UIPrompt)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514D[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PlayerCharacterProfileImage_CM_C*  K2Node_ComponentBoundEvent_CharacterProfileImageWidget; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup;               // 0x0020(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514E[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListItem_SocialConnection_C*           K2Node_DynamicCast_AsList_Item_Social_Connection;  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM) == 0x000008, "Wrong alignment on WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM");
static_assert(sizeof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM) == 0x000058, "Wrong size on WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM, EntryPoint) == 0x000000, "Member 'WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM, K2Node_ComponentBoundEvent_CharacterProfileImageWidget) == 0x000018, "Member 'WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM::K2Node_ComponentBoundEvent_CharacterProfileImageWidget' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM, K2Node_ComponentBoundEvent_NavGroup) == 0x000020, "Member 'WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM::K2Node_ComponentBoundEvent_NavGroup' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM, K2Node_MakeArray_Array) == 0x000028, "Member 'WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM, K2Node_Event_ListItemObject) == 0x000038, "Member 'WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM, K2Node_Event_bIsSelected) == 0x000040, "Member 'WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM, K2Node_DynamicCast_AsList_Item_Social_Connection) == 0x000048, "Member 'WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM::K2Node_DynamicCast_AsList_Item_Social_Connection' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM, K2Node_Event_bIsExpanded) == 0x000051, "Member 'WBP_ListEntry_SocialConnection_CM_C_ExecuteUbergraph_WBP_ListEntry_SocialConnection_CM::K2Node_Event_bIsExpanded' has a wrong offset!");

// Function WBP_ListEntry_SocialConnection_CM.WBP_ListEntry_SocialConnection_CM_C.HandleOnMarkUIFocus
// 0x0018 (0x0018 - 0x0000)
struct WBP_ListEntry_SocialConnection_CM_C_HandleOnMarkUIFocus final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ListEntry_SocialConnection_CM_C_HandleOnMarkUIFocus) == 0x000008, "Wrong alignment on WBP_ListEntry_SocialConnection_CM_C_HandleOnMarkUIFocus");
static_assert(sizeof(WBP_ListEntry_SocialConnection_CM_C_HandleOnMarkUIFocus) == 0x000018, "Wrong size on WBP_ListEntry_SocialConnection_CM_C_HandleOnMarkUIFocus");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_HandleOnMarkUIFocus, Widget) == 0x000000, "Member 'WBP_ListEntry_SocialConnection_CM_C_HandleOnMarkUIFocus::Widget' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_HandleOnMarkUIFocus, UIPrompt) == 0x000008, "Member 'WBP_ListEntry_SocialConnection_CM_C_HandleOnMarkUIFocus::UIPrompt' has a wrong offset!");

// Function WBP_ListEntry_SocialConnection_CM.WBP_ListEntry_SocialConnection_CM_C.OnFocusReceived
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UWidget*                                WidgetToFocus;                                     // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514F[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5150[0x2];                                     // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5151[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5152[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5153[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0130(0x00B8)()
};
static_assert(alignof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived) == 0x0001E8, "Wrong size on WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, WidgetToFocus) == 0x0000F8, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::WidgetToFocus' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, Temp_bool_True_if_break_was_hit_Variable) == 0x000100, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, Temp_int_Array_Index_Variable) == 0x000104, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, CallFunc_Not_PreBool_ReturnValue) == 0x000108, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, CallFunc_IsValid_ReturnValue) == 0x000109, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, Temp_int_Loop_Counter_Variable) == 0x00010C, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, CallFunc_Add_IntInt_ReturnValue) == 0x000110, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, CallFunc_Array_Get_Item) == 0x000118, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, CallFunc_IsVisible_ReturnValue) == 0x000120, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, CallFunc_Array_Length_ReturnValue) == 0x000124, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, CallFunc_BooleanAND_ReturnValue) == 0x000129, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000130, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_SocialConnection_CM.WBP_ListEntry_SocialConnection_CM_C.OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_ListEntry_SocialConnection_CM_C_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_ListEntry_SocialConnection_CM_C*   Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_SocialConnection_CM_C_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_SocialConnection_CM_C_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_SocialConnection_CM_C_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_ListEntry_SocialConnection_CM_C_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnInspectPlayerCharacter__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnInspectPlayerCharacter__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_ListEntry_SocialConnection_CM.WBP_ListEntry_SocialConnection_CM_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_SocialConnection_CM_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_SocialConnection_CM_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ListEntry_SocialConnection_CM_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ListEntry_SocialConnection_CM_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ListEntry_SocialConnection_CM_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ListEntry_SocialConnection_CM.WBP_ListEntry_SocialConnection_CM_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ListEntry_SocialConnection_CM_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ListEntry_SocialConnection_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_SocialConnection_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_SocialConnection_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_ListEntry_SocialConnection_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_ListEntry_SocialConnection_CM_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_ListEntry_SocialConnection_CM.WBP_ListEntry_SocialConnection_CM_C.UpdateButtonsFromConnection
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_SocialConnection_CM_C_UpdateButtonsFromConnection final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_SocialConnection_CM_C_UpdateButtonsFromConnection) == 0x000001, "Wrong alignment on WBP_ListEntry_SocialConnection_CM_C_UpdateButtonsFromConnection");
static_assert(sizeof(WBP_ListEntry_SocialConnection_CM_C_UpdateButtonsFromConnection) == 0x000001, "Wrong size on WBP_ListEntry_SocialConnection_CM_C_UpdateButtonsFromConnection");
static_assert(offsetof(WBP_ListEntry_SocialConnection_CM_C_UpdateButtonsFromConnection, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_ListEntry_SocialConnection_CM_C_UpdateButtonsFromConnection::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

