#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GardenPlate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GardenPlate.WBP_GardenPlate_C
// 0x0050 (0x0310 - 0x02C0)
class UWBP_GardenPlate_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           IconBox;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Buffs;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WaterProgress_C*                   WBP_WaterProgress;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShouldDisplayIcon;                                 // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPlayedShownSound;                               // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x02EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617B[0x5];                                     // 0x02EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           WaitForValCharTimerHandle;                         // 0x02F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHidden;                                          // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617C[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerWidgetBase*              UIManagerWidget;                                   // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    Equipment;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void EquippedInUse(class UEquipmentComponent* EquipmentComponent, bool bIsUsingEquipped);
	void ExecuteUbergraph_WBP_GardenPlate(int32 EntryPoint, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, bool K2Node_CustomEvent_shouldShow, class FText CallFunc_GetText_ReturnValue, bool CallFunc_TextIsEmpty_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, TDelegate<void(class US6UI_UIManagerWidgetBase* UIManagerWidgetBase)> K2Node_CreateDelegate_OutputDelegate, class US6UI_UIManagerWidgetBase* K2Node_CustomEvent_UIManagerWidgetBase, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, ESlateVisibility Temp_byte_Variable, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class UEquipmentComponent* CallFunc_GetEquipment_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, ESlateVisibility K2Node_Select_Default, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, ESlateVisibility Temp_byte_Variable_2, TDelegate<void(bool ShouldShow)> K2Node_CreateDelegate_OutputDelegate_2, ESlateVisibility Temp_byte_Variable_3, TDelegate<void(class UEquipmentComponent* EquipmentComponent, bool bIsUsingEquipped)> K2Node_CreateDelegate_OutputDelegate_3, ESlateVisibility K2Node_Select_Default_1, class UEquipmentComponent* K2Node_CustomEvent_EquipmentComponent, bool K2Node_CustomEvent_bIsUsingEquipped, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1, int32 CallFunc_AkEventGlobal_ReturnValue_1);
	void HideInspectPlate();
	void InputModeRefreshed(class US6UI_UIManagerWidgetBase* UIManagerWidgetBase);
	void OnGardenInspectToggle(bool ShouldShow);
	void OnInitialized();
	void Set_Water_Droplet_Progress(double Progress, bool ShouldBeVisible, bool* Param_IsVisible, ESlateVisibility Temp_byte_Variable, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility K2Node_Select_Default);
	void SetGardenBuffInfo(const struct FGardenTileBuffInfo& GardenBuff);
	void ShowInspectPlate();
	void WaitForValeriaCharacter();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GardenPlate_C">();
	}
	static class UWBP_GardenPlate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GardenPlate_C>();
	}
};
static_assert(alignof(UWBP_GardenPlate_C) == 0x000008, "Wrong alignment on UWBP_GardenPlate_C");
static_assert(sizeof(UWBP_GardenPlate_C) == 0x000310, "Wrong size on UWBP_GardenPlate_C");
static_assert(offsetof(UWBP_GardenPlate_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_GardenPlate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlate_C, IconBox) == 0x0002C8, "Member 'UWBP_GardenPlate_C::IconBox' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlate_C, IconImage) == 0x0002D0, "Member 'UWBP_GardenPlate_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlate_C, TextBlock_Buffs) == 0x0002D8, "Member 'UWBP_GardenPlate_C::TextBlock_Buffs' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlate_C, WBP_WaterProgress) == 0x0002E0, "Member 'UWBP_GardenPlate_C::WBP_WaterProgress' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlate_C, ShouldDisplayIcon) == 0x0002E8, "Member 'UWBP_GardenPlate_C::ShouldDisplayIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlate_C, HasPlayedShownSound) == 0x0002E9, "Member 'UWBP_GardenPlate_C::HasPlayedShownSound' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlate_C, NewVar_0) == 0x0002EA, "Member 'UWBP_GardenPlate_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlate_C, WaitForValCharTimerHandle) == 0x0002F0, "Member 'UWBP_GardenPlate_C::WaitForValCharTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlate_C, IsHidden) == 0x0002F8, "Member 'UWBP_GardenPlate_C::IsHidden' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlate_C, UIManagerWidget) == 0x000300, "Member 'UWBP_GardenPlate_C::UIManagerWidget' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlate_C, Equipment) == 0x000308, "Member 'UWBP_GardenPlate_C::Equipment' has a wrong offset!");

}

