#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogueOptionButton_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DialogueOptionButton_CM.WBP_DialogueOptionButton_CM_C
// 0x01B0 (0x16F0 - 0x1540)
class UWBP_DialogueOptionButton_CM_C final : public UCommonButtonBaseInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ButtonSlideOnHover;                                // 0x1548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ArrowImage;                                        // 0x1550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ArrowSizeBox;                                      // 0x1558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BoundInputActionStateIndicator_C*  BoundInputActionStateIndicator_CommitOption;       // 0x1560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                ButtonText;                                        // 0x1568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DialogImageSizeBox;                                // 0x1570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DialogTypeImg;                                     // 0x1578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              DialogueOptionButton_CM;                           // 0x1580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NumericOverlay;                                    // 0x1588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonInputActionWidget_C*         WBP_CommonInputActionWidget;                       // 0x1590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WBP_IADescription_Container;                       // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVALUI_UISize                                 UiSize;                                            // 0x15A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5B41[0x7];                                     // 0x15A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Dialogue_CM_C*                     ParentDialogue;                                    // 0x15A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          DialogueOptionCancel;                              // 0x15B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B42[0x7];                                     // 0x15B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogueToShow                        Dialogue;                                          // 0x15B8(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Index_WBP_DialogueOptionButton_CM_C;               // 0x1618(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B43[0x4];                                     // 0x161C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_BasicTooltip_C*                    IconTooltip;                                       // 0x1620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  InputActionHandle_CommitOption;                    // 0x1628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            DialogIconColorTint_Focused;                       // 0x1638(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DialogIconColorTint;                               // 0x164C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NoColorTint;                                       // 0x1660(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_5B44[0x4];                                     // 0x1674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DialogIconNormalSize;                              // 0x1678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              DialogIconLargeSize;                               // 0x1688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_BasicTooltip_C*                    OptionTooltip;                                     // 0x1698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            UnfocusedTint;                                     // 0x16A0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            FocusedTint;                                       // 0x16B4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVAL_DialogueOption                    Dialogue_Option;                                   // 0x16C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnFocusReceived();
	void Commit_Option(int32 CallFunc_AkEventGlobal_ReturnValue, bool CallFunc_IsDialogueTextFullyDisplayed_ReturnValue);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_DialogueOptionButton_CM(int32 EntryPoint, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, ECommonInputType Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, ESlateVisibility Temp_byte_Variable_4, ESlateVisibility Temp_byte_Variable_5, ESlateVisibility Temp_byte_Variable_6, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UWBP_BasicTooltip_C* CallFunc_Create_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_2, ESlateVisibility CallFunc_GetVisibility_ReturnValue, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, const struct FSlateColor& K2Node_MakeStruct_SlateColor, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1, const struct FFocusEvent& K2Node_Event_InFocusEvent, const class FString& CallFunc_GetDisplayName_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, ECommonInputType K2Node_CustomEvent_bNewInputType, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, ESlateVisibility K2Node_Select_Default, ESlateVisibility K2Node_Select_Default_1, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1);
	void Handle_Input_Action_Commit_Option_Triggered(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* InputAction, class UPanelWidget* CallFunc_GetParent_ReturnValue, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_IsVisible_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue);
	void InputMethodChanged(ECommonInputType bNewInputType);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnInitialized();
	void ResetAnimations();
	void SetUISize(EVALUI_UISize NewSize, bool K2Node_SwitchEnum_CmpSuccess);
	void SetupDialogueOption(const struct FDialogueToShow& Param_Dialogue, const struct FVAL_DialogueOption& DialogueOption, class UVAL_DialogueSpeakerAsset* DialogueSpeaker, class UWBP_Dialogue_CM_C* Parent, bool CancelOption, class UInputAction* InputAction_CommitOption, const class FString& HintString, class UTexture2D* Temp_object_Variable, class UTexture2D* Temp_object_Variable_1, class UTexture2D* Temp_object_Variable_2, class UTexture2D* Temp_object_Variable_3, class UTexture2D* Temp_object_Variable_4, class UTexture2D* Temp_object_Variable_5, class UTexture2D* Temp_object_Variable_6, class UTexture2D* Temp_object_Variable_7, class UTexture2D* Temp_object_Variable_8, class UTexture2D* Temp_object_Variable_9, class UTexture2D* Temp_object_Variable_10, class UTexture2D* Temp_object_Variable_11, class UTexture2D* Temp_object_Variable_12, class UTexture2D* Temp_object_Variable_13, EVillagerDialogueIcon Temp_byte_Variable, bool Temp_bool_Variable, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue, bool Temp_bool_Variable_1, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess, const struct FVAL_DialogueContext& K2Node_MakeStruct_VAL_DialogueContext, class UTexture2D* K2Node_Select_Default, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class FText CallFunc_PerformTextSubstitutionsForDialogue_ReturnValue, TSet<EVillagerDialogueIcon>& K2Node_MakeSet_Set, bool CallFunc_Set_Contains_ReturnValue, const struct FSlateColor& K2Node_Select_Default_1, const struct FSlateColor& K2Node_Select_Default_2, bool Temp_bool_Variable_2, const struct FVector2D& K2Node_Select_Default_3, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_Not_PreBool_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DialogueOptionButton_CM_C">();
	}
	static class UWBP_DialogueOptionButton_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DialogueOptionButton_CM_C>();
	}
};
static_assert(alignof(UWBP_DialogueOptionButton_CM_C) == 0x000010, "Wrong alignment on UWBP_DialogueOptionButton_CM_C");
static_assert(sizeof(UWBP_DialogueOptionButton_CM_C) == 0x0016F0, "Wrong size on UWBP_DialogueOptionButton_CM_C");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, UberGraphFrame) == 0x001540, "Member 'UWBP_DialogueOptionButton_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, ButtonSlideOnHover) == 0x001548, "Member 'UWBP_DialogueOptionButton_CM_C::ButtonSlideOnHover' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, ArrowImage) == 0x001550, "Member 'UWBP_DialogueOptionButton_CM_C::ArrowImage' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, ArrowSizeBox) == 0x001558, "Member 'UWBP_DialogueOptionButton_CM_C::ArrowSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, BoundInputActionStateIndicator_CommitOption) == 0x001560, "Member 'UWBP_DialogueOptionButton_CM_C::BoundInputActionStateIndicator_CommitOption' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, ButtonText) == 0x001568, "Member 'UWBP_DialogueOptionButton_CM_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, DialogImageSizeBox) == 0x001570, "Member 'UWBP_DialogueOptionButton_CM_C::DialogImageSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, DialogTypeImg) == 0x001578, "Member 'UWBP_DialogueOptionButton_CM_C::DialogTypeImg' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, DialogueOptionButton_CM) == 0x001580, "Member 'UWBP_DialogueOptionButton_CM_C::DialogueOptionButton_CM' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, NumericOverlay) == 0x001588, "Member 'UWBP_DialogueOptionButton_CM_C::NumericOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, WBP_CommonInputActionWidget) == 0x001590, "Member 'UWBP_DialogueOptionButton_CM_C::WBP_CommonInputActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, WBP_IADescription_Container) == 0x001598, "Member 'UWBP_DialogueOptionButton_CM_C::WBP_IADescription_Container' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, UiSize) == 0x0015A0, "Member 'UWBP_DialogueOptionButton_CM_C::UiSize' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, ParentDialogue) == 0x0015A8, "Member 'UWBP_DialogueOptionButton_CM_C::ParentDialogue' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, DialogueOptionCancel) == 0x0015B0, "Member 'UWBP_DialogueOptionButton_CM_C::DialogueOptionCancel' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, Dialogue) == 0x0015B8, "Member 'UWBP_DialogueOptionButton_CM_C::Dialogue' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, Index_WBP_DialogueOptionButton_CM_C) == 0x001618, "Member 'UWBP_DialogueOptionButton_CM_C::Index_WBP_DialogueOptionButton_CM_C' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, IconTooltip) == 0x001620, "Member 'UWBP_DialogueOptionButton_CM_C::IconTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, InputActionHandle_CommitOption) == 0x001628, "Member 'UWBP_DialogueOptionButton_CM_C::InputActionHandle_CommitOption' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, DialogIconColorTint_Focused) == 0x001638, "Member 'UWBP_DialogueOptionButton_CM_C::DialogIconColorTint_Focused' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, DialogIconColorTint) == 0x00164C, "Member 'UWBP_DialogueOptionButton_CM_C::DialogIconColorTint' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, NoColorTint) == 0x001660, "Member 'UWBP_DialogueOptionButton_CM_C::NoColorTint' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, DialogIconNormalSize) == 0x001678, "Member 'UWBP_DialogueOptionButton_CM_C::DialogIconNormalSize' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, DialogIconLargeSize) == 0x001688, "Member 'UWBP_DialogueOptionButton_CM_C::DialogIconLargeSize' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, OptionTooltip) == 0x001698, "Member 'UWBP_DialogueOptionButton_CM_C::OptionTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, UnfocusedTint) == 0x0016A0, "Member 'UWBP_DialogueOptionButton_CM_C::UnfocusedTint' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, FocusedTint) == 0x0016B4, "Member 'UWBP_DialogueOptionButton_CM_C::FocusedTint' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueOptionButton_CM_C, Dialogue_Option) == 0x0016C8, "Member 'UWBP_DialogueOptionButton_CM_C::Dialogue_Option' has a wrong offset!");

}

