#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IconButton_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IconButton_CM.WBP_IconButton_CM_C
// 0x0020 (0x1560 - 0x1540)
class UWBP_IconButton_CM_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IconImage;                                         // 0x1548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture;                                       // 0x1550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_IconButton_CM(int32 EntryPoint, bool K2Node_Event_IsDesignTime);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IconButton_CM_C">();
	}
	static class UWBP_IconButton_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IconButton_CM_C>();
	}
};
static_assert(alignof(UWBP_IconButton_CM_C) == 0x000010, "Wrong alignment on UWBP_IconButton_CM_C");
static_assert(sizeof(UWBP_IconButton_CM_C) == 0x001560, "Wrong size on UWBP_IconButton_CM_C");
static_assert(offsetof(UWBP_IconButton_CM_C, UberGraphFrame) == 0x001540, "Member 'UWBP_IconButton_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IconButton_CM_C, IconImage) == 0x001548, "Member 'UWBP_IconButton_CM_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWBP_IconButton_CM_C, IconTexture) == 0x001550, "Member 'UWBP_IconButton_CM_C::IconTexture' has a wrong offset!");

}

