#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Audio_Settings_PF

#include "Basic.hpp"

#include "S6Core_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Palia_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_21_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_21_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5535[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_21_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_21_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_21_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_21_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_21_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_21_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_21_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_21_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_22_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_22_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5536[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_22_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_22_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_22_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_22_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_22_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_22_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_22_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Dropdown_CM_K2Node_ComponentBoundEvent_22_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.BndEvt__WBP_Audio_Settings_PF_ComboBox_MixProfile_K2Node_ComponentBoundEvent_9_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_MixProfile_K2Node_ComponentBoundEvent_9_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_MixProfile_K2Node_ComponentBoundEvent_9_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_MixProfile_K2Node_ComponentBoundEvent_9_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_MixProfile_K2Node_ComponentBoundEvent_9_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_MixProfile_K2Node_ComponentBoundEvent_9_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_MixProfile_K2Node_ComponentBoundEvent_9_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_MixProfile_K2Node_ComponentBoundEvent_9_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.BndEvt__WBP_Audio_Settings_PF_ComboBox_PanningRule_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_PanningRule_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_PanningRule_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_PanningRule_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_PanningRule_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_PanningRule_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_PanningRule_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_BndEvt__WBP_Audio_Settings_PF_ComboBox_PanningRule_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.ExecuteUbergraph_WBP_Audio_Settings_PF
// 0x0200 (0x0200 - 0x0000)
struct WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5537[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue_1;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5538[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue_2;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue_3;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5539[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_2; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_3; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0078(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_553A[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_4; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_5; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_6; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_7; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_8; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_9; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText Name, class FText Description)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0118(0x0018)()
	class FText                                   K2Node_CustomEvent_Description;                    // 0x0130(0x0018)()
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0148(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_553B[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit; // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_553C[0x6];                                     // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value_3;                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_2;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_1;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_553D[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x01A0(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_553E[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x01C0(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_553F[0x6];                                     // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox_1;        // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox;          // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOverallVolume_value_ImplicitCast;      // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSoundVolume_value_ImplicitCast;        // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMusicVolume_value_ImplicitCast;        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDialogueVolume_value_ImplicitCast;     // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF");
static_assert(sizeof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF) == 0x000200, "Wrong size on WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, EntryPoint) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, Temp_bool_Variable) == 0x000008, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetPlayerController_ReturnValue_1) == 0x000018, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_IsLocalController_ReturnValue) == 0x000020, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_IsLocalController_ReturnValue_1) == 0x000021, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_IsLocalController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetPlayerController_ReturnValue_2) == 0x000028, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetPlayerController_ReturnValue_3) == 0x000030, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_IsLocalController_ReturnValue_2) == 0x000038, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_IsLocalController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_IsLocalController_ReturnValue_3) == 0x000039, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_IsLocalController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000040, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, Temp_real_Variable) == 0x000048, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue_1) == 0x000050, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue_2) == 0x000058, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue_3) == 0x000060, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, Temp_real_Variable_1) == 0x000068, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, Temp_object_Variable) == 0x000070, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000078, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000098, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00009C, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0000A0, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, Temp_real_Variable_1_0) == 0x0000A8, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, Temp_real_Variable_0) == 0x0000B0, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x0000B8, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue_4) == 0x0000C0, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue_5) == 0x0000C8, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue_6) == 0x0000D0, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue_7) == 0x0000D8, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue_8) == 0x0000E0, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue_9) == 0x0000E8, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, Temp_int_Loop_Counter_Variable) == 0x0000F0, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_Add_IntInt_ReturnValue) == 0x0000F4, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_CreateDelegate_OutputDelegate_1) == 0x000108, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_CustomEvent_Name) == 0x000118, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_CustomEvent_Description) == 0x000130, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_CustomEvent_Description' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_GetAllChildren_ReturnValue) == 0x000148, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_Array_Get_Item) == 0x000158, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit) == 0x000168, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_Less_IntInt_ReturnValue) == 0x000171, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_ComponentBoundEvent_Value_3) == 0x000178, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_ComponentBoundEvent_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_ComponentBoundEvent_Value_2) == 0x000180, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_ComponentBoundEvent_Value_1) == 0x000188, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_ComponentBoundEvent_Value) == 0x000190, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_ComponentBoundEvent_Index_1) == 0x000198, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_ComponentBoundEvent_Index_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_ComponentBoundEvent_Text_1) == 0x0001A0, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_ComponentBoundEvent_Index) == 0x0001B8, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_ComponentBoundEvent_Text) == 0x0001C0, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001D8, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_SwitchInteger_CmpSuccess) == 0x0001D9, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_ComponentBoundEvent_OpenedDropBox_1) == 0x0001E0, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_ComponentBoundEvent_OpenedDropBox_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, K2Node_ComponentBoundEvent_OpenedDropBox) == 0x0001E8, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::K2Node_ComponentBoundEvent_OpenedDropBox' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_SetOverallVolume_value_ImplicitCast) == 0x0001F0, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_SetOverallVolume_value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_SetSoundVolume_value_ImplicitCast) == 0x0001F4, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_SetSoundVolume_value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_SetMusicVolume_value_ImplicitCast) == 0x0001F8, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_SetMusicVolume_value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF, CallFunc_SetDialogueVolume_value_ImplicitCast) == 0x0001FC, "Member 'WBP_Audio_Settings_PF_C_ExecuteUbergraph_WBP_Audio_Settings_PF::CallFunc_SetDialogueVolume_value_ImplicitCast' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.HandleSettingsItemHovered
// 0x0030 (0x0030 - 0x0000)
struct WBP_Audio_Settings_PF_C_HandleSettingsItemHovered final
{
public:
	class FText                                   Param_Name;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_HandleSettingsItemHovered) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_HandleSettingsItemHovered");
static_assert(sizeof(WBP_Audio_Settings_PF_C_HandleSettingsItemHovered) == 0x000030, "Wrong size on WBP_Audio_Settings_PF_C_HandleSettingsItemHovered");
static_assert(offsetof(WBP_Audio_Settings_PF_C_HandleSettingsItemHovered, Param_Name) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_HandleSettingsItemHovered::Param_Name' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_HandleSettingsItemHovered, Description) == 0x000018, "Member 'WBP_Audio_Settings_PF_C_HandleSettingsItemHovered::Description' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_Audio_Settings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.OnDropDownOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Audio_Settings_PF_C_OnDropDownOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropDownBox;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_OnDropDownOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_OnDropDownOpened__DelegateSignature");
static_assert(sizeof(WBP_Audio_Settings_PF_C_OnDropDownOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_Audio_Settings_PF_C_OnDropDownOpened__DelegateSignature");
static_assert(offsetof(WBP_Audio_Settings_PF_C_OnDropDownOpened__DelegateSignature, OpenedDropDownBox) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_OnDropDownOpened__DelegateSignature::OpenedDropDownBox' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.ResetSettings
// 0x0010 (0x0010 - 0x0000)
struct WBP_Audio_Settings_PF_C_ResetSettings final
{
public:
	bool                                          NewLocalVar;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5540[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_ResetSettings) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_ResetSettings");
static_assert(sizeof(WBP_Audio_Settings_PF_C_ResetSettings) == 0x000010, "Wrong size on WBP_Audio_Settings_PF_C_ResetSettings");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ResetSettings, NewLocalVar) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_ResetSettings::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ResetSettings, CallFunc_GetPlatformType_ReturnValue) == 0x000001, "Member 'WBP_Audio_Settings_PF_C_ResetSettings::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ResetSettings, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'WBP_Audio_Settings_PF_C_ResetSettings::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_ResetSettings, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000008, "Member 'WBP_Audio_Settings_PF_C_ResetSettings::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.SynchronizeState
// 0x0050 (0x0050 - 0x0000)
struct WBP_Audio_Settings_PF_C_SynchronizeState final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPanningRule                                  Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5541[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAudioMixProfiles                             Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5542[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetSliderValue_SliderValue_ImplicitCast;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetSliderValue_SliderValue_ImplicitCast_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetSliderValue_SliderValue_ImplicitCast_2; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetSliderValue_SliderValue_ImplicitCast_3; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_SynchronizeState) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_SynchronizeState");
static_assert(sizeof(WBP_Audio_Settings_PF_C_SynchronizeState) == 0x000050, "Wrong size on WBP_Audio_Settings_PF_C_SynchronizeState");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, Temp_int_Variable) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, Temp_int_Variable_1) == 0x000004, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, Temp_byte_Variable) == 0x000008, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, Temp_int_Variable_2) == 0x00000C, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, Temp_int_Variable_3) == 0x000010, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, Temp_int_Variable_4) == 0x000014, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, Temp_byte_Variable_1) == 0x000018, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000020, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, K2Node_Select_Default) == 0x000028, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, K2Node_Select_Default_1) == 0x00002C, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, CallFunc_SetSliderValue_SliderValue_ImplicitCast) == 0x000030, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::CallFunc_SetSliderValue_SliderValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, CallFunc_SetSliderValue_SliderValue_ImplicitCast_1) == 0x000038, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::CallFunc_SetSliderValue_SliderValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, CallFunc_SetSliderValue_SliderValue_ImplicitCast_2) == 0x000040, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::CallFunc_SetSliderValue_SliderValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_SynchronizeState, CallFunc_SetSliderValue_SliderValue_ImplicitCast_3) == 0x000048, "Member 'WBP_Audio_Settings_PF_C_SynchronizeState::CallFunc_SetSliderValue_SliderValue_ImplicitCast_3' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.TryResetSettings
// 0x0038 (0x0038 - 0x0000)
struct WBP_Audio_Settings_PF_C_TryResetSettings final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ResetToDefault_Confirmation_PF_C*  CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Audio_Settings_PF_C_TryResetSettings) == 0x000008, "Wrong alignment on WBP_Audio_Settings_PF_C_TryResetSettings");
static_assert(sizeof(WBP_Audio_Settings_PF_C_TryResetSettings) == 0x000038, "Wrong size on WBP_Audio_Settings_PF_C_TryResetSettings");
static_assert(offsetof(WBP_Audio_Settings_PF_C_TryResetSettings, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_Audio_Settings_PF_C_TryResetSettings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_TryResetSettings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_Audio_Settings_PF_C_TryResetSettings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_TryResetSettings, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_Audio_Settings_PF_C_TryResetSettings::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_TryResetSettings, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_Audio_Settings_PF_C_TryResetSettings::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Audio_Settings_PF_C_TryResetSettings, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000030, "Member 'WBP_Audio_Settings_PF_C_TryResetSettings::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_Audio_Settings_PF.WBP_Audio_Settings_PF_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Audio_Settings_PF_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
