#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TileEntry_Voice_CM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_BndEvt__WBP_TileEntry_Voice_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_TileEntry_Voice_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_TileEntry_Voice_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_TileEntry_Voice_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_TileEntry_Voice_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.ExecuteUbergraph_WBP_TileEntry_Voice_CM
// 0x0268 (0x0268 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DDA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationItem_Voice*  K2Node_DynamicCast_AsVAL_Character_Customization_Item_Voice; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DDB[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharacterCustomizationItem_Voice_PerBodyTypeConfig CallFunc_TryGetBodyTypeSpecificConfig_Voice_OutBodyTypeSpecificConfig; // 0x0030(0x0090)()
	bool                                          CallFunc_TryGetBodyTypeSpecificConfig_Voice_ReturnValue; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DDC[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoiceSet_C*                            K2Node_DynamicCast_AsVoice_Set;                    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DDD[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          CallFunc_GetVoiceEvent_Value;                      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DDE[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DDF[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DE0[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0128(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0160(0x0078)(ConstParm)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListItemSelected_ReturnValue;           // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DE1[0x6];                                     // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DE2[0x2];                                     // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_1;          // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_1; // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DE3[0x3];                                     // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0214(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0224(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DE4[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_2;          // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DE5[0x4];                                     // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_2; // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DE6[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM) == 0x000268, "Wrong size on WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, EntryPoint) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_CustomEvent_Loaded_1) == 0x000010, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, Temp_object_Variable) == 0x000018, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_AsVAL_Character_Customization_Item_Voice) == 0x000020, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_AsVAL_Character_Customization_Item_Voice' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_TryGetBodyTypeSpecificConfig_Voice_OutBodyTypeSpecificConfig) == 0x000030, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_TryGetBodyTypeSpecificConfig_Voice_OutBodyTypeSpecificConfig' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_TryGetBodyTypeSpecificConfig_Voice_ReturnValue) == 0x0000C0, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_TryGetBodyTypeSpecificConfig_Voice_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_CustomEvent_Loaded) == 0x0000C8, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, Temp_object_Variable_1) == 0x0000D0, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_AsVoice_Set) == 0x0000D8, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_AsVoice_Set' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_GetVoiceEvent_Value) == 0x0000E8, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_GetVoiceEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x0000F0, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_Event_bIsExpanded) == 0x0000F4, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_GetOwningListView_ReturnValue) == 0x0000F8, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_GetListItemObject_ReturnValue) == 0x000100, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_AsList_View) == 0x000108, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item) == 0x000118, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_bSuccess_3) == 0x000120, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000124, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_Event_MyGeometry) == 0x000128, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_Event_MouseEvent) == 0x000160, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_Event_ListItemObject) == 0x0001D8, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_IsListItemSelected_ReturnValue) == 0x0001E0, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_IsListItemSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_Event_bIsSelected) == 0x0001E1, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_PlayAnimation_ReturnValue) == 0x0001E8, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001F0, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_Not_PreBool_ReturnValue) == 0x0001F8, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_BooleanAND_ReturnValue) == 0x0001F9, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x0001FC, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_GetListItemObject_ReturnValue_1) == 0x000200, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_GetListItemObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_1) == 0x000208, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_bSuccess_4) == 0x000210, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000214, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000224, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_GetListItemObject_ReturnValue_2) == 0x000238, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_GetListItemObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, CallFunc_AkEventGlobal_ReturnValue_3) == 0x000240, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::CallFunc_AkEventGlobal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_2) == 0x000248, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_DynamicCast_bSuccess_5) == 0x000250, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_ComponentBoundEvent_Button_2) == 0x000258, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000260, "Member 'WBP_TileEntry_Voice_CM_C_ExecuteUbergraph_WBP_TileEntry_Voice_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.FindAndSetTooltipText
// 0x0050 (0x0050 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText final
{
public:
	class FText                                   Tool_Tip_Text;                                     // 0x0000(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DE7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DE8[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0038(0x0018)()
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText) == 0x000050, "Wrong size on WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText, Tool_Tip_Text) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText::Tool_Tip_Text' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000018, "Member 'WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText, CallFunc_GetListItemObject_ReturnValue) == 0x000020, "Member 'WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item) == 0x000028, "Member 'WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText, CallFunc_Conv_NameToText_ReturnValue) == 0x000038, "Member 'WBP_TileEntry_Voice_CM_C_FindAndSetTooltipText::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.GetItemId
// 0x0038 (0x0038 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_GetItemId final
{
public:
	struct FGuid                                  Item_Id;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_MakeStruct_Guid;                            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_GetItemId) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_GetItemId");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_GetItemId) == 0x000038, "Wrong size on WBP_TileEntry_Voice_CM_C_GetItemId");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_GetItemId, Item_Id) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_GetItemId::Item_Id' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_GetItemId, K2Node_MakeStruct_Guid) == 0x000010, "Member 'WBP_TileEntry_Voice_CM_C_GetItemId::K2Node_MakeStruct_Guid' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_GetItemId, CallFunc_GetListItemObject_ReturnValue) == 0x000020, "Member 'WBP_TileEntry_Voice_CM_C_GetItemId::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_GetItemId, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item) == 0x000028, "Member 'WBP_TileEntry_Voice_CM_C_GetItemId::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_GetItemId, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_TileEntry_Voice_CM_C_GetItemId::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.IsNew
// 0x0002 (0x0002 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_IsNew final
{
public:
	bool                                          New;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_IsNew) == 0x000001, "Wrong alignment on WBP_TileEntry_Voice_CM_C_IsNew");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_IsNew) == 0x000002, "Wrong size on WBP_TileEntry_Voice_CM_C_IsNew");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_IsNew, New) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_IsNew::New' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_IsNew, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WBP_TileEntry_Voice_CM_C_IsNew::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_OnListItemObjectSet");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_TileEntry_Voice_CM_C_OnListItemObjectSet");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.OnLoaded_06CDD44A4A33BB7D1730B0BB4F5E8DD9
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_OnLoaded_06CDD44A4A33BB7D1730B0BB4F5E8DD9 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_OnLoaded_06CDD44A4A33BB7D1730B0BB4F5E8DD9) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_OnLoaded_06CDD44A4A33BB7D1730B0BB4F5E8DD9");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_OnLoaded_06CDD44A4A33BB7D1730B0BB4F5E8DD9) == 0x000008, "Wrong size on WBP_TileEntry_Voice_CM_C_OnLoaded_06CDD44A4A33BB7D1730B0BB4F5E8DD9");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_OnLoaded_06CDD44A4A33BB7D1730B0BB4F5E8DD9, Loaded) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_OnLoaded_06CDD44A4A33BB7D1730B0BB4F5E8DD9::Loaded' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.OnLoaded_9E6342EF4011C03C32B0AF9D16E5152A
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_OnLoaded_9E6342EF4011C03C32B0AF9D16E5152A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_OnLoaded_9E6342EF4011C03C32B0AF9D16E5152A) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_OnLoaded_9E6342EF4011C03C32B0AF9D16E5152A");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_OnLoaded_9E6342EF4011C03C32B0AF9D16E5152A) == 0x000008, "Wrong size on WBP_TileEntry_Voice_CM_C_OnLoaded_9E6342EF4011C03C32B0AF9D16E5152A");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_OnLoaded_9E6342EF4011C03C32B0AF9D16E5152A, Loaded) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_OnLoaded_9E6342EF4011C03C32B0AF9D16E5152A::Loaded' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_OnMouseEnter");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_TileEntry_Voice_CM_C_OnMouseEnter");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_TileEntry_Voice_CM_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.SeeNew
// 0x0028 (0x0028 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_SeeNew final
{
public:
	struct FGuid                                  CallFunc_GetItemId_Item_Id;                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DE9[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNew_New;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_SeeNew) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_SeeNew");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_SeeNew) == 0x000028, "Wrong size on WBP_TileEntry_Voice_CM_C_SeeNew");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SeeNew, CallFunc_GetItemId_Item_Id) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_SeeNew::CallFunc_GetItemId_Item_Id' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SeeNew, CallFunc_GetValeriaPlayerController_OutResult) == 0x000010, "Member 'WBP_TileEntry_Voice_CM_C_SeeNew::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SeeNew, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000018, "Member 'WBP_TileEntry_Voice_CM_C_SeeNew::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SeeNew, CallFunc_IsValid_Guid_ReturnValue) == 0x000020, "Member 'WBP_TileEntry_Voice_CM_C_SeeNew::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SeeNew, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'WBP_TileEntry_Voice_CM_C_SeeNew::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SeeNew, CallFunc_IsNew_New) == 0x000022, "Member 'WBP_TileEntry_Voice_CM_C_SeeNew::CallFunc_IsNew_New' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.SetNew
// 0x0020 (0x0020 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_SetNew final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DEA[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_SetNew) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_SetNew");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_SetNew) == 0x000020, "Wrong size on WBP_TileEntry_Voice_CM_C_SetNew");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetNew, Temp_bool_Variable) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_SetNew::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetNew, Temp_byte_Variable) == 0x000001, "Member 'WBP_TileEntry_Voice_CM_C_SetNew::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetNew, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_TileEntry_Voice_CM_C_SetNew::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetNew, CallFunc_GetListItemObject_ReturnValue) == 0x000008, "Member 'WBP_TileEntry_Voice_CM_C_SetNew::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetNew, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item) == 0x000010, "Member 'WBP_TileEntry_Voice_CM_C_SetNew::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetNew, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_TileEntry_Voice_CM_C_SetNew::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetNew, K2Node_Select_Default) == 0x000019, "Member 'WBP_TileEntry_Voice_CM_C_SetNew::K2Node_Select_Default' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.SetOwned
// 0x0005 (0x0005 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_SetOwned final
{
public:
	bool                                          Param_Owned;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_SetOwned) == 0x000001, "Wrong alignment on WBP_TileEntry_Voice_CM_C_SetOwned");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_SetOwned) == 0x000005, "Wrong size on WBP_TileEntry_Voice_CM_C_SetOwned");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetOwned, Param_Owned) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_SetOwned::Param_Owned' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetOwned, Temp_bool_Variable) == 0x000001, "Member 'WBP_TileEntry_Voice_CM_C_SetOwned::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetOwned, Temp_byte_Variable) == 0x000002, "Member 'WBP_TileEntry_Voice_CM_C_SetOwned::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetOwned, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_TileEntry_Voice_CM_C_SetOwned::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetOwned, K2Node_Select_Default) == 0x000004, "Member 'WBP_TileEntry_Voice_CM_C_SetOwned::K2Node_Select_Default' has a wrong offset!");

// Function WBP_TileEntry_Voice_CM.WBP_TileEntry_Voice_CM_C.SetSelected
// 0x0030 (0x0030 - 0x0000)
struct WBP_TileEntry_Voice_CM_C_SetSelected final
{
public:
	bool                                          Param_Selected;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DEB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DEC[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DED[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_Voice_CM_C_SetSelected) == 0x000008, "Wrong alignment on WBP_TileEntry_Voice_CM_C_SetSelected");
static_assert(sizeof(WBP_TileEntry_Voice_CM_C_SetSelected) == 0x000030, "Wrong size on WBP_TileEntry_Voice_CM_C_SetSelected");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetSelected, Param_Selected) == 0x000000, "Member 'WBP_TileEntry_Voice_CM_C_SetSelected::Param_Selected' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetSelected, Temp_byte_Variable) == 0x000001, "Member 'WBP_TileEntry_Voice_CM_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_Voice_CM_C_SetSelected, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_TileEntry_Voice_CM_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
