#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_TabHost

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Social_TabHost.WBP_Social_TabHost_C
// 0x0030 (0x0368 - 0x0338)
class UWBP_Social_TabHost_C final : public UVALUI_TabButtonHostBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_DepthSortedHorizontalBox*        HBox_TabButtons;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                ButtonPadding;                                     // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FColor                                 IconInactiveColor;                                 // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 IconActiveColor;                                   // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 IconHoverColor;                                    // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddTabButton(class FName& TabName, struct FVALUI_InstantiatedTabButtonInfo& Info);
	void AddTabButtonImpl(struct FVALUI_InstantiatedTabButtonInfo& InstantiatedTabButtonInfo, class FName& TabName, class UButton** Button, class UButton* ButtonCreated, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UWBP_Social_TabButton_C* CallFunc_Create_ReturnValue, class UObject* CallFunc_LoadAsset_Blocking_ReturnValue, class UTexture2D* K2Node_DynamicCast_AsTexture_2D, bool K2Node_DynamicCast_bSuccess, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue);
	void ExecuteUbergraph_WBP_Social_TabHost(int32 EntryPoint, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, bool Temp_bool_True_if_break_was_hit_Variable_1, bool Temp_bool_True_if_break_was_hit_Variable_2, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_2, int32 Temp_int_Array_Index_Variable_2, bool CallFunc_BooleanAND_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UWBP_Social_TabButton_C* K2Node_DynamicCast_AsWBP_Social_Tab_Button, bool K2Node_DynamicCast_bSuccess, class FName K2Node_Event_TabName_4, struct FVALUI_InstantiatedTabButtonInfo& K2Node_Event_Info_3, class FName K2Node_Event_TabName_3, struct FVALUI_InstantiatedTabButtonInfo& K2Node_Event_Info_2, class UButton* CallFunc_AddTabButtonImpl_Button, bool CallFunc_IsValid_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_1, class UWidget* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_RemoveChild_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, class UWBP_Social_TabButton_C* K2Node_DynamicCast_AsWBP_Social_Tab_Button_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class FName K2Node_Event_TabName_2, TArray<class FName>& CallFunc_GetTabNames_ReturnValue, int32 CallFunc_Array_Find_ReturnValue, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, TArray<class FName>& CallFunc_GetTabNames_ReturnValue_1, class FName CallFunc_GetActiveTabName_ReturnValue, int32 CallFunc_Array_Find_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue, class FName K2Node_Event_TabName_1, struct FVALUI_InstantiatedTabButtonInfo& K2Node_Event_Info_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_2, class FName K2Node_Event_TabName, struct FVALUI_InstantiatedTabButtonInfo& K2Node_Event_Info, class UWidget* CallFunc_Array_Get_Item_2, class UWBP_Social_TabButton_C* K2Node_DynamicCast_AsWBP_Social_Tab_Button_2, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue_2);
	void HandleDifferentActiveTabSet(class FName TabName);
	void HideTabButton(class FName& TabName, struct FVALUI_InstantiatedTabButtonInfo& Info);
	void RemoveTabButton(class FName& TabName, struct FVALUI_InstantiatedTabButtonInfo& Info);
	void ShowTabButton(class FName& TabName, struct FVALUI_InstantiatedTabButtonInfo& Info);
	void UpdateButtonHoverAnimPermissions(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class FName CallFunc_GetActiveTabName_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UWBP_Social_TabButton_C* K2Node_DynamicCast_AsWBP_Social_Tab_Button, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_NameName_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void UpdateSocialButtonCount(class FName TabName, int32 Count, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UWBP_Social_TabButton_C* K2Node_DynamicCast_AsWBP_Social_Tab_Button, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_NameName_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Social_TabHost_C">();
	}
	static class UWBP_Social_TabHost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Social_TabHost_C>();
	}
};
static_assert(alignof(UWBP_Social_TabHost_C) == 0x000008, "Wrong alignment on UWBP_Social_TabHost_C");
static_assert(sizeof(UWBP_Social_TabHost_C) == 0x000368, "Wrong size on UWBP_Social_TabHost_C");
static_assert(offsetof(UWBP_Social_TabHost_C, UberGraphFrame) == 0x000338, "Member 'UWBP_Social_TabHost_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Social_TabHost_C, HBox_TabButtons) == 0x000340, "Member 'UWBP_Social_TabHost_C::HBox_TabButtons' has a wrong offset!");
static_assert(offsetof(UWBP_Social_TabHost_C, ButtonPadding) == 0x000348, "Member 'UWBP_Social_TabHost_C::ButtonPadding' has a wrong offset!");
static_assert(offsetof(UWBP_Social_TabHost_C, IconInactiveColor) == 0x000358, "Member 'UWBP_Social_TabHost_C::IconInactiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_Social_TabHost_C, IconActiveColor) == 0x00035C, "Member 'UWBP_Social_TabHost_C::IconActiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_Social_TabHost_C, IconHoverColor) == 0x000360, "Member 'UWBP_Social_TabHost_C::IconHoverColor' has a wrong offset!");

}

