#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemContext

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemContext.WBP_ItemContext_C.ExecuteUbergraph_WBP_ItemContext
// 0x0238 (0x0238 - 0x0000)
struct WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FValeriaItem& Bait)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FValeriaItem& Ammo)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, const struct FEquipmentItem& Item)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E5D[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           K2Node_CustomEvent_Bait;                           // 0x0060(0x0060)()
	class UFishingComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E5E[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           K2Node_CustomEvent_Ammo;                           // 0x00D8(0x0060)()
	class UProjectileFiringComponent*             CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_2;          // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E5F[0x6];                                     // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_2;        // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UProjectileFiringComponent*             CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_3;          // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E60[0x6];                                     // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_3;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue;                 // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_4;          // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E61[0x6];                                     // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_4;        // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_5;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E62[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_5;        // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue_1;               // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFishingComponent*                      CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_6;          // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E63[0x5];                                     // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_6;        // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_7;          // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E64[0x6];                                     // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_7;        // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue_1;               // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E65[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    K2Node_CustomEvent_Inventory;                      // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    K2Node_CustomEvent_EquipmentComponent;             // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         K2Node_CustomEvent_Item;                           // 0x01E8(0x0050)()
};
static_assert(alignof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext) == 0x000008, "Wrong alignment on WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext");
static_assert(sizeof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext) == 0x000238, "Wrong size on WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, EntryPoint) == 0x000000, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_OutResult) == 0x000054, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000058, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_CustomEvent_Bait) == 0x000060, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_CustomEvent_Bait' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetComponentByClass_ReturnValue) == 0x0000C0, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_SwitchEnum_CmpSuccess) == 0x0000C8, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_OutResult_1) == 0x0000C9, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_OutResult_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_ReturnValue_1) == 0x0000D0, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_CustomEvent_Ammo) == 0x0000D8, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_CustomEvent_Ammo' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000138, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_SwitchEnum_CmpSuccess_1) == 0x000140, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_OutResult_2) == 0x000141, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_OutResult_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_ReturnValue_2) == 0x000148, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000150, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_SwitchEnum_CmpSuccess_2) == 0x000158, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_OutResult_3) == 0x000159, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_OutResult_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_ReturnValue_3) == 0x000160, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetEquipment_ReturnValue) == 0x000168, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_SwitchEnum_CmpSuccess_3) == 0x000170, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_OutResult_4) == 0x000171, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_OutResult_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_ReturnValue_4) == 0x000178, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_OutResult_5) == 0x000180, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_OutResult_5' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_ReturnValue_5) == 0x000188, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetEquipment_ReturnValue_1) == 0x000190, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000198, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_SwitchEnum_CmpSuccess_4) == 0x0001A0, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_SwitchEnum_CmpSuccess_5) == 0x0001A1, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_OutResult_6) == 0x0001A2, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_OutResult_6' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_ReturnValue_6) == 0x0001A8, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetInventory_ReturnValue) == 0x0001B0, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_SwitchEnum_CmpSuccess_6) == 0x0001B8, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_SwitchEnum_CmpSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_OutResult_7) == 0x0001B9, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_OutResult_7' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetValeriaCharacter_ReturnValue_7) == 0x0001C0, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetValeriaCharacter_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, CallFunc_GetInventory_ReturnValue_1) == 0x0001C8, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::CallFunc_GetInventory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_SwitchEnum_CmpSuccess_7) == 0x0001D0, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_SwitchEnum_CmpSuccess_7' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_CustomEvent_Inventory) == 0x0001D8, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_CustomEvent_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_CustomEvent_EquipmentComponent) == 0x0001E0, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_CustomEvent_EquipmentComponent' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext, K2Node_CustomEvent_Item) == 0x0001E8, "Member 'WBP_ItemContext_C_ExecuteUbergraph_WBP_ItemContext::K2Node_CustomEvent_Item' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.GetSelectedLauncherAmmo
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_ItemContext_C_GetSelectedLauncherAmmo final
{
public:
	struct FValeriaItem                           Ammo;                                              // 0x0000(0x0060)(Parm, OutParm)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E66[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E67[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectileFiringComponent*             CallFunc_GetFiringComponent_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           CallFunc_GetSelectedAmmo_ReturnValue;              // 0x0080(0x0060)()
};
static_assert(alignof(WBP_ItemContext_C_GetSelectedLauncherAmmo) == 0x000008, "Wrong alignment on WBP_ItemContext_C_GetSelectedLauncherAmmo");
static_assert(sizeof(WBP_ItemContext_C_GetSelectedLauncherAmmo) == 0x0000E0, "Wrong size on WBP_ItemContext_C_GetSelectedLauncherAmmo");
static_assert(offsetof(WBP_ItemContext_C_GetSelectedLauncherAmmo, Ammo) == 0x000000, "Member 'WBP_ItemContext_C_GetSelectedLauncherAmmo::Ammo' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_GetSelectedLauncherAmmo, CallFunc_GetValeriaCharacter_OutResult) == 0x000060, "Member 'WBP_ItemContext_C_GetSelectedLauncherAmmo::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_GetSelectedLauncherAmmo, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000068, "Member 'WBP_ItemContext_C_GetSelectedLauncherAmmo::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_GetSelectedLauncherAmmo, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'WBP_ItemContext_C_GetSelectedLauncherAmmo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_GetSelectedLauncherAmmo, CallFunc_GetFiringComponent_ReturnValue) == 0x000078, "Member 'WBP_ItemContext_C_GetSelectedLauncherAmmo::CallFunc_GetFiringComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_GetSelectedLauncherAmmo, CallFunc_GetSelectedAmmo_ReturnValue) == 0x000080, "Member 'WBP_ItemContext_C_GetSelectedLauncherAmmo::CallFunc_GetSelectedAmmo_ReturnValue' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.HandleEquipmentChanged
// 0x0058 (0x0058 - 0x0000)
struct WBP_ItemContext_C_HandleEquipmentChanged final
{
public:
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         Item;                                              // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ItemContext_C_HandleEquipmentChanged) == 0x000008, "Wrong alignment on WBP_ItemContext_C_HandleEquipmentChanged");
static_assert(sizeof(WBP_ItemContext_C_HandleEquipmentChanged) == 0x000058, "Wrong size on WBP_ItemContext_C_HandleEquipmentChanged");
static_assert(offsetof(WBP_ItemContext_C_HandleEquipmentChanged, EquipmentComponent) == 0x000000, "Member 'WBP_ItemContext_C_HandleEquipmentChanged::EquipmentComponent' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_HandleEquipmentChanged, Item) == 0x000008, "Member 'WBP_ItemContext_C_HandleEquipmentChanged::Item' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.HandleInventoryChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemContext_C_HandleInventoryChanged final
{
public:
	class UInventoryComponent*                    Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemContext_C_HandleInventoryChanged) == 0x000008, "Wrong alignment on WBP_ItemContext_C_HandleInventoryChanged");
static_assert(sizeof(WBP_ItemContext_C_HandleInventoryChanged) == 0x000008, "Wrong size on WBP_ItemContext_C_HandleInventoryChanged");
static_assert(offsetof(WBP_ItemContext_C_HandleInventoryChanged, Inventory) == 0x000000, "Member 'WBP_ItemContext_C_HandleInventoryChanged::Inventory' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.HandleSelectedAmmo
// 0x0060 (0x0060 - 0x0000)
struct WBP_ItemContext_C_HandleSelectedAmmo final
{
public:
	struct FValeriaItem                           Ammo;                                              // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ItemContext_C_HandleSelectedAmmo) == 0x000008, "Wrong alignment on WBP_ItemContext_C_HandleSelectedAmmo");
static_assert(sizeof(WBP_ItemContext_C_HandleSelectedAmmo) == 0x000060, "Wrong size on WBP_ItemContext_C_HandleSelectedAmmo");
static_assert(offsetof(WBP_ItemContext_C_HandleSelectedAmmo, Ammo) == 0x000000, "Member 'WBP_ItemContext_C_HandleSelectedAmmo::Ammo' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.HandleSelectedBait
// 0x0060 (0x0060 - 0x0000)
struct WBP_ItemContext_C_HandleSelectedBait final
{
public:
	struct FValeriaItem                           Bait;                                              // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ItemContext_C_HandleSelectedBait) == 0x000008, "Wrong alignment on WBP_ItemContext_C_HandleSelectedBait");
static_assert(sizeof(WBP_ItemContext_C_HandleSelectedBait) == 0x000060, "Wrong size on WBP_ItemContext_C_HandleSelectedBait");
static_assert(offsetof(WBP_ItemContext_C_HandleSelectedBait, Bait) == 0x000000, "Member 'WBP_ItemContext_C_HandleSelectedBait::Bait' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.IsAmmo
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_ItemContext_C_IsAmmo final
{
public:
	struct FValeriaItem                           Item;                                              // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bMatch;                                            // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E68[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E69[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E6A[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0088(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemContext_C_IsAmmo) == 0x000008, "Wrong alignment on WBP_ItemContext_C_IsAmmo");
static_assert(sizeof(WBP_ItemContext_C_IsAmmo) == 0x0000A8, "Wrong size on WBP_ItemContext_C_IsAmmo");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, Item) == 0x000000, "Member 'WBP_ItemContext_C_IsAmmo::Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, bMatch) == 0x000060, "Member 'WBP_ItemContext_C_IsAmmo::bMatch' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, Temp_int_Array_Index_Variable) == 0x000064, "Member 'WBP_ItemContext_C_IsAmmo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000068, "Member 'WBP_ItemContext_C_IsAmmo::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000070, "Member 'WBP_ItemContext_C_IsAmmo::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_ItemContext_C_IsAmmo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'WBP_ItemContext_C_IsAmmo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'WBP_ItemContext_C_IsAmmo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000088, "Member 'WBP_ItemContext_C_IsAmmo::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, CallFunc_Array_Get_Item) == 0x000098, "Member 'WBP_ItemContext_C_IsAmmo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'WBP_ItemContext_C_IsAmmo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, CallFunc_MatchesTag_ReturnValue) == 0x0000A4, "Member 'WBP_ItemContext_C_IsAmmo::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsAmmo, CallFunc_Less_IntInt_ReturnValue) == 0x0000A5, "Member 'WBP_ItemContext_C_IsAmmo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.IsCompatibleLauncher
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_ItemContext_C_IsCompatibleLauncher final
{
public:
	struct FValeriaItem                           Item;                                              // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UVAL_ItemTypeDefinitionAsset*           AmmoType;                                          // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bMatch;                                            // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E6B[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E6C[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLauncherConfig                        CallFunc_GetLauncherConfig_ReturnValue;            // 0x0088(0x0058)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemContext_C_IsCompatibleLauncher) == 0x000008, "Wrong alignment on WBP_ItemContext_C_IsCompatibleLauncher");
static_assert(sizeof(WBP_ItemContext_C_IsCompatibleLauncher) == 0x0000E8, "Wrong size on WBP_ItemContext_C_IsCompatibleLauncher");
static_assert(offsetof(WBP_ItemContext_C_IsCompatibleLauncher, Item) == 0x000000, "Member 'WBP_ItemContext_C_IsCompatibleLauncher::Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsCompatibleLauncher, AmmoType) == 0x000060, "Member 'WBP_ItemContext_C_IsCompatibleLauncher::AmmoType' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsCompatibleLauncher, bMatch) == 0x000068, "Member 'WBP_ItemContext_C_IsCompatibleLauncher::bMatch' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsCompatibleLauncher, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'WBP_ItemContext_C_IsCompatibleLauncher::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsCompatibleLauncher, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000070, "Member 'WBP_ItemContext_C_IsCompatibleLauncher::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsCompatibleLauncher, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000078, "Member 'WBP_ItemContext_C_IsCompatibleLauncher::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsCompatibleLauncher, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_ItemContext_C_IsCompatibleLauncher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsCompatibleLauncher, CallFunc_GetLauncherConfig_ReturnValue) == 0x000088, "Member 'WBP_ItemContext_C_IsCompatibleLauncher::CallFunc_GetLauncherConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsCompatibleLauncher, CallFunc_HasAnyTags_ReturnValue) == 0x0000E0, "Member 'WBP_ItemContext_C_IsCompatibleLauncher::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.IsFishingBait
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_ItemContext_C_IsFishingBait final
{
public:
	struct FValeriaItem                           Item;                                              // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bMatch;                                            // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E6D[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E6E[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E6F[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0088(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemContext_C_IsFishingBait) == 0x000008, "Wrong alignment on WBP_ItemContext_C_IsFishingBait");
static_assert(sizeof(WBP_ItemContext_C_IsFishingBait) == 0x0000A8, "Wrong size on WBP_ItemContext_C_IsFishingBait");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, Item) == 0x000000, "Member 'WBP_ItemContext_C_IsFishingBait::Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, bMatch) == 0x000060, "Member 'WBP_ItemContext_C_IsFishingBait::bMatch' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, Temp_int_Array_Index_Variable) == 0x000064, "Member 'WBP_ItemContext_C_IsFishingBait::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000068, "Member 'WBP_ItemContext_C_IsFishingBait::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000070, "Member 'WBP_ItemContext_C_IsFishingBait::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_ItemContext_C_IsFishingBait::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'WBP_ItemContext_C_IsFishingBait::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'WBP_ItemContext_C_IsFishingBait::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000088, "Member 'WBP_ItemContext_C_IsFishingBait::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, CallFunc_Array_Get_Item) == 0x000098, "Member 'WBP_ItemContext_C_IsFishingBait::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'WBP_ItemContext_C_IsFishingBait::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, CallFunc_MatchesTag_ReturnValue) == 0x0000A4, "Member 'WBP_ItemContext_C_IsFishingBait::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingBait, CallFunc_Less_IntInt_ReturnValue) == 0x0000A5, "Member 'WBP_ItemContext_C_IsFishingBait::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.IsFishingRod
// 0x0080 (0x0080 - 0x0000)
struct WBP_ItemContext_C_IsFishingRod final
{
public:
	struct FValeriaItem                           Item;                                              // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bMatch;                                            // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E70[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FNameIsNone_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemContext_C_IsFishingRod) == 0x000008, "Wrong alignment on WBP_ItemContext_C_IsFishingRod");
static_assert(sizeof(WBP_ItemContext_C_IsFishingRod) == 0x000080, "Wrong size on WBP_ItemContext_C_IsFishingRod");
static_assert(offsetof(WBP_ItemContext_C_IsFishingRod, Item) == 0x000000, "Member 'WBP_ItemContext_C_IsFishingRod::Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingRod, bMatch) == 0x000060, "Member 'WBP_ItemContext_C_IsFishingRod::bMatch' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingRod, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000068, "Member 'WBP_ItemContext_C_IsFishingRod::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingRod, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000070, "Member 'WBP_ItemContext_C_IsFishingRod::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingRod, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_ItemContext_C_IsFishingRod::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingRod, CallFunc_FNameIsNone_ReturnValue) == 0x000079, "Member 'WBP_ItemContext_C_IsFishingRod::CallFunc_FNameIsNone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsFishingRod, CallFunc_Not_PreBool_ReturnValue) == 0x00007A, "Member 'WBP_ItemContext_C_IsFishingRod::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.IsLauncher
// 0x0080 (0x0080 - 0x0000)
struct WBP_ItemContext_C_IsLauncher final
{
public:
	struct FValeriaItem                           Item;                                              // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bMatch;                                            // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E71[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLauncher_ReturnValue;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemContext_C_IsLauncher) == 0x000008, "Wrong alignment on WBP_ItemContext_C_IsLauncher");
static_assert(sizeof(WBP_ItemContext_C_IsLauncher) == 0x000080, "Wrong size on WBP_ItemContext_C_IsLauncher");
static_assert(offsetof(WBP_ItemContext_C_IsLauncher, Item) == 0x000000, "Member 'WBP_ItemContext_C_IsLauncher::Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsLauncher, bMatch) == 0x000060, "Member 'WBP_ItemContext_C_IsLauncher::bMatch' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsLauncher, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000068, "Member 'WBP_ItemContext_C_IsLauncher::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsLauncher, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000070, "Member 'WBP_ItemContext_C_IsLauncher::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsLauncher, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_ItemContext_C_IsLauncher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_IsLauncher, CallFunc_IsLauncher_ReturnValue) == 0x000079, "Member 'WBP_ItemContext_C_IsLauncher::CallFunc_IsLauncher_ReturnValue' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.Refresh
// 0x0005 (0x0005 - 0x0000)
struct WBP_ItemContext_C_Refresh final
{
public:
	bool                                          CallFunc_ItemIsEmpty_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFishingRod_bMatch;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFishingBait_bMatch;                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAmmo_bMatch;                            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLauncher_bMatch;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemContext_C_Refresh) == 0x000001, "Wrong alignment on WBP_ItemContext_C_Refresh");
static_assert(sizeof(WBP_ItemContext_C_Refresh) == 0x000005, "Wrong size on WBP_ItemContext_C_Refresh");
static_assert(offsetof(WBP_ItemContext_C_Refresh, CallFunc_ItemIsEmpty_ReturnValue) == 0x000000, "Member 'WBP_ItemContext_C_Refresh::CallFunc_ItemIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_Refresh, CallFunc_IsFishingRod_bMatch) == 0x000001, "Member 'WBP_ItemContext_C_Refresh::CallFunc_IsFishingRod_bMatch' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_Refresh, CallFunc_IsFishingBait_bMatch) == 0x000002, "Member 'WBP_ItemContext_C_Refresh::CallFunc_IsFishingBait_bMatch' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_Refresh, CallFunc_IsAmmo_bMatch) == 0x000003, "Member 'WBP_ItemContext_C_Refresh::CallFunc_IsAmmo_bMatch' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_Refresh, CallFunc_IsLauncher_bMatch) == 0x000004, "Member 'WBP_ItemContext_C_Refresh::CallFunc_IsLauncher_bMatch' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.SetItem
// 0x0068 (0x0068 - 0x0000)
struct WBP_ItemContext_C_SetItem final
{
public:
	struct FValeriaItem                           Item;                                              // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UVAL_ItemTypeDefinitionAsset*           ItemType;                                          // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemContext_C_SetItem) == 0x000008, "Wrong alignment on WBP_ItemContext_C_SetItem");
static_assert(sizeof(WBP_ItemContext_C_SetItem) == 0x000068, "Wrong size on WBP_ItemContext_C_SetItem");
static_assert(offsetof(WBP_ItemContext_C_SetItem, Item) == 0x000000, "Member 'WBP_ItemContext_C_SetItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetItem, ItemType) == 0x000060, "Member 'WBP_ItemContext_C_SetItem::ItemType' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.SetItemIcon
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_ItemContext_C_SetItemIcon final
{
public:
	struct FValeriaItem                           Item;                                              // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bShowAmount;                                       // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E72[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E73[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E74[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0088(0x0018)()
	bool                                          CallFunc_ItemIsEmpty_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemContext_C_SetItemIcon) == 0x000008, "Wrong alignment on WBP_ItemContext_C_SetItemIcon");
static_assert(sizeof(WBP_ItemContext_C_SetItemIcon) == 0x0000A8, "Wrong size on WBP_ItemContext_C_SetItemIcon");
static_assert(offsetof(WBP_ItemContext_C_SetItemIcon, Item) == 0x000000, "Member 'WBP_ItemContext_C_SetItemIcon::Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetItemIcon, bShowAmount) == 0x000060, "Member 'WBP_ItemContext_C_SetItemIcon::bShowAmount' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetItemIcon, CallFunc_Greater_IntInt_ReturnValue) == 0x000061, "Member 'WBP_ItemContext_C_SetItemIcon::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetItemIcon, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000068, "Member 'WBP_ItemContext_C_SetItemIcon::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetItemIcon, CallFunc_BooleanAND_ReturnValue) == 0x000070, "Member 'WBP_ItemContext_C_SetItemIcon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetItemIcon, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000078, "Member 'WBP_ItemContext_C_SetItemIcon::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetItemIcon, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_ItemContext_C_SetItemIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetItemIcon, CallFunc_Conv_IntToText_ReturnValue) == 0x000088, "Member 'WBP_ItemContext_C_SetItemIcon::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetItemIcon, CallFunc_ItemIsEmpty_ReturnValue) == 0x0000A0, "Member 'WBP_ItemContext_C_SetItemIcon::CallFunc_ItemIsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.SetToFishingBait
// 0x0080 (0x0080 - 0x0000)
struct WBP_ItemContext_C_SetToFishingBait final
{
public:
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E75[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E76[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFishingComponent*                      CallFunc_GetFishing_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           CallFunc_GetSelectedBait_ReturnValue;              // 0x0020(0x0060)()
};
static_assert(alignof(WBP_ItemContext_C_SetToFishingBait) == 0x000008, "Wrong alignment on WBP_ItemContext_C_SetToFishingBait");
static_assert(sizeof(WBP_ItemContext_C_SetToFishingBait) == 0x000080, "Wrong size on WBP_ItemContext_C_SetToFishingBait");
static_assert(offsetof(WBP_ItemContext_C_SetToFishingBait, CallFunc_GetValeriaCharacter_OutResult) == 0x000000, "Member 'WBP_ItemContext_C_SetToFishingBait::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetToFishingBait, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_ItemContext_C_SetToFishingBait::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetToFishingBait, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_ItemContext_C_SetToFishingBait::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetToFishingBait, CallFunc_GetFishing_ReturnValue) == 0x000018, "Member 'WBP_ItemContext_C_SetToFishingBait::CallFunc_GetFishing_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemContext_C_SetToFishingBait, CallFunc_GetSelectedBait_ReturnValue) == 0x000020, "Member 'WBP_ItemContext_C_SetToFishingBait::CallFunc_GetSelectedBait_ReturnValue' has a wrong offset!");

// Function WBP_ItemContext.WBP_ItemContext_C.SetToFishingTool
// 0x0120 (0x0120 - 0x0000)
struct WBP_ItemContext_C_SetToFishingTool final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E77[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFishingComponent*                      CallFunc_GetFishing_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBagSlotLocation>               CallFunc_GetToolsForToolWheel_ReturnValue;         // 0x0028(0x0010)(ReferenceParm)
