#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_Button_ColorPicker_01_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Template_Button_ColorPicker_01_CM.WBP_Template_Button_ColorPicker_01_CM_C
// 0x0068 (0x0350 - 0x02E8)
class UWBP_Template_Button_ColorPicker_01_CM_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_CM_C*              Button;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PrimaryColor;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SecondaryColor;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FocusTip_CM_C*                     WBP_FocusTip_CM;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           PrimaryColor;                                      // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           SecondaryColor;                                    // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_56C6[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnButtonClicked;                                   // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Param_Button);
	void BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Param_Button);
	void ExecuteUbergraph_WBP_Template_Button_ColorPicker_01_CM(int32 EntryPoint, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, bool K2Node_Event_IsDesignTime, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1);
	void OnButtonClicked__DelegateSignature(class UWBP_Template_Button_ColorPicker_01_CM_C* Param_Button);
	void PreConstruct(bool IsDesignTime);
	void SetColors(const struct FLinearColor& Color1, const struct FLinearColor& Color2);
	void SetIsSelected(bool Param_Selected, const struct FButtonStyle& NewLocalVar_0);
	void UpdateSelectedStyle(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Template_Button_ColorPicker_01_CM_C">();
	}
	static class UWBP_Template_Button_ColorPicker_01_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Template_Button_ColorPicker_01_CM_C>();
	}
};
static_assert(alignof(UWBP_Template_Button_ColorPicker_01_CM_C) == 0x000008, "Wrong alignment on UWBP_Template_Button_ColorPicker_01_CM_C");
static_assert(sizeof(UWBP_Template_Button_ColorPicker_01_CM_C) == 0x000350, "Wrong size on UWBP_Template_Button_ColorPicker_01_CM_C");
static_assert(offsetof(UWBP_Template_Button_ColorPicker_01_CM_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_Template_Button_ColorPicker_01_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_ColorPicker_01_CM_C, Button) == 0x0002F0, "Member 'UWBP_Template_Button_ColorPicker_01_CM_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_ColorPicker_01_CM_C, Image_PrimaryColor) == 0x0002F8, "Member 'UWBP_Template_Button_ColorPicker_01_CM_C::Image_PrimaryColor' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_ColorPicker_01_CM_C, Image_SecondaryColor) == 0x000300, "Member 'UWBP_Template_Button_ColorPicker_01_CM_C::Image_SecondaryColor' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_ColorPicker_01_CM_C, Image_Selected) == 0x000308, "Member 'UWBP_Template_Button_ColorPicker_01_CM_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_ColorPicker_01_CM_C, WBP_FocusTip_CM) == 0x000310, "Member 'UWBP_Template_Button_ColorPicker_01_CM_C::WBP_FocusTip_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_ColorPicker_01_CM_C, PrimaryColor) == 0x000318, "Member 'UWBP_Template_Button_ColorPicker_01_CM_C::PrimaryColor' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_ColorPicker_01_CM_C, SecondaryColor) == 0x000328, "Member 'UWBP_Template_Button_ColorPicker_01_CM_C::SecondaryColor' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_ColorPicker_01_CM_C, Selected) == 0x000338, "Member 'UWBP_Template_Button_ColorPicker_01_CM_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_ColorPicker_01_CM_C, OnButtonClicked) == 0x000340, "Member 'UWBP_Template_Button_ColorPicker_01_CM_C::OnButtonClicked' has a wrong offset!");

}

