#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PetsBonusReceived_ModalWidget_CM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_PetsBonusReceived_ModalWidget_CM.WBP_PetsBonusReceived_ModalWidget_CM_C.CloseSelf
// 0x0010 (0x0010 - 0x0000)
struct WBP_PetsBonusReceived_ModalWidget_CM_C_CloseSelf final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PetsBonusReceived_ModalWidget_CM_C_CloseSelf) == 0x000008, "Wrong alignment on WBP_PetsBonusReceived_ModalWidget_CM_C_CloseSelf");
static_assert(sizeof(WBP_PetsBonusReceived_ModalWidget_CM_C_CloseSelf) == 0x000010, "Wrong size on WBP_PetsBonusReceived_ModalWidget_CM_C_CloseSelf");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_CloseSelf, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_CloseSelf::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_CloseSelf, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_CloseSelf::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_PetsBonusReceived_ModalWidget_CM.WBP_PetsBonusReceived_ModalWidget_CM_C.ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM
// 0x0080 (0x0080 - 0x0000)
struct WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47D2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PetImage_C*                        CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47D3[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Pet> CallFunc_Array_Get_Item;                           // 0x0020(0x0028)(HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47D4[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetItemIdFromItem_OutId;                  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemIdFromItem_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47D5[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM) == 0x000008, "Wrong alignment on WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM");
static_assert(sizeof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM) == 0x000080, "Wrong size on WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, EntryPoint) == 0x000000, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000048, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, CallFunc_GetItemIdFromItem_OutId) == 0x000058, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::CallFunc_GetItemIdFromItem_OutId' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, CallFunc_GetItemIdFromItem_ReturnValue) == 0x000068, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::CallFunc_GetItemIdFromItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, CallFunc_GetValeriaPlayerController_OutResult) == 0x000069, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000070, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'WBP_PetsBonusReceived_ModalWidget_CM_C_ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

