#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AccessibilitySettings_PF

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "Palia_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.BndEvt__WBP_AccessibilitySettings_PF_Checkbox_CameraAssist_CM_K2Node_ComponentBoundEvent_1_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_CameraAssist_CM_K2Node_ComponentBoundEvent_1_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_CameraAssist_CM_K2Node_ComponentBoundEvent_1_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_CameraAssist_CM_K2Node_ComponentBoundEvent_1_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_CameraAssist_CM_K2Node_ComponentBoundEvent_1_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_CameraAssist_CM_K2Node_ComponentBoundEvent_1_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_CameraAssist_CM_K2Node_ComponentBoundEvent_1_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_CameraAssist_CM_K2Node_ComponentBoundEvent_1_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.BndEvt__WBP_AccessibilitySettings_PF_Checkbox_SubtitlesForCinematics_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_SubtitlesForCinematics_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_SubtitlesForCinematics_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_SubtitlesForCinematics_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_SubtitlesForCinematics_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_SubtitlesForCinematics_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_SubtitlesForCinematics_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_Checkbox_SubtitlesForCinematics_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.BndEvt__WBP_AccessibilitySettings_PF_ComboBox_FontSize_CM_K2Node_ComponentBoundEvent_13_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_FontSize_CM_K2Node_ComponentBoundEvent_13_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_FontSize_CM_K2Node_ComponentBoundEvent_13_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_FontSize_CM_K2Node_ComponentBoundEvent_13_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_FontSize_CM_K2Node_ComponentBoundEvent_13_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_FontSize_CM_K2Node_ComponentBoundEvent_13_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_FontSize_CM_K2Node_ComponentBoundEvent_13_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_FontSize_CM_K2Node_ComponentBoundEvent_13_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDBackground_CM_K2Node_ComponentBoundEvent_8_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDBackground_CM_K2Node_ComponentBoundEvent_8_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDBackground_CM_K2Node_ComponentBoundEvent_8_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDBackground_CM_K2Node_ComponentBoundEvent_8_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDBackground_CM_K2Node_ComponentBoundEvent_8_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDBackground_CM_K2Node_ComponentBoundEvent_8_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDBackground_CM_K2Node_ComponentBoundEvent_8_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDBackground_CM_K2Node_ComponentBoundEvent_8_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDColorblindModes_CM_K2Node_ComponentBoundEvent_11_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDColorblindModes_CM_K2Node_ComponentBoundEvent_11_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDColorblindModes_CM_K2Node_ComponentBoundEvent_11_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDColorblindModes_CM_K2Node_ComponentBoundEvent_11_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDColorblindModes_CM_K2Node_ComponentBoundEvent_11_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDColorblindModes_CM_K2Node_ComponentBoundEvent_11_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDColorblindModes_CM_K2Node_ComponentBoundEvent_11_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDColorblindModes_CM_K2Node_ComponentBoundEvent_11_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDOpacity_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDOpacity_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDOpacity_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDOpacity_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDOpacity_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDOpacity_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDOpacity_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDOpacity_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDOpacity_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_HUDOpacity_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesBackground_CM_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesBackground_CM_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesBackground_CM_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesBackground_CM_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesBackground_CM_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesBackground_CM_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesBackground_CM_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesBackground_CM_K2Node_ComponentBoundEvent_6_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesColor_CM_K2Node_ComponentBoundEvent_4_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesColor_CM_K2Node_ComponentBoundEvent_4_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesColor_CM_K2Node_ComponentBoundEvent_4_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesColor_CM_K2Node_ComponentBoundEvent_4_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesColor_CM_K2Node_ComponentBoundEvent_4_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesColor_CM_K2Node_ComponentBoundEvent_4_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesColor_CM_K2Node_ComponentBoundEvent_4_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesColor_CM_K2Node_ComponentBoundEvent_4_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesSize_CM_K2Node_ComponentBoundEvent_2_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesSize_CM_K2Node_ComponentBoundEvent_2_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesSize_CM_K2Node_ComponentBoundEvent_2_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesSize_CM_K2Node_ComponentBoundEvent_2_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesSize_CM_K2Node_ComponentBoundEvent_2_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesSize_CM_K2Node_ComponentBoundEvent_2_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesSize_CM_K2Node_ComponentBoundEvent_2_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_BndEvt__WBP_AccessibilitySettings_PF_ComboBox_SubtitlesSize_CM_K2Node_ComponentBoundEvent_2_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On Tab Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Tab_Selection;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on WBP_AccessibilitySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature, Tab_Selection) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature::Tab_Selection' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.Display GamePad Icon
// 0x0001 (0x0001 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_Display_GamePad_Icon final
{
public:
	bool                                          IsShowIcon;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_Display_GamePad_Icon) == 0x000001, "Wrong alignment on WBP_AccessibilitySettings_PF_C_Display_GamePad_Icon");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_Display_GamePad_Icon) == 0x000001, "Wrong size on WBP_AccessibilitySettings_PF_C_Display_GamePad_Icon");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_Display_GamePad_Icon, IsShowIcon) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_Display_GamePad_Icon::IsShowIcon' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.ExecuteUbergraph_WBP_AccessibilitySettings_PF
// 0x0210 (0x0210 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0010(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54CA[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54CB[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54CC[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0088(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54CD[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54CE[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_HUDOpacity                               Temp_byte_Variable;                                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_HUDOpacity                               Temp_byte_Variable_1;                              // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_HUDOpacity                               Temp_byte_Variable_2;                              // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54CF[0x1];                                     // 0x00F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   CallFunc_Get_Focus_Widget_SettingsItem;            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Tab_Selection;          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D0[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   CallFunc_Get_Focus_Widget_SettingsItem_1;          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D1[0x2];                                     // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D2[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D3[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D4[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5;                              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked_1;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D5[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D6[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0170(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0198(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D7[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox_5;        // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox_4;        // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox_3;        // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox_2;        // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox_1;        // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox;          // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D8[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x01F0(0x0018)()
	EVAL_HUDOpacity                               K2Node_Select_Default;                             // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF) == 0x000008, "Wrong alignment on WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF) == 0x000210, "Wrong size on WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, EntryPoint) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000008, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000010, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000030, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000034, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000038, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_object_Variable) == 0x000040, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000048, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable) == 0x000050, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable_1) == 0x000058, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable_0) == 0x000060, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable_1_0) == 0x000068, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_bool_Variable) == 0x000070, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000078, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_GetCurrentInputType_ReturnValue) == 0x000080, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000088, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x0000A8, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x0000AC, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0000B0, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_SwitchEnum_CmpSuccess) == 0x0000B8, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000B9, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_object_Variable_1) == 0x0000C0, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable_2) == 0x0000C8, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable_2_0) == 0x0000D0, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable_3) == 0x0000D8, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_bool_Variable_1) == 0x0000E0, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable_3_0) == 0x0000E8, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_int_Variable) == 0x0000F0, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_byte_Variable) == 0x0000F4, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_byte_Variable_1) == 0x0000F5, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_byte_Variable_2) == 0x0000F6, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_Get_Focus_Widget_SettingsItem) == 0x0000F8, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_Get_Focus_Widget_SettingsItem' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_ComponentBoundEvent_Tab_Selection) == 0x000100, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_ComponentBoundEvent_Tab_Selection' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_Get_Focus_Widget_SettingsItem_1) == 0x000108, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_Get_Focus_Widget_SettingsItem_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_CustomEvent_bNewInputType) == 0x000110, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_SwitchEnum_CmpSuccess_1) == 0x000111, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_CreateDelegate_OutputDelegate) == 0x000114, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_bool_Variable_2) == 0x000124, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_GetActiveWidget_ReturnValue) == 0x000128, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000130, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000131, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable_4) == 0x000138, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000140, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable_5) == 0x000148, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_ComponentBoundEvent_Checked_1) == 0x000150, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_ComponentBoundEvent_Checked_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_object_Variable_2) == 0x000158, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_ComponentBoundEvent_Checked) == 0x000160, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_ComponentBoundEvent_Checked' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue_1) == 0x000168, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000170, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000190, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x000194, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x000198, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable_5_0) == 0x0001A0, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable_5_0' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, Temp_real_Variable_4_0) == 0x0001A8, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue_2) == 0x0001B0, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_ComponentBoundEvent_OpenedDropBox_5) == 0x0001B8, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_ComponentBoundEvent_OpenedDropBox_5' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_ComponentBoundEvent_OpenedDropBox_4) == 0x0001C0, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_ComponentBoundEvent_OpenedDropBox_4' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_ComponentBoundEvent_OpenedDropBox_3) == 0x0001C8, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_ComponentBoundEvent_OpenedDropBox_3' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_ComponentBoundEvent_OpenedDropBox_2) == 0x0001D0, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_ComponentBoundEvent_OpenedDropBox_2' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_ComponentBoundEvent_OpenedDropBox_1) == 0x0001D8, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_ComponentBoundEvent_OpenedDropBox_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_ComponentBoundEvent_OpenedDropBox) == 0x0001E0, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_ComponentBoundEvent_OpenedDropBox' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_ComponentBoundEvent_Index) == 0x0001E8, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_ComponentBoundEvent_Text) == 0x0001F0, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF, K2Node_Select_Default) == 0x000208, "Member 'WBP_AccessibilitySettings_PF_C_ExecuteUbergraph_WBP_AccessibilitySettings_PF::K2Node_Select_Default' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.Get Focus Widget
// 0x0028 (0x0028 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_Get_Focus_Widget final
{
public:
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   SettingsItem;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   CallFunc_GetFocusWidgetFromTab_FocusWidget;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   CallFunc_GetFocusWidgetFromTab_FocusWidget_1;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   CallFunc_GetFocusWidgetFromTab_FocusWidget_2;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AccessibilitySettings_PF_C_Get_Focus_Widget) == 0x000008, "Wrong alignment on WBP_AccessibilitySettings_PF_C_Get_Focus_Widget");
static_assert(sizeof(WBP_AccessibilitySettings_PF_C_Get_Focus_Widget) == 0x000028, "Wrong size on WBP_AccessibilitySettings_PF_C_Get_Focus_Widget");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_Get_Focus_Widget, SettingsItem) == 0x000000, "Member 'WBP_AccessibilitySettings_PF_C_Get_Focus_Widget::SettingsItem' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_Get_Focus_Widget, CallFunc_GetFocusWidgetFromTab_FocusWidget) == 0x000008, "Member 'WBP_AccessibilitySettings_PF_C_Get_Focus_Widget::CallFunc_GetFocusWidgetFromTab_FocusWidget' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_Get_Focus_Widget, CallFunc_GetFocusWidgetFromTab_FocusWidget_1) == 0x000010, "Member 'WBP_AccessibilitySettings_PF_C_Get_Focus_Widget::CallFunc_GetFocusWidgetFromTab_FocusWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_Get_Focus_Widget, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000018, "Member 'WBP_AccessibilitySettings_PF_C_Get_Focus_Widget::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_Get_Focus_Widget, K2Node_SwitchInteger_CmpSuccess) == 0x00001C, "Member 'WBP_AccessibilitySettings_PF_C_Get_Focus_Widget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_AccessibilitySettings_PF_C_Get_Focus_Widget, CallFunc_GetFocusWidgetFromTab_FocusWidget_2) == 0x000020, "Member 'WBP_AccessibilitySettings_PF_C_Get_Focus_Widget::CallFunc_GetFocusWidgetFromTab_FocusWidget_2' has a wrong offset!");

// Function WBP_AccessibilitySettings_PF.WBP_AccessibilitySettings_PF_C.GetFocusWidgetFromTab
// 0x0058 (0x0058 - 0x0000)
struct WBP_AccessibilitySettings_PF_C_GetFocusWidgetFromTab final
{
public:
	class UVALUI_ScrollBox_Styled*                Scrollbar_Widget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   DefaultFocusWidget;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   FocusWidget;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54DA[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54DB[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
