#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoginScreen_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoginScreen_CM.WBP_LoginScreen_CM_C
// 0x01C8 (0x06D8 - 0x0510)
class UWBP_LoginScreen_CM_C final : public UCommonActivatableWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ErrorBoing;                                        // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVALUI_Border_Styled*                   BorderStyled_CapsLockWarning;                      // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WBP_TextButton_CM_0::UWBP_TextButton_CM_C* BTN_ResetPassword;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Secondary_01_CM_C* Button_Back;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_LoginWait;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Primary_Login;                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WBP_TextButton_CM_0::UWBP_TextButton_CM_C* CreateButton;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CreateButtonTextBox;                               // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Container;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_151;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeftArrow;                                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RightArrow;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_EditableTextBox_Styled*          PasswordInputBox;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Checkmark_CM_C*                    PasswordRevealCheckmark;                           // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_LoginError;                                // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_LoginWait;                                 // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Error;                                        // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Header;                                       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_EditableTextBox_Styled*          UsernameInputBox;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Notification_Basic_Error_C* WBP_Template_Notification_Basic_Error;             // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_LoginButton;                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             LoginScreen_LogInFailure;                          // 0x05C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Reset_Clicked;                                     // 0x05D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         AkID;                                              // 0x05E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DEE[0x4];                                     // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  InputErrorTextStyle;                               // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   PrevText;                                          // 0x05F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   NewText;                                           // 0x0608(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   InText;                                            // 0x0620(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SpamPrevent_1;                                     // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpamPrevent_2;                                     // 0x0639(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DEF[0x6];                                     // 0x063A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LoginLoadingText;                                  // 0x0640(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LoginTimerText;                                    // 0x0658(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CurrentlyLoggingIn;                                // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DF0[0x7];                                     // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LoginWaitTimer;                                    // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoginWaitTries;                                    // 0x0680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DF1[0x4];                                     // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LoginWaitIntervalMax;                              // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LoginWaitIntervalBase;                             // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LoginWaitIntervalJitter;                           // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                HoveredInputBox;                                   // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HideLoginHeader;                                   // 0x06A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowGameLobbyAfterLogin;                           // 0x06A9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DF2[0x6];                                     // 0x06AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnBackClicked;                                     // 0x06B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ShowBackButton;                                    // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomLogin;                                       // 0x06C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DF3[0x6];                                     // 0x06C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPreLogin;                                        // 0x06C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent, const struct FKey& CallFunc_GetKey_ReturnValue, const struct FEventReply& CallFunc_Unhandled_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void HandleMoveToNextField(bool CallFunc_HasKeyboardFocus_ReturnValue);
	void EnableLoginButton(bool IsEnabled);
	void Compute_Login_Wait_Timer(double NewLoginWaitTimer, double CallFunc_Multiply_DoubleDouble_ReturnValue, int32 Temp_int_Variable, double CallFunc_RandomFloatInRange_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_FClamp_ReturnValue, bool CallFunc_EqualEqual_DoubleDouble_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue);
	void DisplayLoginWait(class FText Text);
	void HandleLoginFailure(const class FString& Error_Message, int32 Error_Code, class FText CallFunc_GetErrorTextFromError_Text, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	ESlateVisibility Get_BorderStyled_CapsLockWarning_Visibility_0(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool CallFunc_AreCapsLocked_ReturnValue, ESlateVisibility K2Node_Select_Default);
	void GetErrorTextFromError(int32 ErrorCode, const class FString& ErrorMessage, class FText* Text, class FText ErrorText, class FText CallFunc_Conv_StringToText_ReturnValue, bool CallFunc_Contains_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, int64 CallFunc_Conv_IntToInt64_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, bool CallFunc_Contains_ReturnValue_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue_2, bool CallFunc_EqualEqual_IntInt_ReturnValue_3, bool CallFunc_EqualEqual_IntInt_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_5, bool CallFunc_Contains_ReturnValue_2, bool CallFunc_Contains_ReturnValue_3, class FText CallFunc_Format_ReturnValue);
	void Login_Player(const class FString& AccountUsername, const class FString& Password, bool IsPasswordEmpty, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, class UWBP_PregameUIManager_C* K2Node_DynamicCast_AsWBP_Pregame_UIManager, bool K2Node_DynamicCast_bSuccess, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UWidget* CallFunc_GetActiveWidget_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, int32 CallFunc_Len_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2);
	void OnLoginFailure(const class FString& ErrorMessage, int32 ErrorCode);
	void BndEvt__PasswordInputBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature(class FText& Text, ETextCommit CommitMethod);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature(class FText& Text);
	void BndEvt__WBP_LoginScreen_PasswordInputBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature(class FText& Text);
	void BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature(class FText& Text, ETextCommit CommitMethod);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnClientLoggedIn();
	void BndEvt__WBP_LoginScreen_CM_CreateButton_K2Node_ComponentBoundEvent_4_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_LoginScreen_CM_CreateButton_K2Node_ComponentBoundEvent_5_ButtonHovered__DelegateSignature();
	void BndEvt__WBP_LoginScreen_CM_BTN_ResetPassword_K2Node_ComponentBoundEvent_8_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_LoginScreen_CM_BTN_ResetPassword_K2Node_ComponentBoundEvent_9_ButtonHovered__DelegateSignature();
	void BndEvt__WBP_LoginScreen_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature(bool Checked);
	void BndEvt__WBP_LoginScreen_CM_Button_Primary_Login_K2Node_ComponentBoundEvent_2_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_LoginScreen_CM_Button_Primary_Login_K2Node_ComponentBoundEvent_12_ButtonHovered__DelegateSignature();
	void BndEvt__WBP_LoginScreen_CM_Button_Back_K2Node_ComponentBoundEvent_7_OnButtonClicked__DelegateSignature();
	void OnPreLogin__DelegateSignature();
	void OnBackClicked__DelegateSignature();
	void Reset_Clicked__DelegateSignature();
	void LoginScreen_LogInFailure__DelegateSignature();
	void ExecuteUbergraph_WBP_LoginScreen_CM(int32 EntryPoint, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool Temp_bool_IsClosed_Variable, TDelegate<void(const class FString& ErrorMessage, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate, bool Temp_bool_Has_Been_Initd_Variable, const class FString& K2Node_CustomEvent_ErrorMessage, int32 K2Node_CustomEvent_ErrorCode, class FText CallFunc_GetText_ReturnValue, class FText CallFunc_GetText_ReturnValue_1, const class FString& CallFunc_Conv_TextToString_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, const class FString& CallFunc_TryGetCommandlineKeyValuePair_Value, bool CallFunc_TryGetCommandlineKeyValuePair_ReturnValue, const class FString& CallFunc_TryGetCommandlineKeyValuePair_Value_1, bool CallFunc_TryGetCommandlineKeyValuePair_ReturnValue_1, class FText K2Node_ComponentBoundEvent_Text_3, ETextCommit K2Node_ComponentBoundEvent_CommitMethod_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool K2Node_Event_IsDesignTime, int32 CallFunc_AkEventGlobal_ReturnValue, class FText K2Node_ComponentBoundEvent_Text_2, class FText K2Node_ComponentBoundEvent_Text_1, class FText K2Node_ComponentBoundEvent_Text, ETextCommit K2Node_ComponentBoundEvent_CommitMethod, int32 CallFunc_AkEventGlobal_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_2, int32 CallFunc_AkEventGlobal_ReturnValue_3, int32 CallFunc_AkEventGlobal_ReturnValue_4, int32 CallFunc_AkEventGlobal_ReturnValue_5, const class FString& CallFunc_Conv_TextToString_ReturnValue_2, const class FString& CallFunc_Conv_TextToString_ReturnValue_3, bool CallFunc_EndsWith_ReturnValue, int32 CallFunc_Len_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue_4, int32 CallFunc_Len_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, int32 CallFunc_AkEventGlobal_ReturnValue_6, int32 CallFunc_AkEventGlobal_ReturnValue_7, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_8, int32 CallFunc_AkEventGlobal_ReturnValue_9, bool CallFunc_IsHovered_ReturnValue, bool CallFunc_IsHovered_ReturnValue_1, bool Temp_bool_IsClosed_Variable_1, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_10, int32 CallFunc_AkEventGlobal_ReturnValue_11, bool Temp_bool_Has_Been_Initd_Variable_1, bool CallFunc_Not_PreBool_ReturnValue, const class FString& Temp_string_Variable, class UWidget* CallFunc_GetActiveWidget_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, const class FString& K2Node_Select_Default, class FText CallFunc_Conv_StringToText_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, int64 CallFunc_Conv_IntToInt64_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_12, int32 CallFunc_AkEventGlobal_ReturnValue_13, int32 CallFunc_AkEventGlobal_ReturnValue_14, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue, const class FString& K2Node_Select_Default_1, class FText CallFunc_Conv_StringToText_ReturnValue_1, bool K2Node_ComponentBoundEvent_Checked, bool CallFunc_Not_PreBool_ReturnValue_2, ESlateVisibility K2Node_Select_Default_2, ESlateVisibility K2Node_Select_Default_3, double CallFunc_Subtract_DoubleDouble_B_ImplicitCast);

	void IsFocused(class UWidget* In, bool* Out, bool CallFunc_HasAnyUserFocus_ReturnValue, bool CallFunc_HasFocusedDescendants_ReturnValue, bool CallFunc_GetIsEnabled_ReturnValue, bool CallFunc_BooleanOR_ReturnValue) const;
	void Get_Focued_Child_Widget(class UWidget** Out, bool CallFunc_IsFocused_out, bool CallFunc_IsFocused_out_1, bool CallFunc_IsFocused_out_2, bool CallFunc_IsFocused_out_3, bool CallFunc_IsFocused_out_4) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoginScreen_CM_C">();
	}
	static class UWBP_LoginScreen_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoginScreen_CM_C>();
	}
};
static_assert(alignof(UWBP_LoginScreen_CM_C) == 0x000008, "Wrong alignment on UWBP_LoginScreen_CM_C");
static_assert(sizeof(UWBP_LoginScreen_CM_C) == 0x0006D8, "Wrong size on UWBP_LoginScreen_CM_C");
static_assert(offsetof(UWBP_LoginScreen_CM_C, UberGraphFrame) == 0x000510, "Member 'UWBP_LoginScreen_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, ErrorBoing) == 0x000518, "Member 'UWBP_LoginScreen_CM_C::ErrorBoing' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, BorderStyled_CapsLockWarning) == 0x000520, "Member 'UWBP_LoginScreen_CM_C::BorderStyled_CapsLockWarning' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, BTN_ResetPassword) == 0x000528, "Member 'UWBP_LoginScreen_CM_C::BTN_ResetPassword' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, Button_Back) == 0x000530, "Member 'UWBP_LoginScreen_CM_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, Button_LoginWait) == 0x000538, "Member 'UWBP_LoginScreen_CM_C::Button_LoginWait' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, Button_Primary_Login) == 0x000540, "Member 'UWBP_LoginScreen_CM_C::Button_Primary_Login' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, CreateButton) == 0x000548, "Member 'UWBP_LoginScreen_CM_C::CreateButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, CreateButtonTextBox) == 0x000550, "Member 'UWBP_LoginScreen_CM_C::CreateButtonTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, HBox_Container) == 0x000558, "Member 'UWBP_LoginScreen_CM_C::HBox_Container' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, Image_151) == 0x000560, "Member 'UWBP_LoginScreen_CM_C::Image_151' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, Image_LeftArrow) == 0x000568, "Member 'UWBP_LoginScreen_CM_C::Image_LeftArrow' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, Image_RightArrow) == 0x000570, "Member 'UWBP_LoginScreen_CM_C::Image_RightArrow' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, PasswordInputBox) == 0x000578, "Member 'UWBP_LoginScreen_CM_C::PasswordInputBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, PasswordRevealCheckmark) == 0x000580, "Member 'UWBP_LoginScreen_CM_C::PasswordRevealCheckmark' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, SizeBox_LoginError) == 0x000588, "Member 'UWBP_LoginScreen_CM_C::SizeBox_LoginError' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, SizeBox_LoginWait) == 0x000590, "Member 'UWBP_LoginScreen_CM_C::SizeBox_LoginWait' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, Text_Error) == 0x000598, "Member 'UWBP_LoginScreen_CM_C::Text_Error' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, Text_Header) == 0x0005A0, "Member 'UWBP_LoginScreen_CM_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, UsernameInputBox) == 0x0005A8, "Member 'UWBP_LoginScreen_CM_C::UsernameInputBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, WBP_Template_Notification_Basic_Error) == 0x0005B0, "Member 'UWBP_LoginScreen_CM_C::WBP_Template_Notification_Basic_Error' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, WidgetSwitcher_LoginButton) == 0x0005B8, "Member 'UWBP_LoginScreen_CM_C::WidgetSwitcher_LoginButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, LoginScreen_LogInFailure) == 0x0005C0, "Member 'UWBP_LoginScreen_CM_C::LoginScreen_LogInFailure' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, Reset_Clicked) == 0x0005D0, "Member 'UWBP_LoginScreen_CM_C::Reset_Clicked' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, AkID) == 0x0005E0, "Member 'UWBP_LoginScreen_CM_C::AkID' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, InputErrorTextStyle) == 0x0005E8, "Member 'UWBP_LoginScreen_CM_C::InputErrorTextStyle' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, PrevText) == 0x0005F0, "Member 'UWBP_LoginScreen_CM_C::PrevText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, NewText) == 0x000608, "Member 'UWBP_LoginScreen_CM_C::NewText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, InText) == 0x000620, "Member 'UWBP_LoginScreen_CM_C::InText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, SpamPrevent_1) == 0x000638, "Member 'UWBP_LoginScreen_CM_C::SpamPrevent_1' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, SpamPrevent_2) == 0x000639, "Member 'UWBP_LoginScreen_CM_C::SpamPrevent_2' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, LoginLoadingText) == 0x000640, "Member 'UWBP_LoginScreen_CM_C::LoginLoadingText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, LoginTimerText) == 0x000658, "Member 'UWBP_LoginScreen_CM_C::LoginTimerText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, CurrentlyLoggingIn) == 0x000670, "Member 'UWBP_LoginScreen_CM_C::CurrentlyLoggingIn' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, LoginWaitTimer) == 0x000678, "Member 'UWBP_LoginScreen_CM_C::LoginWaitTimer' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, LoginWaitTries) == 0x000680, "Member 'UWBP_LoginScreen_CM_C::LoginWaitTries' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, LoginWaitIntervalMax) == 0x000688, "Member 'UWBP_LoginScreen_CM_C::LoginWaitIntervalMax' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, LoginWaitIntervalBase) == 0x000690, "Member 'UWBP_LoginScreen_CM_C::LoginWaitIntervalBase' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, LoginWaitIntervalJitter) == 0x000698, "Member 'UWBP_LoginScreen_CM_C::LoginWaitIntervalJitter' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, HoveredInputBox) == 0x0006A0, "Member 'UWBP_LoginScreen_CM_C::HoveredInputBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, HideLoginHeader) == 0x0006A8, "Member 'UWBP_LoginScreen_CM_C::HideLoginHeader' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, ShowGameLobbyAfterLogin) == 0x0006A9, "Member 'UWBP_LoginScreen_CM_C::ShowGameLobbyAfterLogin' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, OnBackClicked) == 0x0006B0, "Member 'UWBP_LoginScreen_CM_C::OnBackClicked' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, ShowBackButton) == 0x0006C0, "Member 'UWBP_LoginScreen_CM_C::ShowBackButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, CustomLogin) == 0x0006C1, "Member 'UWBP_LoginScreen_CM_C::CustomLogin' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_CM_C, OnPreLogin) == 0x0006C8, "Member 'UWBP_LoginScreen_CM_C::OnPreLogin' has a wrong offset!");

}

