#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GoldCapWarning

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_GoldCapWarning.WBP_GoldCapWarning_C.ExecuteUbergraph_WBP_GoldCapWarning
// 0x0138 (0x0138 - 0x0000)
struct WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5B[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0048(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0078)(ConstParm)
};
static_assert(alignof(WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning) == 0x000008, "Wrong alignment on WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning");
static_assert(sizeof(WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning) == 0x000138, "Wrong size on WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning");
static_assert(offsetof(WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning, EntryPoint) == 0x000000, "Member 'WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning, K2Node_Event_InFocusEvent) == 0x000004, "Member 'WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning, K2Node_Event_MyGeometry) == 0x00000C, "Member 'WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning, K2Node_Event_MouseEvent_1) == 0x000048, "Member 'WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning, K2Node_Event_MouseEvent) == 0x0000C0, "Member 'WBP_GoldCapWarning_C_ExecuteUbergraph_WBP_GoldCapWarning::K2Node_Event_MouseEvent' has a wrong offset!");

// Function WBP_GoldCapWarning.WBP_GoldCapWarning_C.MakeTooltipWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_GoldCapWarning_C_MakeTooltipWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BasicTooltip_C*                    Param_ToolTipWidget;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BasicTooltip_C*                    CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0018(0x0018)()
};
static_assert(alignof(WBP_GoldCapWarning_C_MakeTooltipWidget) == 0x000008, "Wrong alignment on WBP_GoldCapWarning_C_MakeTooltipWidget");
static_assert(sizeof(WBP_GoldCapWarning_C_MakeTooltipWidget) == 0x000030, "Wrong size on WBP_GoldCapWarning_C_MakeTooltipWidget");
static_assert(offsetof(WBP_GoldCapWarning_C_MakeTooltipWidget, ReturnValue) == 0x000000, "Member 'WBP_GoldCapWarning_C_MakeTooltipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_MakeTooltipWidget, Param_ToolTipWidget) == 0x000008, "Member 'WBP_GoldCapWarning_C_MakeTooltipWidget::Param_ToolTipWidget' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_MakeTooltipWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_GoldCapWarning_C_MakeTooltipWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_MakeTooltipWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x000018, "Member 'WBP_GoldCapWarning_C_MakeTooltipWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

// Function WBP_GoldCapWarning.WBP_GoldCapWarning_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_GoldCapWarning_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_GoldCapWarning_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_GoldCapWarning_C_OnFocusLost");
static_assert(sizeof(WBP_GoldCapWarning_C_OnFocusLost) == 0x000008, "Wrong size on WBP_GoldCapWarning_C_OnFocusLost");
static_assert(offsetof(WBP_GoldCapWarning_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_GoldCapWarning_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_GoldCapWarning.WBP_GoldCapWarning_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_GoldCapWarning_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_GoldCapWarning_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_GoldCapWarning_C_OnFocusReceived");
static_assert(sizeof(WBP_GoldCapWarning_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_GoldCapWarning_C_OnFocusReceived");
static_assert(offsetof(WBP_GoldCapWarning_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_GoldCapWarning_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_GoldCapWarning_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_GoldCapWarning_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_GoldCapWarning_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_GoldCapWarning.WBP_GoldCapWarning_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_GoldCapWarning_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_GoldCapWarning_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_GoldCapWarning_C_OnMouseEnter");
static_assert(sizeof(WBP_GoldCapWarning_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_GoldCapWarning_C_OnMouseEnter");
static_assert(offsetof(WBP_GoldCapWarning_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_GoldCapWarning_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_GoldCapWarning_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_GoldCapWarning.WBP_GoldCapWarning_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_GoldCapWarning_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_GoldCapWarning_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_GoldCapWarning_C_OnMouseLeave");
static_assert(sizeof(WBP_GoldCapWarning_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_GoldCapWarning_C_OnMouseLeave");
static_assert(offsetof(WBP_GoldCapWarning_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_GoldCapWarning_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_GoldCapWarning.WBP_GoldCapWarning_C.UpdateVisibility
// 0x0038 (0x0038 - 0x0000)
struct WBP_GoldCapWarning_C_UpdateVisibility final
{
public:
	int32                                         TotalItemValue;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsVisible;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D5C[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       CallFunc_GetVitals_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D5D[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetVitalMax_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVital_ReturnValue;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D5E[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GoldCapWarning_C_UpdateVisibility) == 0x000008, "Wrong alignment on WBP_GoldCapWarning_C_UpdateVisibility");
static_assert(sizeof(WBP_GoldCapWarning_C_UpdateVisibility) == 0x000038, "Wrong size on WBP_GoldCapWarning_C_UpdateVisibility");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, TotalItemValue) == 0x000000, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::TotalItemValue' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, Param_IsVisible) == 0x000004, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::Param_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, Visible) == 0x000005, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::Visible' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, Temp_bool_Variable) == 0x000006, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, Temp_byte_Variable) == 0x000007, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, Temp_byte_Variable_1) == 0x000008, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, CallFunc_GetValeriaCharacter_OutResult) == 0x000009, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, CallFunc_GetVitals_ReturnValue) == 0x000018, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::CallFunc_GetVitals_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, K2Node_Select_Default) == 0x000020, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, CallFunc_GetVitalMax_ReturnValue) == 0x000024, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::CallFunc_GetVitalMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, CallFunc_GetVital_ReturnValue) == 0x000028, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::CallFunc_GetVital_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, K2Node_SwitchEnum_CmpSuccess) == 0x00002C, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GoldCapWarning_C_UpdateVisibility, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'WBP_GoldCapWarning_C_UpdateVisibility::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

