#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Palia_PhoenixShrine_Previz

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Palia_PhoenixShrine_Previz.WBP_Palia_PhoenixShrine_Previz_C.ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B56[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B57[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B58[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_VillagerTheArchaeologist_Intro_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B59[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaVillagerCharacter*              K2Node_DynamicCast_AsValeria_Villager_Character;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5A[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5B[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5C[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz) == 0x000008, "Wrong alignment on WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz");
static_assert(sizeof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz) == 0x0000A8, "Wrong size on WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, EntryPoint) == 0x000000, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_OpenSource_ReturnValue) == 0x000018, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_OpenSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, K2Node_DynamicCast_AsValeria_Villager_Character) == 0x000040, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::K2Node_DynamicCast_AsValeria_Villager_Character' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00004B, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_IsPlaying_ReturnValue) == 0x000068, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_Add_IntInt_ReturnValue_1) == 0x00006C, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000070, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000078, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000080, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_MakeColor_ReturnValue) == 0x000084, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_MakeColor_ReturnValue_1) == 0x000094, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz, CallFunc_MakeColor_A_ImplicitCast) == 0x0000A4, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ExecuteUbergraph_WBP_Palia_PhoenixShrine_Previz::CallFunc_MakeColor_A_ImplicitCast' has a wrong offset!");

// Function WBP_Palia_PhoenixShrine_Previz.WBP_Palia_PhoenixShrine_Previz_C.ForceEngageWithVillager
// 0x0090 (0x0090 - 0x0000)
struct WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager final
{
public:
	class AValeriaVillagerCharacter*              Villager;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 VillagerInteraction;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInteractableComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UInteractableComponent*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5E[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractorComponent*                   CallFunc_GetInteractorComponent_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5F[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractorComponent*                   CallFunc_GetInteractorComponent_ReturnValue_1;     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInteractEventParams                   K2Node_MakeStruct_InteractEventParams;             // 0x0060(0x0018)()
	struct FUseEventResults                       CallFunc_InteractWithHighlighted_ReturnValue;      // 0x0078(0x0018)()
};
static_assert(alignof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager) == 0x000008, "Wrong alignment on WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager");
static_assert(sizeof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager) == 0x000090, "Wrong size on WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, Villager) == 0x000000, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::Villager' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, VillagerInteraction) == 0x000008, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::VillagerInteraction' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, CallFunc_GetPlayerPawn_ReturnValue) == 0x000030, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, K2Node_DynamicCast_AsValeria_Character) == 0x000038, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, CallFunc_GetInteractorComponent_ReturnValue) == 0x000048, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::CallFunc_GetInteractorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, CallFunc_GetInteractorComponent_ReturnValue_1) == 0x000058, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::CallFunc_GetInteractorComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, K2Node_MakeStruct_InteractEventParams) == 0x000060, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::K2Node_MakeStruct_InteractEventParams' has a wrong offset!");
static_assert(offsetof(WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager, CallFunc_InteractWithHighlighted_ReturnValue) == 0x000078, "Member 'WBP_Palia_PhoenixShrine_Previz_C_ForceEngageWithVillager::CallFunc_InteractWithHighlighted_ReturnValue' has a wrong offset!");

}

