#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SavedLoadout_Drag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SavedLoadout_Drag.WBP_SavedLoadout_Drag_C
// 0x0038 (0x02F8 - 0x02C0)
class UWBP_SavedLoadout_Drag_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 OutfitImage;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x02D0(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_SavedLoadout_Drag(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SavedLoadout_Drag_C">();
	}
	static class UWBP_SavedLoadout_Drag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SavedLoadout_Drag_C>();
	}
};
static_assert(alignof(UWBP_SavedLoadout_Drag_C) == 0x000008, "Wrong alignment on UWBP_SavedLoadout_Drag_C");
static_assert(sizeof(UWBP_SavedLoadout_Drag_C) == 0x0002F8, "Wrong size on UWBP_SavedLoadout_Drag_C");
static_assert(offsetof(UWBP_SavedLoadout_Drag_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_SavedLoadout_Drag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadout_Drag_C, OutfitImage) == 0x0002C8, "Member 'UWBP_SavedLoadout_Drag_C::OutfitImage' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadout_Drag_C, Texture) == 0x0002D0, "Member 'UWBP_SavedLoadout_Drag_C::Texture' has a wrong offset!");

}

