#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrafterRecipe_RadialCountdownTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CrafterRecipe_RadialCountdownTimer.WBP_CrafterRecipe_RadialCountdownTimer_C
// 0x0070 (0x0330 - 0x02C0)
class UWBP_CrafterRecipe_RadialCountdownTimer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Backer;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IconBase;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Progress;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Icon;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         EndValeriaTimeMs;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         StartValeriaTimeMs;                                // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CurrValeriaTimeMs;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Reverse;                                           // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6188[0x6];                                     // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             TimerStart;                                        // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             TimerDone;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        Alpha;                                             // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer(int32 EntryPoint, int64 CallFunc_GetValeriaTimestampMs64_ReturnValue, bool CallFunc_NotEqual_Int64Int64_ReturnValue, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, bool CallFunc_BooleanAND_ReturnValue);
	void OvererideAlpha(double Param_Alpha, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, float CallFunc_SetScalarParameterValue_Value_ImplicitCast);
	void SetCountdownTimer(int64 StartValeriaTimeSecs, int64 EndValeriaTimeSecs, bool ShouldBeReverse, bool* SetTimer, int64 CallFunc_GetValeriaTimestampMs64_ReturnValue, bool CallFunc_Greater_Int64Int64_ReturnValue, int64 CallFunc_GetValeriaTimestampMs64_ReturnValue_1);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TimerDone__DelegateSignature();
	void TimerStart__DelegateSignature();
	void UpdateTimeAndUI(int64 Param_CurrValeriaTimeMs, int64 CallFunc_Subtract_Int64Int64_ReturnValue, int32 CallFunc_Conv_Int64ToInt_ReturnValue, int64 CallFunc_Subtract_Int64Int64_ReturnValue_1, int32 CallFunc_Conv_Int64ToInt_ReturnValue_1);
	void UpdateUI(int32 TimePassed, int32 TotalTime, double OldAlpha, double LocalAlpha, bool CallFunc_Less_DoubleDouble_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_1, double CallFunc_FMax_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CrafterRecipe_RadialCountdownTimer_C">();
	}
	static class UWBP_CrafterRecipe_RadialCountdownTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CrafterRecipe_RadialCountdownTimer_C>();
	}
};
static_assert(alignof(UWBP_CrafterRecipe_RadialCountdownTimer_C) == 0x000008, "Wrong alignment on UWBP_CrafterRecipe_RadialCountdownTimer_C");
static_assert(sizeof(UWBP_CrafterRecipe_RadialCountdownTimer_C) == 0x000330, "Wrong size on UWBP_CrafterRecipe_RadialCountdownTimer_C");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, Image_Backer) == 0x0002C8, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::Image_Backer' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, Image_IconBase) == 0x0002D0, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::Image_IconBase' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, Image_Progress) == 0x0002D8, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::Image_Progress' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, NamedSlot_Icon) == 0x0002E0, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::NamedSlot_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, EndValeriaTimeMs) == 0x0002E8, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::EndValeriaTimeMs' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, StartValeriaTimeMs) == 0x0002F0, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::StartValeriaTimeMs' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, CurrValeriaTimeMs) == 0x0002F8, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::CurrValeriaTimeMs' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, Reverse) == 0x000300, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::Reverse' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, IsActive) == 0x000301, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::IsActive' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, TimerStart) == 0x000308, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::TimerStart' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, TimerDone) == 0x000318, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::TimerDone' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipe_RadialCountdownTimer_C, Alpha) == 0x000328, "Member 'UWBP_CrafterRecipe_RadialCountdownTimer_C::Alpha' has a wrong offset!");

}

