#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsItem_Slider_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FSettingsItemSlider_structs.hpp"
#include "WBP_SettingsItem_Parent_DoNotEdit_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C
// 0x0118 (0x0400 - 0x02E8)
class UWBP_SettingsItem_Slider_CM_C final : public UWBP_SettingsItem_Parent_DoNotEdit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_SettingsItem_Slider_CM_C;       // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_CM_C*              Button_Backer;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_ItemName;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Slider_Settings_CM_C*              WBP_Slider_Settings_CM;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFSettingsItemSlider                   SliderSettings;                                    // 0x0308(0x0028)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ItemName;                                          // 0x0330(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnSliderValueChanged;                              // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBackerButton_Clicked;                            // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBackerButton_Hovered;                            // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBackerButton_Unhovered;                          // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSlider_MouseCaptureBegin;                        // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSlider_MouseCaptureEnd;                          // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSlider_ControllerCaptureBegin;                   // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSlider_ControllerCaptureEnd;                     // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAkAudioEvent*                          AkEvent_SliderCaptureBegin;                        // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent_SliderCaptureEnd;                          // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         AkMusID;                                           // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5532[0x4];                                     // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Description;                                       // 0x03E0(0x0018)(Edit, BlueprintVisible)
	double                                        StepSize;                                          // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_0_OnFocused__DelegateSignature();
	void BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature(double Value);
	void BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_12_OnMouseCaptureBegin__DelegateSignature();
	void BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_13_OnMouseCaptureEnd__DelegateSignature();
	void BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_14_OnControllerCaptureBegin__DelegateSignature();
	void BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_15_OnControllerCaptureEnd__DelegateSignature();
	void ExecuteUbergraph_WBP_SettingsItem_Slider_CM(int32 EntryPoint, bool K2Node_Event_IsDesignTime, bool CallFunc_NotEqual_IntInt_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_2, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, double K2Node_ComponentBoundEvent_Value, int32 CallFunc_AkEventGlobal_ReturnValue_2, float CallFunc_SetStepSize_InValue_ImplicitCast);
	void OnBackerButton_Clicked__DelegateSignature();
	void OnBackerButton_Hovered__DelegateSignature();
	void OnBackerButton_Unhovered__DelegateSignature();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnSlider_ControllerCaptureBegin__DelegateSignature();
	void OnSlider_ControllerCaptureEnd__DelegateSignature();
	void OnSlider_MouseCaptureBegin__DelegateSignature();
	void OnSlider_MouseCaptureEnd__DelegateSignature();
	void OnSliderValueChanged__DelegateSignature(double Value);
	void PreConstruct(bool IsDesignTime);
	void SetItemName(class FText Param_ItemName);
	void SetSliderSettings(const struct FFSettingsItemSlider& Param_SliderSettings);
	void SetSliderValue(double SliderValue);
	void UpdateSliderDisplayedValueModifier(double DisplayedValueModifier);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingsItem_Slider_CM_C">();
	}
	static class UWBP_SettingsItem_Slider_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingsItem_Slider_CM_C>();
	}
};
static_assert(alignof(UWBP_SettingsItem_Slider_CM_C) == 0x000008, "Wrong alignment on UWBP_SettingsItem_Slider_CM_C");
static_assert(sizeof(UWBP_SettingsItem_Slider_CM_C) == 0x000400, "Wrong size on UWBP_SettingsItem_Slider_CM_C");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, UberGraphFrame_WBP_SettingsItem_Slider_CM_C) == 0x0002E8, "Member 'UWBP_SettingsItem_Slider_CM_C::UberGraphFrame_WBP_SettingsItem_Slider_CM_C' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, Button_Backer) == 0x0002F0, "Member 'UWBP_SettingsItem_Slider_CM_C::Button_Backer' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, TextBlock_ItemName) == 0x0002F8, "Member 'UWBP_SettingsItem_Slider_CM_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, WBP_Slider_Settings_CM) == 0x000300, "Member 'UWBP_SettingsItem_Slider_CM_C::WBP_Slider_Settings_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, SliderSettings) == 0x000308, "Member 'UWBP_SettingsItem_Slider_CM_C::SliderSettings' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, ItemName) == 0x000330, "Member 'UWBP_SettingsItem_Slider_CM_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, OnSliderValueChanged) == 0x000348, "Member 'UWBP_SettingsItem_Slider_CM_C::OnSliderValueChanged' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, OnBackerButton_Clicked) == 0x000358, "Member 'UWBP_SettingsItem_Slider_CM_C::OnBackerButton_Clicked' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, OnBackerButton_Hovered) == 0x000368, "Member 'UWBP_SettingsItem_Slider_CM_C::OnBackerButton_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, OnBackerButton_Unhovered) == 0x000378, "Member 'UWBP_SettingsItem_Slider_CM_C::OnBackerButton_Unhovered' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, OnSlider_MouseCaptureBegin) == 0x000388, "Member 'UWBP_SettingsItem_Slider_CM_C::OnSlider_MouseCaptureBegin' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, OnSlider_MouseCaptureEnd) == 0x000398, "Member 'UWBP_SettingsItem_Slider_CM_C::OnSlider_MouseCaptureEnd' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, OnSlider_ControllerCaptureBegin) == 0x0003A8, "Member 'UWBP_SettingsItem_Slider_CM_C::OnSlider_ControllerCaptureBegin' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, OnSlider_ControllerCaptureEnd) == 0x0003B8, "Member 'UWBP_SettingsItem_Slider_CM_C::OnSlider_ControllerCaptureEnd' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, AkEvent_SliderCaptureBegin) == 0x0003C8, "Member 'UWBP_SettingsItem_Slider_CM_C::AkEvent_SliderCaptureBegin' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, AkEvent_SliderCaptureEnd) == 0x0003D0, "Member 'UWBP_SettingsItem_Slider_CM_C::AkEvent_SliderCaptureEnd' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, AkMusID) == 0x0003D8, "Member 'UWBP_SettingsItem_Slider_CM_C::AkMusID' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, Description) == 0x0003E0, "Member 'UWBP_SettingsItem_Slider_CM_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Slider_CM_C, StepSize) == 0x0003F8, "Member 'UWBP_SettingsItem_Slider_CM_C::StepSize' has a wrong offset!");

}

