#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CarouselPaginator_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CarouselPaginator_CM.WBP_CarouselPaginator_CM_C
// 0x0050 (0x0338 - 0x02E8)
class UWBP_CarouselPaginator_CM_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_CM_C*              Button_LeftArrow;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_RightArrow;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_PageButtons;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ActivePageIndex;                                   // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61F7[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnActivePageChanged;                               // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_CarouselPagePip_CM_C*>      CachedPagePips;                                    // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         TotalPageCount;                                    // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Backward();
	void BndEvt__WBP_CarouselPaginator_CM_Button_LeftArrow_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_CarouselPaginator_CM_Button_LeftArrow_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_CarouselPaginator_CM_Button_RightArrow_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_CarouselPaginator_CM_Button_RightArrow_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WBP_CarouselPaginator_CM(int32 EntryPoint, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_3, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_2, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1);
	void Forward();
	void GetActivePageIndex(int32* Param_ActivePageIndex);
	void HandleCarouselPageButtonClicked(class UWBP_CarouselPageButton_CM_C* TutorialPageButton);
	void OnActivePageChanged__DelegateSignature(class UWBP_CarouselPaginator_CM_C* CarouselPaginator);
	void SetActivePageIndex(int32 NewValue, class UWBP_CarouselPagePip_CM_C* CallFunc_Array_Get_Item, bool CallFunc_Array_IsValidIndex_ReturnValue, class UWBP_CarouselPagePip_CM_C* CallFunc_Array_Get_Item_1, bool CallFunc_Array_IsValidIndex_ReturnValue_1, bool CallFunc_NotEqual_IntInt_ReturnValue);
	void SetPageCount(int32 PageCount, int32 NewActivePageIndex, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, int32 Temp_int_Variable, class UWBP_CarouselPagePip_CM_C* CallFunc_Create_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue);
	void UpdateNavButtonStates();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CarouselPaginator_CM_C">();
	}
	static class UWBP_CarouselPaginator_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CarouselPaginator_CM_C>();
	}
};
static_assert(alignof(UWBP_CarouselPaginator_CM_C) == 0x000008, "Wrong alignment on UWBP_CarouselPaginator_CM_C");
static_assert(sizeof(UWBP_CarouselPaginator_CM_C) == 0x000338, "Wrong size on UWBP_CarouselPaginator_CM_C");
static_assert(offsetof(UWBP_CarouselPaginator_CM_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_CarouselPaginator_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPaginator_CM_C, Button_LeftArrow) == 0x0002F0, "Member 'UWBP_CarouselPaginator_CM_C::Button_LeftArrow' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPaginator_CM_C, Button_RightArrow) == 0x0002F8, "Member 'UWBP_CarouselPaginator_CM_C::Button_RightArrow' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPaginator_CM_C, HBox_PageButtons) == 0x000300, "Member 'UWBP_CarouselPaginator_CM_C::HBox_PageButtons' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPaginator_CM_C, ActivePageIndex) == 0x000308, "Member 'UWBP_CarouselPaginator_CM_C::ActivePageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPaginator_CM_C, OnActivePageChanged) == 0x000310, "Member 'UWBP_CarouselPaginator_CM_C::OnActivePageChanged' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPaginator_CM_C, CachedPagePips) == 0x000320, "Member 'UWBP_CarouselPaginator_CM_C::CachedPagePips' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPaginator_CM_C, TotalPageCount) == 0x000330, "Member 'UWBP_CarouselPaginator_CM_C::TotalPageCount' has a wrong offset!");

}

