#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GraphicsSettings_Advanced_CM

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GraphicsSettings_Advanced_CM.WBP_GraphicsSettings_Advanced_CM_C
// 0x0050 (0x0560 - 0x0510)
class UWBP_GraphicsSettings_Advanced_CM_C final : public UCommonActivatableWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_SettingsItem_Checkbox_CM_C*        Checkbox_DynamicResolution_CM;                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsItem_Checkbox_CM_C*        Checkbox_HDR_CM;                                   // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsItem_Checkbox_CM_C*        Checkbox_Vsync_CM;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        Combobox_DxVersion;                                // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        Combobox_FOV_CM;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        Combobox_FrameRateLimit_CM;                        // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ScrollBox_Styled*                Scrollbar_GraphicsAdvanced;                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_DescriptionBox_C*         WBP_Settings_DescriptionBox;                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVAL_DirectXVersion                           CurrentDxVersion;                                  // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasSettingChangedForRHI;                           // 0x0559(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GraphicsSettings_Advanced_CM_Checkbox_DynamicResolution_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature(bool Checked);
	void BndEvt__WBP_GraphicsSettings_Advanced_CM_Checkbox_HDR_CM_K2Node_ComponentBoundEvent_8_OnCheckedStateChanged__DelegateSignature(bool Checked);
	void BndEvt__WBP_GraphicsSettings_Advanced_CM_Checkbox_Vsync_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature(bool Checked);
	void BndEvt__WBP_GraphicsSettings_Advanced_CM_Combobox_DxVersion_K2Node_ComponentBoundEvent_1_OnOptionChanged__DelegateSignature(int32 Param_Index, class FText Text);
	void BndEvt__WBP_GraphicsSettings_Advanced_CM_Combobox_FOV_CM_K2Node_ComponentBoundEvent_9_OnOptionChanged__DelegateSignature(int32 Param_Index, class FText Text);
	void BndEvt__WBP_GraphicsSettings_Advanced_CM_Combobox_FrameRateLimit_CM_K2Node_ComponentBoundEvent_2_OnOptionChanged__DelegateSignature(int32 Param_Index, class FText Text);
	void BP_OnActivated();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_GraphicsSettings_Advanced_CM(int32 EntryPoint, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, TDelegate<void(class FText Name, class FText Description)> K2Node_CreateDelegate_OutputDelegate, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue_1, int32 Temp_int_Array_Index_Variable, bool CallFunc_SupportsHDRDisplayOutput_ReturnValue, EVAL_DirectXVersion Temp_byte_Variable, EVAL_DirectXVersion Temp_byte_Variable_1, class FText K2Node_CustomEvent_Name, class FText K2Node_CustomEvent_Description, bool K2Node_ComponentBoundEvent_Checked_2, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, bool K2Node_ComponentBoundEvent_Checked_1, class UWidget* CallFunc_Array_Get_Item, class UWBP_SettingsItem_Parent_DoNotEdit_C* K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue, bool K2Node_ComponentBoundEvent_Checked, int32 K2Node_ComponentBoundEvent_Index_2, class FText K2Node_ComponentBoundEvent_Text_2, const class FString& CallFunc_Conv_TextToString_ReturnValue, double CallFunc_Conv_StringToDouble_ReturnValue, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue_2, int32 Temp_int_Variable, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue, int32 K2Node_ComponentBoundEvent_Index_1, class FText K2Node_ComponentBoundEvent_Text_1, EVAL_DirectXVersion K2Node_Select_Default, bool CallFunc_NotEqual_ByteByte_ReturnValue, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue_1, int32 K2Node_ComponentBoundEvent_Index, class FText K2Node_ComponentBoundEvent_Text, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, double CallFunc_Conv_StringToDouble_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_SetFOV_value_ImplicitCast, float CallFunc_SetFrameRateLimit_NewLimit_ImplicitCast);
	void HandleSettingsItemHovered(class FText Param_Name, class FText Description);
	void HandleSettingsItemUnhovered();
	void SetEnableHDR(class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, bool CallFunc_SupportsHDRDisplayOutput_ReturnValue);
	void UpdateAdvancedSettingsToMatchAppliedSettigns(bool FrameLimitOptionMatch, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable, bool CallFunc_Not_PreBool_ReturnValue, class FText CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Variable, int32 Temp_int_Variable_1, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue, int32 Temp_int_Variable_2, bool CallFunc_IsHDREnabled_ReturnValue, float CallFunc_GetFrameRateLimit_ReturnValue, bool CallFunc_IsDynamicResolutionEnabled_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, bool CallFunc_IsVSyncEnabled_ReturnValue, bool CallFunc_EqualEqual_TextText_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, int32 CallFunc_FTrunc_ReturnValue_1, class FText CallFunc_Conv_IntToText_ReturnValue_1, int32 CallFunc_Array_Find_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, EVAL_DirectXVersion Temp_byte_Variable, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, EVAL_DirectXVersion CallFunc_GetDirectXVersion_ReturnValue, int32 K2Node_Select_Default, double CallFunc_FTrunc_A_ImplicitCast, double CallFunc_FTrunc_A_ImplicitCast_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GraphicsSettings_Advanced_CM_C">();
	}
	static class UWBP_GraphicsSettings_Advanced_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GraphicsSettings_Advanced_CM_C>();
	}
};
static_assert(alignof(UWBP_GraphicsSettings_Advanced_CM_C) == 0x000008, "Wrong alignment on UWBP_GraphicsSettings_Advanced_CM_C");
static_assert(sizeof(UWBP_GraphicsSettings_Advanced_CM_C) == 0x000560, "Wrong size on UWBP_GraphicsSettings_Advanced_CM_C");
static_assert(offsetof(UWBP_GraphicsSettings_Advanced_CM_C, UberGraphFrame) == 0x000510, "Member 'UWBP_GraphicsSettings_Advanced_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Advanced_CM_C, Checkbox_DynamicResolution_CM) == 0x000518, "Member 'UWBP_GraphicsSettings_Advanced_CM_C::Checkbox_DynamicResolution_CM' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Advanced_CM_C, Checkbox_HDR_CM) == 0x000520, "Member 'UWBP_GraphicsSettings_Advanced_CM_C::Checkbox_HDR_CM' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Advanced_CM_C, Checkbox_Vsync_CM) == 0x000528, "Member 'UWBP_GraphicsSettings_Advanced_CM_C::Checkbox_Vsync_CM' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Advanced_CM_C, Combobox_DxVersion) == 0x000530, "Member 'UWBP_GraphicsSettings_Advanced_CM_C::Combobox_DxVersion' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Advanced_CM_C, Combobox_FOV_CM) == 0x000538, "Member 'UWBP_GraphicsSettings_Advanced_CM_C::Combobox_FOV_CM' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Advanced_CM_C, Combobox_FrameRateLimit_CM) == 0x000540, "Member 'UWBP_GraphicsSettings_Advanced_CM_C::Combobox_FrameRateLimit_CM' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Advanced_CM_C, Scrollbar_GraphicsAdvanced) == 0x000548, "Member 'UWBP_GraphicsSettings_Advanced_CM_C::Scrollbar_GraphicsAdvanced' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Advanced_CM_C, WBP_Settings_DescriptionBox) == 0x000550, "Member 'UWBP_GraphicsSettings_Advanced_CM_C::WBP_Settings_DescriptionBox' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Advanced_CM_C, CurrentDxVersion) == 0x000558, "Member 'UWBP_GraphicsSettings_Advanced_CM_C::CurrentDxVersion' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Advanced_CM_C, WasSettingChangedForRHI) == 0x000559, "Member 'UWBP_GraphicsSettings_Advanced_CM_C::WasSettingChangedForRHI' has a wrong offset!");

}

