#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopBacker_01_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_TopBackerSettings_CloseButton_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopBacker_01_CM.WBP_TopBacker_01_CM_C
// 0x00D8 (0x0398 - 0x02C0)
class UWBP_TopBacker_01_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HBox_Container;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Header;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CloseButton_CM_C*                  WBP_CloseButton_CM;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnExitButtonClicked;                               // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FBP_TopBackerSettings_CloseButton      BackerSettings;                                    // 0x02F8(0x00A0)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ApplyBackerSettings(const struct FBP_TopBackerSettings_CloseButton& Settings, ESlateVisibility Temp_byte_Variable, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue_1, ESlateVisibility Temp_byte_Variable_1, class UHorizontalBoxSlot* CallFunc_SlotAsHorizontalBoxSlot_ReturnValue, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue_2, bool Temp_bool_Variable, ESlateVisibility K2Node_Select_Default);
	void BndEvt__WBP_TopBacker_01_CM_WBP_CloseButton_CM_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature();
	void ExecuteUbergraph_WBP_TopBacker_01_CM(int32 EntryPoint, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool K2Node_Event_IsDesignTime, bool K2Node_CustomEvent_Is_Visible, ESlateVisibility K2Node_Select_Default);
	void OnExitButtonClicked__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void Set_Close_Button_Visibility(bool Is_Visible);
	void SetHeaderText(class FText Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopBacker_01_CM_C">();
	}
	static class UWBP_TopBacker_01_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopBacker_01_CM_C>();
	}
};
static_assert(alignof(UWBP_TopBacker_01_CM_C) == 0x000008, "Wrong alignment on UWBP_TopBacker_01_CM_C");
static_assert(sizeof(UWBP_TopBacker_01_CM_C) == 0x000398, "Wrong size on UWBP_TopBacker_01_CM_C");
static_assert(offsetof(UWBP_TopBacker_01_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_TopBacker_01_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_01_CM_C, HBox_Container) == 0x0002C8, "Member 'UWBP_TopBacker_01_CM_C::HBox_Container' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_01_CM_C, Image_Icon) == 0x0002D0, "Member 'UWBP_TopBacker_01_CM_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_01_CM_C, Text_Header) == 0x0002D8, "Member 'UWBP_TopBacker_01_CM_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_01_CM_C, WBP_CloseButton_CM) == 0x0002E0, "Member 'UWBP_TopBacker_01_CM_C::WBP_CloseButton_CM' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_01_CM_C, OnExitButtonClicked) == 0x0002E8, "Member 'UWBP_TopBacker_01_CM_C::OnExitButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_01_CM_C, BackerSettings) == 0x0002F8, "Member 'UWBP_TopBacker_01_CM_C::BackerSettings' has a wrong offset!");

}

