#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonUIButtonPrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "F_CommonUIButtonPrompt_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CommonUI_classes.hpp"
#include "S6Core_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C
// 0x0128 (0x0410 - 0x02E8)
class UWBP_CommonUIButtonPrompt_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         AllButtonPrompt;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_KeyPrompt;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RootOverlay;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class UInputAction*, class UWBP_CommonUIButtonPromptItem_C*> IANameForWidget;                                   // 0x0308(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FF_CommonUIButtonPrompt>        UIButtonPromptInfo;                                // 0x0358(0x0010)(Edit, BlueprintVisible)
	TMap<class UInputAction*, class UWBP_CommonUIButtonPromptItem_C*> IANameForWidget_Hold;                              // 0x0368(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class FString, class UWBP_CommonUIButtonPromptItem_C*> IANameForWidget_Special;                           // 0x03B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bCenter;                                           // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_CommonUIButtonPrompt(int32 EntryPoint, bool K2Node_Event_IsDesignTime, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate, ECommonInputType K2Node_CustomEvent_bNewInputType, ERedirectsPlatform CallFunc_GetPlatformType_ReturnValue, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, ECommonInputType CallFunc_GetCurrentInputType_ReturnValue);
	void GetCurrentUIButtonPromptArray(TArray<struct FF_CommonUIButtonPrompt>* ButtonPromptArray, const TArray<struct FF_CommonUIButtonPrompt>& PromptArray, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UWBP_CommonUIButtonPromptItem_C* K2Node_DynamicCast_AsWBP_Common_UIButton_Prompt_Item, bool K2Node_DynamicCast_bSuccess, const struct FF_CommonUIButtonPrompt& CallFunc_GetCurrentPromptInfo_NewParam, ESlateVisibility CallFunc_GetVisibility_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue);
	void GetPromptItemByIA(class UInputAction* Input_Action, bool IsHold, class UWBP_CommonUIButtonPromptItem_C** PromptItem, bool Temp_bool_Variable, const TMap<class UInputAction*, class UWBP_CommonUIButtonPromptItem_C*>& K2Node_Select_Default, class UWBP_CommonUIButtonPromptItem_C* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	void GetSpecialPromptItem(const class FString& SpecialName, class UWBP_CommonUIButtonPromptItem_C** PromptItem, class UWBP_CommonUIButtonPromptItem_C* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	void HandleOnInputMethodChanged(ECommonInputType bNewInputType);
	void InitUIButtonPromptByArray(TArray<struct FF_CommonUIButtonPrompt>& ItemInfos, int32 Temp_int_Array_Index_Variable, bool CallFunc_Array_IsNotEmpty_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_Variable, class UWBP_CommonUIButtonPromptItem_C* CallFunc_Create_ReturnValue, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue, TArray<struct FF_CommonUIButtonPrompt>& K2Node_Select_Default, int32 CallFunc_Array_Length_ReturnValue, const struct FF_CommonUIButtonPrompt& CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsEmpty_ReturnValue);
	void IsPromptItemVisible(class UInputAction* InputAction, bool* Param_IsVisible, class UWBP_CommonUIButtonPromptItem_C* CallFunc_GetPromptItemByIA_PromptItem, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsVisible_ReturnValue);
	void PreConstruct(bool IsDesignTime);
	void RefreshCurrentButtonPrompt(TArray<struct FF_CommonUIButtonPrompt>& Prompt_Infos, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_IsEmpty_ReturnValue, class UWBP_CommonUIButtonPromptItem_C* K2Node_DynamicCast_AsWBP_Common_UIButton_Prompt_Item, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void SetAllPromptItemVisibility(bool IsShow, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_Variable, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, ESlateVisibility K2Node_Select_Default, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void SetBackgroundBoderStyle(struct FSlateBrush& InBrush);
	void SetBackgroundColor(const struct FColor& Color, const struct FLinearColor& CallFunc_Conv_ColorToLinearColor_ReturnValue);
	void SetButtonPromptsToCenter(class UBorderSlot* CallFunc_SlotAsBorderSlot_ReturnValue);
	void SetButtonPromptsVisibility(ECommonInputType Input_Type, bool Temp_bool_Variable, bool CallFunc_EqualEqual_ByteByte_ReturnValue, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility K2Node_Select_Default);
	void SetDescriptionByIA(class UInputAction* InputAction, class FText Description, bool IsHold, class UWBP_CommonUIButtonPromptItem_C* CallFunc_GetPromptItemByIA_PromptItem, bool CallFunc_IsValid_ReturnValue);
	void SetPromptItemVisibilityByIA(class UInputAction* InputAction, bool IsShow, bool IsHold, bool Temp_bool_Variable, class UWBP_CommonUIButtonPromptItem_C* CallFunc_GetPromptItemByIA_PromptItem, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility K2Node_Select_Default);
	void Update_UIButton_Prompt_by_Array(TArray<struct FF_CommonUIButtonPrompt>& PromptInfos, int32 CallFunc_Array_Length_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_NotEqual_IntInt_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CommonUIButtonPrompt_C">();
	}
	static class UWBP_CommonUIButtonPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CommonUIButtonPrompt_C>();
	}
};
static_assert(alignof(UWBP_CommonUIButtonPrompt_C) == 0x000008, "Wrong alignment on UWBP_CommonUIButtonPrompt_C");
static_assert(sizeof(UWBP_CommonUIButtonPrompt_C) == 0x000410, "Wrong size on UWBP_CommonUIButtonPrompt_C");
static_assert(offsetof(UWBP_CommonUIButtonPrompt_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_CommonUIButtonPrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPrompt_C, AllButtonPrompt) == 0x0002F0, "Member 'UWBP_CommonUIButtonPrompt_C::AllButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPrompt_C, Border_KeyPrompt) == 0x0002F8, "Member 'UWBP_CommonUIButtonPrompt_C::Border_KeyPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPrompt_C, RootOverlay) == 0x000300, "Member 'UWBP_CommonUIButtonPrompt_C::RootOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPrompt_C, IANameForWidget) == 0x000308, "Member 'UWBP_CommonUIButtonPrompt_C::IANameForWidget' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPrompt_C, UIButtonPromptInfo) == 0x000358, "Member 'UWBP_CommonUIButtonPrompt_C::UIButtonPromptInfo' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPrompt_C, IANameForWidget_Hold) == 0x000368, "Member 'UWBP_CommonUIButtonPrompt_C::IANameForWidget_Hold' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPrompt_C, IANameForWidget_Special) == 0x0003B8, "Member 'UWBP_CommonUIButtonPrompt_C::IANameForWidget_Special' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPrompt_C, bCenter) == 0x000408, "Member 'UWBP_CommonUIButtonPrompt_C::bCenter' has a wrong offset!");

}

