#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsItem_Dropdown_CM

#include "Basic.hpp"

#include "WBP_SettingsItem_Parent_DoNotEdit_classes.hpp"
#include "Slate_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C
// 0x00F0 (0x03D8 - 0x02E8)
class UWBP_SettingsItem_Dropdown_CM_C final : public UWBP_SettingsItem_Parent_DoNotEdit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_SettingsItem_Dropdown_CM_C;     // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_CM_C*              Button_Backer;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_ItemName;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ComboBox_02_CM_C*                  WBP_ComboBox_02_CM;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Selected_Option;                                   // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5450[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Text_Options;                                      // 0x0310(0x0010)(Edit, BlueprintVisible)
	class UVALUI_TextBlockStyle*                  Text_Block_Style;                                  // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Text_Justification;                                // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5451[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ItemName;                                          // 0x0330(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnOptionChanged;                                   // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMenuOpened;                                      // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBackerButton_Clicked;                            // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBackerButton_Hovered;                            // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBackerButton_Unhovered;                          // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          UseScrollbar;                                      // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5452[0x7];                                     // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Description;                                       // 0x03A0(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnDropDownFocusLost;                               // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMenuClosed;                                      // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_SettingsItem_Dropdown_CM_Button_Backer_K2Node_ComponentBoundEvent_3_OnFocused__DelegateSignature();
	void BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_0_OnMenuOpened__DelegateSignature();
	void BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature(int32 Param_Index, class FText Text);
	void BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_8_OnMenuClosed__DelegateSignature();
	void BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM(int32 EntryPoint, int32 K2Node_ComponentBoundEvent_Index, class FText K2Node_ComponentBoundEvent_Text, bool CallFunc_TextIsEmpty_ReturnValue, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_2, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, int32 CallFunc_AkEventGlobal_ReturnValue, bool K2Node_Event_IsDesignTime);
	void OnBackerButton_Clicked__DelegateSignature();
	void OnBackerButton_Hovered__DelegateSignature();
	void OnBackerButton_Unhovered__DelegateSignature();
	void OnDropDownFocusLost__DelegateSignature();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnMenuClosed__DelegateSignature();
	void OnMenuOpened__DelegateSignature(class UWBP_SettingsItem_Dropdown_CM_C* OpenedDropBox);
	void OnOptionChanged__DelegateSignature(int32 Param_Index, class FText Text);
	void PreConstruct(bool IsDesignTime);
	void SetCurrentOptionToIndex(int32 Param_Index);
	void SetItemName(class FText Param_ItemName);
	void SetTextOptions(TArray<class FText>& Param_Text_Options, int32 Param_Selected_Option);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingsItem_Dropdown_CM_C">();
	}
	static class UWBP_SettingsItem_Dropdown_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingsItem_Dropdown_CM_C>();
	}
};
static_assert(alignof(UWBP_SettingsItem_Dropdown_CM_C) == 0x000008, "Wrong alignment on UWBP_SettingsItem_Dropdown_CM_C");
static_assert(sizeof(UWBP_SettingsItem_Dropdown_CM_C) == 0x0003D8, "Wrong size on UWBP_SettingsItem_Dropdown_CM_C");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, UberGraphFrame_WBP_SettingsItem_Dropdown_CM_C) == 0x0002E8, "Member 'UWBP_SettingsItem_Dropdown_CM_C::UberGraphFrame_WBP_SettingsItem_Dropdown_CM_C' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, Button_Backer) == 0x0002F0, "Member 'UWBP_SettingsItem_Dropdown_CM_C::Button_Backer' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, TextBlock_ItemName) == 0x0002F8, "Member 'UWBP_SettingsItem_Dropdown_CM_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, WBP_ComboBox_02_CM) == 0x000300, "Member 'UWBP_SettingsItem_Dropdown_CM_C::WBP_ComboBox_02_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, Selected_Option) == 0x000308, "Member 'UWBP_SettingsItem_Dropdown_CM_C::Selected_Option' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, Text_Options) == 0x000310, "Member 'UWBP_SettingsItem_Dropdown_CM_C::Text_Options' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, Text_Block_Style) == 0x000320, "Member 'UWBP_SettingsItem_Dropdown_CM_C::Text_Block_Style' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, Text_Justification) == 0x000328, "Member 'UWBP_SettingsItem_Dropdown_CM_C::Text_Justification' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, ItemName) == 0x000330, "Member 'UWBP_SettingsItem_Dropdown_CM_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, OnOptionChanged) == 0x000348, "Member 'UWBP_SettingsItem_Dropdown_CM_C::OnOptionChanged' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, OnMenuOpened) == 0x000358, "Member 'UWBP_SettingsItem_Dropdown_CM_C::OnMenuOpened' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, OnBackerButton_Clicked) == 0x000368, "Member 'UWBP_SettingsItem_Dropdown_CM_C::OnBackerButton_Clicked' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, OnBackerButton_Hovered) == 0x000378, "Member 'UWBP_SettingsItem_Dropdown_CM_C::OnBackerButton_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, OnBackerButton_Unhovered) == 0x000388, "Member 'UWBP_SettingsItem_Dropdown_CM_C::OnBackerButton_Unhovered' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, UseScrollbar) == 0x000398, "Member 'UWBP_SettingsItem_Dropdown_CM_C::UseScrollbar' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, Description) == 0x0003A0, "Member 'UWBP_SettingsItem_Dropdown_CM_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, OnDropDownFocusLost) == 0x0003B8, "Member 'UWBP_SettingsItem_Dropdown_CM_C::OnDropDownFocusLost' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsItem_Dropdown_CM_C, OnMenuClosed) == 0x0003C8, "Member 'UWBP_SettingsItem_Dropdown_CM_C::OnMenuClosed' has a wrong offset!");

}

