#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FishingHud

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_FishingHud.WBP_FishingHud_C.ExecuteUbergraph_WBP_FishingHud
// 0x0280 (0x0280 - 0x0000)
struct WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C37[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FishingEncouragementEmoji_C*       CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFishingComponent*                      K2Node_CustomEvent_Source_2;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_CustomEvent_fromVc;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFishingComponent*                      K2Node_CustomEvent_FishingComponent;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFishingViewComponent*                  K2Node_CustomEvent_FIshingViewComponent;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFishingComponent* Source, const struct FFishCaughtResult& Result)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFishingViewComponent*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFishingComponent*                      K2Node_CustomEvent_Source_1;                       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFishCaughtResult                      K2Node_CustomEvent_Result;                         // 0x0080(0x0010)(NoDestructor)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C38[0x5];                                     // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C39[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFishingViewComponent*                  K2Node_CustomEvent_FishingView_1;                  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_bobble;                         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFishingViewComponent*                  K2Node_CustomEvent_FishingView;                    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3A[0x8];                                     // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFishingMiniGameViewState              K2Node_CustomEvent_ViewState;                      // 0x00E0(0x0120)()
	class UFishingComponent*                      K2Node_CustomEvent_Source;                         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3B[0x3];                                     // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFishingViewComponent* FishingView, const struct FFishingMiniGameViewState& ViewState, class UFishingComponent* Source)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x021C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* ModalWidget, TArray<class UUserWidget*>& TutorialWidgets)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x022C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3C[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFishingViewComponent* FishingView, class AActor* bobble)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0248(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM; // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RedirectTutorialModalType_bSuccess;       // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud) == 0x000010, "Wrong alignment on WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud");
static_assert(sizeof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud) == 0x000280, "Wrong size on WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, EntryPoint) == 0x000000, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CustomEvent_Source_2) == 0x000010, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CustomEvent_Source_2' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CustomEvent_fromVc) == 0x000018, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CustomEvent_fromVc' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CustomEvent_FishingComponent) == 0x000020, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CustomEvent_FishingComponent' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CustomEvent_FIshingViewComponent) == 0x000028, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CustomEvent_FIshingViewComponent' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_RandomFloatInRange_ReturnValue) == 0x000050, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000058, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_AddChild_ReturnValue) == 0x000070, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CustomEvent_Source_1) == 0x000078, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CustomEvent_Source_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CustomEvent_Result) == 0x000080, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000090, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000099, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_BooleanAND_ReturnValue) == 0x00009A, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_PlayAnimation_ReturnValue) == 0x0000A0, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A8, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0000B0, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000B8, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CustomEvent_FishingView_1) == 0x0000C0, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CustomEvent_FishingView_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CustomEvent_bobble) == 0x0000C8, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CustomEvent_bobble' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CustomEvent_FishingView) == 0x0000D0, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CustomEvent_FishingView' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CustomEvent_ViewState) == 0x0000E0, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CustomEvent_ViewState' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CustomEvent_Source) == 0x000200, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000208, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000210, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_CanStartTutorialForFlag_ReturnValue) == 0x000218, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_CanStartTutorialForFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CreateDelegate_OutputDelegate_1) == 0x00021C, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CreateDelegate_OutputDelegate_2) == 0x00022C, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_GetPlayerController_ReturnValue) == 0x000240, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_CreateDelegate_OutputDelegate_3) == 0x000248, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000258, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM) == 0x000260, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, K2Node_DynamicCast_bSuccess_1) == 0x000270, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud, CallFunc_RedirectTutorialModalType_bSuccess) == 0x000271, "Member 'WBP_FishingHud_C_ExecuteUbergraph_WBP_FishingHud::CallFunc_RedirectTutorialModalType_bSuccess' has a wrong offset!");

// Function WBP_FishingHud.WBP_FishingHud_C.HandleAimingCastState
// 0x0130 (0x0130 - 0x0000)
struct WBP_FishingHud_C_HandleAimingCastState final
{
public:
	class UFishingViewComponent*                  FishingView;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3D[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFishingMiniGameViewState              CallFunc_GetViewState_ReturnValue;                 // 0x0010(0x0120)()
};
static_assert(alignof(WBP_FishingHud_C_HandleAimingCastState) == 0x000010, "Wrong alignment on WBP_FishingHud_C_HandleAimingCastState");
static_assert(sizeof(WBP_FishingHud_C_HandleAimingCastState) == 0x000130, "Wrong size on WBP_FishingHud_C_HandleAimingCastState");
static_assert(offsetof(WBP_FishingHud_C_HandleAimingCastState, FishingView) == 0x000000, "Member 'WBP_FishingHud_C_HandleAimingCastState::FishingView' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleAimingCastState, CallFunc_GetViewState_ReturnValue) == 0x000010, "Member 'WBP_FishingHud_C_HandleAimingCastState::CallFunc_GetViewState_ReturnValue' has a wrong offset!");

// Function WBP_FishingHud.WBP_FishingHud_C.HandleFishingViewUpdated
// 0x0140 (0x0140 - 0x0000)
struct WBP_FishingHud_C_HandleFishingViewUpdated final
{
public:
	class UFishingViewComponent*                  FishingView;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3E[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFishingMiniGameViewState              ViewState;                                         // 0x0010(0x0120)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UFishingComponent*                      Source;                                            // 0x0130(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FishingHud_C_HandleFishingViewUpdated) == 0x000010, "Wrong alignment on WBP_FishingHud_C_HandleFishingViewUpdated");
static_assert(sizeof(WBP_FishingHud_C_HandleFishingViewUpdated) == 0x000140, "Wrong size on WBP_FishingHud_C_HandleFishingViewUpdated");
static_assert(offsetof(WBP_FishingHud_C_HandleFishingViewUpdated, FishingView) == 0x000000, "Member 'WBP_FishingHud_C_HandleFishingViewUpdated::FishingView' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleFishingViewUpdated, ViewState) == 0x000010, "Member 'WBP_FishingHud_C_HandleFishingViewUpdated::ViewState' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleFishingViewUpdated, Source) == 0x000130, "Member 'WBP_FishingHud_C_HandleFishingViewUpdated::Source' has a wrong offset!");

// Function WBP_FishingHud.WBP_FishingHud_C.HandleOpenFishingTutorial
// 0x0040 (0x0040 - 0x0000)
struct WBP_FishingHud_C_HandleOpenFishingTutorial final
{
public:
	class UUserWidget*                            ModalWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    TutorialWidgets;                                   // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_ModalInterface_Tutorial_C> K2Node_DynamicCast_AsBP_Modal_Interface_Tutorial;  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3F[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FishingHud_C_HandleOpenFishingTutorial) == 0x000008, "Wrong alignment on WBP_FishingHud_C_HandleOpenFishingTutorial");
static_assert(sizeof(WBP_FishingHud_C_HandleOpenFishingTutorial) == 0x000040, "Wrong size on WBP_FishingHud_C_HandleOpenFishingTutorial");
static_assert(offsetof(WBP_FishingHud_C_HandleOpenFishingTutorial, ModalWidget) == 0x000000, "Member 'WBP_FishingHud_C_HandleOpenFishingTutorial::ModalWidget' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleOpenFishingTutorial, TutorialWidgets) == 0x000008, "Member 'WBP_FishingHud_C_HandleOpenFishingTutorial::TutorialWidgets' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleOpenFishingTutorial, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_FishingHud_C_HandleOpenFishingTutorial::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleOpenFishingTutorial, K2Node_DynamicCast_AsBP_Modal_Interface_Tutorial) == 0x000020, "Member 'WBP_FishingHud_C_HandleOpenFishingTutorial::K2Node_DynamicCast_AsBP_Modal_Interface_Tutorial' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleOpenFishingTutorial, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_FishingHud_C_HandleOpenFishingTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleOpenFishingTutorial, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000038, "Member 'WBP_FishingHud_C_HandleOpenFishingTutorial::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_FishingHud.WBP_FishingHud_C.HandleReelingState
// 0x0190 (0x0190 - 0x0000)
struct WBP_FishingHud_C_HandleReelingState final
{
public:
	class UFishingViewComponent*                  FishingView;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BackerRed;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BackerTan;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        DangerDmgAmount;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFishingMiniGameViewState              CallFunc_GetViewState_ReturnValue;                 // 0x0020(0x0120)()
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C40[0x1];                                     // 0x015F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FishingHud_C_HandleReelingState) == 0x000010, "Wrong alignment on WBP_FishingHud_C_HandleReelingState");
static_assert(sizeof(WBP_FishingHud_C_HandleReelingState) == 0x000190, "Wrong size on WBP_FishingHud_C_HandleReelingState");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, FishingView) == 0x000000, "Member 'WBP_FishingHud_C_HandleReelingState::FishingView' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, BackerRed) == 0x000008, "Member 'WBP_FishingHud_C_HandleReelingState::BackerRed' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, BackerTan) == 0x000010, "Member 'WBP_FishingHud_C_HandleReelingState::BackerTan' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, DangerDmgAmount) == 0x000018, "Member 'WBP_FishingHud_C_HandleReelingState::DangerDmgAmount' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_GetViewState_ReturnValue) == 0x000020, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_GetViewState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000140, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000148, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000150, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000158, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000159, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00015A, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x00015B, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00015C, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_BooleanAND_ReturnValue) == 0x00015D, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_BooleanAND_ReturnValue_1) == 0x00015E, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000160, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000168, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000170, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000178, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000180, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000188, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_HandleReelingState, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x00018C, "Member 'WBP_FishingHud_C_HandleReelingState::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");

// Function WBP_FishingHud.WBP_FishingHud_C.LinkToFishingComponent
// 0x0010 (0x0010 - 0x0000)
struct WBP_FishingHud_C_LinkToFishingComponent final
{
public:
	class UFishingComponent*                      FishingComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFishingViewComponent*                  FishingViewComponent;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FishingHud_C_LinkToFishingComponent) == 0x000008, "Wrong alignment on WBP_FishingHud_C_LinkToFishingComponent");
static_assert(sizeof(WBP_FishingHud_C_LinkToFishingComponent) == 0x000010, "Wrong size on WBP_FishingHud_C_LinkToFishingComponent");
static_assert(offsetof(WBP_FishingHud_C_LinkToFishingComponent, FishingComponent) == 0x000000, "Member 'WBP_FishingHud_C_LinkToFishingComponent::FishingComponent' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_LinkToFishingComponent, FishingViewComponent) == 0x000008, "Member 'WBP_FishingHud_C_LinkToFishingComponent::FishingViewComponent' has a wrong offset!");

// Function WBP_FishingHud.WBP_FishingHud_C.On_MenuAnchor_Popin_Bites_GetUserMenuContent_0
// 0x0060 (0x0060 - 0x0000)
struct WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0 final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopinCalloutWidget_C*              LocalPopin;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C41[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FTUEPopin_CM_C*                    CallFunc_Redirect_FTUEPopin_Type_FTUEPopin;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C42[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopinCalloutWidget_C*              CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0) == 0x000008, "Wrong alignment on WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0");
static_assert(sizeof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0) == 0x000060, "Wrong size on WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0, ReturnValue) == 0x000000, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0, LocalPopin) == 0x000008, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0::LocalPopin' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000018, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0, K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM) == 0x000020, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0::K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0, CallFunc_Redirect_FTUEPopin_Type_FTUEPopin) == 0x000038, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0::CallFunc_Redirect_FTUEPopin_Type_FTUEPopin' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0, CallFunc_SetContent_ReturnValue) == 0x000048, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0::CallFunc_SetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Bites_GetUserMenuContent_0::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_FishingHud.WBP_FishingHud_C.On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0
// 0x0060 (0x0060 - 0x0000)
struct WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0 final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopinCalloutWidget_C*              LocalPopin;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C43[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FTUEPopin_CM_C*                    CallFunc_Redirect_FTUEPopin_Type_FTUEPopin;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C44[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopinCalloutWidget_C*              CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0) == 0x000008, "Wrong alignment on WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0");
static_assert(sizeof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0) == 0x000060, "Wrong size on WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0, ReturnValue) == 0x000000, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0, LocalPopin) == 0x000008, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0::LocalPopin' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000018, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0, K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM) == 0x000020, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0::K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0, CallFunc_Redirect_FTUEPopin_Type_FTUEPopin) == 0x000038, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0::CallFunc_Redirect_FTUEPopin_Type_FTUEPopin' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0, CallFunc_SetContent_ReturnValue) == 0x000048, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0::CallFunc_SetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_FishingHud_C_On_MenuAnchor_Popin_Nibbles_GetUserMenuContent_0::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_FishingHud.WBP_FishingHud_C.OnBobberCreated
// 0x0010 (0x0010 - 0x0000)
struct WBP_FishingHud_C_OnBobberCreated final
{
public:
	class UFishingViewComponent*                  FishingView;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 bobble;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FishingHud_C_OnBobberCreated) == 0x000008, "Wrong alignment on WBP_FishingHud_C_OnBobberCreated");
static_assert(sizeof(WBP_FishingHud_C_OnBobberCreated) == 0x000010, "Wrong size on WBP_FishingHud_C_OnBobberCreated");
static_assert(offsetof(WBP_FishingHud_C_OnBobberCreated, FishingView) == 0x000000, "Member 'WBP_FishingHud_C_OnBobberCreated::FishingView' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_OnBobberCreated, bobble) == 0x000008, "Member 'WBP_FishingHud_C_OnBobberCreated::bobble' has a wrong offset!");

// Function WBP_FishingHud.WBP_FishingHud_C.OnFishCaught
// 0x0018 (0x0018 - 0x0000)
struct WBP_FishingHud_C_OnFishCaught final
{
public:
	class UFishingComponent*                      Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFishCaughtResult                      Result;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_FishingHud_C_OnFishCaught) == 0x000008, "Wrong alignment on WBP_FishingHud_C_OnFishCaught");
static_assert(sizeof(WBP_FishingHud_C_OnFishCaught) == 0x000018, "Wrong size on WBP_FishingHud_C_OnFishCaught");
static_assert(offsetof(WBP_FishingHud_C_OnFishCaught, Source) == 0x000000, "Member 'WBP_FishingHud_C_OnFishCaught::Source' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_OnFishCaught, Result) == 0x000008, "Member 'WBP_FishingHud_C_OnFishCaught::Result' has a wrong offset!");

// Function WBP_FishingHud.WBP_FishingHud_C.OnReceivedFishingEncouragement
// 0x0010 (0x0010 - 0x0000)
struct WBP_FishingHud_C_OnReceivedFishingEncouragement final
{
public:
	class UFishingComponent*                      Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      FromVc;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FishingHud_C_OnReceivedFishingEncouragement) == 0x000008, "Wrong alignment on WBP_FishingHud_C_OnReceivedFishingEncouragement");
static_assert(sizeof(WBP_FishingHud_C_OnReceivedFishingEncouragement) == 0x000010, "Wrong size on WBP_FishingHud_C_OnReceivedFishingEncouragement");
static_assert(offsetof(WBP_FishingHud_C_OnReceivedFishingEncouragement, Source) == 0x000000, "Member 'WBP_FishingHud_C_OnReceivedFishingEncouragement::Source' has a wrong offset!");
static_assert(offsetof(WBP_FishingHud_C_OnReceivedFishingEncouragement, FromVc) == 0x000008, "Member 'WBP_FishingHud_C_OnReceivedFishingEncouragement::FromVc' has a wrong offset!");

// Function WBP_FishingHud.WBP_FishingHud_C.UpdateDebugUI
// 0x0410 (0x0410 - 0x0000)
struct WBP_FishingHud_C_UpdateDebugUI final
{
public:
	class UFishingComponent*                      FishingComp;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebuggingOn__IsDebuggingOn;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFishingState_NEW                             CallFunc_GetDebugInfo_CurrentFishingState;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFFishingLevelSegmentActionType               CallFunc_GetDebugInfo_FishActionType;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C45[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDebugInfo_CurrentSegmentNextIndex;     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDebugInfo_TotalSegments;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_CurrentActionLerpPctg;       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_TimePassed;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_ActionStated;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_ActionTargetLocation;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_CurrentBobberSpeed;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_CurrentBobberPosition;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_TotalTaskTime;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_RawTaskTimeWithoutPause;     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_TimeInCurrentTask;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugInfo_FishName;                    // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_SafeZonePosition;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFishingState_NEW                             CallFunc_GetDebugInfo_CurrentFishingState_1;       // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFFishingLevelSegmentActionType               CallFunc_GetDebugInfo_FishActionType_1;            // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C46[0x1];                                     // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDebugInfo_CurrentSegmentNextIndex_1;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDebugInfo_TotalSegments_1;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_CurrentActionLerpPctg_1;     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_TimePassed_1;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_ActionStated_1;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_ActionTargetLocation_1;      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_CurrentBobberSpeed_1;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_CurrentBobberPosition_1;     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_TotalTaskTime_1;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_RawTaskTimeWithoutPause_1;   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_TimeInCurrentTask_1;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C47[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugInfo_FishName_1;                  // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugInfo_SafeZonePosition_1;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C48[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_UTIL_FloatToStringWithPrecision_OutString; // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_UTIL_FloatToStringWithPrecision_OutString_1; // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_UTIL_FloatToStringWithPrecision_OutString_2; // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_UTIL_FloatToStringWithPrecision_OutString_3; // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_UTIL_FloatToStringWithPrecision_OutString_4; // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
