#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PregameUIManager

#include "Basic.hpp"

#include "F_GenericErrorModalPayload_structs.hpp"
#include "ValeriaDTOs_structs.hpp"
#include "Palia_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S6UICore_structs.hpp"


namespace SDK::Params
{

// Function WBP_PregameUIManager.WBP_PregameUIManager_C.AddLoadingScreenWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_PregameUIManager_C_AddLoadingScreenWidget final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PregameUIManager_C_AddLoadingScreenWidget) == 0x000008, "Wrong alignment on WBP_PregameUIManager_C_AddLoadingScreenWidget");
static_assert(sizeof(WBP_PregameUIManager_C_AddLoadingScreenWidget) == 0x000008, "Wrong size on WBP_PregameUIManager_C_AddLoadingScreenWidget");
static_assert(offsetof(WBP_PregameUIManager_C_AddLoadingScreenWidget, Widget) == 0x000000, "Member 'WBP_PregameUIManager_C_AddLoadingScreenWidget::Widget' has a wrong offset!");

// Function WBP_PregameUIManager.WBP_PregameUIManager_C.Center Character Creation Subscene on Character
// 0x0210 (0x0210 - 0x0000)
struct WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character final
{
public:
	class AVAL_CharacterRenderStudio*             Studio;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVAL_CharacterRenderStudioState               State;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4418[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4419[0xB];                                     // 0x0015(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441A[0x8];                                     // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0090(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue;        // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441B[0x8];                                     // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CenterSubSceneOnTransform_ReturnValue;    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character) == 0x000010, "Wrong alignment on WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character");
static_assert(sizeof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character) == 0x000210, "Wrong size on WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, Studio) == 0x000000, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::Studio' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, State) == 0x000008, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::State' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, Temp_name_Variable) == 0x00000C, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, CallFunc_GetCharacter_ReturnValue) == 0x000080, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, CallFunc_GetTransform_ReturnValue_1) == 0x000090, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, CallFunc_MakeRelativeTransform_ReturnValue) == 0x0000F0, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::CallFunc_MakeRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, CallFunc_BreakTransform_Location) == 0x000150, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, CallFunc_BreakTransform_Rotation) == 0x000168, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, CallFunc_BreakTransform_Scale) == 0x000180, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, CallFunc_MakeTransform_ReturnValue) == 0x0001A0, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character, CallFunc_CenterSubSceneOnTransform_ReturnValue) == 0x000200, "Member 'WBP_PregameUIManager_C_Center_Character_Creation_Subscene_on_Character::CallFunc_CenterSubSceneOnTransform_ReturnValue' has a wrong offset!");

// Function WBP_PregameUIManager.WBP_PregameUIManager_C.DisplayLoadingScreen
// 0x0018 (0x0018 - 0x0000)
struct WBP_PregameUIManager_C_DisplayLoadingScreen final
{
public:
	bool                                          Display;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_PC;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PregameUIManager_C_DisplayLoadingScreen) == 0x000008, "Wrong alignment on WBP_PregameUIManager_C_DisplayLoadingScreen");
static_assert(sizeof(WBP_PregameUIManager_C_DisplayLoadingScreen) == 0x000018, "Wrong size on WBP_PregameUIManager_C_DisplayLoadingScreen");
static_assert(offsetof(WBP_PregameUIManager_C_DisplayLoadingScreen, Display) == 0x000000, "Member 'WBP_PregameUIManager_C_DisplayLoadingScreen::Display' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_DisplayLoadingScreen, CallFunc_GetValeriaPlayerController_PC) == 0x000008, "Member 'WBP_PregameUIManager_C_DisplayLoadingScreen::CallFunc_GetValeriaPlayerController_PC' has a wrong offset!");
static_assert(offsetof(WBP_PregameUIManager_C_DisplayLoadingScreen, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000010, "Member 'WBP_PregameUIManager_C_DisplayLoadingScreen::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");

// Function WBP_PregameUIManager.WBP_PregameUIManager_C.DisplayMatchmakingErrorResult
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_PregameUIManager_C_DisplayMatchmakingErrorResult final
{
public:
	struct FOSSVAL_MatchmakingResult              Result;                                            // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PregameUIManager_C_DisplayMatchmakingErrorResult) == 0x000008, "Wrong alignment on WBP_PregameUIManager_C_DisplayMatchmakingErrorResult");
static_assert(sizeof(WBP_PregameUIManager_C_DisplayMatchmakingErrorResult) == 0x0000C0, "Wrong size on WBP_PregameUIManager_C_DisplayMatchmakingErrorResult");
static_assert(offsetof(WBP_PregameUIManager_C_DisplayMatchmakingErrorResult, Result) == 0x000000, "Member 'WBP_PregameUIManager_C_DisplayMatchmakingErrorResult::Result' has a wrong offset!");

// Function WBP_PregameUIManager.WBP_PregameUIManager_C.ExecuteUbergraph_WBP_PregameUIManager
// 0x3408 (0x3408 - 0x0000)
struct WBP_PregameUIManager_C_ExecuteUbergraph_WBP_PregameUIManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetServerStatusUrl_ReturnValue;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441E[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FVAL_ValidateLoadoutErrorPayload& ErrorPayload)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441F[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget_3;                  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_ModalInterface_GenericError_C> K2Node_DynamicCast_AsBP_Modal_Interface_Generic_Error; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4420[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget_2;                  // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable_1;                            // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4421[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_ModalInterface_GenericError_C> K2Node_DynamicCast_AsBP_Modal_Interface_Generic_Error_1; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4422[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00F8(0x0018)()
	class FName                                   Temp_name_Variable;                                // 0x0110(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0118(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValeriaWeather*                        CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValEnvironmentManager*                 CallFunc_GetCurrentEnvManager_ReturnValue;         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaWeather*                        CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValEnvironmentManager*                 CallFunc_GetCurrentEnvManager_ReturnValue_1;       // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget_1;                  // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable_2;                            // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_ModalInterface_GenericError_C> K2Node_DynamicCast_AsBP_Modal_Interface_Generic_Error_2; // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4423[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4424[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget;                    // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable_3;                            // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_ModalInterface_GenericError_C> K2Node_DynamicCast_AsBP_Modal_Interface_Generic_Error_3; // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4425[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_GenericErrorModalPayload            K2Node_MakeStruct_F_GenericErrorModalPayload;      // 0x01E0(0x0098)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_PC;            // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0290(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FOSSVAL_MatchmakingResult& Result)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x02A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_MatchmakingResult              K2Node_CustomEvent_Result_1;                       // 0x02B0(0x00C0)(ConstParm)
	class UOSSVAL_AsyncActionQueryUserPrivileges* CallFunc_QueryUserPrivileges_ReturnValue;          // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4426[0x5];                                     // 0x037B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_MatchmakingTicketContext       K2Node_MakeStruct_OSSVAL_MatchmakingTicketContext; // 0x0388(0x0010)(NoDestructor)
	class UVAL_AsyncAction_JoinServer*            CallFunc_JoinServer_ReturnValue;                   // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bQueryResult;                   // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4427[0x1];                                     // 0x03A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bQueryResult)>            K2Node_CreateDelegate_OutputDelegate_15;           // 0x03A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4428[0x4];                                     // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ServerType;                     // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FOSSVAL_MatchmakingRequestContext      K2Node_MakeStruct_OSSVAL_MatchmakingRequestContext; // 0x03C8(0x00A8)()
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue_1;       // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x0478(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_AsyncAction_Matchmaking*           CallFunc_StartMatchmaking_ReturnValue;             // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FOSSVAL_MatchmakingResult& Result)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x0490(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4429[0x7];                                     // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_PC_1;          // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVALUI_PregameState                           CallFunc_GetCurrentPregameStateId_ReturnValue;     // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442A[0x3];                                     // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x04B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442B[0x3];                                     // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x04C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x04D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x04E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Number)>                 K2Node_CreateDelegate_OutputDelegate_21;           // 0x04F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable_4;                            // 0x0500(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FOSSVAL_MatchmakingResult& Result)> K2Node_CreateDelegate_OutputDelegate_22;           // 0x0508(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CrossplayNotification_Console_C*   K2Node_DynamicCast_AsWBP_Crossplay_Notification_Console; // 0x0518(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442C[0x7];                                     // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FF_GenericErrorModalPayload            K2Node_MakeStruct_F_GenericErrorModalPayload_1;    // 0x0530(0x0098)(HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorMsg_1;                     // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorMsg;                       // 0x05D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_RedirectModalType_ReturnValue;            // 0x05E8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue;                    // 0x0610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVALUI_CharacterCreationState                 K2Node_Event_NewState_3;                           // 0x0619(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x061A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442D[0x5];                                     // 0x061B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0620(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget_4;                  // 0x0628(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALDTOS_MetaCharacterFormat           CallFunc_GetCachedCharacterAtIndex_Checked_OutCharacter; // 0x0630(0x0778)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0DA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_CharacterRenderStudio* Studio, EVAL_CharacterRenderStudioState State)> K2Node_CreateDelegate_OutputDelegate_23;           // 0x0DB0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_CharacterRenderStudio* Studio, EVAL_CharacterRenderStudioState State)> K2Node_CreateDelegate_OutputDelegate_24;           // 0x0DC0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVALDTOS_MetaCharacterFormat           K2Node_CustomEvent_Commited_Character;             // 0x0DD0(0x0778)()
	TArray<struct FVALDTOS_MetaCharacterFormat>   K2Node_MakeArray_Array;                            // 0x1548(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_ComponentBoundEvent_FirstSelection;         // 0x1558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442E[0x3];                                     // 0x1559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS6UI_InputMode                        CallFunc_CreateInputMode_UIOnly_ReturnValue;       // 0x155C(0x0010)(NoDestructor)
	uint8                                         Pad_442F[0x4];                                     // 0x156C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_StateViewModel*                   CallFunc_GetViewModel_ReturnValue;                 // 0x1570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_MatchmakingTicket              Temp_struct_Variable;                              // 0x1578(0x0098)()
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x1610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_25;           // 0x1614(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_26;           // 0x1624(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4430[0x4];                                     // 0x1634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_CharacterCreationScreenBase*     CallFunc_GetCharacterCreationScreen_ReturnValue;   // 0x1638(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_StateViewModel*                   CallFunc_GetViewModel_ReturnValue_1;               // 0x1640(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS6UI_InputMode                        CallFunc_CreateInputMode_UIOnly_ReturnValue_1;     // 0x1648(0x0010)(NoDestructor)
	struct FOSSVAL_MatchmakingResult              Temp_struct_Variable_1;                            // 0x1658(0x00C0)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x1718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4431[0x7];                                     // 0x1719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x1720(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXSXPlatform_ReturnValue;                // 0x1728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x1729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x172A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x172B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4432[0x4];                                     // 0x172C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x1730(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x1738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4433[0x7];                                     // 0x1739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue_1;                  // 0x1740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x1748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4434[0x7];                                     // 0x1749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x1750(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x1758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4435[0x3];                                     // 0x1759(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x175C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4436[0x4];                                     // 0x1764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActorWithTag_ReturnValue;              // 0x1768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x1770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4437[0x7];                                     // 0x1771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANiagaraActor*                          K2Node_DynamicCast_AsNiagara_Actor;                // 0x1778(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x1780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVALUI_LobbyState                             K2Node_Event_NewState_2;                           // 0x1781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x1782(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x1783(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4438[0x4];                                     // 0x1784(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSSVAL_MatchmakingTicket              K2Node_CustomEvent_Ticket;                         // 0x1788(0x0098)(ConstParm)
	struct FOSSVAL_MatchmakingResult              K2Node_CustomEvent_Result_3;                       // 0x1820(0x00C0)(ConstParm)
	class AValeriaCharacter*                      CallFunc_GetCharacter_ReturnValue_1;               // 0x18E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVALDTOS_MetaCharacterFormat           K2Node_ComponentBoundEvent_CurrentCharacter;       // 0x18E8(0x0778)()
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue; // 0x2060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue_1; // 0x2068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationLoadout     CallFunc_PersistenceDTOsToLoadout_ReturnValue;     // 0x2070(0x0900)()
	class UVAL_ApplyCustomizationsToActorProxy*   CallFunc_ApplyCustomizationsToActor_ReturnValue;   // 0x2970(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x2978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4439[0x7];                                     // 0x2979(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue_2; // 0x2980(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue_3; // 0x2988(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVAL_ValidateLoadoutErrorPayload       K2Node_CustomEvent_ErrorPayload;                   // 0x2990(0x0050)()
	struct FF_GenericErrorModalPayload            K2Node_MakeStruct_F_GenericErrorModalPayload_2;    // 0x29E0(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_Should_Show_Dialog_For_Error_Map_Should_Show_Dialog; // 0x2A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_443A[0x7];                                     // 0x2A79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_RedirectModalType_ReturnValue_1;          // 0x2A80(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x2AA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FOSSVAL_MatchmakingTicket& Ticket, struct FOSSVAL_MatchmakingResult& Result)> K2Node_CreateDelegate_OutputDelegate_27;           // 0x2AB0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue_2;                  // 0x2AC0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x2AC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x2AC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_443B[0x6];                                     // 0x2ACA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class USkeletalMeshComponent*>           CallFunc_GetAllMeshComponents_ReturnValue;         // 0x2AD0(0x0050)(ContainsInstancedReference)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x2B20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_Set_ToArray_Result;                       // 0x2B28(0x0010)(ReferenceParm, ContainsInstancedReference)
	EVALUI_LoginState                             K2Node_Event_NewState_1;                           // 0x2B38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_443C[0x7];                                     // 0x2B39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x2B40(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x2B50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_443D[0x7];                                     // 0x2B51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x2B58(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x2B70(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x2BC0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x2BD0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x2BE8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_2; // 0x2BF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ErrorCode;                            // 0x2C00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_443E[0x4];                                     // 0x2C04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x2C08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x2C10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x2C18(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x2C68(0x0010)(ReferenceParm)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable_5;                            // 0x2C78(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x2C80(0x0018)()
	TScriptInterface<class IBP_ModalInterface_GenericError_C> K2Node_DynamicCast_AsBP_Modal_Interface_Generic_Error_4; // 0x2C98(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x2CA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x2CA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_443F[0x6];                                     // 0x2CAA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AnnouncementsModalDialog_CM_C*     K2Node_DynamicCast_AsWBP_Announcements_Modal_Dialog_CM; // 0x2CB0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x2CB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x2CB9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4440[0x6];                                     // 0x2CBA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_RedirectModalType_ReturnValue_2;          // 0x2CC0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue_3;                  // 0x2CE8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x2CF0(0x0018)()
	struct FF_GenericErrorModalPayload            K2Node_MakeStruct_F_GenericErrorModalPayload_3;    // 0x2D08(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x2DA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4441[0x7];                                     // 0x2DA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_3; // 0x2DA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x2DB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4442[0x7];                                     // 0x2DB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x2DB8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ErrorCode;                      // 0x2DC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x2DCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4443[0x3];                                     // 0x2DCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x2DD0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x2E08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x2E0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVALUI_PregameState                           CallFunc_GetCurrentPregameStateId_ReturnValue_1;   // 0x2E0D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4444[0x2];                                     // 0x2E0E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget_5;                  // 0x2E10(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x2E18(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EVALUI_PregameState                           K2Node_Event_NewState;                             // 0x2E28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x2E29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4445[0x6];                                     // 0x2E2A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_CharacterRenderStudio*             CallFunc_GetCharacterRenderStudio_ReturnValue;     // 0x2E30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestScene_ReturnValue;                 // 0x2E38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestScene_ReturnValue_1;               // 0x2E39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4446[0x2];                                     // 0x2E3A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_28;           // 0x2E3C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4447[0x4];                                     // 0x2E4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x2E50(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x2E58(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x2E60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4448[0x7];                                     // 0x2E61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSSVAL_MatchmakingResult              K2Node_CustomEvent_Result;                         // 0x2E68(0x00C0)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x2F28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FF_GenericErrorModalPayload            CallFunc_CreateErrorPayloadForMatchmakingResult_Payload; // 0x2F30(0x0098)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_29;           // 0x2FC8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_PC_2;          // 0x2FD8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x2FE0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x2FE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggedIn_ReturnValue;                   // 0x2FE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4449[0x6];                                     // 0x2FEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget_1;                             // 0x2FF0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x2FF8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x3000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x3008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Number)>                 K2Node_CreateDelegate_OutputDelegate_30;           // 0x3010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_MatchmakingRequestContext      Temp_struct_Variable_2;                            // 0x3020(0x00A8)()
	TDelegate<void(struct FOSSVAL_MatchmakingResult& Result)> K2Node_CreateDelegate_OutputDelegate_31;           // 0x30C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_MatchmakingResult              Temp_struct_Variable_3;                            // 0x30D8(0x00C0)()
	TDelegate<void(const class FString& ErrorMsg)> K2Node_CreateDelegate_OutputDelegate_32;           // 0x3198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMsg)> K2Node_CreateDelegate_OutputDelegate_33;           // 0x31A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x31B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444A[0x7];                                     // 0x31B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_5;            // 0x31C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_PC_3;          // 0x31C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_MatchmakingRequestContext      K2Node_CustomEvent_RequestContext;                 // 0x31D0(0x00A8)(ConstParm)
	struct FOSSVAL_MatchmakingResult              K2Node_CustomEvent_Result_2;                       // 0x3278(0x00C0)(ConstParm)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x3338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasKicked_ReturnValue;                    // 0x3340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444B[0x7];                                     // 0x3341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_PC_4;          // 0x3348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_2; // 0x3350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_PC_5;          // 0x3358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_3; // 0x3360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FOSSVAL_MatchmakingRequestContext& RequestContext, struct FOSSVAL_MatchmakingResult& Result)> K2Node_CreateDelegate_OutputDelegate_34;           // 0x3368(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HadTravelNetworkFailure_ReturnValue;      // 0x3378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444C[0x7];                                     // 0x3379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnvironment_ReturnValue;               // 0x3380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_RedirectModalType_ReturnValue_3;          // 0x3390(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x33B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444D[0x7];                                     // 0x33B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue_4;                  // 0x33C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x33C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444E[0x7];                                     // 0x33C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_RedirectModalType_ReturnValue_4;          // 0x33D0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue_5;                  // 0x33F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x3400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PregameUIManager_C_ExecuteUbergraph_WBP_PregameUIManager) == 0x000008, "Wrong alignment on WBP_PregameUIManager_C_ExecuteUbergraph_WBP_PregameUIManager");
static_assert(sizeof(WBP_PregameUIManager_C_ExecuteUbergraph_WBP_PregameUIManager) == 0x003408, "Wrong size on WBP_PregameUIManager_C_ExecuteUbergraph_WBP_PregameUIManager");
