#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Guild_TransferOwnershipConfirmation_Modal_PF

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Guild_TransferOwnershipConfirmation_Modal_PF.WBP_Guild_TransferOwnershipConfirmation_Modal_PF_C
// 0x0058 (0x05B0 - 0x0558)
class UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C final : public UVALUI_ModalWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                PlayerNameTextBlock;                               // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class US6UI_BackgroundBlur*                   S6UI_BackgroundBlur;                               // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerCharacterProfileImage_CM_C*  WBP_PlayerCharacterProfileImage_CM;                // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_PopupSecondary_02_PF_C*   WBP_Template_PopupSecondary_02_PF;                 // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       NewOwnerId;                                        // 0x0580(0x0030)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Guild_TransferOwnershipConfirmation_Modal_PF_WBP_Template_PopupSecondary_02_PF_K2Node_ComponentBoundEvent_0_Confirm__DelegateSignature();
	void BndEvt__WBP_Guild_TransferOwnershipConfirmation_Modal_PF_WBP_Template_PopupSecondary_02_PF_K2Node_ComponentBoundEvent_1_Cancel__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_PF(int32 EntryPoint, struct FGuid& K2Node_CustomEvent_AccountId_1, TDelegate<void(struct FGuid& AccountId)> K2Node_CreateDelegate_OutputDelegate, struct FGuid& K2Node_CustomEvent_AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& K2Node_CustomEvent_Names, TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate_1, TArray<struct FOSSVAL_CharacterNameAndId>& Temp_struct_Variable, const struct FGuid& Temp_struct_Variable_1, class FText CallFunc_Conv_StringToText_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, bool K2Node_Event_IsDesignTime, const struct FGuid& CallFunc_GetAccountId_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void HandleTransferFailure(const class FString& ErrorMessage);
	void HandleTransferSuccess();
	void OnFailure_B93A118A441B40CAA7E2C98B133D7F5E(struct FGuid& AccountId);
	void OnSuccess_B93A118A441B40CAA7E2C98B133D7F5E(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names);
	void PreConstruct(bool IsDesignTime);
	void TransferOwnership(class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_TryGetUserMembership_bOutHasMembership, const struct FVAL_PlayerGuild& CallFunc_TryGetUserMembership_PlayerGuild, bool CallFunc_TryGetUserMembership_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, const struct FVAL_PlayerGuild& K2Node_SetFieldsInStruct_StructOut, class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_3, bool CallFunc_CanTransferGuildOwnership_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Guild_TransferOwnershipConfirmation_Modal_PF_C">();
	}
	static class UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C>();
	}
};
static_assert(alignof(UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C) == 0x000008, "Wrong alignment on UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C");
static_assert(sizeof(UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C) == 0x0005B0, "Wrong size on UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C");
static_assert(offsetof(UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C, UberGraphFrame) == 0x000558, "Member 'UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C, PlayerNameTextBlock) == 0x000560, "Member 'UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C::PlayerNameTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C, S6UI_BackgroundBlur) == 0x000568, "Member 'UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C::S6UI_BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C, WBP_PlayerCharacterProfileImage_CM) == 0x000570, "Member 'UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C::WBP_PlayerCharacterProfileImage_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C, WBP_Template_PopupSecondary_02_PF) == 0x000578, "Member 'UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C::WBP_Template_PopupSecondary_02_PF' has a wrong offset!");
static_assert(offsetof(UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C, NewOwnerId) == 0x000580, "Member 'UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C::NewOwnerId' has a wrong offset!");

}

