#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cooking_Hud_Shelved

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Cooking_Hud_Shelved.WBP_Cooking_Hud_Shelved_C.ExecuteUbergraph_WBP_Cooking_Hud_Shelved
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C9[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FComplexRecipeRecord& RecipeRecord)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               K2Node_DynamicCast_AsValeria_Player_Controller;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CA[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FComplexRecipeRecord                   K2Node_MakeStruct_ComplexRecipeRecord;             // 0x0038(0x0070)(ContainsInstancedReference)
	class UCookingSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Client_GetLocalPlayerInCrafterCamera_ReturnValue; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CB[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CC[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCookingSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved) == 0x000008, "Wrong alignment on WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved");
static_assert(sizeof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved) == 0x0000D8, "Wrong size on WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, EntryPoint) == 0x000000, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, Temp_byte_Variable) == 0x000004, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, Temp_bool_Variable) == 0x000006, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, K2Node_DynamicCast_AsValeria_Player_Controller) == 0x000020, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::K2Node_DynamicCast_AsValeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, K2Node_Event_IsDesignTime) == 0x000029, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000030, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, K2Node_MakeStruct_ComplexRecipeRecord) == 0x000038, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::K2Node_MakeStruct_ComplexRecipeRecord' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000A8, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, CallFunc_Client_GetLocalPlayerInCrafterCamera_ReturnValue) == 0x0000B0, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::CallFunc_Client_GetLocalPlayerInCrafterCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B4, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000C8, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved, K2Node_Select_Default) == 0x0000D0, "Member 'WBP_Cooking_Hud_Shelved_C_ExecuteUbergraph_WBP_Cooking_Hud_Shelved::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Cooking_Hud_Shelved.WBP_Cooking_Hud_Shelved_C.HandleIngredientShelfChanged
// 0x0140 (0x0140 - 0x0000)
struct WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged final
{
public:
	struct FComplexRecipeRecord                   RecipeRecord;                                      // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<bool>                                  StarQuality;                                       // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 ShelfIngredientCounts;                             // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<class UTexture2D*>                     ShelfIngredientIcons;                              // 0x0090(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CD[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FComplexRecipeIngredientSet            CallFunc_Array_Get_Item;                           // 0x00B8(0x0038)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CE[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Cooking_ShelvedIngredient_C*       K2Node_DynamicCast_AsWBP_Cooking_Shelved_Ingredient; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CF[0x2];                                     // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D0[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item_1;                         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D1[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged) == 0x000008, "Wrong alignment on WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged");
static_assert(sizeof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged) == 0x000140, "Wrong size on WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, RecipeRecord) == 0x000000, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::RecipeRecord' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, StarQuality) == 0x000070, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::StarQuality' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, ShelfIngredientCounts) == 0x000080, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::ShelfIngredientCounts' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, ShelfIngredientIcons) == 0x000090, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::ShelfIngredientIcons' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, Temp_int_Array_Index_Variable) == 0x0000B0, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, Temp_int_Array_Index_Variable_1) == 0x0000B4, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x0000F4, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, Temp_byte_Variable) == 0x0000F5, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, Temp_byte_Variable_1) == 0x0000F6, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, Temp_bool_Variable) == 0x0000F7, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Array_Add_ReturnValue) == 0x0000F8, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Array_Add_ReturnValue_1) == 0x0000FC, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Array_Length_ReturnValue_2) == 0x000100, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000104, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_GetChildAt_ReturnValue) == 0x000108, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, K2Node_DynamicCast_AsWBP_Cooking_Shelved_Ingredient) == 0x000110, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::K2Node_DynamicCast_AsWBP_Cooking_Shelved_Ingredient' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, K2Node_Select_Default) == 0x000119, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, Temp_int_Loop_Counter_Variable_1) == 0x00011C, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Add_IntInt_ReturnValue_1) == 0x000120, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Array_Get_Item_1) == 0x000128, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Array_Length_ReturnValue_3) == 0x000130, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Less_IntInt_ReturnValue_1) == 0x000134, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged, CallFunc_Array_Add_ReturnValue_2) == 0x000138, "Member 'WBP_Cooking_Hud_Shelved_C_HandleIngredientShelfChanged::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function WBP_Cooking_Hud_Shelved.WBP_Cooking_Hud_Shelved_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Cooking_Hud_Shelved_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Hud_Shelved_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Cooking_Hud_Shelved_C_PreConstruct");
static_assert(sizeof(WBP_Cooking_Hud_Shelved_C_PreConstruct) == 0x000001, "Wrong size on WBP_Cooking_Hud_Shelved_C_PreConstruct");
static_assert(offsetof(WBP_Cooking_Hud_Shelved_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Cooking_Hud_Shelved_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

