#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Slider_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Slider_CM.WBP_Slider_CM_C.BndEvt__WBP_Slider_CM_AnalogSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Slider_CM_C_BndEvt__WBP_Slider_CM_AnalogSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Slider_CM_C_BndEvt__WBP_Slider_CM_AnalogSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Slider_CM_C_BndEvt__WBP_Slider_CM_AnalogSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Slider_CM_C_BndEvt__WBP_Slider_CM_AnalogSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Slider_CM_C_BndEvt__WBP_Slider_CM_AnalogSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Slider_CM_C_BndEvt__WBP_Slider_CM_AnalogSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_Slider_CM_C_BndEvt__WBP_Slider_CM_AnalogSlider_K2Node_ComponentBoundEvent_9_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Slider_CM.WBP_Slider_CM_C.ExecuteUbergraph_WBP_Slider_CM
// 0x0040 (0x0040 - 0x0000)
struct WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5529[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CallDelegate_Value_ImplicitCast;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_InRangeB_ImplicitCast;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_InRangeA_ImplicitCast;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM) == 0x000008, "Wrong alignment on WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM");
static_assert(sizeof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM) == 0x000040, "Wrong size on WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM");
static_assert(offsetof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM, EntryPoint) == 0x000000, "Member 'WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000008, "Member 'WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x00000C, "Member 'WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM, K2Node_ComponentBoundEvent_Value) == 0x000010, "Member 'WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM, CallFunc_MapRangeClamped_ReturnValue) == 0x000018, "Member 'WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000020, "Member 'WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM, K2Node_CallDelegate_Value_ImplicitCast) == 0x000028, "Member 'WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM::K2Node_CallDelegate_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM, CallFunc_MapRangeClamped_InRangeB_ImplicitCast) == 0x000030, "Member 'WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM::CallFunc_MapRangeClamped_InRangeB_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM, CallFunc_MapRangeClamped_InRangeA_ImplicitCast) == 0x000038, "Member 'WBP_Slider_CM_C_ExecuteUbergraph_WBP_Slider_CM::CallFunc_MapRangeClamped_InRangeA_ImplicitCast' has a wrong offset!");

// Function WBP_Slider_CM.WBP_Slider_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Slider_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Slider_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Slider_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_Slider_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Slider_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_Slider_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Slider_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Slider_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Slider_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Slider_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Slider_CM.WBP_Slider_CM_C.OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Slider_CM_C_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Slider_CM_C_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Slider_CM_C_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Slider_CM_C_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_Slider_CM_C_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Slider_CM_C_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Slider_CM_C_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Slider_CM.WBP_Slider_CM_C.SetValue
// 0x0010 (0x0010 - 0x0000)
struct WBP_Slider_CM_C_SetValue final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Slider_CM_C_SetValue) == 0x000008, "Wrong alignment on WBP_Slider_CM_C_SetValue");
static_assert(sizeof(WBP_Slider_CM_C_SetValue) == 0x000010, "Wrong size on WBP_Slider_CM_C_SetValue");
static_assert(offsetof(WBP_Slider_CM_C_SetValue, Value) == 0x000000, "Member 'WBP_Slider_CM_C_SetValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_Slider_CM_C_SetValue, CallFunc_SetValue_InValue_ImplicitCast) == 0x000008, "Member 'WBP_Slider_CM_C_SetValue::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");

}

