#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ButtonTab_Secondary_02_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ButtonTab_Secondary_02_CM.WBP_ButtonTab_Secondary_02_CM_C
// 0x0060 (0x0320 - 0x02C0)
class UWBP_ButtonTab_Secondary_02_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_93;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TabImageDisplay;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TabTextBlock;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListItemButton_CM_C*               WBP_ListItemButton_CM;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             TabImage;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Tab_Text;                                          // 0x02F0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             On_Selected;                                       // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 HoverStyle_CM;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ButtonTab_Secondary_02_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature(class UWBP_ListItemButton_CM_C* ListItemButton);
	void BndEvt__WBP_ButtonTab_Secondary_02_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature(class UWBP_ListItemButton_CM_C* ListItemButton);
	void BndEvt__WBP_ButtonTab_Secondary_02_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature(class UWBP_ListItemButton_CM_C* ListItemButton);
	void ExecuteUbergraph_WBP_ButtonTab_Secondary_02_CM(int32 EntryPoint, class UWBP_ListItemButton_CM_C* K2Node_ComponentBoundEvent_ListItemButton, bool K2Node_Event_IsDesignTime, class UWBP_ListItemButton_CM_C* K2Node_ComponentBoundEvent_ListItemButton_2, class UWBP_ListItemButton_CM_C* K2Node_ComponentBoundEvent_ListItemButton_1);
	void On_Selected__DelegateSignature(class UWBP_ButtonTab_Secondary_02_CM_C* Selected);
	void PreConstruct(bool IsDesignTime);
	void Set_Selected(bool IsSelected, bool Temp_bool_Variable, class UVALUI_TextBlockStyle* Temp_object_Variable, class UVALUI_TextBlockStyle* Temp_object_Variable_1, class UVALUI_TextBlockStyle* K2Node_Select_Default, const struct FSlateColor& K2Node_MakeStruct_SlateColor, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1, bool Temp_bool_Variable_1, const struct FSlateColor& K2Node_Select_Default_1);
	void SetIconOnly(bool InIconOnly);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ButtonTab_Secondary_02_CM_C">();
	}
	static class UWBP_ButtonTab_Secondary_02_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ButtonTab_Secondary_02_CM_C>();
	}
};
static_assert(alignof(UWBP_ButtonTab_Secondary_02_CM_C) == 0x000008, "Wrong alignment on UWBP_ButtonTab_Secondary_02_CM_C");
static_assert(sizeof(UWBP_ButtonTab_Secondary_02_CM_C) == 0x000320, "Wrong size on UWBP_ButtonTab_Secondary_02_CM_C");
static_assert(offsetof(UWBP_ButtonTab_Secondary_02_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ButtonTab_Secondary_02_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonTab_Secondary_02_CM_C, SizeBox_93) == 0x0002C8, "Member 'UWBP_ButtonTab_Secondary_02_CM_C::SizeBox_93' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonTab_Secondary_02_CM_C, TabImageDisplay) == 0x0002D0, "Member 'UWBP_ButtonTab_Secondary_02_CM_C::TabImageDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonTab_Secondary_02_CM_C, TabTextBlock) == 0x0002D8, "Member 'UWBP_ButtonTab_Secondary_02_CM_C::TabTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonTab_Secondary_02_CM_C, WBP_ListItemButton_CM) == 0x0002E0, "Member 'UWBP_ButtonTab_Secondary_02_CM_C::WBP_ListItemButton_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonTab_Secondary_02_CM_C, TabImage) == 0x0002E8, "Member 'UWBP_ButtonTab_Secondary_02_CM_C::TabImage' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonTab_Secondary_02_CM_C, Tab_Text) == 0x0002F0, "Member 'UWBP_ButtonTab_Secondary_02_CM_C::Tab_Text' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonTab_Secondary_02_CM_C, On_Selected) == 0x000308, "Member 'UWBP_ButtonTab_Secondary_02_CM_C::On_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonTab_Secondary_02_CM_C, HoverStyle_CM) == 0x000318, "Member 'UWBP_ButtonTab_Secondary_02_CM_C::HoverStyle_CM' has a wrong offset!");

}

