#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VillagerDebugPlate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VillagerDebugPlate.WBP_VillagerDebugPlate_C
// 0x0048 (0x0308 - 0x02C0)
class UWBP_VillagerDebugPlate_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                Text_VillagerBlueprintName;                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_VillagerConfigName;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_VillagerCoreConfigName;                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Tags;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AValeriaVillagerCharacter*              Villager;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_SimpleScaledText_C*>        TagTextBoxes;                                      // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AValeriaPlayerController*               OwningPlayerController;                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ActorTagComponentUpdated();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_VillagerDebugPlate(int32 EntryPoint, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AValeriaPlayerController* K2Node_DynamicCast_AsValeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, class AValeriaVillagerCharacter* K2Node_CustomEvent_Villager, int64 CallFunc_Conv_IntToInt64_ReturnValue, class FName CallFunc_GetVillagerRowNameByConfigId_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class FText CallFunc_Conv_NameToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, int32 CallFunc_GetVillagerCoreIdByVillagerId_ReturnValue, class FText CallFunc_Format_ReturnValue, int64 CallFunc_Conv_IntToInt64_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, class FName CallFunc_GetVillagerRowNameByCoreConfigId_ReturnValue, class FText CallFunc_Conv_NameToText_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, const class FString& CallFunc_GetObjectName_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Conv_StringToText_ReturnValue, class FText CallFunc_Format_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_4, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_2, class FText CallFunc_Format_ReturnValue_2, bool CallFunc_IsValid_ReturnValue, class UActorTagComponent* CallFunc_GetTagComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UActorTagComponent* CallFunc_GetTagComponent_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1);
	void SetValues();
	void SetVillager(class AValeriaVillagerCharacter* Param_Villager);
	void UpdateTags(int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, class UWBP_SimpleScaledText_C* CallFunc_Create_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, class UActorTagComponent* CallFunc_GetTagComponent_ReturnValue, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FTagEntry& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int64 CallFunc_Conv_IntToInt64_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const class FString& CallFunc_GetDebugStringFromGameplayTag_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class UWBP_SimpleScaledText_C* CallFunc_Array_Get_Item_1, class FText CallFunc_Format_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VillagerDebugPlate_C">();
	}
	static class UWBP_VillagerDebugPlate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VillagerDebugPlate_C>();
	}
};
static_assert(alignof(UWBP_VillagerDebugPlate_C) == 0x000008, "Wrong alignment on UWBP_VillagerDebugPlate_C");
static_assert(sizeof(UWBP_VillagerDebugPlate_C) == 0x000308, "Wrong size on UWBP_VillagerDebugPlate_C");
static_assert(offsetof(UWBP_VillagerDebugPlate_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_VillagerDebugPlate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VillagerDebugPlate_C, Text_VillagerBlueprintName) == 0x0002C8, "Member 'UWBP_VillagerDebugPlate_C::Text_VillagerBlueprintName' has a wrong offset!");
static_assert(offsetof(UWBP_VillagerDebugPlate_C, Text_VillagerConfigName) == 0x0002D0, "Member 'UWBP_VillagerDebugPlate_C::Text_VillagerConfigName' has a wrong offset!");
static_assert(offsetof(UWBP_VillagerDebugPlate_C, Text_VillagerCoreConfigName) == 0x0002D8, "Member 'UWBP_VillagerDebugPlate_C::Text_VillagerCoreConfigName' has a wrong offset!");
static_assert(offsetof(UWBP_VillagerDebugPlate_C, VerticalBox_Tags) == 0x0002E0, "Member 'UWBP_VillagerDebugPlate_C::VerticalBox_Tags' has a wrong offset!");
static_assert(offsetof(UWBP_VillagerDebugPlate_C, Villager) == 0x0002E8, "Member 'UWBP_VillagerDebugPlate_C::Villager' has a wrong offset!");
static_assert(offsetof(UWBP_VillagerDebugPlate_C, TagTextBoxes) == 0x0002F0, "Member 'UWBP_VillagerDebugPlate_C::TagTextBoxes' has a wrong offset!");
static_assert(offsetof(UWBP_VillagerDebugPlate_C, OwningPlayerController) == 0x000300, "Member 'UWBP_VillagerDebugPlate_C::OwningPlayerController' has a wrong offset!");

}

