#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerCharacterRow_Button_Friend_CM

#include "Basic.hpp"

#include "F_CommonUIButtonPrompt_structs.hpp"
#include "UMG_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM
// 0x0158 (0x0158 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x0014(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D63[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names;                          // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable;                              // 0x0048(0x0010)(ReferenceParm)
	struct FGuid                                  Temp_struct_Variable_1;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D64[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D65[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x00A8(0x0030)(HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& AddedPlayerCharacterId)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& AddedPlayerCharacterId)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhoWantsFriendship_bHasResult;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhoWantsFriendship_bDoWeWantFriendship;   // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhoWantsFriendship_bDoTheyWantFriendship; // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D66[0x5];                                     // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhoWantsFriendship_bHasResult_1;          // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhoWantsFriendship_bDoWeWantFriendship_1; // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhoWantsFriendship_bDoTheyWantFriendship_1; // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D67[0x2];                                     // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestFriendshipWithPlayer_ReturnValue;  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D68[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D69[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x014C(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM) == 0x000158, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, EntryPoint) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, K2Node_CustomEvent_AccountId_1) == 0x000004, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, K2Node_CustomEvent_AccountId) == 0x000014, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, K2Node_CustomEvent_Names) == 0x000028, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::K2Node_CustomEvent_Names' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, Temp_struct_Variable) == 0x000048, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, Temp_struct_Variable_1) == 0x000058, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x00007C, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000090, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x000098, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_GetNetId_ReturnValue) == 0x0000A8, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_GetNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000D8, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000E8, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_WhoWantsFriendship_bHasResult) == 0x0000F8, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_WhoWantsFriendship_bHasResult' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_WhoWantsFriendship_bDoWeWantFriendship) == 0x0000F9, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_WhoWantsFriendship_bDoWeWantFriendship' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_WhoWantsFriendship_bDoTheyWantFriendship) == 0x0000FA, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_WhoWantsFriendship_bDoTheyWantFriendship' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000100, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000108, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_IsValid_ReturnValue_1) == 0x000110, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_EqualEqual_ReturnValue) == 0x000111, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_EqualEqual_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_WhoWantsFriendship_bHasResult_1) == 0x000112, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_WhoWantsFriendship_bHasResult_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_WhoWantsFriendship_bDoWeWantFriendship_1) == 0x000113, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_WhoWantsFriendship_bDoWeWantFriendship_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_WhoWantsFriendship_bDoTheyWantFriendship_1) == 0x000114, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_WhoWantsFriendship_bDoTheyWantFriendship_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_Not_PreBool_ReturnValue) == 0x000115, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x000118, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_GetAccountId_ReturnValue) == 0x000120, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_RequestFriendshipWithPlayer_ReturnValue) == 0x000130, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_RequestFriendshipWithPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_GetCharacterNamesByAccountId_ReturnValue) == 0x000138, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_GetCharacterNamesByAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, K2Node_ComponentBoundEvent_Button) == 0x000140, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, CallFunc_IsValid_ReturnValue_2) == 0x000148, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM, K2Node_Event_InFocusEvent) == 0x00014C, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Friend_CM::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.GetCharacterName
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_GetCharacterName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_GetCharacterName) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_GetCharacterName");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_GetCharacterName) == 0x000010, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_GetCharacterName");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_GetCharacterName, ReturnValue) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_GetCharacterName::ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.HandleError
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleError final
{
public:
	struct FUniqueNetIdRepl                       AddedPlayerCharacterId;                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleError) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleError");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleError) == 0x000030, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleError");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleError, AddedPlayerCharacterId) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleError::AddedPlayerCharacterId' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.HandleRelationshipsChanged
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRelationshipsChanged final
{
public:
	TSet<struct FUniqueNetIdRepl>                 PlayerCharacterIds;                                // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRelationshipsChanged) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRelationshipsChanged");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRelationshipsChanged) == 0x000050, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRelationshipsChanged");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRelationshipsChanged, PlayerCharacterIds) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRelationshipsChanged::PlayerCharacterIds' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.HandleRequestFriendshipWithPlayerSucceeded
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRequestFriendshipWithPlayerSucceeded final
{
public:
	struct FUniqueNetIdRepl                       AddedPlayerCharacterId;                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRequestFriendshipWithPlayerSucceeded) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRequestFriendshipWithPlayerSucceeded");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRequestFriendshipWithPlayerSucceeded) == 0x000030, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRequestFriendshipWithPlayerSucceeded");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRequestFriendshipWithPlayerSucceeded, AddedPlayerCharacterId) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_HandleRequestFriendshipWithPlayerSucceeded::AddedPlayerCharacterId' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.OnFailure_EE3656384694241AE323B9BD7F929808
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFailure_EE3656384694241AE323B9BD7F929808 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFailure_EE3656384694241AE323B9BD7F929808) == 0x000004, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFailure_EE3656384694241AE323B9BD7F929808");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFailure_EE3656384694241AE323B9BD7F929808) == 0x000010, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFailure_EE3656384694241AE323B9BD7F929808");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFailure_EE3656384694241AE323B9BD7F929808, AccountId) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFailure_EE3656384694241AE323B9BD7F929808::AccountId' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusLost");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusLost");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.OnFocusReceived
// 0x0240 (0x0240 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt;          // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt_1;        // 0x0138(0x0040)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0178(0x00B8)()
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived) == 0x000240, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived, K2Node_MakeStruct_F_CommonUIButtonPrompt) == 0x0000F8, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived::K2Node_MakeStruct_F_CommonUIButtonPrompt' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived, K2Node_MakeStruct_F_CommonUIButtonPrompt_1) == 0x000138, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived::K2Node_MakeStruct_F_CommonUIButtonPrompt_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000178, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived, K2Node_MakeArray_Array) == 0x000230, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnFocusReceived::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.OnSuccess_EE3656384694241AE323B9BD7F929808
// 0x0020 (0x0020 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_OnSuccess_EE3656384694241AE323B9BD7F929808 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Names;                                             // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnSuccess_EE3656384694241AE323B9BD7F929808) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_OnSuccess_EE3656384694241AE323B9BD7F929808");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnSuccess_EE3656384694241AE323B9BD7F929808) == 0x000020, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_OnSuccess_EE3656384694241AE323B9BD7F929808");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnSuccess_EE3656384694241AE323B9BD7F929808, AccountId) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnSuccess_EE3656384694241AE323B9BD7F929808::AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_OnSuccess_EE3656384694241AE323B9BD7F929808, Names) == 0x000010, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_OnSuccess_EE3656384694241AE323B9BD7F929808::Names' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.SetParameters
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_SetParameters final
{
public:
	struct FUniqueNetIdRepl                       Param_UserId;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_SetParameters) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_SetParameters");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_SetParameters) == 0x000030, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_SetParameters");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_SetParameters, Param_UserId) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_SetParameters::Param_UserId' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Friend_CM.WBP_PlayerCharacterRow_Button_Friend_CM_C.WhoWantsFriendship
// 0x0128 (0x0128 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Friend_CM_C_WhoWantsFriendship final
{
public:
	bool                                          bHasResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoWeWantFriendship;                               // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoTheyWantFriendship;                             // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoTheyWantFriendship_Local;                       // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoWeWantFriendship_Local;                         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D6A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<struct FUniqueNetIdRepl>                 CallFunc_TryGetOutgoingFriendRequests_OutFriendRequests; // 0x0018(0x0050)()
	bool                                          CallFunc_TryGetOutgoingFriendRequests_ReturnValue; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D6B[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FUniqueNetIdRepl>                 CallFunc_TryGetReciprocalFriendRequests_OutFriendRequests; // 0x0070(0x0050)()
	bool                                          CallFunc_TryGetReciprocalFriendRequests_ReturnValue; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue_1;               // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D6C[0x5];                                     // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<struct FUniqueNetIdRepl>                 CallFunc_TryGetIncomingFriendRequests_OutFriendRequests; // 0x00D0(0x0050)()
	bool                                          CallFunc_TryGetIncomingFriendRequests_ReturnValue; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue_2;               // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Friend_CM_C_WhoWantsFriendship) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Friend_CM_C_WhoWantsFriendship");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Friend_CM_C_WhoWantsFriendship) == 0x000128, "Wrong size on WBP_PlayerCharacterRow_Button_Friend_CM_C_WhoWantsFriendship");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_WhoWantsFriendship, bHasResult) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_WhoWantsFriendship::bHasResult' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Friend_CM_C_WhoWantsFriendship, bDoWeWantFriendship) == 0x000001, "Member 'WBP_PlayerCharacterRow_Button_Friend_CM_C_WhoWantsFriendship::bDoWeWantFriendship' has a wrong offset!");
