#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cinematic_Overlay

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_Cinematic_Overlay.WBP_Cinematic_Overlay_C.ExecuteUbergraph_WBP_Cinematic_Overlay
// 0x0158 (0x0158 - 0x0000)
struct WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6019[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601B[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601C[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601D[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601E[0x1];                                     // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00DC(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_CustomEvent_ActionValue;                    // 0x0118(0x0020)(NoDestructor)
	float                                         K2Node_CustomEvent_ElapsedTime;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TriggeredTime;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           K2Node_CustomEvent_InputAction;                    // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreCheatsEnabled_Result;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601F[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Update_Skip_UI_Visibility_Delta_Time_ImplicitCast; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay) == 0x000008, "Wrong alignment on WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay");
static_assert(sizeof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay) == 0x000158, "Wrong size on WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, EntryPoint) == 0x000000, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000008, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000028, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00002C, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000030, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_object_Variable) == 0x000038, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_real_Variable) == 0x000048, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_real_Variable_1) == 0x000050, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_real_Variable_0) == 0x000058, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_bool_Variable) == 0x000068, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000070, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000090, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000094, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000098, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000A0, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_object_Variable_1) == 0x0000A8, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_real_Variable_2) == 0x0000B0, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_real_Variable_2_0) == 0x0000B8, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_real_Variable_3) == 0x0000C0, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_bool_Variable_1) == 0x0000C8, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_real_Variable_3_0) == 0x0000D0, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x0000D8, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_bool_Has_Been_Initd_Variable) == 0x0000D9, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, Temp_bool_IsClosed_Variable) == 0x0000DA, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_Event_MyGeometry) == 0x0000DC, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_Event_InDeltaTime) == 0x000114, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_CustomEvent_ActionValue) == 0x000118, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_CustomEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_CustomEvent_ElapsedTime) == 0x000138, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_CustomEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_CustomEvent_TriggeredTime) == 0x00013C, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_CustomEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, K2Node_CustomEvent_InputAction) == 0x000140, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::K2Node_CustomEvent_InputAction' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, CallFunc_AreCheatsEnabled_Result) == 0x000148, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::CallFunc_AreCheatsEnabled_Result' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay, CallFunc_Update_Skip_UI_Visibility_Delta_Time_ImplicitCast) == 0x000150, "Member 'WBP_Cinematic_Overlay_C_ExecuteUbergraph_WBP_Cinematic_Overlay::CallFunc_Update_Skip_UI_Visibility_Delta_Time_ImplicitCast' has a wrong offset!");

// Function WBP_Cinematic_Overlay.WBP_Cinematic_Overlay_C.Handle Input Action Cinematic Skip Triggered
// 0x0038 (0x0038 - 0x0000)
struct WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           InputAction;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Skip_UI_Visible_Is_Visible;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered) == 0x000008, "Wrong alignment on WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered");
static_assert(sizeof(WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered) == 0x000038, "Wrong size on WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered, ActionValue) == 0x000000, "Member 'WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered, ElapsedTime) == 0x000020, "Member 'WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered, TriggeredTime) == 0x000024, "Member 'WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered, InputAction) == 0x000028, "Member 'WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered::InputAction' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered, CallFunc_Is_Skip_UI_Visible_Is_Visible) == 0x000030, "Member 'WBP_Cinematic_Overlay_C_Handle_Input_Action_Cinematic_Skip_Triggered::CallFunc_Is_Skip_UI_Visible_Is_Visible' has a wrong offset!");

// Function WBP_Cinematic_Overlay.WBP_Cinematic_Overlay_C.InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkip_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_Cinematic_Overlay.WBP_Cinematic_Overlay_C.InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_Cinematic_Overlay_C_InpActEvt_IA_CinematicSkipUI_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_Cinematic_Overlay.WBP_Cinematic_Overlay_C.Is Skip UI Visible
// 0x0002 (0x0002 - 0x0000)
struct WBP_Cinematic_Overlay_C_Is_Skip_UI_Visible final
{
public:
	bool                                          Is_Visible;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cinematic_Overlay_C_Is_Skip_UI_Visible) == 0x000001, "Wrong alignment on WBP_Cinematic_Overlay_C_Is_Skip_UI_Visible");
static_assert(sizeof(WBP_Cinematic_Overlay_C_Is_Skip_UI_Visible) == 0x000002, "Wrong size on WBP_Cinematic_Overlay_C_Is_Skip_UI_Visible");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Is_Skip_UI_Visible, Is_Visible) == 0x000000, "Member 'WBP_Cinematic_Overlay_C_Is_Skip_UI_Visible::Is_Visible' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Is_Skip_UI_Visible, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WBP_Cinematic_Overlay_C_Is_Skip_UI_Visible::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WBP_Cinematic_Overlay.WBP_Cinematic_Overlay_C.Skip UI Triggered
// 0x0030 (0x0030 - 0x0000)
struct WBP_Cinematic_Overlay_C_Skip_UI_Triggered final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           InputAction;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cinematic_Overlay_C_Skip_UI_Triggered) == 0x000008, "Wrong alignment on WBP_Cinematic_Overlay_C_Skip_UI_Triggered");
static_assert(sizeof(WBP_Cinematic_Overlay_C_Skip_UI_Triggered) == 0x000030, "Wrong size on WBP_Cinematic_Overlay_C_Skip_UI_Triggered");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Skip_UI_Triggered, ActionValue) == 0x000000, "Member 'WBP_Cinematic_Overlay_C_Skip_UI_Triggered::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Skip_UI_Triggered, ElapsedTime) == 0x000020, "Member 'WBP_Cinematic_Overlay_C_Skip_UI_Triggered::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Skip_UI_Triggered, TriggeredTime) == 0x000024, "Member 'WBP_Cinematic_Overlay_C_Skip_UI_Triggered::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Skip_UI_Triggered, InputAction) == 0x000028, "Member 'WBP_Cinematic_Overlay_C_Skip_UI_Triggered::InputAction' has a wrong offset!");

// Function WBP_Cinematic_Overlay.WBP_Cinematic_Overlay_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Cinematic_Overlay_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cinematic_Overlay_C_Tick) == 0x000004, "Wrong alignment on WBP_Cinematic_Overlay_C_Tick");
static_assert(sizeof(WBP_Cinematic_Overlay_C_Tick) == 0x00003C, "Wrong size on WBP_Cinematic_Overlay_C_Tick");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Cinematic_Overlay_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Cinematic_Overlay_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Cinematic_Overlay.WBP_Cinematic_Overlay_C.Update Skip UI Visibility
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cinematic_Overlay_C_Update_Skip_UI_Visibility final
{
public:
	double                                        Delta_Time;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Skip_UI_Visible_Is_Visible;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6020[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cinematic_Overlay_C_Update_Skip_UI_Visibility) == 0x000008, "Wrong alignment on WBP_Cinematic_Overlay_C_Update_Skip_UI_Visibility");
static_assert(sizeof(WBP_Cinematic_Overlay_C_Update_Skip_UI_Visibility) == 0x000020, "Wrong size on WBP_Cinematic_Overlay_C_Update_Skip_UI_Visibility");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Update_Skip_UI_Visibility, Delta_Time) == 0x000000, "Member 'WBP_Cinematic_Overlay_C_Update_Skip_UI_Visibility::Delta_Time' has a wrong offset!");
static_assert(offsetof(WBP_Cinematic_Overlay_C_Update_Skip_UI_Visibility, CallFunc_Is_Skip_UI_Visible_Is_Visible) == 0x000008, "Member 'WBP_Cinematic_Overlay_C_Update_Skip_UI_Visibility::CallFunc_Is_Skip_UI_Visible_Is_Visible' has a wrong offset!");
