#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCustomization_TabButton_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CharacterCustomization_WardrobeButtonInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterCustomization_TabButton_CM.WBP_CharacterCustomization_TabButton_CM_C
// 0x00A0 (0x0360 - 0x02C0)
class UWBP_CharacterCustomization_TabButton_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DisplayActive;                                     // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_InactiveBackground;                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NotificationCountBadge_C*          WBP_NotificationCountBadge;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              WBP_Template_Button_CM;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FBP_CharacterCustomization_WardrobeButtonInfo ButtonInfo;                                        // 0x02F8(0x0030)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           ActiveColor;                                       // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InactiveColor;                                     // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnButtonClicked;                                   // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Active;                                            // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_CharacterCustomization_TabButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_CharacterCustomization_TabButton_CM(int32 EntryPoint, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, bool K2Node_Event_IsDesignTime, const struct FGeometry& K2Node_Event_MyGeometry, struct FPointerEvent& K2Node_Event_MouseEvent_1, struct FPointerEvent& K2Node_Event_MouseEvent, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1);
	void OnButtonClicked__DelegateSignature(class UWBP_CharacterCustomization_TabButton_CM_C* Button);
	void OnMouseEnter(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void OnMouseLeave(struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SetActive(bool Param_Active, bool WasActive, bool Temp_bool_Variable, int32 CallFunc_AkEventGlobal_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, class UWidget* K2Node_Select_Default);
	void SetColor(bool Param_Active, const struct FLinearColor& CallFunc_SelectColor_ReturnValue);
	void UpdateBadgeCount(int32 Count);
	void UpdateFromButtonInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterCustomization_TabButton_CM_C">();
	}
	static class UWBP_CharacterCustomization_TabButton_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterCustomization_TabButton_CM_C>();
	}
};
static_assert(alignof(UWBP_CharacterCustomization_TabButton_CM_C) == 0x000008, "Wrong alignment on UWBP_CharacterCustomization_TabButton_CM_C");
static_assert(sizeof(UWBP_CharacterCustomization_TabButton_CM_C) == 0x000360, "Wrong size on UWBP_CharacterCustomization_TabButton_CM_C");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, DisplayActive) == 0x0002C8, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::DisplayActive' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, Image_Icon) == 0x0002D0, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, Image_InactiveBackground) == 0x0002D8, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::Image_InactiveBackground' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, WBP_NotificationCountBadge) == 0x0002E0, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::WBP_NotificationCountBadge' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, WBP_Template_Button_CM) == 0x0002E8, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::WBP_Template_Button_CM' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, WidgetSwitcher) == 0x0002F0, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, ButtonInfo) == 0x0002F8, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::ButtonInfo' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, ActiveColor) == 0x000328, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::ActiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, InactiveColor) == 0x000338, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::InactiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, OnButtonClicked) == 0x000348, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::OnButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButton_CM_C, Active) == 0x000358, "Member 'UWBP_CharacterCustomization_TabButton_CM_C::Active' has a wrong offset!");

}

