#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrafterRecipe_RadialCountdownTimer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CrafterRecipe_RadialCountdownTimer.WBP_CrafterRecipe_RadialCountdownTimer_C.ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer
// 0x0058 (0x0058 - 0x0000)
struct WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6189[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetValeriaTimestampMs64_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_618A[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer) == 0x000008, "Wrong alignment on WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer");
static_assert(sizeof(WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer) == 0x000058, "Wrong size on WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer, EntryPoint) == 0x000000, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer, CallFunc_GetValeriaTimestampMs64_ReturnValue) == 0x000008, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer::CallFunc_GetValeriaTimestampMs64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer, CallFunc_NotEqual_Int64Int64_ReturnValue) == 0x000010, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer::CallFunc_NotEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer, K2Node_Event_MyGeometry) == 0x000014, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdownTimer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CrafterRecipe_RadialCountdownTimer.WBP_CrafterRecipe_RadialCountdownTimer_C.OvererideAlpha
// 0x0018 (0x0018 - 0x0000)
struct WBP_CrafterRecipe_RadialCountdownTimer_C_OvererideAlpha final
{
public:
	double                                        Param_Alpha;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipe_RadialCountdownTimer_C_OvererideAlpha) == 0x000008, "Wrong alignment on WBP_CrafterRecipe_RadialCountdownTimer_C_OvererideAlpha");
static_assert(sizeof(WBP_CrafterRecipe_RadialCountdownTimer_C_OvererideAlpha) == 0x000018, "Wrong size on WBP_CrafterRecipe_RadialCountdownTimer_C_OvererideAlpha");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_OvererideAlpha, Param_Alpha) == 0x000000, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_OvererideAlpha::Param_Alpha' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_OvererideAlpha, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_OvererideAlpha::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_OvererideAlpha, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000010, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_OvererideAlpha::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_CrafterRecipe_RadialCountdownTimer.WBP_CrafterRecipe_RadialCountdownTimer_C.SetCountdownTimer
// 0x0030 (0x0030 - 0x0000)
struct WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer final
{
public:
	int64                                         StartValeriaTimeSecs;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         EndValeriaTimeSecs;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldBeReverse;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetTimer;                                          // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_618B[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetValeriaTimestampMs64_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_Int64Int64_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_618C[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetValeriaTimestampMs64_ReturnValue_1;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer) == 0x000008, "Wrong alignment on WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer");
static_assert(sizeof(WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer) == 0x000030, "Wrong size on WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer, StartValeriaTimeSecs) == 0x000000, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer::StartValeriaTimeSecs' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer, EndValeriaTimeSecs) == 0x000008, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer::EndValeriaTimeSecs' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer, ShouldBeReverse) == 0x000010, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer::ShouldBeReverse' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer, SetTimer) == 0x000011, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer::SetTimer' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer, CallFunc_GetValeriaTimestampMs64_ReturnValue) == 0x000018, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer::CallFunc_GetValeriaTimestampMs64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer, CallFunc_Greater_Int64Int64_ReturnValue) == 0x000020, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer::CallFunc_Greater_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer, CallFunc_GetValeriaTimestampMs64_ReturnValue_1) == 0x000028, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_SetCountdownTimer::CallFunc_GetValeriaTimestampMs64_ReturnValue_1' has a wrong offset!");

// Function WBP_CrafterRecipe_RadialCountdownTimer.WBP_CrafterRecipe_RadialCountdownTimer_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CrafterRecipe_RadialCountdownTimer_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipe_RadialCountdownTimer_C_Tick) == 0x000004, "Wrong alignment on WBP_CrafterRecipe_RadialCountdownTimer_C_Tick");
static_assert(sizeof(WBP_CrafterRecipe_RadialCountdownTimer_C_Tick) == 0x00003C, "Wrong size on WBP_CrafterRecipe_RadialCountdownTimer_C_Tick");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_CrafterRecipe_RadialCountdownTimer.WBP_CrafterRecipe_RadialCountdownTimer_C.UpdateTimeAndUI
// 0x0028 (0x0028 - 0x0000)
struct WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI final
{
public:
	int64                                         Param_CurrValeriaTimeMs;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Subtract_Int64Int64_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_Int64ToInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_618D[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Subtract_Int64Int64_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_Int64ToInt_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI) == 0x000008, "Wrong alignment on WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI");
static_assert(sizeof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI) == 0x000028, "Wrong size on WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI, Param_CurrValeriaTimeMs) == 0x000000, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI::Param_CurrValeriaTimeMs' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI, CallFunc_Subtract_Int64Int64_ReturnValue) == 0x000008, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI::CallFunc_Subtract_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI, CallFunc_Conv_Int64ToInt_ReturnValue) == 0x000010, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI::CallFunc_Conv_Int64ToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI, CallFunc_Subtract_Int64Int64_ReturnValue_1) == 0x000018, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI::CallFunc_Subtract_Int64Int64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI, CallFunc_Conv_Int64ToInt_ReturnValue_1) == 0x000020, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateTimeAndUI::CallFunc_Conv_Int64ToInt_ReturnValue_1' has a wrong offset!");

// Function WBP_CrafterRecipe_RadialCountdownTimer.WBP_CrafterRecipe_RadialCountdownTimer_C.UpdateUI
// 0x0050 (0x0050 - 0x0000)
struct WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI final
{
public:
	int32                                         TimePassed;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OldAlpha;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalAlpha;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_618E[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI) == 0x000008, "Wrong alignment on WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI");
static_assert(sizeof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI) == 0x000050, "Wrong size on WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, TimePassed) == 0x000000, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::TimePassed' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, TotalTime) == 0x000004, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::TotalTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, OldAlpha) == 0x000008, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::OldAlpha' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, LocalAlpha) == 0x000010, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::LocalAlpha' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000028, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000048, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'WBP_CrafterRecipe_RadialCountdownTimer_C_UpdateUI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

