#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabWrapper_Large_CM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TabWrapper_Large_CM.WBP_TabWrapper_Large_CM_C.ExecuteUbergraph_WBP_TabWrapper_Large_CM
// 0x0190 (0x0190 - 0x0000)
struct WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B11[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0048(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0078)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_2;    // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_3;    // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM) == 0x000008, "Wrong alignment on WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM");
static_assert(sizeof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM) == 0x000190, "Wrong size on WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, EntryPoint) == 0x000000, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, CallFunc_SetContent_ReturnValue) == 0x000008, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::CallFunc_SetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, K2Node_Event_MyGeometry) == 0x000010, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, K2Node_Event_MouseEvent_1) == 0x000048, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, K2Node_Event_MouseEvent) == 0x0000C0, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, CallFunc_PlayAnimation_ReturnValue) == 0x000138, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, CallFunc_PlayAnimation_ReturnValue_1) == 0x000140, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000148, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x00014C, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000150, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000160, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, CallFunc_Conv_ColorToLinearColor_ReturnValue_2) == 0x000170, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::CallFunc_Conv_ColorToLinearColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM, CallFunc_Conv_ColorToLinearColor_ReturnValue_3) == 0x000180, "Member 'WBP_TabWrapper_Large_CM_C_ExecuteUbergraph_WBP_TabWrapper_Large_CM::CallFunc_Conv_ColorToLinearColor_ReturnValue_3' has a wrong offset!");

// Function WBP_TabWrapper_Large_CM.WBP_TabWrapper_Large_CM_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_TabWrapper_Large_CM_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TabWrapper_Large_CM_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_TabWrapper_Large_CM_C_OnMouseEnter");
static_assert(sizeof(WBP_TabWrapper_Large_CM_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_TabWrapper_Large_CM_C_OnMouseEnter");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_TabWrapper_Large_CM_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_TabWrapper_Large_CM_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_TabWrapper_Large_CM.WBP_TabWrapper_Large_CM_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_TabWrapper_Large_CM_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TabWrapper_Large_CM_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_TabWrapper_Large_CM_C_OnMouseLeave");
static_assert(sizeof(WBP_TabWrapper_Large_CM_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_TabWrapper_Large_CM_C_OnMouseLeave");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_TabWrapper_Large_CM_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_TabWrapper_Large_CM.WBP_TabWrapper_Large_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabWrapper_Large_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TabWrapper_Large_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TabWrapper_Large_CM_C_PreConstruct");
static_assert(sizeof(WBP_TabWrapper_Large_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_TabWrapper_Large_CM_C_PreConstruct");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TabWrapper_Large_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TabWrapper_Large_CM.WBP_TabWrapper_Large_CM_C.UpdateHoverStatePermission
// 0x0038 (0x0038 - 0x0000)
struct WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission final
{
public:
	bool                                          Allowed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ResetTab;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B12[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B13[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission) == 0x000008, "Wrong alignment on WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission");
static_assert(sizeof(WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission) == 0x000038, "Wrong size on WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission, Allowed) == 0x000000, "Member 'WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission::Allowed' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission, ResetTab) == 0x000001, "Member 'WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission::ResetTab' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000004, "Member 'WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000014, "Member 'WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission, CallFunc_IsHovered_ReturnValue) == 0x000024, "Member 'WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission, CallFunc_Not_PreBool_ReturnValue_1) == 0x000025, "Member 'WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_TabWrapper_Large_CM_C_UpdateHoverStatePermission::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

