#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TIM_ChatInputBar_CM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.ApplyParentalControls
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_ApplyParentalControls final
{
public:
	bool                                          CallFunc_IsInParentalControl_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_ApplyParentalControls) == 0x000001, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_ApplyParentalControls");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_ApplyParentalControls) == 0x000001, "Wrong size on WBP_TIM_ChatInputBar_CM_C_ApplyParentalControls");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ApplyParentalControls, CallFunc_IsInParentalControl_ReturnValue) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_ApplyParentalControls::CallFunc_IsInParentalControl_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.BndEvt__WBP_TIM_ChatInputBar_CM_Button_Emoji_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_Button_Emoji_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_Button_Emoji_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_Button_Emoji_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_Button_Emoji_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_Button_Emoji_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_Button_Emoji_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_Button_Emoji_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.BndEvt__WBP_TIM_ChatInputBar_CM_WBP_TIM_EmojiPanel_CM_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_WBP_TIM_EmojiPanel_CM_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_WBP_TIM_EmojiPanel_CM_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_WBP_TIM_EmojiPanel_CM_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_WBP_TIM_EmojiPanel_CM_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_WBP_TIM_EmojiPanel_CM_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_WBP_TIM_EmojiPanel_CM_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_CM_WBP_TIM_EmojiPanel_CM_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.BndEvt__WBP_TIM_ChatInputBar_EditableText_K2Node_ComponentBoundEvent_1_VALUI_OnSummonContextMenu__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_EditableText_K2Node_ComponentBoundEvent_1_VALUI_OnSummonContextMenu__DelegateSignature final
{
public:
	struct FGeometry                              Geometry;                                          // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_EditableText_K2Node_ComponentBoundEvent_1_VALUI_OnSummonContextMenu__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_EditableText_K2Node_ComponentBoundEvent_1_VALUI_OnSummonContextMenu__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_EditableText_K2Node_ComponentBoundEvent_1_VALUI_OnSummonContextMenu__DelegateSignature) == 0x0000B0, "Wrong size on WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_EditableText_K2Node_ComponentBoundEvent_1_VALUI_OnSummonContextMenu__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_EditableText_K2Node_ComponentBoundEvent_1_VALUI_OnSummonContextMenu__DelegateSignature, Geometry) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_EditableText_K2Node_ComponentBoundEvent_1_VALUI_OnSummonContextMenu__DelegateSignature::Geometry' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_EditableText_K2Node_ComponentBoundEvent_1_VALUI_OnSummonContextMenu__DelegateSignature, MouseEvent) == 0x000038, "Member 'WBP_TIM_ChatInputBar_CM_C_BndEvt__WBP_TIM_ChatInputBar_EditableText_K2Node_ComponentBoundEvent_1_VALUI_OnSummonContextMenu__DelegateSignature::MouseEvent' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.DisplayActiveCommandHint
// 0x0010 (0x0010 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_DisplayActiveCommandHint final
{
public:
	const class UVAL_ChatCommand_Base*            Command;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisplay;                                          // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_DisplayActiveCommandHint) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_DisplayActiveCommandHint");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_DisplayActiveCommandHint) == 0x000010, "Wrong size on WBP_TIM_ChatInputBar_CM_C_DisplayActiveCommandHint");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayActiveCommandHint, Command) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayActiveCommandHint::Command' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayActiveCommandHint, bDisplay) == 0x000008, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayActiveCommandHint::bDisplay' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.DisplayChatChannel
// 0x0240 (0x0240 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel final
{
public:
	struct FVALUI_ChatChannel                     Channel;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_567F[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0108(0x0050)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0158(0x0014)()
	uint8                                         Pad_5680[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0198(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5681[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01B8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0208(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_2;                              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5682[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0220(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x023B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMessageTargetType                            Temp_byte_Variable;                                // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x023E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel) == 0x000240, "Wrong size on WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, Channel) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::Channel' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, Temp_bool_Variable) == 0x0000B0, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, K2Node_MakeStruct_FormatArgumentData) == 0x0000B8, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, K2Node_MakeStruct_FormatArgumentData_1) == 0x000108, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, K2Node_MakeStruct_SlateColor) == 0x000158, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, K2Node_MakeArray_Array) == 0x000170, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, CallFunc_Format_ReturnValue) == 0x000180, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, CallFunc_Conv_StringToText_ReturnValue) == 0x000198, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, Temp_bool_Variable_1) == 0x0001B0, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001B8, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, K2Node_MakeArray_Array_1) == 0x000208, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, Temp_bool_Variable_2) == 0x000218, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, CallFunc_Format_ReturnValue_1) == 0x000220, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, Temp_bool_Variable_3) == 0x000238, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, Temp_bool_Variable_4) == 0x000239, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, Temp_bool_Variable_5) == 0x00023A, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, Temp_bool_Variable_6) == 0x00023B, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, Temp_bool_Variable_7) == 0x00023C, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, Temp_byte_Variable) == 0x00023D, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel, K2Node_Select_Default) == 0x00023E, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayChatChannel::K2Node_Select_Default' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.DisplayCommandSuggestions
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_DisplayCommandSuggestions final
{
public:
	bool                                          bInDisplay;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_DisplayCommandSuggestions) == 0x000001, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_DisplayCommandSuggestions");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_DisplayCommandSuggestions) == 0x000001, "Wrong size on WBP_TIM_ChatInputBar_CM_C_DisplayCommandSuggestions");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayCommandSuggestions, bInDisplay) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayCommandSuggestions::bInDisplay' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.DisplayStringsSuggestions
// 0x0020 (0x0020 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_DisplayStringsSuggestions final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         Suggestions;                                       // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_DisplayStringsSuggestions) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_DisplayStringsSuggestions");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_DisplayStringsSuggestions) == 0x000020, "Wrong size on WBP_TIM_ChatInputBar_CM_C_DisplayStringsSuggestions");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayStringsSuggestions, InString) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayStringsSuggestions::InString' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_DisplayStringsSuggestions, Suggestions) == 0x000010, "Member 'WBP_TIM_ChatInputBar_CM_C_DisplayStringsSuggestions::Suggestions' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.ExecuteUbergraph_WBP_TIM_ChatInputBar_CM
// 0x03C0 (0x03C0 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5683[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetContextMenuContentWidget_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_TIM_ChatInputBarContextMenu_CM_C*  K2Node_DynamicCast_AsWBP_TIM_Chat_Input_Bar_Context_Menu_CM; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5684[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText& Text)>            K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVALUI_ChatInputBarState                      K2Node_Event_NewStateId;                           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5685[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVAL_ChatCommand_Base*            K2Node_Event_Command;                              // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisplay;                             // 0x0038(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5686[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InErrorText;                          // 0x0040(0x0018)(ConstParm)
	TDelegate<void(class FText ErrorText)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_InString;                             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_Event_Suggestions;                          // 0x0078(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_bInDisplay;                           // 0x0088(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5687[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0090(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0050)(HasGetValueTypeHash)
	TDelegate<void(const class FString& InString, TArray<class UVAL_ChatCommand_Base*>& CommandObjects)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_IsEmpty;                          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5688[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UUserWidget>                Temp_class_Variable;                               // 0x0120(0x0008)(ConstParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText& Text)>            K2Node_CreateDelegate_OutputDelegate_4;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MaximumCharacterLimit_ReturnValue;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5689[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568A[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_ComponentBoundEvent_Geometry;               // 0x016C(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568B[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_ComponentBoundEvent_MouseEvent;             // 0x01A8(0x0078)(ConstParm)
	struct FVALUI_ChatChannel                     K2Node_Event_Channel;                              // 0x0220(0x00B0)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x02D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCompletitionTextPart_CompletitionText; // 0x02E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0300(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0350(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0360(0x0018)()
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_1;                  // 0x037B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_2;                  // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_3;                  // 0x037D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_4;                  // 0x037E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568C[0x1];                                     // 0x037F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_5;                  // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568D[0x3];                                     // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0394(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568E[0x4];                                     // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TIM_ChatErrorNotification_CM_C*    CallFunc_Create_ReturnValue;                       // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SummonContextMenu_ReturnValue;            // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568F[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM) == 0x0003C0, "Wrong size on WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, EntryPoint) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_GetContextMenuContentWidget_ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_GetContextMenuContentWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_DynamicCast_AsWBP_TIM_Chat_Input_Bar_Context_Menu_CM) == 0x000010, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_DynamicCast_AsWBP_TIM_Chat_Input_Bar_Context_Menu_CM' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_Event_NewStateId) == 0x00002C, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_Event_NewStateId' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_Event_Command) == 0x000030, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_Event_Command' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_Event_bDisplay) == 0x000038, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_Event_bDisplay' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_Event_InErrorText) == 0x000040, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_Event_InErrorText' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_Event_InString) == 0x000068, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_Event_InString' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_Event_Suggestions) == 0x000078, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_Event_Suggestions' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_Event_bInDisplay) == 0x000088, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_Event_bInDisplay' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_GetText_ReturnValue) == 0x000090, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_MakeStruct_FormatArgumentData) == 0x0000B0, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000100, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_IsEmpty_IsEmpty) == 0x000110, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_IsEmpty_IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_Not_PreBool_ReturnValue) == 0x000111, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_PlayAnimation_ReturnValue_1) == 0x000118, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, Temp_class_Variable) == 0x000120, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x000128, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000138, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x000140, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_MaximumCharacterLimit_ReturnValue) == 0x000150, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_MaximumCharacterLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000158, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000160, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_Event_IsDesignTime) == 0x000168, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_ComponentBoundEvent_Geometry) == 0x00016C, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_ComponentBoundEvent_Geometry' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_ComponentBoundEvent_MouseEvent) == 0x0001A8, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_ComponentBoundEvent_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_Event_Channel) == 0x000220, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_Event_Channel' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002D0, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_ComponentBoundEvent_Button) == 0x0002E0, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_GetCompletitionTextPart_CompletitionText) == 0x0002E8, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_GetCompletitionTextPart_CompletitionText' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_MakeStruct_FormatArgumentData_1) == 0x000300, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_MakeArray_Array) == 0x000350, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_Format_ReturnValue) == 0x000360, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_ComponentBoundEvent_InVisibility) == 0x000378, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_SwitchEnum_CmpSuccess) == 0x000379, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_IsConsole_ReturnValue) == 0x00037A, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_IsConsole_ReturnValue_1) == 0x00037B, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_IsConsole_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_IsConsole_ReturnValue_2) == 0x00037C, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_IsConsole_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_IsConsole_ReturnValue_3) == 0x00037D, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_IsConsole_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_IsConsole_ReturnValue_4) == 0x00037E, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_IsConsole_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x000380, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_4) == 0x000388, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_IsConsole_ReturnValue_5) == 0x000390, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_IsConsole_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, K2Node_MakeStruct_Margin) == 0x000394, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_Create_ReturnValue) == 0x0003A8, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_SummonContextMenu_ReturnValue) == 0x0003B0, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_SummonContextMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0003B8, "Member 'WBP_TIM_ChatInputBar_CM_C_ExecuteUbergraph_WBP_TIM_ChatInputBar_CM::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.HandleCommandSuggestionsChanged
// 0x0020 (0x0020 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_HandleCommandSuggestionsChanged final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class UVAL_ChatCommand_Base*>          CommandClasses;                                    // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_HandleCommandSuggestionsChanged) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_HandleCommandSuggestionsChanged");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_HandleCommandSuggestionsChanged) == 0x000020, "Wrong size on WBP_TIM_ChatInputBar_CM_C_HandleCommandSuggestionsChanged");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleCommandSuggestionsChanged, InString) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleCommandSuggestionsChanged::InString' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleCommandSuggestionsChanged, CommandClasses) == 0x000010, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleCommandSuggestionsChanged::CommandClasses' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.HandleDisplayCommandHint
// 0x0048 (0x0048 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint final
{
public:
	class UVAL_ChatCommand_Base*                  Command;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Display;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5690[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HintText;                                          // 0x0010(0x0018)(Edit, BlueprintVisible)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5691[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint) == 0x000048, "Wrong size on WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint, Command) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint::Command' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint, Display) == 0x000008, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint::Display' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint, HintText) == 0x000010, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint::HintText' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint, CallFunc_TextIsEmpty_ReturnValue) == 0x000040, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint, CallFunc_Not_PreBool_ReturnValue_1) == 0x000042, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleDisplayCommandHint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.HandleEditableTextChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_HandleEditableTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_HandleEditableTextChanged) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_HandleEditableTextChanged");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_HandleEditableTextChanged) == 0x000018, "Wrong size on WBP_TIM_ChatInputBar_CM_C_HandleEditableTextChanged");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleEditableTextChanged, Text) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleEditableTextChanged::Text' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.HandleOnChatChannelSet
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_HandleOnChatChannelSet final
{
public:
	struct FVALUI_ChatChannel                     Channel;                                           // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_HandleOnChatChannelSet) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_HandleOnChatChannelSet");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_HandleOnChatChannelSet) == 0x0000B0, "Wrong size on WBP_TIM_ChatInputBar_CM_C_HandleOnChatChannelSet");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleOnChatChannelSet, Channel) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleOnChatChannelSet::Channel' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.HandleOnStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_HandleOnStateChanged final
{
public:
	EVALUI_ChatInputBarState                      NewStateId;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_HandleOnStateChanged) == 0x000001, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_HandleOnStateChanged");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_HandleOnStateChanged) == 0x000001, "Wrong size on WBP_TIM_ChatInputBar_CM_C_HandleOnStateChanged");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleOnStateChanged, NewStateId) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleOnStateChanged::NewStateId' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.HandleRequestDisplayChatError
// 0x0018 (0x0018 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_HandleRequestDisplayChatError final
{
public:
	class FText                                   ErrorText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_HandleRequestDisplayChatError) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_HandleRequestDisplayChatError");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_HandleRequestDisplayChatError) == 0x000018, "Wrong size on WBP_TIM_ChatInputBar_CM_C_HandleRequestDisplayChatError");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleRequestDisplayChatError, ErrorText) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleRequestDisplayChatError::ErrorText' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.HandleRequestInsertText
// 0x0020 (0x0020 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_HandleRequestInsertText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_IsDesktop_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_HandleRequestInsertText) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_HandleRequestInsertText");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_HandleRequestInsertText) == 0x000020, "Wrong size on WBP_TIM_ChatInputBar_CM_C_HandleRequestInsertText");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleRequestInsertText, Text) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleRequestInsertText::Text' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_HandleRequestInsertText, CallFunc_IsDesktop_ReturnValue) == 0x000018, "Member 'WBP_TIM_ChatInputBar_CM_C_HandleRequestInsertText::CallFunc_IsDesktop_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.LoadOrUnloadEmoji
// 0x0004 (0x0004 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji final
{
public:
	EVALUI_ChatInputBarState                      NewStateId;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji) == 0x000001, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji) == 0x000004, "Wrong size on WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji, NewStateId) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji::NewStateId' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000002, "Member 'WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000003, "Member 'WBP_TIM_ChatInputBar_CM_C_LoadOrUnloadEmoji::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatInputBar_CM.WBP_TIM_ChatInputBar_CM_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_TIM_ChatInputBar_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5692[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
	class UWidget*                                K2Node_Select_Default;                             // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatInputBar_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_TIM_ChatInputBar_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_TIM_ChatInputBar_CM_C_OnFocusReceived) == 0x0001C0, "Wrong size on WBP_TIM_ChatInputBar_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_TIM_ChatInputBar_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatInputBar_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_TIM_ChatInputBar_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
