#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FocusPoints

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_FocusPoints.WBP_FocusPoints_C.SetPoints
// 0x0088 (0x0088 - 0x0000)
struct WBP_FocusPoints_C_SetPoints final
{
public:
	int32                                         Points;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1970[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
};
static_assert(alignof(WBP_FocusPoints_C_SetPoints) == 0x000008, "Wrong alignment on WBP_FocusPoints_C_SetPoints");
static_assert(sizeof(WBP_FocusPoints_C_SetPoints) == 0x000088, "Wrong size on WBP_FocusPoints_C_SetPoints");
static_assert(offsetof(WBP_FocusPoints_C_SetPoints, Points) == 0x000000, "Member 'WBP_FocusPoints_C_SetPoints::Points' has a wrong offset!");
static_assert(offsetof(WBP_FocusPoints_C_SetPoints, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_FocusPoints_C_SetPoints::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FocusPoints_C_SetPoints, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_FocusPoints_C_SetPoints::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_FocusPoints_C_SetPoints, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_FocusPoints_C_SetPoints::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_FocusPoints_C_SetPoints, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WBP_FocusPoints_C_SetPoints::CallFunc_Format_ReturnValue' has a wrong offset!");

}

