#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerCharacterRow_Button_Message_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C
// 0x0080 (0x0420 - 0x03A0)
class UWBP_PlayerCharacterRow_Button_Message_CM_C final : public UCommonUserWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Button_Icon_CM_C*                  WBP_Button_Icon_CM;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FocusTip_CM_C*                     WBP_FocusTip_CM;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x03B8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CharacterName;                                     // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMarkFocusUI;                                     // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsShowFocusTip;                                   // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_557D[0x7];                                     // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x0410(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BindToManagerEvents(bool Bind, TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_2, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_3, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_3);
	void BndEvt__WBP_PlayerCharacterRow_Button_Message_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_OnFocused__DelegateSignature();
	void BndEvt__WBP_PlayerCharacterRow_Button_Message_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PlayerCharacterRow_Button_Message_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_2_OnUnfocused__DelegateSignature();
	void Destruct();
	void ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM(int32 EntryPoint, struct FGuid& K2Node_CustomEvent_AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& K2Node_CustomEvent_Names, TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate, TArray<struct FOSSVAL_CharacterNameAndId>& Temp_struct_Variable, const struct FGuid& Temp_struct_Variable_1, struct FGuid& K2Node_CustomEvent_AccountId_1, const struct FUniqueNetIdRepl& K2Node_CustomEvent_NewUserId, bool CallFunc_IsValid_ReturnValue, TDelegate<void(struct FGuid& AccountId)> K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_EqualEqual_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UChatManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, const struct FGuid& CallFunc_GetAccountId_ReturnValue, class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue, const struct FMessageTarget& CallFunc_MakeMessageTarget_DirectMessage_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, const struct FFocusEvent& K2Node_Event_InFocusEvent);
	void HandleFriendRelationshipsChanged(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds);
	void HandleOnFocused();
	void HandleOnPresenceChange(const struct FPresence& OldPresence, const struct FPresence& NewPresence);
	void HandleOnUnFocused();
	void OnClicked__DelegateSignature();
	void OnFailure_7654FC5540BAEB6D780028B2C3844F34(struct FGuid& AccountId);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt_1, TArray<struct FF_CommonUIButtonPrompt>& K2Node_MakeArray_Array, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnMarkFocusUI__DelegateSignature(class UWidget* Widget, TArray<struct FF_CommonUIButtonPrompt>& UIPrompt);
	void OnSuccess_7654FC5540BAEB6D780028B2C3844F34(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names);
	void SetUser(const struct FUniqueNetIdRepl& NewUserId);
	void UpdateFromUser(class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, const struct FPresence& CallFunc_GetPresenceForUserId_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_EqualEqual_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_IsFriend_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerCharacterRow_Button_Message_CM_C">();
	}
	static class UWBP_PlayerCharacterRow_Button_Message_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerCharacterRow_Button_Message_CM_C>();
	}
};
static_assert(alignof(UWBP_PlayerCharacterRow_Button_Message_CM_C) == 0x000008, "Wrong alignment on UWBP_PlayerCharacterRow_Button_Message_CM_C");
static_assert(sizeof(UWBP_PlayerCharacterRow_Button_Message_CM_C) == 0x000420, "Wrong size on UWBP_PlayerCharacterRow_Button_Message_CM_C");
static_assert(offsetof(UWBP_PlayerCharacterRow_Button_Message_CM_C, UberGraphFrame) == 0x0003A0, "Member 'UWBP_PlayerCharacterRow_Button_Message_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_Button_Message_CM_C, WBP_Button_Icon_CM) == 0x0003A8, "Member 'UWBP_PlayerCharacterRow_Button_Message_CM_C::WBP_Button_Icon_CM' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_Button_Message_CM_C, WBP_FocusTip_CM) == 0x0003B0, "Member 'UWBP_PlayerCharacterRow_Button_Message_CM_C::WBP_FocusTip_CM' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_Button_Message_CM_C, UserId) == 0x0003B8, "Member 'UWBP_PlayerCharacterRow_Button_Message_CM_C::UserId' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_Button_Message_CM_C, CharacterName) == 0x0003E8, "Member 'UWBP_PlayerCharacterRow_Button_Message_CM_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_Button_Message_CM_C, OnMarkFocusUI) == 0x0003F8, "Member 'UWBP_PlayerCharacterRow_Button_Message_CM_C::OnMarkFocusUI' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_Button_Message_CM_C, bIsShowFocusTip) == 0x000408, "Member 'UWBP_PlayerCharacterRow_Button_Message_CM_C::bIsShowFocusTip' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_Button_Message_CM_C, OnClicked) == 0x000410, "Member 'UWBP_PlayerCharacterRow_Button_Message_CM_C::OnClicked' has a wrong offset!");

}

