#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CarouselPagePip_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CarouselPagePip_CM.WBP_CarouselPagePip_CM_C
// 0x0028 (0x02E8 - 0x02C0)
class UWBP_CarouselPagePip_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Default;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selected;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CarouselPagePip_CM(int32 EntryPoint);
	void OnClicked__DelegateSignature(class UWBP_CarouselPageButton_CM_C* TutorialPageButton);
	void SetIsSelected(bool Param_Selected, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool Temp_bool_Variable_1, ESlateVisibility K2Node_Select_Default, ESlateVisibility K2Node_Select_Default_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CarouselPagePip_CM_C">();
	}
	static class UWBP_CarouselPagePip_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CarouselPagePip_CM_C>();
	}
};
static_assert(alignof(UWBP_CarouselPagePip_CM_C) == 0x000008, "Wrong alignment on UWBP_CarouselPagePip_CM_C");
static_assert(sizeof(UWBP_CarouselPagePip_CM_C) == 0x0002E8, "Wrong size on UWBP_CarouselPagePip_CM_C");
static_assert(offsetof(UWBP_CarouselPagePip_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_CarouselPagePip_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPagePip_CM_C, Default) == 0x0002C8, "Member 'UWBP_CarouselPagePip_CM_C::Default' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPagePip_CM_C, Selected) == 0x0002D0, "Member 'UWBP_CarouselPagePip_CM_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPagePip_CM_C, OnClicked) == 0x0002D8, "Member 'UWBP_CarouselPagePip_CM_C::OnClicked' has a wrong offset!");

}

