#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterActionItem_Console

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterActionItem_Console.WBP_CharacterActionItem_Console_C.BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterActionItem_Console.WBP_CharacterActionItem_Console_C.BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterActionItem_Console_C_BndEvt__WBP_CharacterActionItem_Console_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterActionItem_Console.WBP_CharacterActionItem_Console_C.ExecuteUbergraph_WBP_CharacterActionItem_Console
// 0x0050 (0x0050 - 0x0000)
struct WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D9[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50DA[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasEquippedItem_ReturnValue;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console) == 0x000008, "Wrong alignment on WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console");
static_assert(sizeof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console) == 0x000050, "Wrong size on WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console, EntryPoint) == 0x000000, "Member 'WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console, K2Node_ComponentBoundEvent_Button_1) == 0x000028, "Member 'WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console, CallFunc_GetValeriaCharacter_OutResult) == 0x000039, "Member 'WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000040, "Member 'WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console, CallFunc_HasEquippedItem_ReturnValue) == 0x000049, "Member 'WBP_CharacterActionItem_Console_C_ExecuteUbergraph_WBP_CharacterActionItem_Console::CallFunc_HasEquippedItem_ReturnValue' has a wrong offset!");

// Function WBP_CharacterActionItem_Console.WBP_CharacterActionItem_Console_C.Init Character Action
// 0x0004 (0x0004 - 0x0000)
struct WBP_CharacterActionItem_Console_C_Init_Character_Action final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterActionItem_Console_C_Init_Character_Action) == 0x000001, "Wrong alignment on WBP_CharacterActionItem_Console_C_Init_Character_Action");
static_assert(sizeof(WBP_CharacterActionItem_Console_C_Init_Character_Action) == 0x000004, "Wrong size on WBP_CharacterActionItem_Console_C_Init_Character_Action");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Init_Character_Action, Temp_bool_Variable) == 0x000000, "Member 'WBP_CharacterActionItem_Console_C_Init_Character_Action::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Init_Character_Action, Temp_byte_Variable) == 0x000001, "Member 'WBP_CharacterActionItem_Console_C_Init_Character_Action::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Init_Character_Action, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_CharacterActionItem_Console_C_Init_Character_Action::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Init_Character_Action, K2Node_Select_Default) == 0x000003, "Member 'WBP_CharacterActionItem_Console_C_Init_Character_Action::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CharacterActionItem_Console.WBP_CharacterActionItem_Console_C.IsFishingRodWithNoBait
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait final
{
public:
	struct FValeriaItem                           AmmoItem;                                          // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FValeriaItem                           ToolItem;                                          // 0x0060(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsNoBait;                                          // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFishingRodTool;                                  // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemIsEmpty_ReturnValue;                  // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50DB[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFishingRod_ReturnValue;                 // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemIsEmpty_ReturnValue_1;                // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait) == 0x000008, "Wrong alignment on WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait");
static_assert(sizeof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait) == 0x0000E0, "Wrong size on WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait, AmmoItem) == 0x000000, "Member 'WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait::AmmoItem' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait, ToolItem) == 0x000060, "Member 'WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait::ToolItem' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait, IsNoBait) == 0x0000C0, "Member 'WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait::IsNoBait' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait, IsFishingRodTool) == 0x0000C1, "Member 'WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait::IsFishingRodTool' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait, CallFunc_ItemIsEmpty_ReturnValue) == 0x0000C2, "Member 'WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait::CallFunc_ItemIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait, CallFunc_BooleanAND_ReturnValue) == 0x0000C3, "Member 'WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000C8, "Member 'WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait, K2Node_DynamicCast_AsItem_Type_Definition) == 0x0000D0, "Member 'WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait, CallFunc_IsFishingRod_ReturnValue) == 0x0000D9, "Member 'WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait::CallFunc_IsFishingRod_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait, CallFunc_ItemIsEmpty_ReturnValue_1) == 0x0000DA, "Member 'WBP_CharacterActionItem_Console_C_IsFishingRodWithNoBait::CallFunc_ItemIsEmpty_ReturnValue_1' has a wrong offset!");

// Function WBP_CharacterActionItem_Console.WBP_CharacterActionItem_Console_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterActionItem_Console_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterActionItem_Console_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CharacterActionItem_Console_C_PreConstruct");
static_assert(sizeof(WBP_CharacterActionItem_Console_C_PreConstruct) == 0x000001, "Wrong size on WBP_CharacterActionItem_Console_C_PreConstruct");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CharacterActionItem_Console_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CharacterActionItem_Console.WBP_CharacterActionItem_Console_C.Set Action Style
// 0x0020 (0x0020 - 0x0000)
struct WBP_CharacterActionItem_Console_C_Set_Action_Style final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_ImageStyle*                      BackgroundReleaseStyle;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_ImageStyle*                      BackgroundPressStyle;                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterActionItem_Console_C_Set_Action_Style) == 0x000008, "Wrong alignment on WBP_CharacterActionItem_Console_C_Set_Action_Style");
static_assert(sizeof(WBP_CharacterActionItem_Console_C_Set_Action_Style) == 0x000020, "Wrong size on WBP_CharacterActionItem_Console_C_Set_Action_Style");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Set_Action_Style, Icon) == 0x000000, "Member 'WBP_CharacterActionItem_Console_C_Set_Action_Style::Icon' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Set_Action_Style, BackgroundReleaseStyle) == 0x000008, "Member 'WBP_CharacterActionItem_Console_C_Set_Action_Style::BackgroundReleaseStyle' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Set_Action_Style, BackgroundPressStyle) == 0x000010, "Member 'WBP_CharacterActionItem_Console_C_Set_Action_Style::BackgroundPressStyle' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Set_Action_Style, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_CharacterActionItem_Console_C_Set_Action_Style::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Set_Action_Style, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'WBP_CharacterActionItem_Console_C_Set_Action_Style::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Set_Action_Style, CallFunc_IsValid_ReturnValue_2) == 0x00001A, "Member 'WBP_CharacterActionItem_Console_C_Set_Action_Style::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_CharacterActionItem_Console.WBP_CharacterActionItem_Console_C.Update Action Style
// 0x0028 (0x0028 - 0x0000)
struct WBP_CharacterActionItem_Console_C_Update_Action_Style final
{
public:
	class UVALUI_ImageStyle*                      NewLocalVar;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50DC[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ImageStyle*                      K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterActionItem_Console_C_Update_Action_Style) == 0x000008, "Wrong alignment on WBP_CharacterActionItem_Console_C_Update_Action_Style");
static_assert(sizeof(WBP_CharacterActionItem_Console_C_Update_Action_Style) == 0x000028, "Wrong size on WBP_CharacterActionItem_Console_C_Update_Action_Style");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Update_Action_Style, NewLocalVar) == 0x000000, "Member 'WBP_CharacterActionItem_Console_C_Update_Action_Style::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Update_Action_Style, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'WBP_CharacterActionItem_Console_C_Update_Action_Style::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Update_Action_Style, Temp_bool_Variable) == 0x000018, "Member 'WBP_CharacterActionItem_Console_C_Update_Action_Style::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Update_Action_Style, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_CharacterActionItem_Console_C_Update_Action_Style::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_Update_Action_Style, K2Node_Select_Default) == 0x000020, "Member 'WBP_CharacterActionItem_Console_C_Update_Action_Style::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CharacterActionItem_Console.WBP_CharacterActionItem_Console_C.UpdateActionIcon
// 0x0040 (0x0040 - 0x0000)
struct WBP_CharacterActionItem_Console_C_UpdateActionIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterActionItem_Console_C_UpdateActionIcon) == 0x000008, "Wrong alignment on WBP_CharacterActionItem_Console_C_UpdateActionIcon");
static_assert(sizeof(WBP_CharacterActionItem_Console_C_UpdateActionIcon) == 0x000040, "Wrong size on WBP_CharacterActionItem_Console_C_UpdateActionIcon");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateActionIcon, Icon) == 0x000000, "Member 'WBP_CharacterActionItem_Console_C_UpdateActionIcon::Icon' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateActionIcon, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000028, "Member 'WBP_CharacterActionItem_Console_C_UpdateActionIcon::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateActionIcon, K2Node_DynamicCast_AsTexture_2D) == 0x000030, "Member 'WBP_CharacterActionItem_Console_C_UpdateActionIcon::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateActionIcon, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_CharacterActionItem_Console_C_UpdateActionIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_CharacterActionItem_Console.WBP_CharacterActionItem_Console_C.UpdateAmmoData
// 0x0278 (0x0278 - 0x0000)
struct WBP_CharacterActionItem_Console_C_UpdateAmmoData final
{
public:
	struct FValeriaItem                           AmmoItem;                                          // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bShowAmount;                                       // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50DD[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           ToolItem;                                          // 0x0068(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FValeriaItem                           AmmoItemToDisplay;                                 // 0x00C8(0x0060)(Edit, BlueprintVisible)
	bool                                          ShowAmmoNum;                                       // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50DE[0x2];                                     // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0130(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFishingRodWithNoBait_IsNoBait;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50DF[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsOneTag_ReturnValue;               // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsOneTag_ReturnValue_1;             // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50E0[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFishingComponent*                      CallFunc_GetFishing_ReturnValue;                   // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           CallFunc_GetNoBaitSelectedItem_ReturnValue;        // 0x0188(0x0060)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemIsEmpty_ReturnValue;                  // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemIsEmpty_ReturnValue_1;                // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50E1[0x3];                                     // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition_1;       // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50E2[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0208(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1; // 0x0228(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_2;                           // 0x0250(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterActionItem_Console_C_UpdateAmmoData) == 0x000008, "Wrong alignment on WBP_CharacterActionItem_Console_C_UpdateAmmoData");
static_assert(sizeof(WBP_CharacterActionItem_Console_C_UpdateAmmoData) == 0x000278, "Wrong size on WBP_CharacterActionItem_Console_C_UpdateAmmoData");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, AmmoItem) == 0x000000, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::AmmoItem' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, bShowAmount) == 0x000060, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::bShowAmount' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, ToolItem) == 0x000068, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::ToolItem' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, AmmoItemToDisplay) == 0x0000C8, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::AmmoItemToDisplay' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, ShowAmmoNum) == 0x000128, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::ShowAmmoNum' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, Temp_byte_Variable) == 0x000129, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, Temp_byte_Variable_1) == 0x00012A, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, Temp_bool_Variable) == 0x00012B, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, Temp_bool_Variable_1) == 0x00012C, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, Temp_bool_Variable_2) == 0x00012D, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000130, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000158, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_IsFishingRodWithNoBait_IsNoBait) == 0x000160, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_IsFishingRodWithNoBait_IsNoBait' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000168, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_IsValid_ReturnValue) == 0x000171, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_ContainsOneTag_ReturnValue) == 0x000172, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_ContainsOneTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_ContainsOneTag_ReturnValue_1) == 0x000173, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_ContainsOneTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_GetValeriaCharacter_OutResult) == 0x000174, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000178, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_GetFishing_ReturnValue) == 0x000180, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_GetFishing_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_GetNoBaitSelectedItem_ReturnValue) == 0x000188, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_GetNoBaitSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, K2Node_SwitchEnum_CmpSuccess) == 0x0001E8, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_ItemIsEmpty_ReturnValue) == 0x0001E9, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_ItemIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_ItemIsEmpty_ReturnValue_1) == 0x0001EA, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_ItemIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_Not_PreBool_ReturnValue) == 0x0001EB, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001EC, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x0001F0, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, K2Node_DynamicCast_AsItem_Type_Definition_1) == 0x0001F8, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::K2Node_DynamicCast_AsItem_Type_Definition_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_Conv_IntToText_ReturnValue) == 0x000208, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_IsValid_ReturnValue_1) == 0x000220, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_Not_PreBool_ReturnValue_2) == 0x000221, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_Greater_IntInt_ReturnValue) == 0x000222, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_BooleanAND_ReturnValue) == 0x000223, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, K2Node_Select_Default) == 0x000224, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, Temp_byte_Variable_2) == 0x000225, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, Temp_byte_Variable_3) == 0x000226, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, K2Node_Select_Default_1) == 0x000227, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1) == 0x000228, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoData, K2Node_Select_Default_2) == 0x000250, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoData::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_CharacterActionItem_Console.WBP_CharacterActionItem_Console_C.UpdateAmmoIcon
// 0x0040 (0x0040 - 0x0000)
struct WBP_CharacterActionItem_Console_C_UpdateAmmoIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterActionItem_Console_C_UpdateAmmoIcon) == 0x000008, "Wrong alignment on WBP_CharacterActionItem_Console_C_UpdateAmmoIcon");
static_assert(sizeof(WBP_CharacterActionItem_Console_C_UpdateAmmoIcon) == 0x000040, "Wrong size on WBP_CharacterActionItem_Console_C_UpdateAmmoIcon");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoIcon, Icon) == 0x000000, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoIcon::Icon' has a wrong offset!");
static_assert(offsetof(WBP_CharacterActionItem_Console_C_UpdateAmmoIcon, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000028, "Member 'WBP_CharacterActionItem_Console_C_UpdateAmmoIcon::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
