#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LinkAccount_PF

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LinkAccount_PF.WBP_LinkAccount_PF_C
// 0x0058 (0x0468 - 0x0410)
class UWBP_LinkAccount_PF_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Link_CM;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Secondary_01_CM_C* Button_Skip_CM;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Container;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeftArrow;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RightArrow;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Header;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnLinkClicked;                                     // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSkipClicked;                                     // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_LinkAccount_PF_WBP_Template_Button_Primary_01_CM_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_LinkAccount_PF_WBP_Template_Button_Secondary_01_CM_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature();
	void ExecuteUbergraph_WBP_LinkAccount_PF(int32 EntryPoint);
	void OnLinkClicked__DelegateSignature();
	void OnSkipClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LinkAccount_PF_C">();
	}
	static class UWBP_LinkAccount_PF_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LinkAccount_PF_C>();
	}
};
static_assert(alignof(UWBP_LinkAccount_PF_C) == 0x000008, "Wrong alignment on UWBP_LinkAccount_PF_C");
static_assert(sizeof(UWBP_LinkAccount_PF_C) == 0x000468, "Wrong size on UWBP_LinkAccount_PF_C");
static_assert(offsetof(UWBP_LinkAccount_PF_C, UberGraphFrame) == 0x000410, "Member 'UWBP_LinkAccount_PF_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LinkAccount_PF_C, Button_Link_CM) == 0x000418, "Member 'UWBP_LinkAccount_PF_C::Button_Link_CM' has a wrong offset!");
static_assert(offsetof(UWBP_LinkAccount_PF_C, Button_Skip_CM) == 0x000420, "Member 'UWBP_LinkAccount_PF_C::Button_Skip_CM' has a wrong offset!");
static_assert(offsetof(UWBP_LinkAccount_PF_C, HBox_Container) == 0x000428, "Member 'UWBP_LinkAccount_PF_C::HBox_Container' has a wrong offset!");
static_assert(offsetof(UWBP_LinkAccount_PF_C, Image_LeftArrow) == 0x000430, "Member 'UWBP_LinkAccount_PF_C::Image_LeftArrow' has a wrong offset!");
static_assert(offsetof(UWBP_LinkAccount_PF_C, Image_RightArrow) == 0x000438, "Member 'UWBP_LinkAccount_PF_C::Image_RightArrow' has a wrong offset!");
static_assert(offsetof(UWBP_LinkAccount_PF_C, Text_Header) == 0x000440, "Member 'UWBP_LinkAccount_PF_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UWBP_LinkAccount_PF_C, OnLinkClicked) == 0x000448, "Member 'UWBP_LinkAccount_PF_C::OnLinkClicked' has a wrong offset!");
static_assert(offsetof(UWBP_LinkAccount_PF_C, OnSkipClicked) == 0x000458, "Member 'UWBP_LinkAccount_PF_C::OnSkipClicked' has a wrong offset!");

}

