#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Login_PF

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Login_PF.WBP_Login_PF_C.ExecuteUbergraph_WBP_Login_PF
// 0x0290 (0x0290 - 0x0000)
struct WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C55[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget_3;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopupLinkSuccess_PF_C*             K2Node_DynamicCast_AsWBP_Popup_Link_Success_PF;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C56[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget_2;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable_1;                            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopupEULA_CM_C*                    K2Node_DynamicCast_AsWBP_Popup_EULA_CM;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C57[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget_1;                  // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable_2;                            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopupConfirmSkipLink_PF_C*         K2Node_DynamicCast_AsWBP_Popup_Confirm_Skip_Link_PF; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C58[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget;                    // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable_3;                            // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ErrorCode;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C59[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C5A[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C5B[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue;                    // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C5C[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue_1;                  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C5D[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x01B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C5E[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue_2;                  // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C5F[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C60[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue_3;                  // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C61[0x3];                                     // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& ErrorMessage, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x020C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C62[0x4];                                     // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x0230(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PregameUIManager_C*                K2Node_DynamicCast_AsWBP_Pregame_UIManager;        // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C63[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x024C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x025C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C64[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C65[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF) == 0x000008, "Wrong alignment on WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF");
static_assert(sizeof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF) == 0x000290, "Wrong size on WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, EntryPoint) == 0x000000, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CustomEvent_ModalWidget_3) == 0x000008, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CustomEvent_ModalWidget_3' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, Temp_object_Variable) == 0x000020, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_DynamicCast_AsWBP_Popup_Link_Success_PF) == 0x000038, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_DynamicCast_AsWBP_Popup_Link_Success_PF' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CustomEvent_ModalWidget_2) == 0x000048, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CustomEvent_ModalWidget_2' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, Temp_object_Variable_1) == 0x000060, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_3) == 0x000068, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_DynamicCast_AsWBP_Popup_EULA_CM) == 0x000078, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_DynamicCast_AsWBP_Popup_EULA_CM' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CustomEvent_ModalWidget_1) == 0x000088, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CustomEvent_ModalWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_4) == 0x000090, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, Temp_object_Variable_2) == 0x0000A0, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000A8, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_DynamicCast_AsWBP_Popup_Confirm_Skip_Link_PF) == 0x0000B8, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_DynamicCast_AsWBP_Popup_Confirm_Skip_Link_PF' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CustomEvent_ModalWidget) == 0x0000C8, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CustomEvent_ModalWidget' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000D0, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, Temp_object_Variable_3) == 0x0000E0, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000E8, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CustomEvent_ErrorMessage) == 0x0000F8, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CustomEvent_ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CustomEvent_ErrorCode) == 0x000108, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CustomEvent_ErrorCode' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_8) == 0x00010C, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000120, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_9) == 0x000128, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_10) == 0x000138, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_11) == 0x000148, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_Not_PreBool_ReturnValue) == 0x000158, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_12) == 0x00015C, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_GetOwningPlayer_ReturnValue) == 0x000170, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_OpenModal_ReturnValue) == 0x000178, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_OpenModal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000180, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_IsValid_ReturnValue) == 0x000188, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000190, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_OpenModal_ReturnValue_1) == 0x000198, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_OpenModal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_13) == 0x0001A0, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_IsValid_ReturnValue_1) == 0x0001B0, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_14) == 0x0001B4, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0001C8, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_OpenModal_ReturnValue_2) == 0x0001D0, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_OpenModal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_IsValid_ReturnValue_2) == 0x0001D8, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_15) == 0x0001DC, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_GetOwningPlayer_ReturnValue_3) == 0x0001F0, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_GetOwningPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_OpenModal_ReturnValue_3) == 0x0001F8, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_OpenModal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000200, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_IsValid_ReturnValue_3) == 0x000208, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_16) == 0x00020C, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_GetOwningPlayer_ReturnValue_4) == 0x000220, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_GetOwningPlayer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000228, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_17) == 0x000230, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_DynamicCast_AsWBP_Pregame_UIManager) == 0x000240, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_DynamicCast_AsWBP_Pregame_UIManager' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_DynamicCast_bSuccess_3) == 0x000248, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_18) == 0x00024C, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, K2Node_CreateDelegate_OutputDelegate_19) == 0x00025C, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000270, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_Not_PreBool_ReturnValue_1) == 0x000278, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue_1) == 0x000280, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF, CallFunc_Not_PreBool_ReturnValue_2) == 0x000288, "Member 'WBP_Login_PF_C_ExecuteUbergraph_WBP_Login_PF::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function WBP_Login_PF.WBP_Login_PF_C.Handle Linked S6 Account Successfully
// 0x0008 (0x0008 - 0x0000)
struct WBP_Login_PF_C_Handle_Linked_S6_Account_Successfully final
{
public:
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_PF_C_Handle_Linked_S6_Account_Successfully) == 0x000008, "Wrong alignment on WBP_Login_PF_C_Handle_Linked_S6_Account_Successfully");
static_assert(sizeof(WBP_Login_PF_C_Handle_Linked_S6_Account_Successfully) == 0x000008, "Wrong size on WBP_Login_PF_C_Handle_Linked_S6_Account_Successfully");
static_assert(offsetof(WBP_Login_PF_C_Handle_Linked_S6_Account_Successfully, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000000, "Member 'WBP_Login_PF_C_Handle_Linked_S6_Account_Successfully::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");

// Function WBP_Login_PF.WBP_Login_PF_C.OnLoginFailure
// 0x0018 (0x0018 - 0x0000)
struct WBP_Login_PF_C_OnLoginFailure final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_PF_C_OnLoginFailure) == 0x000008, "Wrong alignment on WBP_Login_PF_C_OnLoginFailure");
static_assert(sizeof(WBP_Login_PF_C_OnLoginFailure) == 0x000018, "Wrong size on WBP_Login_PF_C_OnLoginFailure");
static_assert(offsetof(WBP_Login_PF_C_OnLoginFailure, ErrorMessage) == 0x000000, "Member 'WBP_Login_PF_C_OnLoginFailure::ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_Login_PF_C_OnLoginFailure, ErrorCode) == 0x000010, "Member 'WBP_Login_PF_C_OnLoginFailure::ErrorCode' has a wrong offset!");

// Function WBP_Login_PF.WBP_Login_PF_C.OnOpened_4942A25B45CCC8C681474CBB816D4748
// 0x0008 (0x0008 - 0x0000)
struct WBP_Login_PF_C_OnOpened_4942A25B45CCC8C681474CBB816D4748 final
{
public:
	class US6UI_ModalWidgetBase*                  ModalWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_PF_C_OnOpened_4942A25B45CCC8C681474CBB816D4748) == 0x000008, "Wrong alignment on WBP_Login_PF_C_OnOpened_4942A25B45CCC8C681474CBB816D4748");
static_assert(sizeof(WBP_Login_PF_C_OnOpened_4942A25B45CCC8C681474CBB816D4748) == 0x000008, "Wrong size on WBP_Login_PF_C_OnOpened_4942A25B45CCC8C681474CBB816D4748");
static_assert(offsetof(WBP_Login_PF_C_OnOpened_4942A25B45CCC8C681474CBB816D4748, ModalWidget) == 0x000000, "Member 'WBP_Login_PF_C_OnOpened_4942A25B45CCC8C681474CBB816D4748::ModalWidget' has a wrong offset!");

// Function WBP_Login_PF.WBP_Login_PF_C.OnOpened_69EEF34C438321278CC4E2B5F61940F0
// 0x0008 (0x0008 - 0x0000)
struct WBP_Login_PF_C_OnOpened_69EEF34C438321278CC4E2B5F61940F0 final
{
public:
	class US6UI_ModalWidgetBase*                  ModalWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_PF_C_OnOpened_69EEF34C438321278CC4E2B5F61940F0) == 0x000008, "Wrong alignment on WBP_Login_PF_C_OnOpened_69EEF34C438321278CC4E2B5F61940F0");
static_assert(sizeof(WBP_Login_PF_C_OnOpened_69EEF34C438321278CC4E2B5F61940F0) == 0x000008, "Wrong size on WBP_Login_PF_C_OnOpened_69EEF34C438321278CC4E2B5F61940F0");
static_assert(offsetof(WBP_Login_PF_C_OnOpened_69EEF34C438321278CC4E2B5F61940F0, ModalWidget) == 0x000000, "Member 'WBP_Login_PF_C_OnOpened_69EEF34C438321278CC4E2B5F61940F0::ModalWidget' has a wrong offset!");

// Function WBP_Login_PF.WBP_Login_PF_C.OnOpened_6AB51AC54FE1B8489FBF4D9EA953BA58
// 0x0008 (0x0008 - 0x0000)
struct WBP_Login_PF_C_OnOpened_6AB51AC54FE1B8489FBF4D9EA953BA58 final
{
public:
	class US6UI_ModalWidgetBase*                  ModalWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_PF_C_OnOpened_6AB51AC54FE1B8489FBF4D9EA953BA58) == 0x000008, "Wrong alignment on WBP_Login_PF_C_OnOpened_6AB51AC54FE1B8489FBF4D9EA953BA58");
static_assert(sizeof(WBP_Login_PF_C_OnOpened_6AB51AC54FE1B8489FBF4D9EA953BA58) == 0x000008, "Wrong size on WBP_Login_PF_C_OnOpened_6AB51AC54FE1B8489FBF4D9EA953BA58");
static_assert(offsetof(WBP_Login_PF_C_OnOpened_6AB51AC54FE1B8489FBF4D9EA953BA58, ModalWidget) == 0x000000, "Member 'WBP_Login_PF_C_OnOpened_6AB51AC54FE1B8489FBF4D9EA953BA58::ModalWidget' has a wrong offset!");

// Function WBP_Login_PF.WBP_Login_PF_C.OnOpened_8A83A3D24866C908BA13D294B109BDEF
// 0x0008 (0x0008 - 0x0000)
struct WBP_Login_PF_C_OnOpened_8A83A3D24866C908BA13D294B109BDEF final
{
public:
	class US6UI_ModalWidgetBase*                  ModalWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_PF_C_OnOpened_8A83A3D24866C908BA13D294B109BDEF) == 0x000008, "Wrong alignment on WBP_Login_PF_C_OnOpened_8A83A3D24866C908BA13D294B109BDEF");
static_assert(sizeof(WBP_Login_PF_C_OnOpened_8A83A3D24866C908BA13D294B109BDEF) == 0x000008, "Wrong size on WBP_Login_PF_C_OnOpened_8A83A3D24866C908BA13D294B109BDEF");
static_assert(offsetof(WBP_Login_PF_C_OnOpened_8A83A3D24866C908BA13D294B109BDEF, ModalWidget) == 0x000000, "Member 'WBP_Login_PF_C_OnOpened_8A83A3D24866C908BA13D294B109BDEF::ModalWidget' has a wrong offset!");

// Function WBP_Login_PF.WBP_Login_PF_C.Toggle Connecting
// 0x0001 (0x0001 - 0x0000)
struct WBP_Login_PF_C_Toggle_Connecting final
{
public:
	bool                                          IsConnecting;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_PF_C_Toggle_Connecting) == 0x000001, "Wrong alignment on WBP_Login_PF_C_Toggle_Connecting");
static_assert(sizeof(WBP_Login_PF_C_Toggle_Connecting) == 0x000001, "Wrong size on WBP_Login_PF_C_Toggle_Connecting");
static_assert(offsetof(WBP_Login_PF_C_Toggle_Connecting, IsConnecting) == 0x000000, "Member 'WBP_Login_PF_C_Toggle_Connecting::IsConnecting' has a wrong offset!");

}

