#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyboardSettings_CM

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.BndEvt__WBP_KeyRebindingSettings_CM_Slider_AimSensitivity_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_Slider_AimSensitivity_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_Slider_AimSensitivity_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_Slider_AimSensitivity_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_Slider_AimSensitivity_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_Slider_AimSensitivity_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_Slider_AimSensitivity_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_Slider_AimSensitivity_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_2_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_2_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_2_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_2_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_2_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_2_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_2_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_2_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Checkbox_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_SettingsItem_Slider_CM_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.BndEvt__WBP_KeyRebindingSettings_CM_WBP_Template_ButtonTab_Secondary_02_CM_K2Node_ComponentBoundEvent_7_On Tab Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_Template_ButtonTab_Secondary_02_CM_K2Node_ComponentBoundEvent_7_On_Tab_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Tab_Selection;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_Template_ButtonTab_Secondary_02_CM_K2Node_ComponentBoundEvent_7_On_Tab_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_Template_ButtonTab_Secondary_02_CM_K2Node_ComponentBoundEvent_7_On_Tab_Selection_Changed__DelegateSignature");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_Template_ButtonTab_Secondary_02_CM_K2Node_ComponentBoundEvent_7_On_Tab_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_Template_ButtonTab_Secondary_02_CM_K2Node_ComponentBoundEvent_7_On_Tab_Selection_Changed__DelegateSignature");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_Template_ButtonTab_Secondary_02_CM_K2Node_ComponentBoundEvent_7_On_Tab_Selection_Changed__DelegateSignature, Tab_Selection) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_BndEvt__WBP_KeyRebindingSettings_CM_WBP_Template_ButtonTab_Secondary_02_CM_K2Node_ComponentBoundEvent_7_On_Tab_Selection_Changed__DelegateSignature::Tab_Selection' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.ExecuteUbergraph_WBP_KeyboardSettings_CM
// 0x0200 (0x0200 - 0x0000)
struct WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5547[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5548[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5549[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0048(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554B[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_2; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554C[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Name;                           // 0x00C0(0x0018)()
	class FText                                   K2Node_CustomEvent_Description;                    // 0x00D8(0x0018)()
	TDelegate<void(class FText Name, class FText Description)> K2Node_CreateDelegate_OutputDelegate;              // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_Checked_1;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554D[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554E[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked;                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554F[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value_1;                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Tab_Selection;          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5550[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5551[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0158(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0180(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5552[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x019C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5553[0x2];                                     // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_3; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5554[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKeyRebindEmpty_IsEmpty;                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5555[0x2];                                     // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5556[0x3];                                     // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMouseSensitivity_sensitivity_ImplicitCast; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMouseAimSensitivityMultiplier_SensitivityMultiplier_ImplicitCast; // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM) == 0x000008, "Wrong alignment on WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM) == 0x000200, "Wrong size on WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, EntryPoint) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_object_Variable) == 0x000008, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_real_Variable) == 0x000010, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_real_Variable_1) == 0x000018, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_bool_Variable) == 0x000020, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000028, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000030, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_GetCurrentInputType_ReturnValue) == 0x000038, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000048, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000068, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00006C, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000070, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_real_Variable_0) == 0x000078, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_real_Variable_1_0) == 0x000080, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000088, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000090, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue_1) == 0x000098, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue_2) == 0x0000A0, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_bool_Variable_1) == 0x0000A8, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_real_Variable_2) == 0x0000B0, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_real_Variable_3) == 0x0000B8, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_CustomEvent_Name) == 0x0000C0, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_CustomEvent_Description) == 0x0000D8, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_CustomEvent_Description' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_GetAllChildren_ReturnValue) == 0x000100, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_ComponentBoundEvent_Checked_1) == 0x000110, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_ComponentBoundEvent_Checked_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_Array_Get_Item) == 0x000118, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit) == 0x000120, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_Array_Length_ReturnValue) == 0x00012C, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_ComponentBoundEvent_Checked) == 0x000130, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_ComponentBoundEvent_Checked' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_ComponentBoundEvent_Value_1) == 0x000138, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_ComponentBoundEvent_Tab_Selection) == 0x000140, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_ComponentBoundEvent_Tab_Selection' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_object_Variable_1) == 0x000148, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_SwitchInteger_CmpSuccess) == 0x000150, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000158, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000178, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00017C, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000180, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_real_Variable_3_0) == 0x000188, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_real_Variable_2_0) == 0x000190, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000198, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x00019C, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_CustomEvent_bNewInputType) == 0x0001AC, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001AD, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_ComponentBoundEvent_Value) == 0x0001B0, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue_3) == 0x0001B8, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0001C0, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001C4, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001C8, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001D8, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_IsKeyRebindEmpty_IsEmpty) == 0x0001E8, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_IsKeyRebindEmpty_IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_RemoveChild_ReturnValue) == 0x0001E9, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, Temp_int_Loop_Counter_Variable) == 0x0001EC, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_Less_IntInt_ReturnValue) == 0x0001F0, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_Add_IntInt_ReturnValue) == 0x0001F4, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_SetMouseSensitivity_sensitivity_ImplicitCast) == 0x0001F8, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_SetMouseSensitivity_sensitivity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM, CallFunc_SetMouseAimSensitivityMultiplier_SensitivityMultiplier_ImplicitCast) == 0x0001FC, "Member 'WBP_KeyboardSettings_CM_C_ExecuteUbergraph_WBP_KeyboardSettings_CM::CallFunc_SetMouseAimSensitivityMultiplier_SensitivityMultiplier_ImplicitCast' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.HandleSettingsItemHovered
// 0x0030 (0x0030 - 0x0000)
struct WBP_KeyboardSettings_CM_C_HandleSettingsItemHovered final
{
public:
	class FText                                   Param_Name;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_HandleSettingsItemHovered) == 0x000008, "Wrong alignment on WBP_KeyboardSettings_CM_C_HandleSettingsItemHovered");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_HandleSettingsItemHovered) == 0x000030, "Wrong size on WBP_KeyboardSettings_CM_C_HandleSettingsItemHovered");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_HandleSettingsItemHovered, Param_Name) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_HandleSettingsItemHovered::Param_Name' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_HandleSettingsItemHovered, Description) == 0x000018, "Member 'WBP_KeyboardSettings_CM_C_HandleSettingsItemHovered::Description' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_KeyboardSettings_CM_C_InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_KeyboardSettings_CM_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_KeyboardSettings_CM_C_OnInputMethodChanged");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_KeyboardSettings_CM_C_OnInputMethodChanged");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.ResetSettings
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyboardSettings_CM_C_ResetSettings final
{
public:
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_ResetSettings) == 0x000008, "Wrong alignment on WBP_KeyboardSettings_CM_C_ResetSettings");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_ResetSettings) == 0x000008, "Wrong size on WBP_KeyboardSettings_CM_C_ResetSettings");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_ResetSettings, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_ResetSettings::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.SynchronizeInputSettings
// 0x0018 (0x0018 - 0x0000)
struct WBP_KeyboardSettings_CM_C_SynchronizeInputSettings final
{
public:
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetSliderValue_SliderValue_ImplicitCast;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetSliderValue_SliderValue_ImplicitCast_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_SynchronizeInputSettings) == 0x000008, "Wrong alignment on WBP_KeyboardSettings_CM_C_SynchronizeInputSettings");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_SynchronizeInputSettings) == 0x000018, "Wrong size on WBP_KeyboardSettings_CM_C_SynchronizeInputSettings");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_SynchronizeInputSettings, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_SynchronizeInputSettings::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_SynchronizeInputSettings, CallFunc_SetSliderValue_SliderValue_ImplicitCast) == 0x000008, "Member 'WBP_KeyboardSettings_CM_C_SynchronizeInputSettings::CallFunc_SetSliderValue_SliderValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_SynchronizeInputSettings, CallFunc_SetSliderValue_SliderValue_ImplicitCast_1) == 0x000010, "Member 'WBP_KeyboardSettings_CM_C_SynchronizeInputSettings::CallFunc_SetSliderValue_SliderValue_ImplicitCast_1' has a wrong offset!");

// Function WBP_KeyboardSettings_CM.WBP_KeyboardSettings_CM_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_KeyboardSettings_CM_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyboardSettings_CM_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_KeyboardSettings_CM_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_KeyboardSettings_CM_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_KeyboardSettings_CM_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_KeyboardSettings_CM_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyboardSettings_CM_C_BP_GetDesiredFocusTarget, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000008, "Member 'WBP_KeyboardSettings_CM_C_BP_GetDesiredFocusTarget::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
