#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyRebindingMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KeyRebinding_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KeyRebindingMenu.WBP_KeyRebindingMenu_C
// 0x0098 (0x05F0 - 0x0558)
class UWBP_KeyRebindingMenu_C final : public UKeyRebindSettingsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Overlay_1;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ScrollBox_Styled*                ScrollBox;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_InputKeyGroup;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyRebindingGuide_C*               WBP_KeyRebindingGuide;                             // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Secondary_01_CM_C* WBP_Template_Button_Secondary_01_CM;               // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           HideTipsTimerHandle;                               // 0x0590(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         TipsDelayTime;                                     // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5510[0x4];                                     // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ScrollSpeed;                                       // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            WBP_KeyRebidingResult;                             // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                LastFocusedWidget;                                 // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnKeyRebindMenuActivated;                          // 0x05B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasKeyCanbeRebind;                                 // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5511[0x7];                                     // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPopupOpen;                                       // 0x05D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPopupClose;                                      // 0x05E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_KeyRebindingMenu_WBP_Template_Button_Secondary_01_CM_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BP_OnSubWidgetInitCompleted();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_KeyRebindingMenu(int32 EntryPoint, bool Temp_bool_Variable, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, class UInputAction* Temp_object_Variable, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, double Temp_real_Variable, double Temp_real_Variable_1, double Temp_real_Variable_0, double Temp_real_Variable_1_0, bool Temp_bool_Variable_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, int32 Temp_int_Array_Index_Variable, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, double Temp_real_Variable_2, float CallFunc_GetPromptDelayTime_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, double Temp_real_Variable_3, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, float CallFunc_GetScrollOffsetOfEnd_ReturnValue, float CallFunc_GetScrollOffset_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, float CallFunc_GetScrollOffsetOfEnd_ReturnValue_1, double CallFunc_FClamp_ReturnValue, float CallFunc_GetScrollOffset_ReturnValue_1, class UInputAction* Temp_object_Variable_1, double CallFunc_Add_DoubleDouble_ReturnValue, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_1, float K2Node_EnhancedInputActionEvent_ElapsedTime_1, float K2Node_EnhancedInputActionEvent_TriggeredTime_1, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_1, double CallFunc_FClamp_ReturnValue_1, double Temp_real_Variable_3_0, double Temp_real_Variable_2_0, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_1, class UWBP_PopupResetDefault_KeyRebind_C* CallFunc_Create_ReturnValue, class UWBP_KeyRebindResultTips_C* CallFunc_Create_ReturnValue_1, bool CallFunc_K2_IsValidTimerHandle_ReturnValue, const struct FTimerHandle& CallFunc_K2_InvalidateTimerHandle_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const struct FTimerHandle& CallFunc_K2_InvalidateTimerHandle_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, bool CallFunc_IsVisible_ReturnValue, class UWidget* K2Node_Event_Widget, bool K2Node_Event_bIsRebinding_1, struct FKeyRebind_DisplayResult& K2Node_Event_ResultInfo, bool K2Node_Event_bIsRebinding, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue_1, class UWBP_KeyRebindSelector_C* K2Node_DynamicCast_AsWBP_Key_Rebind_Selector, bool K2Node_DynamicCast_bSuccess, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_2, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue_2, ECommonInputType K2Node_CustomEvent_bNewInputType, class UKeyRebindGroupWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class FText CallFunc_GetDescriptionofInputAction_ReturnValue, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_4, bool CallFunc_Array_IsNotEmpty_ReturnValue, double CallFunc_FClamp_Max_ImplicitCast, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast, double CallFunc_FClamp_Max_ImplicitCast_1, float CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast, double CallFunc_Add_DoubleDouble_B_ImplicitCast, float CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast_1);
	void HandleKeyRebindTips(struct FKeyRebind_DisplayResult& KeyRebindResultInfo, class FText CallFunc_GetKeyName_ReturnValue, class FText CallFunc_GetKeyName_ReturnValue_1, class FText CallFunc_GetKeyName_ReturnValue_2, class FText CallFunc_GetKeyName_ReturnValue_3, bool K2Node_SwitchEnum_CmpSuccess, TScriptInterface<class IBPI_KeyRebindInterface_C> K2Node_DynamicCast_AsBPI_Key_Rebind_Interface, bool K2Node_DynamicCast_bSuccess);
	void HiddenResultTips();
	void InpActEvt_IA_UI_ScrollBar_Down_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_ScrollBar_Up_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void IsKeyRebindEmpty(bool* IsEmpty, bool CallFunc_Not_PreBool_ReturnValue);
	void OnInitialized();
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void OnKeyRebindBegin(class UWidget* Widget, bool bIsRebinding);
	void OnKeyRebindEnd(struct FKeyRebind_DisplayResult& ResultInfo, bool bIsRebinding);
	void OnKeyRebindMenuActivated__DelegateSignature(bool bIsActivated);
	void OnPopupClose__DelegateSignature();
	void OnPopupOpen__DelegateSignature();
	void OnResetClose();
	void OnResetConfirm();
	void UpdateInteraction();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KeyRebindingMenu_C">();
	}
	static class UWBP_KeyRebindingMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KeyRebindingMenu_C>();
	}
};
static_assert(alignof(UWBP_KeyRebindingMenu_C) == 0x000008, "Wrong alignment on UWBP_KeyRebindingMenu_C");
static_assert(sizeof(UWBP_KeyRebindingMenu_C) == 0x0005F0, "Wrong size on UWBP_KeyRebindingMenu_C");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, UberGraphFrame) == 0x000558, "Member 'UWBP_KeyRebindingMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, Overlay_1) == 0x000560, "Member 'UWBP_KeyRebindingMenu_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, Overlay_2) == 0x000568, "Member 'UWBP_KeyRebindingMenu_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, ScrollBox) == 0x000570, "Member 'UWBP_KeyRebindingMenu_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, VB_InputKeyGroup) == 0x000578, "Member 'UWBP_KeyRebindingMenu_C::VB_InputKeyGroup' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, WBP_KeyRebindingGuide) == 0x000580, "Member 'UWBP_KeyRebindingMenu_C::WBP_KeyRebindingGuide' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, WBP_Template_Button_Secondary_01_CM) == 0x000588, "Member 'UWBP_KeyRebindingMenu_C::WBP_Template_Button_Secondary_01_CM' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, HideTipsTimerHandle) == 0x000590, "Member 'UWBP_KeyRebindingMenu_C::HideTipsTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, TipsDelayTime) == 0x000598, "Member 'UWBP_KeyRebindingMenu_C::TipsDelayTime' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, ScrollSpeed) == 0x0005A0, "Member 'UWBP_KeyRebindingMenu_C::ScrollSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, WBP_KeyRebidingResult) == 0x0005A8, "Member 'UWBP_KeyRebindingMenu_C::WBP_KeyRebidingResult' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, LastFocusedWidget) == 0x0005B0, "Member 'UWBP_KeyRebindingMenu_C::LastFocusedWidget' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, OnKeyRebindMenuActivated) == 0x0005B8, "Member 'UWBP_KeyRebindingMenu_C::OnKeyRebindMenuActivated' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, HasKeyCanbeRebind) == 0x0005C8, "Member 'UWBP_KeyRebindingMenu_C::HasKeyCanbeRebind' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, OnPopupOpen) == 0x0005D0, "Member 'UWBP_KeyRebindingMenu_C::OnPopupOpen' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_C, OnPopupClose) == 0x0005E0, "Member 'UWBP_KeyRebindingMenu_C::OnPopupClose' has a wrong offset!");

}

