#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GraphicsSettings_Window_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GraphicsSettings_Window_CM.WBP_GraphicsSettings_Window_CM_C
// 0x0080 (0x0590 - 0x0510)
class UWBP_GraphicsSettings_Window_CM_C final : public UCommonActivatableWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_Secondary_01_CM_C* Button_Secondary_ApplyWindowSettings_CM;           // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        Combobox_Resolution_CM;                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        Combobox_WindowMode_CM;                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ScrollBox_Styled*                Scrollbar_GraphicsWindow;                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_DescriptionBox_C*         WBP_Settings_DescriptionBox;                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<double, class FText>                     AspectRationsMap;                                  // 0x0540(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ApplyWindowSettings(EWindowMode Temp_byte_Variable, EWindowMode Temp_byte_Variable_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, EWindowMode Temp_byte_Variable_2, const class FString& CallFunc_Split_LeftS, const class FString& CallFunc_Split_RightS, bool CallFunc_Split_ReturnValue, const class FString& CallFunc_Split_LeftS_1, const class FString& CallFunc_Split_RightS_1, bool CallFunc_Split_ReturnValue_1, int32 CallFunc_Conv_StringToInt_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue_1, int32 Temp_int_Variable, const struct FIntPoint& K2Node_MakeStruct_IntPoint, class UWBP_GraphicsSettings_ConfirmationWindow_CM_C* CallFunc_Create_ReturnValue, EWindowMode K2Node_Select_Default, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue);
	void BndEvt__WBP_GraphicsSettings_Window_CM_Button_Secondary_ApplyWindowSettings_CM_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_GraphicsSettings_Window_CM_Combobox_Resolution_CM_K2Node_ComponentBoundEvent_1_OnOptionChanged__DelegateSignature(int32 Param_Index, class FText Text);
	void BndEvt__WBP_GraphicsSettings_Window_CM_Combobox_WindowMode_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature(int32 Param_Index, class FText Text);
	void BP_OnActivated();
	void Construct();
	void CreateResolutionOptions(bool Init, EWindowMode FullscreenMode, int32 SelectedIndex, const struct FIntPoint& CurrentScreenResolution, const TArray<class FText>& TextOptions, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, uint8 CallFunc_Conv_IntToByte_ReturnValue, uint8 CallFunc_GetValidValue_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, const struct FIntPoint& CallFunc_GetDesktopResolution_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_1, double CallFunc_Conv_IntToDouble_ReturnValue_2, int32 CallFunc_Conv_ByteToInt_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, double CallFunc_Conv_IntToDouble_ReturnValue_3, class FText CallFunc_Conv_IntToText_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_4, double CallFunc_Divide_DoubleDouble_ReturnValue_1, class FText CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, EWindowMode CallFunc_GetFullscreenMode_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, const struct FIntPoint& CallFunc_GetScreenResolution_ReturnValue, TArray<class FText>& K2Node_MakeArray_Array_1, TArray<struct FIntPoint>& CallFunc_GetSupportedFullscreenResolutions_Resolutions, bool CallFunc_GetSupportedFullscreenResolutions_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, const struct FIntPoint& CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Equal_IntPointIntPoint_ReturnValue, bool CallFunc_IsSupportedAspectRatio_Supported, double CallFunc_Conv_IntToDouble_ReturnValue_5, class FText CallFunc_Conv_IntToText_ReturnValue_2, double CallFunc_Conv_IntToDouble_ReturnValue_6, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, double CallFunc_Divide_DoubleDouble_ReturnValue_2, class FText CallFunc_Conv_IntToText_ReturnValue_3, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_4, int32 CallFunc_FTrunc_ReturnValue_1, double CallFunc_Conv_IntToDouble_ReturnValue_7, double CallFunc_Divide_DoubleDouble_ReturnValue_3, class FText CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_5, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_2, class FText CallFunc_Format_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue);
	void DiscardChanges();
	void DoesWindowSettingsHasUnappliedChanges(bool* Value, uint8 CallFunc_Conv_IntToByte_ReturnValue, uint8 CallFunc_GetValidValue_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, const class FString& CallFunc_Split_LeftS, const class FString& CallFunc_Split_RightS, bool CallFunc_Split_ReturnValue, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, const class FString& CallFunc_Split_LeftS_1, const class FString& CallFunc_Split_RightS_1, bool CallFunc_Split_ReturnValue_1, EWindowMode CallFunc_GetFullscreenMode_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, const struct FIntPoint& CallFunc_GetScreenResolution_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue_1, const struct FIntPoint& K2Node_MakeStruct_IntPoint, bool CallFunc_NotEqual_IntPointIntPoint_ReturnValue, bool CallFunc_BooleanOR_ReturnValue);
	void ExecuteUbergraph_WBP_GraphicsSettings_Window_CM(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 K2Node_ComponentBoundEvent_Index_1, class FText K2Node_ComponentBoundEvent_Text_1, class FText K2Node_CustomEvent_Name, class FText K2Node_CustomEvent_Description, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UWBP_SettingsItem_Parent_DoNotEdit_C* K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, int32 K2Node_ComponentBoundEvent_Index, class FText K2Node_ComponentBoundEvent_Text, TDelegate<void(class FText Name, class FText Description)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1);
	void HandleSettingsItemHovered(class FText Param_Name, class FText Description);
	void HandleSettingsItemUnhovered();
	void IsSupportedAspectRatio(const struct FIntPoint& Res, bool* Supported, double CallFunc_Conv_IntToDouble_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue);
	void OnCancel__WBP_GraphicsSettings_ConfirmationWindow_(class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue);
	void OnConfirm__WBP_GraphicsSettings_ConfirmationWindow_(class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue);
	void UpdateApplySettingsEnabledState(bool CallFunc_DoesWindowSettingsHasUnappliedChanges_Value);
	void UpdateWindowSettingsToMatchAppliedSettings(const struct FIntPoint& CurrentScreenResolution, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, const struct FIntPoint& CallFunc_GetDesktopResolution_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_1, bool CallFunc_Equal_IntPointIntPoint_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, double CallFunc_Conv_IntToDouble_ReturnValue_2, class FText CallFunc_Conv_IntToText_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue_1, int32 CallFunc_FTrunc_ReturnValue, EWindowMode CallFunc_GetFullscreenMode_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_3, bool K2Node_SwitchEnum_CmpSuccess, double CallFunc_Divide_DoubleDouble_ReturnValue_1, int32 CallFunc_Conv_ByteToInt_ReturnValue, class FText CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, const struct FIntPoint& CallFunc_GetScreenResolution_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, TArray<class FText>& K2Node_MakeArray_Array_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GraphicsSettings_Window_CM_C">();
	}
	static class UWBP_GraphicsSettings_Window_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GraphicsSettings_Window_CM_C>();
	}
};
static_assert(alignof(UWBP_GraphicsSettings_Window_CM_C) == 0x000008, "Wrong alignment on UWBP_GraphicsSettings_Window_CM_C");
static_assert(sizeof(UWBP_GraphicsSettings_Window_CM_C) == 0x000590, "Wrong size on UWBP_GraphicsSettings_Window_CM_C");
static_assert(offsetof(UWBP_GraphicsSettings_Window_CM_C, UberGraphFrame) == 0x000510, "Member 'UWBP_GraphicsSettings_Window_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Window_CM_C, Button_Secondary_ApplyWindowSettings_CM) == 0x000518, "Member 'UWBP_GraphicsSettings_Window_CM_C::Button_Secondary_ApplyWindowSettings_CM' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Window_CM_C, Combobox_Resolution_CM) == 0x000520, "Member 'UWBP_GraphicsSettings_Window_CM_C::Combobox_Resolution_CM' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Window_CM_C, Combobox_WindowMode_CM) == 0x000528, "Member 'UWBP_GraphicsSettings_Window_CM_C::Combobox_WindowMode_CM' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Window_CM_C, Scrollbar_GraphicsWindow) == 0x000530, "Member 'UWBP_GraphicsSettings_Window_CM_C::Scrollbar_GraphicsWindow' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Window_CM_C, WBP_Settings_DescriptionBox) == 0x000538, "Member 'UWBP_GraphicsSettings_Window_CM_C::WBP_Settings_DescriptionBox' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_Window_CM_C, AspectRationsMap) == 0x000540, "Member 'UWBP_GraphicsSettings_Window_CM_C::AspectRationsMap' has a wrong offset!");

}

