#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListEntry_RequestableItemType_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class UWBP_ListItemButton_CM_C*               ListItemButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, ListItemButton) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::ListItemButton' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_2_OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_2_OnUnhovered__DelegateSignature final
{
public:
	class UWBP_ListItemButton_CM_C*               ListItemButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_2_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_2_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_2_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_2_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_2_OnUnhovered__DelegateSignature, ListItemButton) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_2_OnUnhovered__DelegateSignature::ListItemButton' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_1;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue_1;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_BP_GetSelectedItems_Items;                // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_BP_GetSelectedItems_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577E[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListView*                              K2Node_DynamicCast_AsList_View_1;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577F[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0064(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_5780[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00A0(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0118(0x0078)(ConstParm)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListItem_RequestableItemType_C*        K2Node_DynamicCast_AsList_Item_Requestable_Item_Type; // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInventoryRequestStatus                       K2Node_CustomEvent_RequestStatus;                  // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsExpired;                     // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5781[0x2];                                     // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ListItemButton_CM_C*               K2Node_ComponentBoundEvent_ListItemButton_1;       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_IsTouch;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5782[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ListItemButton_CM_C*               K2Node_ComponentBoundEvent_ListItemButton;         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_IsTouch_1;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanClearSelfSelection_CanClear;           // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM) == 0x0001C8, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, EntryPoint) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_GetListItemObject_ReturnValue) == 0x000008, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_Event_bIsSelected) == 0x000010, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_GetOwningListView_ReturnValue) == 0x000018, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_GetListItemObject_ReturnValue_1) == 0x000020, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_GetListItemObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_DynamicCast_AsList_View) == 0x000028, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_GetOwningListView_ReturnValue_1) == 0x000038, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_GetOwningListView_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_BP_GetSelectedItems_Items) == 0x000040, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_BP_GetSelectedItems_Items' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_BP_GetSelectedItems_ReturnValue) == 0x000050, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_BP_GetSelectedItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_DynamicCast_AsList_View_1) == 0x000058, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_DynamicCast_AsList_View_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_Array_Contains_ReturnValue) == 0x000061, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_Event_MyGeometry) == 0x000064, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_Event_MouseEvent_1) == 0x0000A0, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_Event_MouseEvent) == 0x000118, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_Event_ListItemObject) == 0x000190, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_DynamicCast_AsList_Item_Requestable_Item_Type) == 0x000198, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_DynamicCast_AsList_Item_Requestable_Item_Type' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_DynamicCast_bSuccess_2) == 0x0001A0, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_CustomEvent_RequestStatus) == 0x0001A1, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_CustomEvent_RequestStatus' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_CustomEvent_bIsExpired) == 0x0001A2, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_CustomEvent_bIsExpired' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_Not_PreBool_ReturnValue) == 0x0001A3, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_SwitchEnum_CmpSuccess) == 0x0001A4, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_Event_bIsExpanded) == 0x0001A5, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_ComponentBoundEvent_ListItemButton_1) == 0x0001A8, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_ComponentBoundEvent_ListItemButton_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_IsUsingTouch_IsTouch) == 0x0001B0, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_IsUsingTouch_IsTouch' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, K2Node_ComponentBoundEvent_ListItemButton) == 0x0001B8, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::K2Node_ComponentBoundEvent_ListItemButton' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_IsUsingTouch_IsTouch_1) == 0x0001C0, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_IsUsingTouch_IsTouch_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_CanClearSelfSelection_CanClear) == 0x0001C1, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_CanClearSelfSelection_CanClear' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM, CallFunc_BooleanAND_ReturnValue) == 0x0001C2, "Member 'WBP_ListEntry_RequestableItemType_CM_C_ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.MakeTooltipWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_MakeTooltipWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BasicTooltip_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_MakeTooltipWidget) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_MakeTooltipWidget");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_MakeTooltipWidget) == 0x000010, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_MakeTooltipWidget");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_MakeTooltipWidget, ReturnValue) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_MakeTooltipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_MakeTooltipWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_ListEntry_RequestableItemType_CM_C_MakeTooltipWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_ListEntry_RequestableItemType_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_OnMouseEnter");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_OnMouseEnter");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_ListEntry_RequestableItemType_CM_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_OnMouseLeave");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_OnMouseLeave");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.SetListItemSelection
// 0x0028 (0x0028 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5783[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTileView*                              K2Node_DynamicCast_AsTile_View;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection) == 0x000028, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection, Selected) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection::Selected' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection, CallFunc_GetListItemObject_ReturnValue) == 0x000008, "Member 'WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection, CallFunc_GetOwningListView_ReturnValue) == 0x000010, "Member 'WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection, K2Node_DynamicCast_AsTile_View) == 0x000018, "Member 'WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection::K2Node_DynamicCast_AsTile_View' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_ListEntry_RequestableItemType_CM_C_SetListItemSelection::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.Update Item Button
// 0x0002 (0x0002 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_Update_Item_Button final
{
public:
	EInventoryRequestStatus                       RequestStatus;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsExpired;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_Update_Item_Button) == 0x000001, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_Update_Item_Button");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_Update_Item_Button) == 0x000002, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_Update_Item_Button");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_Update_Item_Button, RequestStatus) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_Update_Item_Button::RequestStatus' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_Update_Item_Button, bIsExpired) == 0x000001, "Member 'WBP_ListEntry_RequestableItemType_CM_C_Update_Item_Button::bIsExpired' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.UpdateFromItemType
// 0x0078 (0x0078 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType final
{
public:
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5784[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           K2Node_MakeStruct_ValeriaItem;                     // 0x0018(0x0060)()
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType) == 0x000078, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000008, "Member 'WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType, K2Node_MakeStruct_ValeriaItem) == 0x000018, "Member 'WBP_ListEntry_RequestableItemType_CM_C_UpdateFromItemType::K2Node_MakeStruct_ValeriaItem' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.CanClearSelfSelection
// 0x0028 (0x0028 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection final
{
public:
	bool                                          CanClear;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5785[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_RequestItemPicker_CM_C*            K2Node_DynamicCast_AsWBP_Request_Item_Picker_CM;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Has_Focus_Item_in_Request_Button_HasFocus; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection) == 0x000028, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection, CanClear) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection::CanClear' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection, CallFunc_GetListItemObject_ReturnValue) == 0x000008, "Member 'WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection, CallFunc_GetOuterObject_ReturnValue) == 0x000010, "Member 'WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection, K2Node_DynamicCast_AsWBP_Request_Item_Picker_CM) == 0x000018, "Member 'WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection::K2Node_DynamicCast_AsWBP_Request_Item_Picker_CM' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection, CallFunc_Has_Focus_Item_in_Request_Button_HasFocus) == 0x000021, "Member 'WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection::CallFunc_Has_Focus_Item_in_Request_Button_HasFocus' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'WBP_ListEntry_RequestableItemType_CM_C_CanClearSelfSelection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C.IsUsingTouch
// 0x0018 (0x0018 - 0x0000)
struct WBP_ListEntry_RequestableItemType_CM_C_IsUsingTouch final
{
public:
	bool                                          IsTouch;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5786[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputMethodActive_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_RequestableItemType_CM_C_IsUsingTouch) == 0x000008, "Wrong alignment on WBP_ListEntry_RequestableItemType_CM_C_IsUsingTouch");
static_assert(sizeof(WBP_ListEntry_RequestableItemType_CM_C_IsUsingTouch) == 0x000018, "Wrong size on WBP_ListEntry_RequestableItemType_CM_C_IsUsingTouch");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_IsUsingTouch, IsTouch) == 0x000000, "Member 'WBP_ListEntry_RequestableItemType_CM_C_IsUsingTouch::IsTouch' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_RequestableItemType_CM_C_IsUsingTouch, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ListEntry_RequestableItemType_CM_C_IsUsingTouch::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
