#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCustomizationPanel_CM

#include "Basic.hpp"

#include "BP_RadioSliderPregisteredElement_structs.hpp"
#include "UMG_structs.hpp"
#include "Palia_structs.hpp"
#include "BP_CharacterCustomization_WardrobeButtonInfo_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.OnItemSelectionChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_OnItemSelectionChanged__DelegateSignature final
{
public:
	class UWBP_CharacterCustomizationPanel_CM_C*  CustomizationPanel;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationItemBase*    ItemSelected;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_OnItemSelectionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_OnItemSelectionChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_OnItemSelectionChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_OnItemSelectionChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnItemSelectionChanged__DelegateSignature, CustomizationPanel) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnItemSelectionChanged__DelegateSignature::CustomizationPanel' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnItemSelectionChanged__DelegateSignature, ItemSelected) == 0x000008, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnItemSelectionChanged__DelegateSignature::ItemSelected' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.UpdateSavedLoadoutButtonVisibility
// 0x0004 (0x0004 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility) == 0x000001, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility) == 0x000004, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility, K2Node_Select_Default) == 0x000003, "Member 'WBP_CharacterCustomizationPanel_CM_C_UpdateSavedLoadoutButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.Toggle Saved Outfits Display
// 0x0028 (0x0028 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_Toggle_Saved_Outfits_Display final
{
public:
	bool                                          bShowSavedOutfitsDisplay;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39AF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LoadoutName;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_Toggle_Saved_Outfits_Display) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_Toggle_Saved_Outfits_Display");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_Toggle_Saved_Outfits_Display) == 0x000028, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_Toggle_Saved_Outfits_Display");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Toggle_Saved_Outfits_Display, bShowSavedOutfitsDisplay) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_Toggle_Saved_Outfits_Display::bShowSavedOutfitsDisplay' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Toggle_Saved_Outfits_Display, LoadoutName) == 0x000008, "Member 'WBP_CharacterCustomizationPanel_CM_C_Toggle_Saved_Outfits_Display::LoadoutName' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Toggle_Saved_Outfits_Display, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'WBP_CharacterCustomizationPanel_CM_C_Toggle_Saved_Outfits_Display::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.HandleOpenSavedLoadoutsTab
// 0x0030 (0x0030 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_HandleOpenSavedLoadoutsTab final
{
public:
	struct FBP_CharacterCustomization_WardrobeButtonInfo Wardrobe_Button_Info;                              // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenSavedLoadoutsTab) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_HandleOpenSavedLoadoutsTab");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenSavedLoadoutsTab) == 0x000030, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_HandleOpenSavedLoadoutsTab");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenSavedLoadoutsTab, Wardrobe_Button_Info) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleOpenSavedLoadoutsTab::Wardrobe_Button_Info' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.HandleOpenCustomizationItemTab
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab final
{
public:
	struct FBP_CharacterCustomization_WardrobeButtonInfo BP_CharacterCustomization_WardrobeButtonInfo;      // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UVALUI_TileView_Styled*                 CallFunc_Get_Active_Tile_View_From_Main_Tab_ActiveTileView; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationItemBase*    CallFunc_Get_Main_Loadout_Item_for_Tab_LoadoutItem; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationItemBase*    CallFunc_Get_Main_Loadout_Item_for_Tab_LoadoutItem_1; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<class FName>                             CallFunc_GetAllLoadoutSlotsForItem_ReturnValue;    // 0x0048(0x0050)()
	TSoftObjectPtr<class UVAL_CharacterCustomizationItemBase> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0098(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Set_ToArray_Result;                       // 0x00C0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TileView_Styled*                 CallFunc_Get_Active_Tile_View_From_Main_Tab_ActiveTileView_1; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab) == 0x0000E8, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab, BP_CharacterCustomization_WardrobeButtonInfo) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab::BP_CharacterCustomization_WardrobeButtonInfo' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab, CallFunc_Get_Active_Tile_View_From_Main_Tab_ActiveTileView) == 0x000030, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab::CallFunc_Get_Active_Tile_View_From_Main_Tab_ActiveTileView' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab, CallFunc_Get_Main_Loadout_Item_for_Tab_LoadoutItem) == 0x000038, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab::CallFunc_Get_Main_Loadout_Item_for_Tab_LoadoutItem' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab, CallFunc_Get_Main_Loadout_Item_for_Tab_LoadoutItem_1) == 0x000040, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab::CallFunc_Get_Main_Loadout_Item_for_Tab_LoadoutItem_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab, CallFunc_GetAllLoadoutSlotsForItem_ReturnValue) == 0x000048, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab::CallFunc_GetAllLoadoutSlotsForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000098, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab, CallFunc_Set_ToArray_Result) == 0x0000C0, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab, CallFunc_Get_Active_Tile_View_From_Main_Tab_ActiveTileView_1) == 0x0000D8, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab::CallFunc_Get_Active_Tile_View_From_Main_Tab_ActiveTileView_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleOpenCustomizationItemTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.OnTileViewEntryInitialized
// 0x0098 (0x0098 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B0[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B1[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B2[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TileView_Styled*                 CallFunc_Get_Active_Tile_View_From_Main_Tab_ActiveTileView; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTabName_Name;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0038(0x0010)(ConstParm, ReferenceParm)
	class UVAL_CharacterCustomizationItemBase*    CallFunc_Get_Main_Loadout_Item_for_Tab_LoadoutItem; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItemBase> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0058(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B3[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized) == 0x000098, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, Item) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, Widget) == 0x000008, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::Widget' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_Get_Active_Tile_View_From_Main_Tab_ActiveTileView) == 0x000028, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_Get_Active_Tile_View_From_Main_Tab_ActiveTileView' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_GetActiveTabName_Name) == 0x000030, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_GetActiveTabName_Name' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_GetListItems_ReturnValue) == 0x000038, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_Get_Main_Loadout_Item_for_Tab_LoadoutItem) == 0x000048, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_Get_Main_Loadout_Item_for_Tab_LoadoutItem' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000058, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item) == 0x000080, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_EqualEqual_SoftObjectReference_ReturnValue) == 0x000092, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_EqualEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized, CallFunc_Array_Contains_ReturnValue) == 0x000093, "Member 'WBP_CharacterCustomizationPanel_CM_C_OnTileViewEntryInitialized::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.HandleDisplayingGliderTrailsPanel
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel final
{
public:
	TSet<class FName>                             GliderSubTabs;                                     // 0x0000(0x0050)(Edit, BlueprintVisible)
	TSet<class FName>                             K2Node_MakeVariable_MakeVariableOutput;            // 0x0050(0x0050)()
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue; // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel) == 0x0000A8, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel, GliderSubTabs) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel::GliderSubTabs' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel, K2Node_MakeVariable_MakeVariableOutput) == 0x000050, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel, CallFunc_Set_Length_ReturnValue) == 0x0000A0, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A4, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel, CallFunc_GetPureConsoleVariableBoolValue_ReturnValue) == 0x0000A5, "Member 'WBP_CharacterCustomizationPanel_CM_C_HandleDisplayingGliderTrailsPanel::CallFunc_GetPureConsoleVariableBoolValue_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.Set Tab To Be Included
// 0x0060 (0x0060 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Included final
{
public:
	TSet<class FName>                             IncludedTabs;                                      // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FName                                   InName;                                            // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIncluded;                                         // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Included) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Included");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Included) == 0x000060, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Included");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Included, IncludedTabs) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Included::IncludedTabs' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Included, InName) == 0x000050, "Member 'WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Included::InName' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Included, bIncluded) == 0x000058, "Member 'WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Included::bIncluded' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.SetupExludedTabsForMode
// 0x0108 (0x0108 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode final
{
public:
	TSet<class FName>                             ExcludedTabs;                                      // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TSet<class FName>                             VariantPanels;                                     // 0x0050(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TSet<class FName>                             SkinSubTabs;                                       // 0x00A0(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue; // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_IsEmpty_ReturnValue;                  // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_1; // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_2; // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_3; // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_4; // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_5; // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_6; // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_7; // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_8; // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode) == 0x000108, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, ExcludedTabs) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::ExcludedTabs' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, VariantPanels) == 0x000050, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::VariantPanels' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, SkinSubTabs) == 0x0000A0, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::SkinSubTabs' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, Temp_bool_Variable) == 0x0000F0, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, Temp_byte_Variable) == 0x0000F1, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, Temp_byte_Variable_1) == 0x0000F2, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_GetPureConsoleVariableBoolValue_ReturnValue) == 0x0000F3, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_GetPureConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_BooleanAND_ReturnValue) == 0x0000F4, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_Set_IsEmpty_ReturnValue) == 0x0000F5, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_Set_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_1) == 0x0000F6, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_Not_PreBool_ReturnValue) == 0x0000F7, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_2) == 0x0000F8, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_BooleanAND_ReturnValue_1) == 0x0000F9, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_BooleanAND_ReturnValue_2) == 0x0000FA, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_3) == 0x0000FB, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_4) == 0x0000FC, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_5) == 0x0000FD, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_6) == 0x0000FE, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_7) == 0x0000FF, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_8) == 0x000100, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode, K2Node_Select_Default) == 0x000101, "Member 'WBP_CharacterCustomizationPanel_CM_C_SetupExludedTabsForMode::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.Set Tab To Be Excluded
// 0x0060 (0x0060 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded final
{
public:
	TSet<class FName>                             ExcludedTabs;                                      // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FName                                   InName;                                            // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInclude;                                          // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded) == 0x000060, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded, ExcludedTabs) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded::ExcludedTabs' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded, InName) == 0x000050, "Member 'WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded::InName' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded, bInclude) == 0x000058, "Member 'WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded::bInclude' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'WBP_CharacterCustomizationPanel_CM_C_Set_Tab_To_Be_Excluded::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.CacheOwnerToTileView
// 0x0038 (0x0038 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B4[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CharacterCustomization_TileView_C*> K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B5[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomization_TileView_C* CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView) == 0x000038, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_CharacterCustomizationPanel_CM_C_CacheOwnerToTileView::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.GetListViewFromWidget
// 0x0038 (0x0038 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TileView_Styled*                 Tile_View;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TileView_Styled*                 K2Node_DynamicCast_AsTileView_Styled;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B6[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomization_TileView_C* K2Node_DynamicCast_AsWBP_Character_Customization_Tile_View; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B7[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TileView_Styled*                 CallFunc_GetTileView_Tile_View;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget) == 0x000038, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget, Widget) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget, Tile_View) == 0x000008, "Member 'WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget::Tile_View' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget, K2Node_DynamicCast_AsTileView_Styled) == 0x000010, "Member 'WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget::K2Node_DynamicCast_AsTileView_Styled' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget, K2Node_DynamicCast_AsWBP_Character_Customization_Tile_View) == 0x000020, "Member 'WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget::K2Node_DynamicCast_AsWBP_Character_Customization_Tile_View' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget, CallFunc_GetTileView_Tile_View) == 0x000030, "Member 'WBP_CharacterCustomizationPanel_CM_C_GetListViewFromWidget::CallFunc_GetTileView_Tile_View' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.IsRightSitckInRotationZone
// 0x0058 (0x0058 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone final
{
public:
	double                                        ActionValueX;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ActionValueY;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightStickRotationAngle;                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRotationZone;                                    // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B8[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Cos_ReturnValue;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B9[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39BA[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone) == 0x000058, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, ActionValueX) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::ActionValueX' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, ActionValueY) == 0x000008, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::ActionValueY' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, RightStickRotationAngle) == 0x000010, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::RightStickRotationAngle' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, IsRotationZone) == 0x000018, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::IsRotationZone' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, CallFunc_Cos_ReturnValue) == 0x000020, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000041, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000048, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x000051, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, CallFunc_BooleanAND_ReturnValue) == 0x000052, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone, CallFunc_BooleanAND_ReturnValue_1) == 0x000053, "Member 'WBP_CharacterCustomizationPanel_CM_C_IsRightSitckInRotationZone::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.Is Face Tab Active
// 0x000C (0x000C - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_Is_Face_Tab_Active final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39BB[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationPanel_CM_C_Is_Face_Tab_Active) == 0x000004, "Wrong alignment on WBP_CharacterCustomizationPanel_CM_C_Is_Face_Tab_Active");
static_assert(sizeof(WBP_CharacterCustomizationPanel_CM_C_Is_Face_Tab_Active) == 0x00000C, "Wrong size on WBP_CharacterCustomizationPanel_CM_C_Is_Face_Tab_Active");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Is_Face_Tab_Active, bActive) == 0x000000, "Member 'WBP_CharacterCustomizationPanel_CM_C_Is_Face_Tab_Active::bActive' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Is_Face_Tab_Active, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'WBP_CharacterCustomizationPanel_CM_C_Is_Face_Tab_Active::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationPanel_CM_C_Is_Face_Tab_Active, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CharacterCustomizationPanel_CM_C_Is_Face_Tab_Active::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomizationPanel_CM.WBP_CharacterCustomizationPanel_CM_C.Update Face Tab Radio Slider
// 0x0080 (0x0080 - 0x0000)
struct WBP_CharacterCustomizationPanel_CM_C_Update_Face_Tab_Radio_Slider final
{
public:
	int32                                         IndexOffset;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39BC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UUserWidget*>               CallFunc_GetElementWidgetsTable_ReturnValue;       // 0x0008(0x0050)(ConstParm, ContainsInstancedReference)
	int32                                         CallFunc_GetCurrentIndex_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Map_Find_Value;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
