#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SavedLoadoutsWheelChoice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C
// 0x00D0 (0x0390 - 0x02C0)
class UWBP_SavedLoadoutsWheelChoice_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Tile_Default;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Tile_Empty;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Tile_Hovered;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Tile_Selected;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EmoteSelectedTip_CM_C*             SavedLoadout_Selected_Tip;                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Tile;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_UButton_Styled*                  TileButton;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AnimatedLoading_C*                 WBP_AnimatedLoading;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Image;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGuid                                  LoadoutId;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  LastRenderPreviewRequestId;                        // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_RenderPreview;                                 // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_SavedLoadout_Drag_C*               DraggedWidget;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_WBP_SavedLoadoutsWheelChoice_C;              // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E14[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             NewLoadoutAssigned;                                // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsSelected;                                        // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E15[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSavedLoadoutWheelChoiceFocused;                  // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSelect;                                          // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_SavedLoadoutsWheelChoice_TileButton_K2Node_ComponentBoundEvent_0_OnButtonSimpleEvent__DelegateSignature();
	void BndEvt__WBP_SavedLoadoutsWheelChoice_TileButton_K2Node_ComponentBoundEvent_1_OnButtonSimpleEvent__DelegateSignature();
	void ClearSelected();
	void Construct();
	void Exchange_Saved_Loadout(class UWBP_SavedLoadoutsWheelChoice_C* Exchanged_Wheel_Choice, const struct FGuid& OldLoadoutId);
	void ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice(int32 EntryPoint, class AVAL_CharacterPreviewer* CallFunc_GetCharacterPreviewer_ReturnValue, bool CallFunc_IsValid_Guid_ReturnValue, class AVAL_CharacterPreviewer* CallFunc_GetCharacterPreviewer_ReturnValue_1, TDelegate<void(class AVAL_CharacterPreviewer* CharacterPreviewer, const struct FGuid& RequestID, class UTextureRenderTarget2D* PreviewTexture)> K2Node_CreateDelegate_OutputDelegate, struct FPointerEvent& K2Node_Event_PointerEvent_2, class UDragDropOperation* K2Node_Event_Operation_2, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, const struct FGeometry& K2Node_Event_MyGeometry, const struct FPointerEvent& K2Node_Event_PointerEvent_1, class UDragDropOperation* K2Node_Event_Operation_1, const struct FPointerEvent& K2Node_Event_PointerEvent, class UDragDropOperation* K2Node_Event_Operation, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UVAL_CharacterCustomizationComponent* CallFunc_GetCharacterCustomizationComponent_ReturnValue, const struct FVAL_CharacterCustomizationLoadout& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, const struct FVAL_RenderFullBodyPreviewParameters& K2Node_MakeStruct_VAL_RenderFullBodyPreviewParameters);
	void GetDisplayedTexture(TSoftObjectPtr<class UTexture2D>* Texture, class UTexture2D* CallFunc_GetBrushResourceAsTexture2D_ReturnValue, TSoftObjectPtr<class UTexture2D> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue);
	void HandleHovered(int32 CallFunc_AkEventGlobal_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue);
	void HandleRenderRequestFinished(class AVAL_CharacterPreviewer* CharacterPreviewer, const struct FGuid& RequestID, class UTextureRenderTarget2D* PreviewTexture, bool CallFunc_EqualEqual_GuidGuid_ReturnValue);
	void HandleUnhovered(class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue);
	void HasValidLoadoutId(bool* bHasValidLoadoutId, bool CallFunc_IsValid_Guid_ReturnValue);
	void Initialize(const struct FGuid& Param_LoadoutId, const struct FVAL_CharacterCustomizationLoadout& Loadout);
	void NewLoadoutAssigned__DelegateSignature(int32 Param_Index, const struct FGuid& Param_LoadoutId);
	void OnDragCancelled(struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragDetected(const struct FGeometry& MyGeometry, struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation, class UBP_SavedLoadoutDrag_C* CallFunc_CreateDragDropOperation_ReturnValue, TSoftObjectPtr<class UTexture2D> CallFunc_GetDisplayedTexture_Texture, class UWBP_SavedLoadout_Drag_C* CallFunc_Create_ReturnValue);
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation, const struct FGuid& OldLoadoutId, class UUserWidget* SavedLoadoutWidgetReference, class UBP_SavedLoadoutDrag_C* K2Node_DynamicCast_AsBP_Saved_Loadout_Drag, bool K2Node_DynamicCast_bSuccess, class UWBP_SavedLoadoutsWheelChoice_C* K2Node_DynamicCast_AsWBP_Saved_Loadouts_Wheel_Choice, bool K2Node_DynamicCast_bSuccess_1, class UWBP_TileEntry_SavedLoadout_C* K2Node_DynamicCast_AsWBP_Tile_Entry_Saved_Loadout, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_EqualEqual_ObjectObject_ReturnValue);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_DetectDragIfPressed_ReturnValue);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_DetectDragIfPressed_ReturnValue);
	void OnSavedLoadoutWheelChoiceFocused__DelegateSignature(class UWBP_SavedLoadoutsWheelChoice_C* NewParam);
	void OnSelect__DelegateSignature(class UWBP_SavedLoadoutsWheelChoice_C* Selected_Wheel_Choice);
	void SelectWheelChoiceByGamepad();
	void Set_Assigned_Loadout(const struct FGuid& Param_LoadoutId, class UVAL_CharacterCustomizationComponent* CharCustComp, bool CallFunc_ClearAssignedSavedLoadout_ReturnValue, bool CallFunc_IsValid_Guid_ReturnValue, bool CallFunc_AssignSavedLoadoutToWheel_ReturnValue, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UVAL_CharacterCustomizationComponent* CallFunc_GetCharacterCustomizationComponent_ReturnValue);
	void SetSelectedTip(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility K2Node_Select_Default);
	void Update(EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class UVAL_CharacterCustomizationComponent* CallFunc_GetCharacterCustomizationComponent_ReturnValue, const struct FGuid& CallFunc_GetLoadoutIdForAssignedSlot_ReturnValue, const struct FVAL_CharacterCustomizationLoadout& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void UpdateIcon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SavedLoadoutsWheelChoice_C">();
	}
	static class UWBP_SavedLoadoutsWheelChoice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SavedLoadoutsWheelChoice_C>();
	}
};
static_assert(alignof(UWBP_SavedLoadoutsWheelChoice_C) == 0x000008, "Wrong alignment on UWBP_SavedLoadoutsWheelChoice_C");
static_assert(sizeof(UWBP_SavedLoadoutsWheelChoice_C) == 0x000390, "Wrong size on UWBP_SavedLoadoutsWheelChoice_C");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_SavedLoadoutsWheelChoice_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, HoverAnim) == 0x0002C8, "Member 'UWBP_SavedLoadoutsWheelChoice_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, Image_Icon) == 0x0002D0, "Member 'UWBP_SavedLoadoutsWheelChoice_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, Image_Tile_Default) == 0x0002D8, "Member 'UWBP_SavedLoadoutsWheelChoice_C::Image_Tile_Default' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, Image_Tile_Empty) == 0x0002E0, "Member 'UWBP_SavedLoadoutsWheelChoice_C::Image_Tile_Empty' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, Image_Tile_Hovered) == 0x0002E8, "Member 'UWBP_SavedLoadoutsWheelChoice_C::Image_Tile_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, Image_Tile_Selected) == 0x0002F0, "Member 'UWBP_SavedLoadoutsWheelChoice_C::Image_Tile_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, SavedLoadout_Selected_Tip) == 0x0002F8, "Member 'UWBP_SavedLoadoutsWheelChoice_C::SavedLoadout_Selected_Tip' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, Switcher_Tile) == 0x000300, "Member 'UWBP_SavedLoadoutsWheelChoice_C::Switcher_Tile' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, TileButton) == 0x000308, "Member 'UWBP_SavedLoadoutsWheelChoice_C::TileButton' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, WBP_AnimatedLoading) == 0x000310, "Member 'UWBP_SavedLoadoutsWheelChoice_C::WBP_AnimatedLoading' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, WidgetSwitcher_Image) == 0x000318, "Member 'UWBP_SavedLoadoutsWheelChoice_C::WidgetSwitcher_Image' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, LoadoutId) == 0x000320, "Member 'UWBP_SavedLoadoutsWheelChoice_C::LoadoutId' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, LastRenderPreviewRequestId) == 0x000330, "Member 'UWBP_SavedLoadoutsWheelChoice_C::LastRenderPreviewRequestId' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, MID_RenderPreview) == 0x000340, "Member 'UWBP_SavedLoadoutsWheelChoice_C::MID_RenderPreview' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, DraggedWidget) == 0x000348, "Member 'UWBP_SavedLoadoutsWheelChoice_C::DraggedWidget' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, Index_WBP_SavedLoadoutsWheelChoice_C) == 0x000350, "Member 'UWBP_SavedLoadoutsWheelChoice_C::Index_WBP_SavedLoadoutsWheelChoice_C' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, NewLoadoutAssigned) == 0x000358, "Member 'UWBP_SavedLoadoutsWheelChoice_C::NewLoadoutAssigned' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, IsSelected) == 0x000368, "Member 'UWBP_SavedLoadoutsWheelChoice_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, OnSavedLoadoutWheelChoiceFocused) == 0x000370, "Member 'UWBP_SavedLoadoutsWheelChoice_C::OnSavedLoadoutWheelChoiceFocused' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadoutsWheelChoice_C, OnSelect) == 0x000380, "Member 'UWBP_SavedLoadoutsWheelChoice_C::OnSelect' has a wrong offset!");

}

