#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_Icon_CM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Button_Icon_CM.WBP_Button_Icon_CM_C.ExecuteUbergraph_WBP_Button_Icon_CM
// 0x001C (0x001C - 0x0000)
struct WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5577[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5578[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0014(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM) == 0x000004, "Wrong alignment on WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM");
static_assert(sizeof(WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM) == 0x00001C, "Wrong size on WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM");
static_assert(offsetof(WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM, EntryPoint) == 0x000000, "Member 'WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000008, "Member 'WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x00000C, "Member 'WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM, K2Node_Event_InFocusEvent) == 0x000014, "Member 'WBP_Button_Icon_CM_C_ExecuteUbergraph_WBP_Button_Icon_CM::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_Button_Icon_CM.WBP_Button_Icon_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Button_Icon_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Button_Icon_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_Button_Icon_CM_C_OnFocusLost");
static_assert(sizeof(WBP_Button_Icon_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_Button_Icon_CM_C_OnFocusLost");
static_assert(offsetof(WBP_Button_Icon_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_Button_Icon_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_Button_Icon_CM.WBP_Button_Icon_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Button_Icon_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Icon_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Button_Icon_CM_C_PreConstruct");
static_assert(sizeof(WBP_Button_Icon_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_Button_Icon_CM_C_PreConstruct");
static_assert(offsetof(WBP_Button_Icon_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Button_Icon_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Button_Icon_CM.WBP_Button_Icon_CM_C.Set Input Action
// 0x0010 (0x0010 - 0x0000)
struct WBP_Button_Icon_CM_C_Set_Input_Action final
{
public:
	class UInputAction*                           Input_Action;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Icon_CM_C_Set_Input_Action) == 0x000008, "Wrong alignment on WBP_Button_Icon_CM_C_Set_Input_Action");
static_assert(sizeof(WBP_Button_Icon_CM_C_Set_Input_Action) == 0x000010, "Wrong size on WBP_Button_Icon_CM_C_Set_Input_Action");
static_assert(offsetof(WBP_Button_Icon_CM_C_Set_Input_Action, Input_Action) == 0x000000, "Member 'WBP_Button_Icon_CM_C_Set_Input_Action::Input_Action' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_Set_Input_Action, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Button_Icon_CM_C_Set_Input_Action::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Button_Icon_CM.WBP_Button_Icon_CM_C.SetButtonStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_Button_Icon_CM_C_SetButtonStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         InStyle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Icon_CM_C_SetButtonStyle) == 0x000008, "Wrong alignment on WBP_Button_Icon_CM_C_SetButtonStyle");
static_assert(sizeof(WBP_Button_Icon_CM_C_SetButtonStyle) == 0x000008, "Wrong size on WBP_Button_Icon_CM_C_SetButtonStyle");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetButtonStyle, InStyle) == 0x000000, "Member 'WBP_Button_Icon_CM_C_SetButtonStyle::InStyle' has a wrong offset!");

// Function WBP_Button_Icon_CM.WBP_Button_Icon_CM_C.SetImage
// 0x0028 (0x0028 - 0x0000)
struct WBP_Button_Icon_CM_C_SetImage final
{
public:
	TSoftObjectPtr<class UTexture2D>              Texture_2D;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Icon_CM_C_SetImage) == 0x000008, "Wrong alignment on WBP_Button_Icon_CM_C_SetImage");
static_assert(sizeof(WBP_Button_Icon_CM_C_SetImage) == 0x000028, "Wrong size on WBP_Button_Icon_CM_C_SetImage");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetImage, Texture_2D) == 0x000000, "Member 'WBP_Button_Icon_CM_C_SetImage::Texture_2D' has a wrong offset!");

// Function WBP_Button_Icon_CM.WBP_Button_Icon_CM_C.SetImageColor
// 0x0024 (0x0024 - 0x0000)
struct WBP_Button_Icon_CM_C_SetImageColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
};
static_assert(alignof(WBP_Button_Icon_CM_C_SetImageColor) == 0x000004, "Wrong alignment on WBP_Button_Icon_CM_C_SetImageColor");
static_assert(sizeof(WBP_Button_Icon_CM_C_SetImageColor) == 0x000024, "Wrong size on WBP_Button_Icon_CM_C_SetImageColor");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetImageColor, Color) == 0x000000, "Member 'WBP_Button_Icon_CM_C_SetImageColor::Color' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetImageColor, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'WBP_Button_Icon_CM_C_SetImageColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_Button_Icon_CM.WBP_Button_Icon_CM_C.SetNewHoverColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_Button_Icon_CM_C_SetNewHoverColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Icon_CM_C_SetNewHoverColor) == 0x000004, "Wrong alignment on WBP_Button_Icon_CM_C_SetNewHoverColor");
static_assert(sizeof(WBP_Button_Icon_CM_C_SetNewHoverColor) == 0x000010, "Wrong size on WBP_Button_Icon_CM_C_SetNewHoverColor");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetNewHoverColor, NewColor) == 0x000000, "Member 'WBP_Button_Icon_CM_C_SetNewHoverColor::NewColor' has a wrong offset!");

// Function WBP_Button_Icon_CM.WBP_Button_Icon_CM_C.SetNewNormalColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_Button_Icon_CM_C_SetNewNormalColor final
{
public:
	struct FLinearColor                           NewNormalColor;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Icon_CM_C_SetNewNormalColor) == 0x000004, "Wrong alignment on WBP_Button_Icon_CM_C_SetNewNormalColor");
static_assert(sizeof(WBP_Button_Icon_CM_C_SetNewNormalColor) == 0x000010, "Wrong size on WBP_Button_Icon_CM_C_SetNewNormalColor");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetNewNormalColor, NewNormalColor) == 0x000000, "Member 'WBP_Button_Icon_CM_C_SetNewNormalColor::NewNormalColor' has a wrong offset!");

// Function WBP_Button_Icon_CM.WBP_Button_Icon_CM_C.SetSizes
// 0x0038 (0x0038 - 0x0000)
struct WBP_Button_Icon_CM_C_SetSizes final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5579[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Icon_CM_C_SetSizes) == 0x000008, "Wrong alignment on WBP_Button_Icon_CM_C_SetSizes");
static_assert(sizeof(WBP_Button_Icon_CM_C_SetSizes) == 0x000038, "Wrong size on WBP_Button_Icon_CM_C_SetSizes");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetSizes, NewParam) == 0x000000, "Member 'WBP_Button_Icon_CM_C_SetSizes::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetSizes, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WBP_Button_Icon_CM_C_SetSizes::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetSizes, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WBP_Button_Icon_CM_C_SetSizes::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetSizes, CallFunc_BreakVector2D_X_1) == 0x000018, "Member 'WBP_Button_Icon_CM_C_SetSizes::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetSizes, CallFunc_BreakVector2D_Y_1) == 0x000020, "Member 'WBP_Button_Icon_CM_C_SetSizes::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetSizes, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000028, "Member 'WBP_Button_Icon_CM_C_SetSizes::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetSizes, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00002C, "Member 'WBP_Button_Icon_CM_C_SetSizes::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetSizes, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1) == 0x000030, "Member 'WBP_Button_Icon_CM_C_SetSizes::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Button_Icon_CM_C_SetSizes, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1) == 0x000034, "Member 'WBP_Button_Icon_CM_C_SetSizes::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1' has a wrong offset!");

}

