#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buffs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Buffs.WBP_Buffs_C
// 0x0038 (0x02F8 - 0x02C0)
class UWBP_Buffs_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTileView*                              TileView_Buffs;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EBuffDisplayType                              BuffDisplayType;                                   // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4F08[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_ListItem_Buff_C*>            BuffActivationListItems;                           // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FBuffActivation>                BuffActivations;                                   // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BindOnChanged();
	void Construct();
	void EvaulateVisibility(bool ValeriaIsVisible, bool ShouldBeVisible, bool CallFunc_GetShouldBeVisible_Visible);
	void ExecuteUbergraph_WBP_Buffs(int32 EntryPoint, class UBuffComponent* K2Node_CustomEvent_buffs, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class UBuffComponent* CallFunc_GetBuffs_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, TDelegate<void(class UBuffComponent* Buffs)> K2Node_CreateDelegate_OutputDelegate, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult_1, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_1, class UBuffComponent* CallFunc_GetBuffs_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_ShouldListenToChanges_Visible);
	void GetShouldBeVisible(bool* Visible, bool CallFunc_ShouldListenToChanges_Visible, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void OnBuffChanged(class UBuffComponent* Buffs);
	void ShouldListenToChanges(bool* Visible, bool CallFunc_IsPackagedForDistribution_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsDebuggingOn__IsDebuggingOn, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, bool CallFunc_BooleanOR_ReturnValue);
	void UnbindOnChanged();
	void UpdateBuffs(const struct FBuffConfig& BuffConfig, int32 Temp_int_Array_Index_Variable, class UBP_ListItem_Buff_C* CallFunc_SpawnObject_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const struct FBuffActivation& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, EValeriaFuncResult CallFunc_FindBuffConfigById_OutResult, const struct FBuffConfig& CallFunc_FindBuffConfigById_ReturnValue, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class UBuffComponent* CallFunc_GetBuffs_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_SwitchEnum_CmpSuccess_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Buffs_C">();
	}
	static class UWBP_Buffs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Buffs_C>();
	}
};
static_assert(alignof(UWBP_Buffs_C) == 0x000008, "Wrong alignment on UWBP_Buffs_C");
static_assert(sizeof(UWBP_Buffs_C) == 0x0002F8, "Wrong size on UWBP_Buffs_C");
static_assert(offsetof(UWBP_Buffs_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Buffs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Buffs_C, TileView_Buffs) == 0x0002C8, "Member 'UWBP_Buffs_C::TileView_Buffs' has a wrong offset!");
static_assert(offsetof(UWBP_Buffs_C, BuffDisplayType) == 0x0002D0, "Member 'UWBP_Buffs_C::BuffDisplayType' has a wrong offset!");
static_assert(offsetof(UWBP_Buffs_C, BuffActivationListItems) == 0x0002D8, "Member 'UWBP_Buffs_C::BuffActivationListItems' has a wrong offset!");
static_assert(offsetof(UWBP_Buffs_C, BuffActivations) == 0x0002E8, "Member 'UWBP_Buffs_C::BuffActivations' has a wrong offset!");

}

