#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RequestAmmo

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_RequestAmmo.WBP_RequestAmmo_C.ExecuteUbergraph_WBP_RequestAmmo
// 0x0070 (0x0070 - 0x0000)
struct WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EEB[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EEC[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NumActiveRequests;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EED[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EEE[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EEF[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RequestAmmoSlot_C*                 K2Node_DynamicCast_AsWBP_Request_Ammo_Slot;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF0[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_RequestAmmoSlot_C*                 CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo) == 0x000008, "Wrong alignment on WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo");
static_assert(sizeof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo) == 0x000070, "Wrong size on WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, EntryPoint) == 0x000000, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, Temp_int_Variable) == 0x000008, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, K2Node_CustomEvent_NumActiveRequests) == 0x000018, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::K2Node_CustomEvent_NumActiveRequests' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, K2Node_DynamicCast_AsWBP_Request_Ammo_Slot) == 0x000048, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::K2Node_DynamicCast_AsWBP_Request_Ammo_Slot' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, CallFunc_Less_IntInt_ReturnValue_1) == 0x000051, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, CallFunc_Create_ReturnValue) == 0x000060, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo, CallFunc_AddChild_ReturnValue) == 0x000068, "Member 'WBP_RequestAmmo_C_ExecuteUbergraph_WBP_RequestAmmo::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_RequestAmmo.WBP_RequestAmmo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RequestAmmo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestAmmo_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_RequestAmmo_C_PreConstruct");
static_assert(sizeof(WBP_RequestAmmo_C_PreConstruct) == 0x000001, "Wrong size on WBP_RequestAmmo_C_PreConstruct");
static_assert(offsetof(WBP_RequestAmmo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_RequestAmmo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_RequestAmmo.WBP_RequestAmmo_C.UpdateAmmoDisplay
// 0x0004 (0x0004 - 0x0000)
struct WBP_RequestAmmo_C_UpdateAmmoDisplay final
{
public:
	int32                                         NumActiveRequests;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestAmmo_C_UpdateAmmoDisplay) == 0x000004, "Wrong alignment on WBP_RequestAmmo_C_UpdateAmmoDisplay");
static_assert(sizeof(WBP_RequestAmmo_C_UpdateAmmoDisplay) == 0x000004, "Wrong size on WBP_RequestAmmo_C_UpdateAmmoDisplay");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateAmmoDisplay, NumActiveRequests) == 0x000000, "Member 'WBP_RequestAmmo_C_UpdateAmmoDisplay::NumActiveRequests' has a wrong offset!");

// Function WBP_RequestAmmo.WBP_RequestAmmo_C.UpdateMaxAmmoSlots
// 0x0050 (0x0050 - 0x0000)
struct WBP_RequestAmmo_C_UpdateMaxAmmoSlots final
{
public:
	int32                                         NumMaxRequests;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF1[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF2[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInventoryRequestManager*               CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_RequestAmmoSlot_C*                 CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryGetNumMaxRequests_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF3[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots) == 0x000008, "Wrong alignment on WBP_RequestAmmo_C_UpdateMaxAmmoSlots");
static_assert(sizeof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots) == 0x000050, "Wrong size on WBP_RequestAmmo_C_UpdateMaxAmmoSlots");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, NumMaxRequests) == 0x000000, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::NumMaxRequests' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, Temp_int_Variable) == 0x000004, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001D, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000030, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, CallFunc_TryGetNumMaxRequests_ReturnValue) == 0x000040, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::CallFunc_TryGetNumMaxRequests_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmo_C_UpdateMaxAmmoSlots, CallFunc_AddChild_ReturnValue) == 0x000048, "Member 'WBP_RequestAmmo_C_UpdateMaxAmmoSlots::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

