#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AnnouncementsModalDialog_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "S6UICore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C
// 0x0060 (0x05F0 - 0x0590)
class UWBP_AnnouncementsModalDialog_CM_C final : public UVALUI_AnnouncementsMessageModalDialog
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         RichTextBlock_Message;                             // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class US6UI_CustomNavigationGroup*            S6UI_CustomNavigationGroup;                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ScrollBox_Styled*                Scrollbox_Message;                                 // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AnimatedLoading_C*                 WBP_AnimatedLoading;                               // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Checkmark_CM_C*                    WBP_Checkmark_CM;                                  // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPrompt_C*            WBP_CommonUIButtonPrompt_98;                       // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Primary_01_CM_C*   WBP_Template_Button_Primary_01;                    // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_PopupSecondary_02_CM_C*   WBP_Template_PopupSecondary_02_CM;                 // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_1;                                  // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_MessageState;                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ScrollSpeed;                                       // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_AnnouncementsModalDialog_CM_S6UI_CustomNavigationGroup_K2Node_ComponentBoundEvent_2_OnCustomNavigationGroupInitialized__DelegateSignature(class US6UI_CustomNavigationGroup* NavGroup);
	void BndEvt__WBP_AnnouncementsModalDialog_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature(bool Checked);
	void BndEvt__WBP_AnnouncementsModalDialog_CM_WBP_Template_Button_Primary_01_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_AnnouncementsModalDialog_CM_WBP_Template_Button_Primary_01_K2Node_ComponentBoundEvent_4_ButtonHovered__DelegateSignature();
	bool BP_OnHandleBackAction(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue);
	bool CanClose(TSet<ES6UI_ModalWidgetState>& K2Node_MakeSet_Set, ES6UI_ModalWidgetState CallFunc_GetModalWidgetState_ReturnValue, bool CallFunc_Set_Contains_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void Construct();
	void ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM(int32 EntryPoint, const class FString& CallFunc_GetAnnouncementUrl_ReturnValue, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_2, float K2Node_EnhancedInputActionEvent_ElapsedTime_2, float K2Node_EnhancedInputActionEvent_TriggeredTime_2, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_2, double CallFunc_Conv_InputActionValueToAxis1D_ReturnValue, class UInputAction* Temp_object_Variable, double Temp_real_Variable, double Temp_real_Variable_0, double Temp_real_Variable_1, double Temp_real_Variable_2, double Temp_real_Variable_1_0, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_1, float K2Node_EnhancedInputActionEvent_ElapsedTime_1, float K2Node_EnhancedInputActionEvent_TriggeredTime_1, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_1, class UInputAction* Temp_object_Variable_1, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, double Temp_real_Variable_3, double Temp_real_Variable_4, double Temp_real_Variable_3_0, double Temp_real_Variable_4_0, bool Temp_bool_Variable, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_1, class UInputAction* Temp_object_Variable_2, double Temp_real_Variable_5, double Temp_real_Variable_5_0, double Temp_real_Variable_6, bool Temp_bool_Variable_1, double Temp_real_Variable_6_0, const class FString& K2Node_Event_Message, class FText CallFunc_Conv_StringToText_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_2, bool K2Node_Event_IsDesignTime, int32 CallFunc_AkEventGlobal_ReturnValue_3, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1, int32 CallFunc_Len_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, bool K2Node_ComponentBoundEvent_Checked, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue_1, class FText Temp_text_Variable, double CallFunc_Multiply_DoubleDouble_ReturnValue, class US6UI_CustomNavigationGroup* K2Node_ComponentBoundEvent_NavGroup, float CallFunc_GetScrollOffset_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, TArray<class UWidget*>& K2Node_MakeArray_Array, bool CallFunc_IsConsole_ReturnValue, bool Temp_bool_Variable_2, class FText Temp_text_Variable_1, class FText K2Node_Select_Default, double CallFunc_Add_DoubleDouble_B_ImplicitCast, float CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast);
	class UWidget* Focus_Check_Box(EUINavigation Param_Navigation);
	void HandleRefreshedMessageFromWeb(const class FString& Message);
	void InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void PreConstruct(bool IsDesignTime);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AnnouncementsModalDialog_CM_C">();
	}
	static class UWBP_AnnouncementsModalDialog_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AnnouncementsModalDialog_CM_C>();
	}
};
static_assert(alignof(UWBP_AnnouncementsModalDialog_CM_C) == 0x000008, "Wrong alignment on UWBP_AnnouncementsModalDialog_CM_C");
static_assert(sizeof(UWBP_AnnouncementsModalDialog_CM_C) == 0x0005F0, "Wrong size on UWBP_AnnouncementsModalDialog_CM_C");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, UberGraphFrame) == 0x000590, "Member 'UWBP_AnnouncementsModalDialog_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, RichTextBlock_Message) == 0x000598, "Member 'UWBP_AnnouncementsModalDialog_CM_C::RichTextBlock_Message' has a wrong offset!");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, S6UI_CustomNavigationGroup) == 0x0005A0, "Member 'UWBP_AnnouncementsModalDialog_CM_C::S6UI_CustomNavigationGroup' has a wrong offset!");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, Scrollbox_Message) == 0x0005A8, "Member 'UWBP_AnnouncementsModalDialog_CM_C::Scrollbox_Message' has a wrong offset!");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, WBP_AnimatedLoading) == 0x0005B0, "Member 'UWBP_AnnouncementsModalDialog_CM_C::WBP_AnimatedLoading' has a wrong offset!");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, WBP_Checkmark_CM) == 0x0005B8, "Member 'UWBP_AnnouncementsModalDialog_CM_C::WBP_Checkmark_CM' has a wrong offset!");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, WBP_CommonUIButtonPrompt_98) == 0x0005C0, "Member 'UWBP_AnnouncementsModalDialog_CM_C::WBP_CommonUIButtonPrompt_98' has a wrong offset!");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, WBP_Template_Button_Primary_01) == 0x0005C8, "Member 'UWBP_AnnouncementsModalDialog_CM_C::WBP_Template_Button_Primary_01' has a wrong offset!");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, WBP_Template_PopupSecondary_02_CM) == 0x0005D0, "Member 'UWBP_AnnouncementsModalDialog_CM_C::WBP_Template_PopupSecondary_02_CM' has a wrong offset!");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, WidgetSwitcher_1) == 0x0005D8, "Member 'UWBP_AnnouncementsModalDialog_CM_C::WidgetSwitcher_1' has a wrong offset!");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, WidgetSwitcher_MessageState) == 0x0005E0, "Member 'UWBP_AnnouncementsModalDialog_CM_C::WidgetSwitcher_MessageState' has a wrong offset!");
static_assert(offsetof(UWBP_AnnouncementsModalDialog_CM_C, ScrollSpeed) == 0x0005E8, "Member 'UWBP_AnnouncementsModalDialog_CM_C::ScrollSpeed' has a wrong offset!");

}

