#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyHUD_MemberRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.ExecuteUbergraph_WBP_PartyHUD_MemberRow
// 0x0200 (0x0200 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_CharacterId;                    // 0x0014(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_570D[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSSVAL_CharacterNameAndId             K2Node_CustomEvent_Name;                           // 0x0028(0x0030)(ConstParm)
	TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId, struct FOSSVAL_CharacterNameAndId& Name)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_CharacterNameAndId             Temp_struct_Variable;                              // 0x0068(0x0030)()
	struct FGuid                                  Temp_struct_Variable_1;                            // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Temp_struct_Variable_2;                            // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_570E[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVALUI_TextBlockStyle>   CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x00D8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x0110(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_CharacterId_1;                  // 0x0120(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_PartyMember                       K2Node_CustomEvent_Member;                         // 0x0170(0x0050)(HasGetValueTypeHash)
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNameByAccountIdAndCharacterIdProxy* CallFunc_GetCharacterNameByAccountIdAndCharacterId_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_570F[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5710[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow) == 0x000008, "Wrong alignment on WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow) == 0x000200, "Wrong size on WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, EntryPoint) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CustomEvent_AccountId) == 0x000004, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CustomEvent_CharacterId) == 0x000014, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CustomEvent_CharacterId' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CustomEvent_Name) == 0x000028, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, Temp_struct_Variable) == 0x000068, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, Temp_struct_Variable_1) == 0x000098, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, Temp_struct_Variable_2) == 0x0000A8, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0000D8, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000100, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CustomEvent_AccountId_1) == 0x000110, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CustomEvent_CharacterId_1) == 0x000120, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CustomEvent_CharacterId_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CreateDelegate_OutputDelegate_2) == 0x000130, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CreateDelegate_OutputDelegate_3) == 0x000140, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CreateDelegate_OutputDelegate_4) == 0x000150, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CreateDelegate_OutputDelegate_5) == 0x000160, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CustomEvent_Member) == 0x000170, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CustomEvent_Member' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0001C0, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, CallFunc_GetCharacterNameByAccountIdAndCharacterId_ReturnValue) == 0x0001C8, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::CallFunc_GetCharacterNameByAccountIdAndCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, CallFunc_IsValid_ReturnValue_1) == 0x0001D0, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x0001D8, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001E0, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, K2Node_Event_IsDesignTime) == 0x0001F0, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0001F8, "Member 'WBP_PartyHUD_MemberRow_C_ExecuteUbergraph_WBP_PartyHUD_MemberRow::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.Handle on Context Menu Button Pressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_Handle_on_Context_Menu_Button_Pressed final
{
public:
	class UWBP_PartyMemberRowContextMenu_C*       ContentWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_Handle_on_Context_Menu_Button_Pressed) == 0x000008, "Wrong alignment on WBP_PartyHUD_MemberRow_C_Handle_on_Context_Menu_Button_Pressed");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_Handle_on_Context_Menu_Button_Pressed) == 0x000008, "Wrong size on WBP_PartyHUD_MemberRow_C_Handle_on_Context_Menu_Button_Pressed");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_Handle_on_Context_Menu_Button_Pressed, ContentWidget) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_Handle_on_Context_Menu_Button_Pressed::ContentWidget' has a wrong offset!");

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.Handle On Game User Settings UI Needs
// 0x0010 (0x0010 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_Handle_On_Game_User_Settings_UI_Needs final
{
public:
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_Handle_On_Game_User_Settings_UI_Needs) == 0x000008, "Wrong alignment on WBP_PartyHUD_MemberRow_C_Handle_On_Game_User_Settings_UI_Needs");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_Handle_On_Game_User_Settings_UI_Needs) == 0x000010, "Wrong size on WBP_PartyHUD_MemberRow_C_Handle_On_Game_User_Settings_UI_Needs");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_Handle_On_Game_User_Settings_UI_Needs, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_Handle_On_Game_User_Settings_UI_Needs::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_Handle_On_Game_User_Settings_UI_Needs, CallFunc_TextIsEmpty_ReturnValue) == 0x000008, "Member 'WBP_PartyHUD_MemberRow_C_Handle_On_Game_User_Settings_UI_Needs::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.HandleOnPartyMemberPromoted
// 0x0050 (0x0050 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_HandleOnPartyMemberPromoted final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_HandleOnPartyMemberPromoted) == 0x000008, "Wrong alignment on WBP_PartyHUD_MemberRow_C_HandleOnPartyMemberPromoted");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_HandleOnPartyMemberPromoted) == 0x000050, "Wrong size on WBP_PartyHUD_MemberRow_C_HandleOnPartyMemberPromoted");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_HandleOnPartyMemberPromoted, Member) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_HandleOnPartyMemberPromoted::Member' has a wrong offset!");

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.HandleOnPartyStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_HandleOnPartyStateChanged final
{
public:
	EVAL_PartyManagerState                        State;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_HandleOnPartyStateChanged) == 0x000001, "Wrong alignment on WBP_PartyHUD_MemberRow_C_HandleOnPartyStateChanged");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_HandleOnPartyStateChanged) == 0x000001, "Wrong size on WBP_PartyHUD_MemberRow_C_HandleOnPartyStateChanged");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_HandleOnPartyStateChanged, State) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_HandleOnPartyStateChanged::State' has a wrong offset!");

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.OnFailure_64FF0DB94623A63854B70DB4ECCD4422
// 0x0020 (0x0020 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_OnFailure_64FF0DB94623A63854B70DB4ECCD4422 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CharacterId;                                       // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_OnFailure_64FF0DB94623A63854B70DB4ECCD4422) == 0x000004, "Wrong alignment on WBP_PartyHUD_MemberRow_C_OnFailure_64FF0DB94623A63854B70DB4ECCD4422");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_OnFailure_64FF0DB94623A63854B70DB4ECCD4422) == 0x000020, "Wrong size on WBP_PartyHUD_MemberRow_C_OnFailure_64FF0DB94623A63854B70DB4ECCD4422");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnFailure_64FF0DB94623A63854B70DB4ECCD4422, AccountId) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_OnFailure_64FF0DB94623A63854B70DB4ECCD4422::AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnFailure_64FF0DB94623A63854B70DB4ECCD4422, CharacterId) == 0x000010, "Member 'WBP_PartyHUD_MemberRow_C_OnFailure_64FF0DB94623A63854B70DB4ECCD4422::CharacterId' has a wrong offset!");

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.OnMouseButtonDown
// 0x0420 (0x0420 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            Reply;                                             // 0x0168(0x00B8)(Edit, BlueprintVisible)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0220(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5711[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0240(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x02F8(0x00B8)()
	TDelegate<void(class UWBP_PartyMemberRowContextMenu_C* ContentWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x03B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetContextMenuContentWidget_ReturnValue;  // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x03D0(0x0030)(HasGetValueTypeHash)
	class UWBP_PartyMemberRowContextMenu_C*       K2Node_DynamicCast_AsWBP_Party_Member_Row_Context_Menu; // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x040B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5712[0x4];                                     // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                Temp_class_Variable;                               // 0x0410(0x0008)(ConstParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SummonContextMenu_ReturnValue;            // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_PartyHUD_MemberRow_C_OnMouseButtonDown");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown) == 0x000420, "Wrong size on WBP_PartyHUD_MemberRow_C_OnMouseButtonDown");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, Reply) == 0x000168, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::Reply' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000220, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000238, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000240, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x0002F8, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, K2Node_CreateDelegate_OutputDelegate) == 0x0003B0, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0003C0, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, CallFunc_GetContextMenuContentWidget_ReturnValue) == 0x0003C8, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::CallFunc_GetContextMenuContentWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, CallFunc_GetNetId_ReturnValue) == 0x0003D0, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::CallFunc_GetNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, K2Node_DynamicCast_AsWBP_Party_Member_Row_Context_Menu) == 0x000400, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::K2Node_DynamicCast_AsWBP_Party_Member_Row_Context_Menu' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, K2Node_DynamicCast_bSuccess) == 0x000408, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, CallFunc_EqualEqual_ReturnValue) == 0x000409, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::CallFunc_EqualEqual_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, CallFunc_Not_PreBool_ReturnValue) == 0x00040A, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, CallFunc_BooleanAND_ReturnValue) == 0x00040B, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, Temp_class_Variable) == 0x000410, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnMouseButtonDown, CallFunc_SummonContextMenu_ReturnValue) == 0x000418, "Member 'WBP_PartyHUD_MemberRow_C_OnMouseButtonDown::CallFunc_SummonContextMenu_ReturnValue' has a wrong offset!");

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.OnSuccess_64FF0DB94623A63854B70DB4ECCD4422
// 0x0050 (0x0050 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_OnSuccess_64FF0DB94623A63854B70DB4ECCD4422 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CharacterId;                                       // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_CharacterNameAndId             Param_Name;                                        // 0x0020(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_OnSuccess_64FF0DB94623A63854B70DB4ECCD4422) == 0x000008, "Wrong alignment on WBP_PartyHUD_MemberRow_C_OnSuccess_64FF0DB94623A63854B70DB4ECCD4422");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_OnSuccess_64FF0DB94623A63854B70DB4ECCD4422) == 0x000050, "Wrong size on WBP_PartyHUD_MemberRow_C_OnSuccess_64FF0DB94623A63854B70DB4ECCD4422");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnSuccess_64FF0DB94623A63854B70DB4ECCD4422, AccountId) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_OnSuccess_64FF0DB94623A63854B70DB4ECCD4422::AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnSuccess_64FF0DB94623A63854B70DB4ECCD4422, CharacterId) == 0x000010, "Member 'WBP_PartyHUD_MemberRow_C_OnSuccess_64FF0DB94623A63854B70DB4ECCD4422::CharacterId' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_OnSuccess_64FF0DB94623A63854B70DB4ECCD4422, Param_Name) == 0x000020, "Member 'WBP_PartyHUD_MemberRow_C_OnSuccess_64FF0DB94623A63854B70DB4ECCD4422::Param_Name' has a wrong offset!");

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PartyHUD_MemberRow_C_PreConstruct");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_PreConstruct) == 0x000001, "Wrong size on WBP_PartyHUD_MemberRow_C_PreConstruct");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.SetCharacterName
// 0x0048 (0x0048 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_SetCharacterName final
{
public:
	struct FUniqueNetIdRepl                       NetId;                                             // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_SetCharacterName) == 0x000008, "Wrong alignment on WBP_PartyHUD_MemberRow_C_SetCharacterName");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_SetCharacterName) == 0x000048, "Wrong size on WBP_PartyHUD_MemberRow_C_SetCharacterName");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_SetCharacterName, NetId) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_SetCharacterName::NetId' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_SetCharacterName, PlayerName) == 0x000030, "Member 'WBP_PartyHUD_MemberRow_C_SetCharacterName::PlayerName' has a wrong offset!");

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.UpdateFromParty
// 0x0028 (0x0028 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_UpdateFromParty final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5713[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentPartyValid_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5714[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_UpdateFromParty) == 0x000008, "Wrong alignment on WBP_PartyHUD_MemberRow_C_UpdateFromParty");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_UpdateFromParty) == 0x000028, "Wrong size on WBP_PartyHUD_MemberRow_C_UpdateFromParty");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_UpdateFromParty, Temp_bool_Variable) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_UpdateFromParty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_UpdateFromParty, Temp_byte_Variable) == 0x000001, "Member 'WBP_PartyHUD_MemberRow_C_UpdateFromParty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_UpdateFromParty, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_PartyHUD_MemberRow_C_UpdateFromParty::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_UpdateFromParty, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_PartyHUD_MemberRow_C_UpdateFromParty::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_UpdateFromParty, CallFunc_IsCurrentPartyValid_ReturnValue) == 0x000010, "Member 'WBP_PartyHUD_MemberRow_C_UpdateFromParty::CallFunc_IsCurrentPartyValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_UpdateFromParty, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000018, "Member 'WBP_PartyHUD_MemberRow_C_UpdateFromParty::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_UpdateFromParty, CallFunc_EqualEqual_ReturnValue) == 0x000020, "Member 'WBP_PartyHUD_MemberRow_C_UpdateFromParty::CallFunc_EqualEqual_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_UpdateFromParty, K2Node_Select_Default) == 0x000021, "Member 'WBP_PartyHUD_MemberRow_C_UpdateFromParty::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PartyHUD_MemberRow.WBP_PartyHUD_MemberRow_C.UpdateFromPartyMember
// 0x0050 (0x0050 - 0x0000)
struct WBP_PartyHUD_MemberRow_C_UpdateFromPartyMember final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyHUD_MemberRow_C_UpdateFromPartyMember) == 0x000008, "Wrong alignment on WBP_PartyHUD_MemberRow_C_UpdateFromPartyMember");
static_assert(sizeof(WBP_PartyHUD_MemberRow_C_UpdateFromPartyMember) == 0x000050, "Wrong size on WBP_PartyHUD_MemberRow_C_UpdateFromPartyMember");
static_assert(offsetof(WBP_PartyHUD_MemberRow_C_UpdateFromPartyMember, Member) == 0x000000, "Member 'WBP_PartyHUD_MemberRow_C_UpdateFromPartyMember::Member' has a wrong offset!");

}

