#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VillagerStore_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "BP_RadioSliderPregisteredElement_structs.hpp"
#include "S6Core_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "S6UICore_structs.hpp"
#include "Palia_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.BndEvt__WBP_VillagerStore_CM_PlayerInventoryWidget_K2Node_ComponentBoundEvent_3_OnSlotClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_PlayerInventoryWidget_K2Node_ComponentBoundEvent_3_OnSlotClicked__DelegateSignature final
{
public:
	class UWBP_InventorySlot_CM_C*                InventorySlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_PlayerInventoryWidget_K2Node_ComponentBoundEvent_3_OnSlotClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_PlayerInventoryWidget_K2Node_ComponentBoundEvent_3_OnSlotClicked__DelegateSignature");
static_assert(sizeof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_PlayerInventoryWidget_K2Node_ComponentBoundEvent_3_OnSlotClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_PlayerInventoryWidget_K2Node_ComponentBoundEvent_3_OnSlotClicked__DelegateSignature");
static_assert(offsetof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_PlayerInventoryWidget_K2Node_ComponentBoundEvent_3_OnSlotClicked__DelegateSignature, InventorySlot) == 0x000000, "Member 'WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_PlayerInventoryWidget_K2Node_ComponentBoundEvent_3_OnSlotClicked__DelegateSignature::InventorySlot' has a wrong offset!");

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.BndEvt__WBP_VillagerStore_CM_RadioSlider_Template_02_Console_K2Node_ComponentBoundEvent_0_OnSliderMoved__DelegateSignature
// 0x0060 (0x0060 - 0x0000)
struct WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_RadioSlider_Template_02_Console_K2Node_ComponentBoundEvent_0_OnSliderMoved__DelegateSignature final
{
public:
	class UUserWidget*                            ElementWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBP_RadioSliderPregisteredElement      ElementData;                                       // 0x0008(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_RadioSlider_Template_02_Console_K2Node_ComponentBoundEvent_0_OnSliderMoved__DelegateSignature) == 0x000008, "Wrong alignment on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_RadioSlider_Template_02_Console_K2Node_ComponentBoundEvent_0_OnSliderMoved__DelegateSignature");
static_assert(sizeof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_RadioSlider_Template_02_Console_K2Node_ComponentBoundEvent_0_OnSliderMoved__DelegateSignature) == 0x000060, "Wrong size on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_RadioSlider_Template_02_Console_K2Node_ComponentBoundEvent_0_OnSliderMoved__DelegateSignature");
static_assert(offsetof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_RadioSlider_Template_02_Console_K2Node_ComponentBoundEvent_0_OnSliderMoved__DelegateSignature, ElementWidget) == 0x000000, "Member 'WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_RadioSlider_Template_02_Console_K2Node_ComponentBoundEvent_0_OnSliderMoved__DelegateSignature::ElementWidget' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_RadioSlider_Template_02_Console_K2Node_ComponentBoundEvent_0_OnSliderMoved__DelegateSignature, ElementData) == 0x000008, "Member 'WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_RadioSlider_Template_02_Console_K2Node_ComponentBoundEvent_0_OnSliderMoved__DelegateSignature::ElementData' has a wrong offset!");

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.BndEvt__WBP_VillagerStore_CM_Slider_Template_02_Filter_K2Node_ComponentBoundEvent_16_On Tab Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_Slider_Template_02_Filter_K2Node_ComponentBoundEvent_16_On_Tab_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Tab_Selection;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_Slider_Template_02_Filter_K2Node_ComponentBoundEvent_16_On_Tab_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_Slider_Template_02_Filter_K2Node_ComponentBoundEvent_16_On_Tab_Selection_Changed__DelegateSignature");
static_assert(sizeof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_Slider_Template_02_Filter_K2Node_ComponentBoundEvent_16_On_Tab_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_Slider_Template_02_Filter_K2Node_ComponentBoundEvent_16_On_Tab_Selection_Changed__DelegateSignature");
static_assert(offsetof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_Slider_Template_02_Filter_K2Node_ComponentBoundEvent_16_On_Tab_Selection_Changed__DelegateSignature, Tab_Selection) == 0x000000, "Member 'WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_CM_Slider_Template_02_Filter_K2Node_ComponentBoundEvent_16_On_Tab_Selection_Changed__DelegateSignature::Tab_Selection' has a wrong offset!");

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.BndEvt__WBP_VillagerStore_ListView_All_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_All_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_All_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_All_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_All_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_All_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_All_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_All_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_All_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_All_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.BndEvt__WBP_VillagerStore_ListView_Items_K2Node_ComponentBoundEvent_9_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Items_K2Node_ComponentBoundEvent_9_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Items_K2Node_ComponentBoundEvent_9_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Items_K2Node_ComponentBoundEvent_9_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Items_K2Node_ComponentBoundEvent_9_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Items_K2Node_ComponentBoundEvent_9_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Items_K2Node_ComponentBoundEvent_9_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Items_K2Node_ComponentBoundEvent_9_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Items_K2Node_ComponentBoundEvent_9_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Items_K2Node_ComponentBoundEvent_9_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.BndEvt__WBP_VillagerStore_ListView_Recipes_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Recipes_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Recipes_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Recipes_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Recipes_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Recipes_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Recipes_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Recipes_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Recipes_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_VillagerStore_CM_C_BndEvt__WBP_VillagerStore_ListView_Recipes_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_VillagerStore_CM_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStore_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_VillagerStore_CM_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_VillagerStore_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_VillagerStore_CM_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_VillagerStore_CM_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_VillagerStore_CM_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.CanAffordToBuyItem
// 0x0048 (0x0048 - 0x0000)
struct WBP_VillagerStore_CM_C_CanAffordToBuyItem final
{
public:
	int32                                         Cost;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanBuy;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AE7[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       CallFunc_GetVitals_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AE8[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetVital_ReturnValue;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVillagerStoreComponent*                CallFunc_GetStore_Store;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AE9[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerInventoryComponent*              CallFunc_GetInventory_Inventory;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AEA[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrencyAmount_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStore_CM_C_CanAffordToBuyItem) == 0x000008, "Wrong alignment on WBP_VillagerStore_CM_C_CanAffordToBuyItem");
static_assert(sizeof(WBP_VillagerStore_CM_C_CanAffordToBuyItem) == 0x000048, "Wrong size on WBP_VillagerStore_CM_C_CanAffordToBuyItem");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, Cost) == 0x000000, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::Cost' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, bCanBuy) == 0x000004, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::bCanBuy' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, CallFunc_GetValeriaCharacter_OutResult) == 0x000005, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, CallFunc_GetVitals_ReturnValue) == 0x000010, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::CallFunc_GetVitals_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, CallFunc_GetVital_ReturnValue) == 0x00001C, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::CallFunc_GetVital_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, CallFunc_GetStore_Store) == 0x000020, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::CallFunc_GetStore_Store' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, CallFunc_GetInventory_Inventory) == 0x000030, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, CallFunc_GetCurrencyAmount_ReturnValue) == 0x00003C, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::CallFunc_GetCurrencyAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanAffordToBuyItem, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000040, "Member 'WBP_VillagerStore_CM_C_CanAffordToBuyItem::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.CanPurchaseSelectedItem
// 0x0038 (0x0038 - 0x0000)
struct WBP_VillagerStore_CM_C_CanPurchaseSelectedItem final
{
public:
	bool                                          CanPurchase;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AEB[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVillagerStoreComponent*                CallFunc_GetStore_Store;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AEC[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemOwned_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AED[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNAND_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem) == 0x000008, "Wrong alignment on WBP_VillagerStore_CM_C_CanPurchaseSelectedItem");
static_assert(sizeof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem) == 0x000038, "Wrong size on WBP_VillagerStore_CM_C_CanPurchaseSelectedItem");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, CanPurchase) == 0x000000, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::CanPurchase' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000001, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, CallFunc_GetStore_Store) == 0x000008, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::CallFunc_GetStore_Store' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000018, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, CallFunc_IsItemOwned_ReturnValue) == 0x000020, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::CallFunc_IsItemOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000028, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, CallFunc_BooleanNAND_ReturnValue) == 0x000031, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::CallFunc_BooleanNAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, CallFunc_BooleanAND_ReturnValue_1) == 0x000033, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CanPurchaseSelectedItem, CallFunc_BooleanAND_ReturnValue_2) == 0x000034, "Member 'WBP_VillagerStore_CM_C_CanPurchaseSelectedItem::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.CloseSellItemWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_VillagerStore_CM_C_CloseSellItemWidget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ES6UI_ModalWidgetState                        CallFunc_GetModalWidgetState_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AEE[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AEF[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStore_CM_C_CloseSellItemWidget) == 0x000008, "Wrong alignment on WBP_VillagerStore_CM_C_CloseSellItemWidget");
static_assert(sizeof(WBP_VillagerStore_CM_C_CloseSellItemWidget) == 0x000020, "Wrong size on WBP_VillagerStore_CM_C_CloseSellItemWidget");
static_assert(offsetof(WBP_VillagerStore_CM_C_CloseSellItemWidget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_VillagerStore_CM_C_CloseSellItemWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CloseSellItemWidget, CallFunc_GetModalWidgetState_ReturnValue) == 0x000001, "Member 'WBP_VillagerStore_CM_C_CloseSellItemWidget::CallFunc_GetModalWidgetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CloseSellItemWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_VillagerStore_CM_C_CloseSellItemWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CloseSellItemWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'WBP_VillagerStore_CM_C_CloseSellItemWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CloseSellItemWidget, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000018, "Member 'WBP_VillagerStore_CM_C_CloseSellItemWidget::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.CreateSellItemWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_VillagerStore_CM_C_CreateSellItemWidget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF1[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF2[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_VillagerStoreCustomSellItem_Console_C* CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStore_CM_C_CreateSellItemWidget) == 0x000008, "Wrong alignment on WBP_VillagerStore_CM_C_CreateSellItemWidget");
static_assert(sizeof(WBP_VillagerStore_CM_C_CreateSellItemWidget) == 0x000030, "Wrong size on WBP_VillagerStore_CM_C_CreateSellItemWidget");
static_assert(offsetof(WBP_VillagerStore_CM_C_CreateSellItemWidget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_VillagerStore_CM_C_CreateSellItemWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CreateSellItemWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_VillagerStore_CM_C_CreateSellItemWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CreateSellItemWidget, CallFunc_GetValeriaPlayerController_OutResult) == 0x000014, "Member 'WBP_VillagerStore_CM_C_CreateSellItemWidget::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CreateSellItemWidget, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000018, "Member 'WBP_VillagerStore_CM_C_CreateSellItemWidget::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CreateSellItemWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'WBP_VillagerStore_CM_C_CreateSellItemWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStore_CM_C_CreateSellItemWidget, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_VillagerStore_CM_C_CreateSellItemWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_VillagerStore_CM.WBP_VillagerStore_CM_C.ExecuteUbergraph_WBP_VillagerStore_CM
// 0x05D8 (0x05D8 - 0x0000)
struct WBP_VillagerStore_CM_C_ExecuteUbergraph_WBP_VillagerStore_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF4[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF5[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF6[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF7[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x00D8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0100(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF8[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF9[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5_0;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0148(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0170(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFA[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFB[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_7_0;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x01C0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x01E8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_4;                            // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_4; // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFC[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_8;                              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8_0;                            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9_0;                            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFD[0x3];                                     // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0224(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bBuy;                           // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFE[0x2];                                     // 0x023E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_4;              // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFF[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    K2Node_CustomEvent_Inventory;                      // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_2;                 // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_2;          // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B00[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_1;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B01[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_StoreItemSlot_ListItem_C*           K2Node_DynamicCast_AsBP_Store_Item_Slot_List_Item; // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B02[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_StoreItemSlot_ListItem_C*           K2Node_DynamicCast_AsBP_Store_Item_Slot_List_Item_1; // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B03[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDataTable*                       K2Node_CustomEvent_Table;                          // 0x0298(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B04[0x6];                                     // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_10;                             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B05[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_11;                             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_5;                            // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B06[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x02D8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0300(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11_0;                           // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10_0;                           // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_5; // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B07[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_StoreItemSlot_ListItem_C*           K2Node_DynamicCast_AsBP_Store_Item_Slot_List_Item_2; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B08[0x3];                                     // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_5;              // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B09[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventorySlot_CM_C*                K2Node_ComponentBoundEvent_InventorySlot;          // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Tab_Selection;          // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0A[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_ElementWidget;          // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBP_RadioSliderPregisteredElement      K2Node_ComponentBoundEvent_ElementData;            // 0x0350(0x0058)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0B[0x6];                                     // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ListView_Styled*                 CallFunc_GetActivatedListView_ListView;            // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* Widget)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x03B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* Widget)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x03C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue_1;            // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x03DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue_2;            // 0x03DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0C[0x4];                                     // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ListView_Styled*                 CallFunc_GetActivatedListView_ListView_1;          // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0D[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0E[0x4];                                     // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_12;                             // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0F[0x7];                                     // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_13;                             // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_6;                            // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue_3;            // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B10[0x4];                                     // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_7;     // 0x0428(0x0020)(NoDestructor)
