#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TileEntry_SavedLoadout

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "S6Core_structs.hpp"
#include "UMG_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.OnItemFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_OnItemFocused__DelegateSignature final
{
public:
	class UWBP_TileEntry_SavedLoadout_C*          Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_OnItemFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_OnItemFocused__DelegateSignature");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_OnItemFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_TileEntry_SavedLoadout_C_OnItemFocused__DelegateSignature");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnItemFocused__DelegateSignature, Widget) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_OnItemFocused__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_TileEntry_SavedLoadout_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_TileEntry_SavedLoadout_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.ExecuteUbergraph_WBP_TileEntry_SavedLoadout
// 0x0B20 (0x0B20 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C6C[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0068(0x0078)(ConstParm)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListItemSelected_ReturnValue;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6D[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_1;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_SavedLoadout_C*               K2Node_DynamicCast_AsTile_Item_Saved_Loadout;      // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6E[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CosmeticItemTooltip_C*             CallFunc_Create_ReturnValue;                       // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_2;          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6F[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C70[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_CharacterPreviewer*                CallFunc_GetCharacterPreviewer_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C71[0x6];                                     // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_CharacterPreviewer*                CallFunc_GetCharacterPreviewer_ReturnValue_1;      // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_CharacterPreviewer* CharacterPreviewer, const struct FGuid& RequestID, class UTextureRenderTarget2D* PreviewTexture)> K2Node_CreateDelegate_OutputDelegate;              // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_RenderFullBodyPreviewParameters   K2Node_MakeStruct_VAL_RenderFullBodyPreviewParameters; // 0x0180(0x0900)()
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0A80(0x0078)(ConstParm)
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x0AF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0B00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C72[0x7];                                     // 0x0B01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_3;          // 0x0B08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_SavedLoadout_C*               K2Node_DynamicCast_AsTile_Item_Saved_Loadout_1;    // 0x0B10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0B18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout) == 0x000B20, "Wrong size on WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, EntryPoint) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_GetOwningListView_ReturnValue) == 0x000008, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_DynamicCast_AsList_View) == 0x000010, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_GetListItemObject_ReturnValue) == 0x000020, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_AkEventGlobal_ReturnValue) == 0x000028, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_Event_MyGeometry) == 0x00002C, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_Event_MouseEvent) == 0x000068, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_Event_ListItemObject) == 0x0000E0, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_IsListItemSelected_ReturnValue) == 0x0000E8, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_IsListItemSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_Event_bIsSelected) == 0x0000E9, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_GetListItemObject_ReturnValue_1) == 0x0000F0, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_GetListItemObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_DynamicCast_AsTile_Item_Saved_Loadout) == 0x0000F8, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_DynamicCast_AsTile_Item_Saved_Loadout' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_GetOwningPlayer_ReturnValue) == 0x000108, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_Create_ReturnValue) == 0x000110, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_GetListItemObject_ReturnValue_2) == 0x000118, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_GetListItemObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item) == 0x000120, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000130, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_ComponentBoundEvent_Button_2) == 0x000138, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_ComponentBoundEvent_Button_1) == 0x000140, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_ComponentBoundEvent_Button) == 0x000148, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_Event_bIsExpanded) == 0x000150, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_GetCharacterPreviewer_ReturnValue) == 0x000158, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_GetCharacterPreviewer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_IsValid_Guid_ReturnValue) == 0x000161, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_GetCharacterPreviewer_ReturnValue_1) == 0x000168, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_GetCharacterPreviewer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_CreateDelegate_OutputDelegate) == 0x000170, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_MakeStruct_VAL_RenderFullBodyPreviewParameters) == 0x000180, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_MakeStruct_VAL_RenderFullBodyPreviewParameters' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_Event_PointerEvent) == 0x000A80, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_Event_Operation) == 0x000AF8, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_Not_PreBool_ReturnValue) == 0x000B00, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, CallFunc_GetListItemObject_ReturnValue_3) == 0x000B08, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::CallFunc_GetListItemObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_DynamicCast_AsTile_Item_Saved_Loadout_1) == 0x000B10, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_DynamicCast_AsTile_Item_Saved_Loadout_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout, K2Node_DynamicCast_bSuccess_3) == 0x000B18, "Member 'WBP_TileEntry_SavedLoadout_C_ExecuteUbergraph_WBP_TileEntry_SavedLoadout::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.Get Customization Panel
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel final
{
public:
	class UWBP_CharacterCustomizationPanel_CM_C*  Character_Customization_Panel_CM;                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C73[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ValeriaPlayerController_C*          K2Node_DynamicCast_AsBP_Valeria_Player_Controller; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C74[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GameplayUIManager_C*               K2Node_DynamicCast_AsWBP_Gameplay_UIManager;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C75[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomizationScreen_CM_C* K2Node_DynamicCast_AsWBP_Character_Customization_Screen_CM; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C76[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PreGameHUD_CM_C*                   K2Node_DynamicCast_AsWBP_Pre_Game_HUD_CM;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C77[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PregameHUD_PF_C*                   K2Node_DynamicCast_AsWBP_Pregame_HUD_PF;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C78[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomizationPanel_CM_C*  K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C79[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomizationPanel_CM_C*  K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM_1; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel) == 0x0000A8, "Wrong size on WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, Character_Customization_Panel_CM) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::Character_Customization_Panel_CM' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, CallFunc_GetValeriaPlayerController_OutResult) == 0x000008, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000010, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_AsBP_Valeria_Player_Controller) == 0x000020, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_AsBP_Valeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000030, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Gameplay_UIManager) == 0x000038, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Gameplay_UIManager' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_SwitchEnum_CmpSuccess) == 0x000041, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, CallFunc_GetPlatformType_ReturnValue) == 0x000042, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, CallFunc_IsValid_ReturnValue) == 0x000043, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_SwitchEnum_CmpSuccess_1) == 0x000044, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Character_Customization_Screen_CM) == 0x000048, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Character_Customization_Screen_CM' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000058, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, CallFunc_GetUIManagerWidget_ReturnValue_1) == 0x000060, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::CallFunc_GetUIManagerWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Pre_Game_HUD_CM) == 0x000068, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Pre_Game_HUD_CM' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Pregame_HUD_PF) == 0x000078, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Pregame_HUD_PF' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_4) == 0x000080, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM) == 0x000088, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_5) == 0x000090, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM_1) == 0x000098, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_6) == 0x0000A0, "Member 'WBP_TileEntry_SavedLoadout_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.GetDisplayedTexture
// 0x0068 (0x0068 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C7A[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0040(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture) == 0x000068, "Wrong size on WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture, Texture) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture::Texture' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000028, "Member 'WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture, K2Node_DynamicCast_AsTexture_2D) == 0x000030, "Member 'WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000040, "Member 'WBP_TileEntry_SavedLoadout_C_GetDisplayedTexture::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.GetItemId
// 0x0038 (0x0038 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_GetItemId final
{
public:
	struct FGuid                                  Item_Id;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_MakeStruct_Guid;                            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_GetItemId) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_GetItemId");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_GetItemId) == 0x000038, "Wrong size on WBP_TileEntry_SavedLoadout_C_GetItemId");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_GetItemId, Item_Id) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_GetItemId::Item_Id' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_GetItemId, K2Node_MakeStruct_Guid) == 0x000010, "Member 'WBP_TileEntry_SavedLoadout_C_GetItemId::K2Node_MakeStruct_Guid' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_GetItemId, CallFunc_GetListItemObject_ReturnValue) == 0x000020, "Member 'WBP_TileEntry_SavedLoadout_C_GetItemId::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_GetItemId, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item) == 0x000028, "Member 'WBP_TileEntry_SavedLoadout_C_GetItemId::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_GetItemId, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_TileEntry_SavedLoadout_C_GetItemId::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.HandleItemSelectionChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_HandleItemSelectionChanged final
{
public:
	bool                                          Param_Selected;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_HandleItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_HandleItemSelectionChanged");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_HandleItemSelectionChanged) == 0x000002, "Wrong size on WBP_TileEntry_SavedLoadout_C_HandleItemSelectionChanged");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_HandleItemSelectionChanged, Param_Selected) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_HandleItemSelectionChanged::Param_Selected' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_HandleItemSelectionChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_TileEntry_SavedLoadout_C_HandleItemSelectionChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.HandleRenderRequestFinished
// 0x0028 (0x0028 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished final
{
public:
	class AVAL_CharacterPreviewer*                CharacterPreviewer;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  RequestID;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 PreviewTexture;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished) == 0x000028, "Wrong size on WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished, CharacterPreviewer) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished::CharacterPreviewer' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished, RequestID) == 0x000008, "Member 'WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished::RequestID' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished, PreviewTexture) == 0x000018, "Member 'WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished::PreviewTexture' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished, CallFunc_EqualEqual_GuidGuid_ReturnValue) == 0x000020, "Member 'WBP_TileEntry_SavedLoadout_C_HandleRenderRequestFinished::CallFunc_EqualEqual_GuidGuid_ReturnValue' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.OnDragCancelled
// 0x0080 (0x0080 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_OnDragCancelled final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_OnDragCancelled) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_OnDragCancelled");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_OnDragCancelled) == 0x000080, "Wrong size on WBP_TileEntry_SavedLoadout_C_OnDragCancelled");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDragCancelled, PointerEvent) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_OnDragCancelled::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDragCancelled, Operation) == 0x000078, "Member 'WBP_TileEntry_SavedLoadout_C_OnDragCancelled::Operation' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.OnDragDetected
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SavedLoadoutDrag_C*                 CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_SavedLoadout_Drag_C*               CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetDisplayedTexture_Texture;              // 0x00C8(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_OnDragDetected) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_OnDragDetected");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_OnDragDetected) == 0x0000F0, "Wrong size on WBP_TileEntry_SavedLoadout_C_OnDragDetected");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'WBP_TileEntry_SavedLoadout_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDragDetected, Operation) == 0x0000B0, "Member 'WBP_TileEntry_SavedLoadout_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000B8, "Member 'WBP_TileEntry_SavedLoadout_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'WBP_TileEntry_SavedLoadout_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDragDetected, CallFunc_GetDisplayedTexture_Texture) == 0x0000C8, "Member 'WBP_TileEntry_SavedLoadout_C_OnDragDetected::CallFunc_GetDisplayedTexture_Texture' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.OnDrop
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C7B[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SavedLoadoutDrag_C*                 K2Node_DynamicCast_AsBP_Saved_Loadout_Drag;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C7C[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SavedLoadoutsWheelChoice_C*        K2Node_DynamicCast_AsWBP_Saved_Loadouts_Wheel_Choice; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_OnDrop) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_OnDrop");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_OnDrop) == 0x0000E0, "Wrong size on WBP_TileEntry_SavedLoadout_C_OnDrop");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDrop, MyGeometry) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDrop, PointerEvent) == 0x000038, "Member 'WBP_TileEntry_SavedLoadout_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDrop, Operation) == 0x0000B0, "Member 'WBP_TileEntry_SavedLoadout_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDrop, ReturnValue) == 0x0000B8, "Member 'WBP_TileEntry_SavedLoadout_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDrop, K2Node_DynamicCast_AsBP_Saved_Loadout_Drag) == 0x0000C0, "Member 'WBP_TileEntry_SavedLoadout_C_OnDrop::K2Node_DynamicCast_AsBP_Saved_Loadout_Drag' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WBP_TileEntry_SavedLoadout_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDrop, K2Node_DynamicCast_AsWBP_Saved_Loadouts_Wheel_Choice) == 0x0000D0, "Member 'WBP_TileEntry_SavedLoadout_C_OnDrop::K2Node_DynamicCast_AsWBP_Saved_Loadouts_Wheel_Choice' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnDrop, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'WBP_TileEntry_SavedLoadout_C_OnDrop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_OnFocusReceived");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_TileEntry_SavedLoadout_C_OnFocusReceived");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_TileEntry_SavedLoadout_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_TileEntry_SavedLoadout_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_TileEntry_SavedLoadout_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_SavedLoadout_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_TileEntry_SavedLoadout_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_TileEntry_SavedLoadout.WBP_TileEntry_SavedLoadout_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_SavedLoadout_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_SavedLoadout_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_TileEntry_SavedLoadout_C_OnListItemObjectSet");
static_assert(sizeof(WBP_TileEntry_SavedLoadout_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_TileEntry_SavedLoadout_C_OnListItemObjectSet");
