#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TIM_ChatCmdSuggestions_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S6UICore_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C
// 0x0030 (0x0550 - 0x0520)
class UWBP_TIM_ChatCmdSuggestions_CM_C final : public US6UI_InputActionHandlingUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_ListView_Styled*                 ListView;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 InString;                                          // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCompleteSuggestion;                              // 0x0540(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_TIM_ChatCmdSuggestions_ListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void CycleToNextSuggestion(int32 SelectedSuggestionIndex, int32 CallFunc_BP_GetNumItemsSelected_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_GetNumItems_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class UObject* CallFunc_BP_GetSelectedItem_ReturnValue, int32 CallFunc_GetIndexForItem_ReturnValue);
	void CycleToPrevSuggestion(int32 SelectedSuggestionIndex, int32 CallFunc_BP_GetNumItemsSelected_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, TArray<class UObject*>& CallFunc_GetListItems_ReturnValue, int32 CallFunc_Array_LastIndex_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, class UObject* CallFunc_BP_GetSelectedItem_ReturnValue, int32 CallFunc_GetIndexForItem_ReturnValue);
	void ExecuteUbergraph_WBP_TIM_ChatCmdSuggestions_CM(int32 EntryPoint, class UObject* K2Node_ComponentBoundEvent_Item);
	void GetCompletitionTextPart(class FText* CompletitionText, int32 CallFunc_Len_ReturnValue, class UObject* CallFunc_BP_GetSelectedItem_ReturnValue, class UBP_TIM_ChatCmdSuggestionListItem_C* K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_RightChop_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue);
	class UWidget* Handle_on_NavigationNext(EUINavigation Param_Navigation);
	void IsEmpty(bool* Param_IsEmpty, int32 CallFunc_GetNumItems_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	void OnCompleteSuggestion__DelegateSignature();
	void Populate_Command_Classes_Suggestions(const class FString& Param_InString, TArray<class UVAL_ChatCommand_Base*>& CommandClasses, const TArray<class UObject*>& Suggestions, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, class UVAL_ChatCommand_Base* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UBP_TIM_ChatCmdSuggestionListItem_C* CallFunc_SpawnObject_ReturnValue, int32 CallFunc_Array_Add_ReturnValue);
	void Populate_Strings_Suggestions(const class FString& Param_InString, TArray<class FString>& StringsSuggestions, const TArray<class UObject*>& Suggestions, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Length_ReturnValue, const class FString& CallFunc_Array_Get_Item, class FText CallFunc_Conv_StringToText_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UBP_TIM_ChatCmdSuggestionListItem_C* CallFunc_SpawnObject_ReturnValue, int32 CallFunc_Array_Add_ReturnValue);
	void Scroll_Suggestion_Index_Into_View(int32 SuggestionIndex, bool CallFunc_EqualEqual_IntInt_ReturnValue, TArray<class UObject*>& CallFunc_GetListItems_ReturnValue, int32 CallFunc_Array_LastIndex_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1);
	void SetSuggestionsIfChanged(TArray<class UObject*>& Suggestions, bool SuggestionsChanged, int32 SelectedSuggestionIndex, class FText OldSelectedSuggestionText, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Length_ReturnValue, class UObject* CallFunc_BP_GetSelectedItem_ReturnValue, class UBP_TIM_ChatCmdSuggestionListItem_C* K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item, bool K2Node_DynamicCast_bSuccess, class UObject* CallFunc_GetItemAt_ReturnValue, class UBP_TIM_ChatCmdSuggestionListItem_C* K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item_1, bool K2Node_DynamicCast_bSuccess_1, class UObject* CallFunc_Array_Get_Item, int32 CallFunc_GetNumItems_ReturnValue, class UBP_TIM_ChatCmdSuggestionListItem_C* K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item_2, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_NotEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_TextText_ReturnValue, bool CallFunc_NotEqual_TextText_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TIM_ChatCmdSuggestions_CM_C">();
	}
	static class UWBP_TIM_ChatCmdSuggestions_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TIM_ChatCmdSuggestions_CM_C>();
	}
};
static_assert(alignof(UWBP_TIM_ChatCmdSuggestions_CM_C) == 0x000008, "Wrong alignment on UWBP_TIM_ChatCmdSuggestions_CM_C");
static_assert(sizeof(UWBP_TIM_ChatCmdSuggestions_CM_C) == 0x000550, "Wrong size on UWBP_TIM_ChatCmdSuggestions_CM_C");
static_assert(offsetof(UWBP_TIM_ChatCmdSuggestions_CM_C, UberGraphFrame) == 0x000520, "Member 'UWBP_TIM_ChatCmdSuggestions_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatCmdSuggestions_CM_C, ListView) == 0x000528, "Member 'UWBP_TIM_ChatCmdSuggestions_CM_C::ListView' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatCmdSuggestions_CM_C, InString) == 0x000530, "Member 'UWBP_TIM_ChatCmdSuggestions_CM_C::InString' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatCmdSuggestions_CM_C, OnCompleteSuggestion) == 0x000540, "Member 'UWBP_TIM_ChatCmdSuggestions_CM_C::OnCompleteSuggestion' has a wrong offset!");

}

