#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialPanel_Party

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SocialPanel_Party.WBP_SocialPanel_Party_C
// 0x0058 (0x0568 - 0x0510)
class UWBP_SocialPanel_Party_C final : public UCommonActivatableWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_Secondary_01_CM_C* Button_Leave;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class US6UI_CustomNavigationGroup*            CustomNavigationGroup_Party;                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ListView_Styled*                 ListView_PartyMembers;                             // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_NumMembers;                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_InParty;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_NoParty;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Party;                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPartyCreated;                                    // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         NumRetriesForDisplayParty;                         // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_3_OnCustomNavigationGroupInitialized__DelegateSignature(class US6UI_CustomNavigationGroup* NavGroup);
	void BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature(class US6UI_CustomNavigationGroup* NavGroup);
	void BndEvt__WBP_SocialPanel_Party_WBP_Template_Button_Secondary_01_CM_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature();
	void ClearMemberList(class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, int32 CallFunc_GetMaximumPartySize_ReturnValue);
	void Construct();
	void Destruct();
	void DisplayParty(bool* bDidFocusOnExistingPartyMember, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, TArray<class UUserWidget*>& CallFunc_GetDisplayedEntryWidgets_ReturnValue, class UUserWidget* CallFunc_Array_Get_Item, const TSet<struct FVAL_PartyMember>& CallFunc_GetAllPartyMembers_ReturnValue, int32 CallFunc_Set_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void ExecuteUbergraph_WBP_SocialPanel_Party(int32 EntryPoint, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, bool Temp_bool_Variable, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_2, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_3, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_4, int32 Temp_int_Variable, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_5, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_6, int32 Temp_int_Variable_1, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_7, bool Temp_bool_Variable_1, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_8, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_9, class US6UI_CustomNavigationGroup* K2Node_ComponentBoundEvent_NavGroup_1, int32 Temp_int_Variable_2, int32 CallFunc_GetNumItems_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 K2Node_Select_Default, class US6UI_CustomNavigationGroup* K2Node_ComponentBoundEvent_NavGroup, TArray<class UWidget*>& K2Node_MakeArray_Array, bool CallFunc_DisplayParty_bDidFocusOnExistingPartyMember, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2);
	void HandleOnMemberAdded(struct FVAL_PartyMember& Member);
	void HandleOnMemberKicked(struct FVAL_PartyMember& Member);
	void HandleOnMemberPromoted(struct FVAL_PartyMember& Member);
	void HandleOnMemberRemoved(struct FVAL_PartyMember& Member);
	void HandleOnPartyStateChanged(EVAL_PartyManagerState State);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnInitialized();
	void OnPartyCreated__DelegateSignature();
	void TryFocusingOnFirstPartyMember();
	void Update_Member_List(bool* bSuccess, const TArray<class UListItem_SocialConnection_C*>& ListItemsSocialConnection, int32 Temp_int_Array_Index_Variable, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, int32 CallFunc_GetMaximumPartySize_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const TSet<struct FVAL_PartyMember>& CallFunc_GetAllPartyMembers_ReturnValue, TArray<struct FVAL_PartyMember>& CallFunc_Set_ToArray_Result, int32 CallFunc_Add_IntInt_ReturnValue, const struct FVAL_PartyMember& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, class UListItem_SocialConnection_C* CallFunc_SpawnObject_ReturnValue, int32 CallFunc_Array_Add_ReturnValue);
	void UpdateFromPartyState(bool CallFunc_DisplayParty_bDidFocusOnExistingPartyMember, bool CallFunc_Update_Member_List_bSuccess, int32 CallFunc_AkEventGlobal_ReturnValue, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, EVAL_PartyManagerState CallFunc_GetCurrentPartyState_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, EVAL_PartyManagerState Temp_byte_Variable, class UWidget* K2Node_Select_Default);
	void UpdateMemberText(int32 Num_members, int32 Total_members, int64 CallFunc_Conv_IntToInt64_ReturnValue, int64 CallFunc_Conv_IntToInt64_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SocialPanel_Party_C">();
	}
	static class UWBP_SocialPanel_Party_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SocialPanel_Party_C>();
	}
};
static_assert(alignof(UWBP_SocialPanel_Party_C) == 0x000008, "Wrong alignment on UWBP_SocialPanel_Party_C");
static_assert(sizeof(UWBP_SocialPanel_Party_C) == 0x000568, "Wrong size on UWBP_SocialPanel_Party_C");
static_assert(offsetof(UWBP_SocialPanel_Party_C, UberGraphFrame) == 0x000510, "Member 'UWBP_SocialPanel_Party_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SocialPanel_Party_C, Button_Leave) == 0x000518, "Member 'UWBP_SocialPanel_Party_C::Button_Leave' has a wrong offset!");
static_assert(offsetof(UWBP_SocialPanel_Party_C, CustomNavigationGroup_Party) == 0x000520, "Member 'UWBP_SocialPanel_Party_C::CustomNavigationGroup_Party' has a wrong offset!");
static_assert(offsetof(UWBP_SocialPanel_Party_C, ListView_PartyMembers) == 0x000528, "Member 'UWBP_SocialPanel_Party_C::ListView_PartyMembers' has a wrong offset!");
static_assert(offsetof(UWBP_SocialPanel_Party_C, TextBlock_NumMembers) == 0x000530, "Member 'UWBP_SocialPanel_Party_C::TextBlock_NumMembers' has a wrong offset!");
static_assert(offsetof(UWBP_SocialPanel_Party_C, VBox_InParty) == 0x000538, "Member 'UWBP_SocialPanel_Party_C::VBox_InParty' has a wrong offset!");
static_assert(offsetof(UWBP_SocialPanel_Party_C, VBox_NoParty) == 0x000540, "Member 'UWBP_SocialPanel_Party_C::VBox_NoParty' has a wrong offset!");
static_assert(offsetof(UWBP_SocialPanel_Party_C, WidgetSwitcher_Party) == 0x000548, "Member 'UWBP_SocialPanel_Party_C::WidgetSwitcher_Party' has a wrong offset!");
static_assert(offsetof(UWBP_SocialPanel_Party_C, OnPartyCreated) == 0x000550, "Member 'UWBP_SocialPanel_Party_C::OnPartyCreated' has a wrong offset!");
static_assert(offsetof(UWBP_SocialPanel_Party_C, NumRetriesForDisplayParty) == 0x000560, "Member 'UWBP_SocialPanel_Party_C::NumRetriesForDisplayParty' has a wrong offset!");

}

