#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerCharacterRow_CM

#include "Basic.hpp"

#include "OnlineSubsystemValeria_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "F_CommonUIButtonPrompt_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.BndEvt__WBP_PlayerCharacterRow_CM_WBP_Social_OpenContextMenuButton_CM_K2Node_ComponentBoundEvent_2_OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_BndEvt__WBP_PlayerCharacterRow_CM_WBP_Social_OpenContextMenuButton_CM_K2Node_ComponentBoundEvent_2_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_BndEvt__WBP_PlayerCharacterRow_CM_WBP_Social_OpenContextMenuButton_CM_K2Node_ComponentBoundEvent_2_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_BndEvt__WBP_PlayerCharacterRow_CM_WBP_Social_OpenContextMenuButton_CM_K2Node_ComponentBoundEvent_2_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_BndEvt__WBP_PlayerCharacterRow_CM_WBP_Social_OpenContextMenuButton_CM_K2Node_ComponentBoundEvent_2_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_PlayerCharacterRow_CM_C_BndEvt__WBP_PlayerCharacterRow_CM_WBP_Social_OpenContextMenuButton_CM_K2Node_ComponentBoundEvent_2_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_BndEvt__WBP_PlayerCharacterRow_CM_WBP_Social_OpenContextMenuButton_CM_K2Node_ComponentBoundEvent_2_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_BndEvt__WBP_PlayerCharacterRow_CM_WBP_Social_OpenContextMenuButton_CM_K2Node_ComponentBoundEvent_2_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_BndEvt__WBP_PlayerCharacterRow_CM_WBP_Social_OpenContextMenuButton_CM_K2Node_ComponentBoundEvent_2_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_PlayerCharacterRow_CM_C_BndEvt__WBP_PlayerCharacterRow_CM_WBP_Social_OpenContextMenuButton_CM_K2Node_ComponentBoundEvent_2_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.DisplayMuted
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_DisplayMuted final
{
public:
	bool                                          Muted;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_DisplayMuted) == 0x000001, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_DisplayMuted");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_DisplayMuted) == 0x000001, "Wrong size on WBP_PlayerCharacterRow_CM_C_DisplayMuted");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_DisplayMuted, Muted) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_DisplayMuted::Muted' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.DoCustomNavigation
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5793[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_DoCustomNavigation) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_DoCustomNavigation");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_DoCustomNavigation) == 0x000018, "Wrong size on WBP_PlayerCharacterRow_CM_C_DoCustomNavigation");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_DoCustomNavigation, Param_Navigation) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_DoCustomNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_DoCustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_PlayerCharacterRow_CM_C_DoCustomNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_DoCustomNavigation, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_PlayerCharacterRow_CM_C_DoCustomNavigation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.ExecuteUbergraph_WBP_PlayerCharacterRow_CM
// 0x0190 (0x0190 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5794[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names;                          // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable;                              // 0x0028(0x0010)(ReferenceParm)
	struct FGuid                                  Temp_struct_Variable_1;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0070(0x0018)()
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CharacterName, bool bMuted)> K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CharacterName, bool bMuted)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5795[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot;          // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5796[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x00DC(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_3;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5797[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5798[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5799[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_ComponentBoundEvent_uiprompt;               // 0x0140(0x0010)(ReferenceParm)
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579A[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579B[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_5;    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM) == 0x000190, "Wrong size on WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, EntryPoint) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_CustomEvent_AccountId) == 0x000004, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_CustomEvent_Names) == 0x000018, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_CustomEvent_Names' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, Temp_struct_Variable) == 0x000028, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, Temp_struct_Variable_1) == 0x000038, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000048, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000050, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000070, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000088, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x000090, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A8, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B8, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_Event_IsDesignTime) == 0x0000C8, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_DynamicCast_AsHorizontal_Box_Slot) == 0x0000D0, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_DynamicCast_AsHorizontal_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_CustomEvent_AccountId_1) == 0x0000DC, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000EC, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, Temp_byte_Variable) == 0x0000FC, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, CallFunc_GetAccountId_ReturnValue) == 0x000100, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_4) == 0x000110, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, CallFunc_GetCharacterNamesByAccountId_ReturnValue) == 0x000118, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::CallFunc_GetCharacterNamesByAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x000124, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, Temp_byte_Variable_1) == 0x000134, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_ComponentBoundEvent_Widget) == 0x000138, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_ComponentBoundEvent_uiprompt) == 0x000140, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_ComponentBoundEvent_uiprompt' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_CreateDelegate_OutputDelegate_5) == 0x000150, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, Temp_bool_Variable) == 0x000160, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_CreateDelegate_OutputDelegate_6) == 0x000164, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_Select_Default) == 0x000174, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, K2Node_CreateDelegate_OutputDelegate_7) == 0x000178, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_5) == 0x000188, "Member 'WBP_PlayerCharacterRow_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_5' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.HandleFriendsManagerRelationshipsChanged
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_HandleFriendsManagerRelationshipsChanged final
{
public:
	TSet<struct FUniqueNetIdRepl>                 PlayerCharacterIds;                                // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_HandleFriendsManagerRelationshipsChanged) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_HandleFriendsManagerRelationshipsChanged");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_HandleFriendsManagerRelationshipsChanged) == 0x000050, "Wrong size on WBP_PlayerCharacterRow_CM_C_HandleFriendsManagerRelationshipsChanged");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_HandleFriendsManagerRelationshipsChanged, PlayerCharacterIds) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_HandleFriendsManagerRelationshipsChanged::PlayerCharacterIds' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.HandleOnCharacterMuted
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted final
{
public:
	class FName                                   Param_CharacterName;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMuted;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579C[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted) == 0x000004, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted) == 0x000018, "Wrong size on WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted, Param_CharacterName) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted::Param_CharacterName' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted, bMuted) == 0x000008, "Member 'WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted::bMuted' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted, CallFunc_Conv_StringToName_ReturnValue) == 0x00000C, "Member 'WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000014, "Member 'WBP_PlayerCharacterRow_CM_C_HandleOnCharacterMuted::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.HandlePresenceChange
// 0x0168 (0x0168 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_HandlePresenceChange final
{
public:
	struct FPresence                              OldPresence;                                       // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPresence                              NewPresence;                                       // 0x00B0(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_HandlePresenceChange) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_HandlePresenceChange");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_HandlePresenceChange) == 0x000168, "Wrong size on WBP_PlayerCharacterRow_CM_C_HandlePresenceChange");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_HandlePresenceChange, OldPresence) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_HandlePresenceChange::OldPresence' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_HandlePresenceChange, NewPresence) == 0x0000B0, "Member 'WBP_PlayerCharacterRow_CM_C_HandlePresenceChange::NewPresence' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_HandlePresenceChange, CallFunc_EqualEqual_ReturnValue) == 0x000160, "Member 'WBP_PlayerCharacterRow_CM_C_HandlePresenceChange::CallFunc_EqualEqual_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.OnCharacterProfileImageClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_OnCharacterProfileImageClicked__DelegateSignature final
{
public:
	class UWBP_PlayerCharacterProfileImage_CM_C*  CharacterProfileImageWidget;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_OnCharacterProfileImageClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_OnCharacterProfileImageClicked__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_OnCharacterProfileImageClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_CM_C_OnCharacterProfileImageClicked__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_OnCharacterProfileImageClicked__DelegateSignature, CharacterProfileImageWidget) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_OnCharacterProfileImageClicked__DelegateSignature::CharacterProfileImageWidget' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.OnFailure_0E85F836453B6664C70D7CA0FCCF570A
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_OnFailure_0E85F836453B6664C70D7CA0FCCF570A final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_OnFailure_0E85F836453B6664C70D7CA0FCCF570A) == 0x000004, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_OnFailure_0E85F836453B6664C70D7CA0FCCF570A");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_OnFailure_0E85F836453B6664C70D7CA0FCCF570A) == 0x000010, "Wrong size on WBP_PlayerCharacterRow_CM_C_OnFailure_0E85F836453B6664C70D7CA0FCCF570A");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_OnFailure_0E85F836453B6664C70D7CA0FCCF570A, AccountId) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_OnFailure_0E85F836453B6664C70D7CA0FCCF570A::AccountId' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_PlayerCharacterRow_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_PlayerCharacterRow_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_PlayerCharacterRow_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_PlayerCharacterRow_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_PlayerCharacterRow_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_PlayerCharacterRow_CM_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.OnSuccess_0E85F836453B6664C70D7CA0FCCF570A
// 0x0020 (0x0020 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_OnSuccess_0E85F836453B6664C70D7CA0FCCF570A final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Names;                                             // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_OnSuccess_0E85F836453B6664C70D7CA0FCCF570A) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_OnSuccess_0E85F836453B6664C70D7CA0FCCF570A");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_OnSuccess_0E85F836453B6664C70D7CA0FCCF570A) == 0x000020, "Wrong size on WBP_PlayerCharacterRow_CM_C_OnSuccess_0E85F836453B6664C70D7CA0FCCF570A");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_OnSuccess_0E85F836453B6664C70D7CA0FCCF570A, AccountId) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_OnSuccess_0E85F836453B6664C70D7CA0FCCF570A::AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_OnSuccess_0E85F836453B6664C70D7CA0FCCF570A, Names) == 0x000010, "Member 'WBP_PlayerCharacterRow_CM_C_OnSuccess_0E85F836453B6664C70D7CA0FCCF570A::Names' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_PreConstruct");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_PlayerCharacterRow_CM_C_PreConstruct");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.SetUser
// 0x0038 (0x0038 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_SetUser final
{
public:
	struct FUniqueNetIdRepl                       Param_UserId;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Param_DebugRandomizePortrait;                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_SetUser) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_SetUser");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_SetUser) == 0x000038, "Wrong size on WBP_PlayerCharacterRow_CM_C_SetUser");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_SetUser, Param_UserId) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_SetUser::Param_UserId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_SetUser, Param_DebugRandomizePortrait) == 0x000030, "Member 'WBP_PlayerCharacterRow_CM_C_SetUser::Param_DebugRandomizePortrait' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.UpdateMuted
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_UpdateMuted final
{
public:
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUserMuted_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_UpdateMuted) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_UpdateMuted");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_UpdateMuted) == 0x000018, "Wrong size on WBP_PlayerCharacterRow_CM_C_UpdateMuted");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_UpdateMuted, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_UpdateMuted::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_UpdateMuted, CallFunc_Conv_StringToName_ReturnValue) == 0x000008, "Member 'WBP_PlayerCharacterRow_CM_C_UpdateMuted::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_UpdateMuted, CallFunc_IsUserMuted_ReturnValue) == 0x000010, "Member 'WBP_PlayerCharacterRow_CM_C_UpdateMuted::CallFunc_IsUserMuted_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C.UpdatePresence
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_PlayerCharacterRow_CM_C_UpdatePresence final
{
public:
	struct FPresence                              CachedPresence;                                    // 0x0000(0x00B0)(Edit, BlueprintVisible)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579D[0x2];                                     // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579E[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E8(0x0018)()
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579F[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue;         // 0x0118(0x00B0)()
};
static_assert(alignof(WBP_PlayerCharacterRow_CM_C_UpdatePresence) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_CM_C_UpdatePresence");
static_assert(sizeof(WBP_PlayerCharacterRow_CM_C_UpdatePresence) == 0x0001C8, "Wrong size on WBP_PlayerCharacterRow_CM_C_UpdatePresence");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_UpdatePresence, CachedPresence) == 0x000000, "Member 'WBP_PlayerCharacterRow_CM_C_UpdatePresence::CachedPresence' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_UpdatePresence, Temp_struct_Variable) == 0x0000B0, "Member 'WBP_PlayerCharacterRow_CM_C_UpdatePresence::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_CM_C_UpdatePresence, Temp_bool_Variable) == 0x0000C0, "Member 'WBP_PlayerCharacterRow_CM_C_UpdatePresence::Temp_bool_Variable' has a wrong offset!");
