#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EmoteButton_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EmoteButton_CM.WBP_EmoteButton_CM_C
// 0x0020 (0x02F8 - 0x02D8)
class UWBP_EmoteButton_CM_C final : public UVALUI_EmoteButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_CM_C*              Button_CM;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_EmoteIcon;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputAction*                           In_Input_Action;                                   // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_EmoteButton_CM(int32 EntryPoint, class UCommonButtonBase* K2Node_CustomEvent_Button, TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate);
	void HandleTooltip();
	void OnInternalButtonClickedCM(class UCommonButtonBase* Button);
	void SetEmoteIcon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EmoteButton_CM_C">();
	}
	static class UWBP_EmoteButton_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EmoteButton_CM_C>();
	}
};
static_assert(alignof(UWBP_EmoteButton_CM_C) == 0x000008, "Wrong alignment on UWBP_EmoteButton_CM_C");
static_assert(sizeof(UWBP_EmoteButton_CM_C) == 0x0002F8, "Wrong size on UWBP_EmoteButton_CM_C");
static_assert(offsetof(UWBP_EmoteButton_CM_C, UberGraphFrame) == 0x0002D8, "Member 'UWBP_EmoteButton_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EmoteButton_CM_C, Button_CM) == 0x0002E0, "Member 'UWBP_EmoteButton_CM_C::Button_CM' has a wrong offset!");
static_assert(offsetof(UWBP_EmoteButton_CM_C, Image_EmoteIcon) == 0x0002E8, "Member 'UWBP_EmoteButton_CM_C::Image_EmoteIcon' has a wrong offset!");
static_assert(offsetof(UWBP_EmoteButton_CM_C, In_Input_Action) == 0x0002F0, "Member 'UWBP_EmoteButton_CM_C::In_Input_Action' has a wrong offset!");

}

