#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListEntry_Social_Block_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "F_CommonUIButtonPrompt_structs.hpp"
#include "Palia_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ListEntry_Social_Block_CM.WBP_ListEntry_Social_Block_CM_C.BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_ListEntry_Social_Block_CM.WBP_ListEntry_Social_Block_CM_C.BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_CustomNavigationGroup_Unblock_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_ListEntry_Social_Block_CM.WBP_ListEntry_Social_Block_CM_C.BndEvt__WBP_ListEntry_Social_Block_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_3_OnCharacterProfileImageClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_3_OnCharacterProfileImageClicked__DelegateSignature final
{
public:
	class UWBP_PlayerCharacterProfileImage_CM_C*  CharacterProfileImageWidget;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_3_OnCharacterProfileImageClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_3_OnCharacterProfileImageClicked__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_3_OnCharacterProfileImageClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_3_OnCharacterProfileImageClicked__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_3_OnCharacterProfileImageClicked__DelegateSignature, CharacterProfileImageWidget) == 0x000000, "Member 'WBP_ListEntry_Social_Block_CM_C_BndEvt__WBP_ListEntry_Social_Block_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_3_OnCharacterProfileImageClicked__DelegateSignature::CharacterProfileImageWidget' has a wrong offset!");

// Function WBP_ListEntry_Social_Block_CM.WBP_ListEntry_Social_Block_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_Social_Block_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Social_Block_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_Social_Block_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_ListEntry_Social_Block_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_ListEntry_Social_Block_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_ListEntry_Social_Block_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_ListEntry_Social_Block_CM.WBP_ListEntry_Social_Block_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_Social_Block_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Social_Block_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_Social_Block_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_ListEntry_Social_Block_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_ListEntry_Social_Block_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ListEntry_Social_Block_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ListEntry_Social_Block_CM.WBP_ListEntry_Social_Block_CM_C.ExecuteUbergraph_WBP_ListEntry_Social_Block_CM
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1274[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1275[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListItem_SocialConnection_C*           K2Node_DynamicCast_AsList_Item_Social_Connection;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1276[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PlayerCharacterProfileImage_CM_C*  K2Node_ComponentBoundEvent_CharacterProfileImageWidget; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt;          // 0x0040(0x0040)(HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt_1;        // 0x0080(0x0040)(HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_MakeArray_Array_1;                          // 0x00C8(0x0010)(ReferenceParm)
	EVAL_SocialBlockError                         CallFunc_RequestBlockUser_ReturnValue;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1277[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup_1;             // 0x00E0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup;               // 0x00E8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM) == 0x000008, "Wrong alignment on WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM");
static_assert(sizeof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM) == 0x0000F0, "Wrong size on WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, EntryPoint) == 0x000000, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_Event_bIsExpanded) == 0x000018, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_Event_bIsSelected) == 0x000019, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_Event_ListItemObject) == 0x000020, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_DynamicCast_AsList_Item_Social_Connection) == 0x000028, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_DynamicCast_AsList_Item_Social_Connection' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_ComponentBoundEvent_CharacterProfileImageWidget) == 0x000038, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_ComponentBoundEvent_CharacterProfileImageWidget' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_MakeStruct_F_CommonUIButtonPrompt) == 0x000040, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_MakeStruct_F_CommonUIButtonPrompt' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_MakeStruct_F_CommonUIButtonPrompt_1) == 0x000080, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_MakeStruct_F_CommonUIButtonPrompt_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000C0, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_MakeArray_Array_1) == 0x0000C8, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, CallFunc_RequestBlockUser_ReturnValue) == 0x0000D8, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::CallFunc_RequestBlockUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_ComponentBoundEvent_NavGroup_1) == 0x0000E0, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_ComponentBoundEvent_NavGroup_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM, K2Node_ComponentBoundEvent_NavGroup) == 0x0000E8, "Member 'WBP_ListEntry_Social_Block_CM_C_ExecuteUbergraph_WBP_ListEntry_Social_Block_CM::K2Node_ComponentBoundEvent_NavGroup' has a wrong offset!");

// Function WBP_ListEntry_Social_Block_CM.WBP_ListEntry_Social_Block_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_ListEntry_Social_Block_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_ListEntry_Social_Block_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_ListEntry_Social_Block_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_ListEntry_Social_Block_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_ListEntry_Social_Block_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_ListEntry_Social_Block_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_ListEntry_Social_Block_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_ListEntry_Social_Block_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_ListEntry_Social_Block_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_Social_Block_CM.WBP_ListEntry_Social_Block_CM_C.OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_ListEntry_Social_Block_CM_C_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_ListEntry_Social_Block_CM_C*       Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Social_Block_CM_C_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_Social_Block_CM_C_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_Social_Block_CM_C_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_ListEntry_Social_Block_CM_C_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_OnInspectPlayerCharacter__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ListEntry_Social_Block_CM_C_OnInspectPlayerCharacter__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_ListEntry_Social_Block_CM_C_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_ListEntry_Social_Block_CM.WBP_ListEntry_Social_Block_CM_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_Social_Block_CM_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Social_Block_CM_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ListEntry_Social_Block_CM_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ListEntry_Social_Block_CM_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ListEntry_Social_Block_CM_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ListEntry_Social_Block_CM_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ListEntry_Social_Block_CM.WBP_ListEntry_Social_Block_CM_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ListEntry_Social_Block_CM_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ListEntry_Social_Block_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_Social_Block_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_Social_Block_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_ListEntry_Social_Block_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ListEntry_Social_Block_CM_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_ListEntry_Social_Block_CM_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_ListEntry_Social_Block_CM.WBP_ListEntry_Social_Block_CM_C.OnRemoveFriendClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_ListEntry_Social_Block_CM_C_OnRemoveFriendClicked__DelegateSignature final
{
public:
	class UWBP_ListEntry_Social_Block_CM_C*       Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Social_Block_CM_C_OnRemoveFriendClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_Social_Block_CM_C_OnRemoveFriendClicked__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_Social_Block_CM_C_OnRemoveFriendClicked__DelegateSignature) == 0x000038, "Wrong size on WBP_ListEntry_Social_Block_CM_C_OnRemoveFriendClicked__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_OnRemoveFriendClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ListEntry_Social_Block_CM_C_OnRemoveFriendClicked__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Social_Block_CM_C_OnRemoveFriendClicked__DelegateSignature, UserId) == 0x000008, "Member 'WBP_ListEntry_Social_Block_CM_C_OnRemoveFriendClicked__DelegateSignature::UserId' has a wrong offset!");

}

