#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PregameHUD_PF

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PregameHUD_PF.WBP_PregameHUD_PF_C
// 0x0048 (0x05A0 - 0x0558)
class UWBP_PregameHUD_PF_C final : public UVALUI_StateUserWidget_PregameHUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_CharacterCreationScreen_CM_C*      CharacterCreationScreen;                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               GeneralLoginBackground;                            // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LoadingScreen;                                     // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterSelectorHUD_CM_C*         LobbyScreen;                                       // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Login_PF_C*                        LoginMenu;                                         // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_MainState;                                // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PregameUIManager_C*                WBP_PregameUIManagerRef;                           // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void DisplayCharacterCreationMatchmaking();
	void DisplayMatchmakingQueueActive(bool bActive);
	void DisplayMatchmakingQueueNumber(int32 Number);
	void ExecuteUbergraph_WBP_PregameHUD_PF(int32 EntryPoint, const struct FS6UI_InputMode& CallFunc_CreateInputMode_UIOnly_ReturnValue, EVALUI_LoginState K2Node_Event_NewState_2, class US6UI_StateViewModel* CallFunc_GetViewModel_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool Temp_bool_IsClosed_Variable, bool K2Node_Event_bActive, EVALUI_CharacterCreationState K2Node_Event_NewState_1, bool K2Node_SwitchEnum_CmpSuccess_1, EVALUI_LobbyState K2Node_Event_NewState, bool Temp_bool_Has_Been_Initd_Variable, class UVALUI_PregameUIManager* K2Node_Event_Owner, int32 K2Node_Event_Number, class UWBP_PregameUIManager_C* K2Node_DynamicCast_AsWBP_Pregame_UIManager, bool K2Node_DynamicCast_bSuccess);
	class UVALUI_CharacterCreationScreenBase* GetCharacterCreationScreen();
	class UVALUI_LobbyScreenUserWidget* GetLobbyScreen();
	void Goto_Character_Creation_Screen(class AValeriaCharacter* CallFunc_GetCharacter_ReturnValue, class AActor* CallFunc_GetDefaultCameraActor_ReturnValue, class ACameraActor* K2Node_DynamicCast_AsCamera_Actor, bool K2Node_DynamicCast_bSuccess, class FName Temp_name_Variable, class FName Temp_name_Variable_1, class AActor* CallFunc_GetCameraActorWithTag_ReturnValue, class ACameraActor* K2Node_DynamicCast_AsCamera_Actor_1, bool K2Node_DynamicCast_bSuccess_1, class AActor* CallFunc_GetCameraActorWithTag_ReturnValue_1, class ACameraActor* K2Node_DynamicCast_AsCamera_Actor_2, bool K2Node_DynamicCast_bSuccess_2);
	void GotoCharacterLobby(const struct FVALDTOS_MetaCharacterFormat& CallFunc_GetCachedCharacterAtIndex_Checked_OutCharacter, TArray<struct FVALDTOS_MetaCharacterFormat>& K2Node_MakeArray_Array);
	void HandleOnCharacterCreationStateChanged(EVALUI_CharacterCreationState NewState);
	void HandleOnLobbyStateChanged(EVALUI_LobbyState NewState);
	void HandleOnLoginStateChanged(EVALUI_LoginState NewState);
	void OnInitialized();
	void PlayFadeInAnimation(class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void SetOwner(class UVALUI_PregameUIManager* Owner);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PregameHUD_PF_C">();
	}
	static class UWBP_PregameHUD_PF_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PregameHUD_PF_C>();
	}
};
static_assert(alignof(UWBP_PregameHUD_PF_C) == 0x000008, "Wrong alignment on UWBP_PregameHUD_PF_C");
static_assert(sizeof(UWBP_PregameHUD_PF_C) == 0x0005A0, "Wrong size on UWBP_PregameHUD_PF_C");
static_assert(offsetof(UWBP_PregameHUD_PF_C, UberGraphFrame) == 0x000558, "Member 'UWBP_PregameHUD_PF_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PregameHUD_PF_C, FadeIn) == 0x000560, "Member 'UWBP_PregameHUD_PF_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_PregameHUD_PF_C, CharacterCreationScreen) == 0x000568, "Member 'UWBP_PregameHUD_PF_C::CharacterCreationScreen' has a wrong offset!");
static_assert(offsetof(UWBP_PregameHUD_PF_C, GeneralLoginBackground) == 0x000570, "Member 'UWBP_PregameHUD_PF_C::GeneralLoginBackground' has a wrong offset!");
static_assert(offsetof(UWBP_PregameHUD_PF_C, LoadingScreen) == 0x000578, "Member 'UWBP_PregameHUD_PF_C::LoadingScreen' has a wrong offset!");
static_assert(offsetof(UWBP_PregameHUD_PF_C, LobbyScreen) == 0x000580, "Member 'UWBP_PregameHUD_PF_C::LobbyScreen' has a wrong offset!");
static_assert(offsetof(UWBP_PregameHUD_PF_C, LoginMenu) == 0x000588, "Member 'UWBP_PregameHUD_PF_C::LoginMenu' has a wrong offset!");
static_assert(offsetof(UWBP_PregameHUD_PF_C, Switcher_MainState) == 0x000590, "Member 'UWBP_PregameHUD_PF_C::Switcher_MainState' has a wrong offset!");
static_assert(offsetof(UWBP_PregameHUD_PF_C, WBP_PregameUIManagerRef) == 0x000598, "Member 'UWBP_PregameHUD_PF_C::WBP_PregameUIManagerRef' has a wrong offset!");

}

