#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialConnectionsCategoryList_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C
// 0x0098 (0x0380 - 0x02E8)
class UWBP_SocialConnectionsCategoryList_CM_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class US6UI_CustomNavigationGroup*            CustomNavigationGroup;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ListView_Styled*                 ListView_Connections;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Root;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Empty;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ExpandableArea_CM_C*               WBP_ExpandableArea_CM;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnInspectPlayerCharacter;                          // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   CategoryDisplayName;                               // 0x0328(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   CategoryEmptyText;                                 // 0x0340(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          PreventSoundSpamOnStart;                           // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E3[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                ListViewEntryWidgetClass;                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMarkFocusUI;                                     // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIgnoreStartExpanded;                              // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_0_OnCustomNavigationGroupInitialized__DelegateSignature(class US6UI_CustomNavigationGroup* NavGroup);
	void BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_3_OnNavigated__DelegateSignature(class US6UI_CustomNavigationGroup* NavGroup);
	void BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_2_OnAreaExpanded__DelegateSignature(class UWBP_ExpandableArea_CM_C* ExpandableAreaWidget, bool Expanded);
	void BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_5_OnExpandableAreaFocused__DelegateSignature(class UWBP_ExpandableArea_CM_C* Expandable_Area);
	void BndEvt__WBP_SocialConnectionsCategoryList_VALUI_ListView_Styled_164_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	class UWidget* DoCustomNavigation(EUINavigation Param_Navigation, bool K2Node_SwitchEnum_CmpSuccess);
	class UWidget* DoCustomNavigation_0(EUINavigation Param_Navigation, bool K2Node_SwitchEnum_CmpSuccess, TArray<class UUserWidget*>& CallFunc_GetDisplayedEntryWidgets_ReturnValue, class UUserWidget* CallFunc_Array_Get_Item);
	void ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM(int32 EntryPoint, bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, class UUserWidget* K2Node_ComponentBoundEvent_Widget, class UWBP_ListEntry_SocialConnection_CM_C* K2Node_DynamicCast_AsWBP_List_Entry_Social_Connection_CM, bool K2Node_DynamicCast_bSuccess, class UWBP_ExpandableArea_CM_C* K2Node_ComponentBoundEvent_ExpandableAreaWidget, bool K2Node_ComponentBoundEvent_Expanded, class US6UI_CustomNavigationGroup* K2Node_ComponentBoundEvent_NavGroup_1, TDelegate<void(class UWidget* Widget, TArray<struct FF_CommonUIButtonPrompt>& UIPrompt)> K2Node_CreateDelegate_OutputDelegate, TArray<class UWidget*>& K2Node_MakeArray_Array, class UWBP_ExpandableArea_CM_C* K2Node_ComponentBoundEvent_Expandable_Area, class UAkAudioEvent* Temp_object_Variable, bool CallFunc_IsVisible_ReturnValue, class UAkAudioEvent* Temp_object_Variable_1, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt, TDelegate<void(class UWBP_ListEntry_SocialConnection_CM_C* Widget, const struct FUniqueNetIdRepl& UserId)> K2Node_CreateDelegate_OutputDelegate_1, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt_1, TArray<struct FF_CommonUIButtonPrompt>& K2Node_MakeArray_Array_1, bool Temp_bool_Variable_1, class UAkAudioEvent* K2Node_Select_Default, int32 CallFunc_AkEventGlobal_ReturnValue, bool K2Node_Event_IsDesignTime, class US6UI_CustomNavigationGroup* K2Node_ComponentBoundEvent_NavGroup, int32 CallFunc_GetNumItems_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 K2Node_Select_Default_1);
	void HandleInspectPlayerCharacter(class UWBP_ListEntry_SocialConnection_CM_C* Widget, const struct FUniqueNetIdRepl& UserId);
	void HandleOnMarkFocusUI(class UWidget* Widget, TArray<struct FF_CommonUIButtonPrompt>& UIPrompt);
	bool HandleSortSocialConnection(class UObject* A, class UObject* B, const struct FPresence& B_Presence, const struct FPresence& A_Presence, const struct FUniqueNetIdRepl& B_UserId, const struct FUniqueNetIdRepl& A_UserId, class UListItem_SocialConnection_C* K2Node_DynamicCast_AsList_Item_Social_Connection, bool K2Node_DynamicCast_bSuccess, class UListItem_SocialConnection_C* K2Node_DynamicCast_AsList_Item_Social_Connection_1, bool K2Node_DynamicCast_bSuccess_1, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, const struct FPresence& CallFunc_GetPresenceForUserId_ReturnValue, const struct FPresence& CallFunc_GetPresenceForUserId_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue, int32 CallFunc_CompareText_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_NotEqual_TextText_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInspectPlayerCharacter__DelegateSignature(class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget, const struct FUniqueNetIdRepl& UserId);
	void OnMarkFocusUI__DelegateSignature(class UWidget* Widget, TArray<struct FF_CommonUIButtonPrompt>& UIPrompt);
	void PreConstruct(bool IsDesignTime);
	void SetHeaderToolTipText(class FText& InToolTipText);
	void SetListItems(TArray<class UListItem_SocialConnection_C*>& Connections, int32 MaximumSize, const TArray<class UListItem_SocialConnection_C*>& ItemsToAdd, const TArray<class UListItem_SocialConnection_C*>& ItemsToRemove, const TMap<struct FUniqueNetIdRepl, class UListItem_SocialConnection_C*>& NewListItems, const TMap<struct FUniqueNetIdRepl, class UListItem_SocialConnection_C*>& OldListItems, const TArray<class UListItem_SocialConnection_C*>& InConnections, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_3, TArray<class UObject*>& CallFunc_GetListItems_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Array_Index_Variable_2, class UListItem_SocialConnection_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable_3, bool CallFunc_Less_IntInt_ReturnValue, TArray<struct FUniqueNetIdRepl>& CallFunc_Map_Keys_Keys, const struct FUniqueNetIdRepl& CallFunc_Array_Get_Item_1, class UListItem_SocialConnection_C* CallFunc_Array_Get_Item_2, class UListItem_SocialConnection_C* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Map_Contains_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, TArray<class UObject*>& CallFunc_GetListItems_ReturnValue_1, class UObject* CallFunc_Array_Get_Item_3, int32 CallFunc_Array_Length_ReturnValue_3, class UListItem_SocialConnection_C* K2Node_DynamicCast_AsList_Item_Social_Connection, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue_3, int32 CallFunc_Array_Add_ReturnValue, TArray<class UObject*>& CallFunc_GetListItems_ReturnValue_2, bool CallFunc_Map_Contains_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_4, bool CallFunc_Greater_IntInt_ReturnValue, TDelegate<void(class UObject* A, class UObject* B)> K2Node_CreateDelegate_OutputDelegate, TArray<class UObject*>& CallFunc_SortObjectArray_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SocialConnectionsCategoryList_CM_C">();
	}
	static class UWBP_SocialConnectionsCategoryList_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SocialConnectionsCategoryList_CM_C>();
	}
};
static_assert(alignof(UWBP_SocialConnectionsCategoryList_CM_C) == 0x000008, "Wrong alignment on UWBP_SocialConnectionsCategoryList_CM_C");
static_assert(sizeof(UWBP_SocialConnectionsCategoryList_CM_C) == 0x000380, "Wrong size on UWBP_SocialConnectionsCategoryList_CM_C");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, CustomNavigationGroup) == 0x0002F0, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::CustomNavigationGroup' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, ListView_Connections) == 0x0002F8, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::ListView_Connections' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, Switcher_Root) == 0x000300, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::Switcher_Root' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, TextBlock_Empty) == 0x000308, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::TextBlock_Empty' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, WBP_ExpandableArea_CM) == 0x000310, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::WBP_ExpandableArea_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, OnInspectPlayerCharacter) == 0x000318, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::OnInspectPlayerCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, CategoryDisplayName) == 0x000328, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::CategoryDisplayName' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, CategoryEmptyText) == 0x000340, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::CategoryEmptyText' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, PreventSoundSpamOnStart) == 0x000358, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::PreventSoundSpamOnStart' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, ListViewEntryWidgetClass) == 0x000360, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::ListViewEntryWidgetClass' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, OnMarkFocusUI) == 0x000368, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::OnMarkFocusUI' has a wrong offset!");
static_assert(offsetof(UWBP_SocialConnectionsCategoryList_CM_C, bIgnoreStartExpanded) == 0x000378, "Member 'UWBP_SocialConnectionsCategoryList_CM_C::bIgnoreStartExpanded' has a wrong offset!");

}

