#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_Button_Primary_01_CM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "F_Button_Primary_Settings_CM_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_BndEvt__WBP_Template_Button_Primary_01_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.Display Game Pad Icon
// 0x0001 (0x0001 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_Display_Game_Pad_Icon final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_Display_Game_Pad_Icon) == 0x000001, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_Display_Game_Pad_Icon");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_Display_Game_Pad_Icon) == 0x000001, "Wrong size on WBP_Template_Button_Primary_01_CM_C_Display_Game_Pad_Icon");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_Display_Game_Pad_Icon, IsShow) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_Display_Game_Pad_Icon::IsShow' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.ExecuteUbergraph_WBP_Template_Button_Primary_01_CM
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C0[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C1[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C2[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_Button_Primary_Settings_CM          K2Node_MakeStruct_F_Button_Primary_Settings_CM;    // 0x0048(0x0050)(HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00C0(0x0008)(NoDestructor)
	bool                                          CallFunc_IsDesktop_ReturnValue;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue_1;                  // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_1;                  // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C3[0x1];                                     // 0x00CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  K2Node_Select_Default;                             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C4[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  K2Node_Select_Default_1;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM) == 0x0000F0, "Wrong size on WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, EntryPoint) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000038, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x00003C, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x000040, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_MakeStruct_F_Button_Primary_Settings_CM) == 0x000048, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_MakeStruct_F_Button_Primary_Settings_CM' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_ComponentBoundEvent_Button_4) == 0x000098, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_ComponentBoundEvent_Button_3) == 0x0000A0, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_ComponentBoundEvent_Button_2) == 0x0000A8, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_ComponentBoundEvent_Button_1) == 0x0000B0, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_ComponentBoundEvent_Button) == 0x0000B8, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_Event_InFocusEvent) == 0x0000C0, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_IsDesktop_ReturnValue) == 0x0000C8, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_IsDesktop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_IsConsole_ReturnValue) == 0x0000C9, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_IsDesktop_ReturnValue_1) == 0x0000CA, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_IsDesktop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_IsConsole_ReturnValue_1) == 0x0000CB, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_IsConsole_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_CustomEvent_bNewInputType) == 0x0000CC, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, Temp_bool_Variable) == 0x0000CD, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000CE, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_Select_Default) == 0x0000D0, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, Temp_bool_Variable_1) == 0x0000D8, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, K2Node_Select_Default_1) == 0x0000E0, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000E8, "Member 'WBP_Template_Button_Primary_01_CM_C_ExecuteUbergraph_WBP_Template_Button_Primary_01_CM::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_OnFocusLost");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_Template_Button_Primary_01_CM_C_OnFocusLost");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Template_Button_Primary_01_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Template_Button_Primary_01_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Template_Button_Primary_01_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Template_Button_Primary_01_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_OnInputMethodChanged");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_Template_Button_Primary_01_CM_C_OnInputMethodChanged");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_PreConstruct");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_Template_Button_Primary_01_CM_C_PreConstruct");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.Set Style
// 0x0008 (0x0008 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_Set_Style final
{
public:
	class UClass*                                 NewStyle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_Set_Style) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_Set_Style");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_Set_Style) == 0x000008, "Wrong size on WBP_Template_Button_Primary_01_CM_C_Set_Style");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_Set_Style, NewStyle) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_Set_Style::NewStyle' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.SetAppearance
// 0x0058 (0x0058 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_SetAppearance final
{
public:
	struct FF_Button_Primary_Settings_CM          ButtonSettings;                                    // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_SetAppearance) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_SetAppearance");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_SetAppearance) == 0x000058, "Wrong size on WBP_Template_Button_Primary_01_CM_C_SetAppearance");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetAppearance, ButtonSettings) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_SetAppearance::ButtonSettings' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetAppearance, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000050, "Member 'WBP_Template_Button_Primary_01_CM_C_SetAppearance::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_SetEnabled final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_SetEnabled) == 0x000001, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_SetEnabled");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_SetEnabled) == 0x000001, "Wrong size on WBP_Template_Button_Primary_01_CM_C_SetEnabled");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetEnabled, Enable) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_SetEnabled::Enable' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.SetGamePadIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_SetGamePadIcon final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_SetGamePadIcon) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_SetGamePadIcon");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_SetGamePadIcon) == 0x000008, "Wrong size on WBP_Template_Button_Primary_01_CM_C_SetGamePadIcon");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetGamePadIcon, Texture) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_SetGamePadIcon::Texture' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.SetInputAction
// 0x0008 (0x0008 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_SetInputAction final
{
public:
	class UInputAction*                           Action;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_SetInputAction) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_SetInputAction");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_SetInputAction) == 0x000008, "Wrong size on WBP_Template_Button_Primary_01_CM_C_SetInputAction");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetInputAction, Action) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_SetInputAction::Action' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.SetPlatformAppearance
// 0x0001 (0x0001 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_SetPlatformAppearance final
{
public:
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_SetPlatformAppearance) == 0x000001, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_SetPlatformAppearance");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_SetPlatformAppearance) == 0x000001, "Wrong size on WBP_Template_Button_Primary_01_CM_C_SetPlatformAppearance");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetPlatformAppearance, CallFunc_IsConsole_ReturnValue) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_SetPlatformAppearance::CallFunc_IsConsole_ReturnValue' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.SetSlotVisibility
// 0x000A (0x000A - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility final
{
public:
	bool                                          Param_LeftSlotVisibility;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_RightSlotVisibility;                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility) == 0x000001, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility) == 0x00000A, "Wrong size on WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility, Param_LeftSlotVisibility) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility::Param_LeftSlotVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility, Param_RightSlotVisibility) == 0x000001, "Member 'WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility::Param_RightSlotVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility, Temp_bool_Variable) == 0x000002, "Member 'WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility, Temp_byte_Variable) == 0x000003, "Member 'WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility, K2Node_Select_Default) == 0x000006, "Member 'WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility, Temp_byte_Variable_2) == 0x000007, "Member 'WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility, Temp_byte_Variable_3) == 0x000008, "Member 'WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility, K2Node_Select_Default_1) == 0x000009, "Member 'WBP_Template_Button_Primary_01_CM_C_SetSlotVisibility::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_SetText final
{
public:
	class FText                                   Param_ButtonText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_SetText) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_SetText");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_SetText) == 0x000018, "Wrong size on WBP_Template_Button_Primary_01_CM_C_SetText");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetText, Param_ButtonText) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_SetText::Param_ButtonText' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.SetTextStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_SetTextStyle final
{
public:
	class UVALUI_TextBlockStyle*                  NewStyle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_SetTextStyle) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_SetTextStyle");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_SetTextStyle) == 0x000008, "Wrong size on WBP_Template_Button_Primary_01_CM_C_SetTextStyle");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_SetTextStyle, NewStyle) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_SetTextStyle::NewStyle' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.UpdateIADescriptionPadding
// 0x0060 (0x0060 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding final
{
public:
	float                                         OffsetLeft;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonStyle*                     CallFunc_GetStyle_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C6[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding) == 0x000008, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding) == 0x000060, "Wrong size on WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding, OffsetLeft) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding::OffsetLeft' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding, K2Node_MakeStruct_Margin) == 0x000020, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000030, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding, CallFunc_GetStyle_ReturnValue) == 0x000038, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding::CallFunc_GetStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding, CallFunc_MakeVector2D_X_ImplicitCast) == 0x000048, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding, K2Node_MakeStruct_Left_ImplicitCast) == 0x000058, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateIADescriptionPadding::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");

// Function WBP_Template_Button_Primary_01_CM.WBP_Template_Button_Primary_01_CM_C.UpdateKeyPrompt
// 0x0024 (0x0024 - 0x0000)
struct WBP_Template_Button_Primary_01_CM_C_UpdateKeyPrompt final
{
public:
	bool                                          bGamepadInput;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C7[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                ConsoleKeyPromptMargin;                            // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                PCKeyPromptMargin;                                 // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Template_Button_Primary_01_CM_C_UpdateKeyPrompt) == 0x000004, "Wrong alignment on WBP_Template_Button_Primary_01_CM_C_UpdateKeyPrompt");
static_assert(sizeof(WBP_Template_Button_Primary_01_CM_C_UpdateKeyPrompt) == 0x000024, "Wrong size on WBP_Template_Button_Primary_01_CM_C_UpdateKeyPrompt");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateKeyPrompt, bGamepadInput) == 0x000000, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateKeyPrompt::bGamepadInput' has a wrong offset!");
static_assert(offsetof(WBP_Template_Button_Primary_01_CM_C_UpdateKeyPrompt, ConsoleKeyPromptMargin) == 0x000004, "Member 'WBP_Template_Button_Primary_01_CM_C_UpdateKeyPrompt::ConsoleKeyPromptMargin' has a wrong offset!");
