#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PopupEULA_CM

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_PopupEULA_CM.WBP_PopupEULA_CM_C.CheckScrollOffset
// 0x0028 (0x0028 - 0x0000)
struct WBP_PopupEULA_CM_C_CheckScrollOffset final
{
public:
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_525D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupEULA_CM_C_CheckScrollOffset) == 0x000008, "Wrong alignment on WBP_PopupEULA_CM_C_CheckScrollOffset");
static_assert(sizeof(WBP_PopupEULA_CM_C_CheckScrollOffset) == 0x000028, "Wrong size on WBP_PopupEULA_CM_C_CheckScrollOffset");
static_assert(offsetof(WBP_PopupEULA_CM_C_CheckScrollOffset, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000000, "Member 'WBP_PopupEULA_CM_C_CheckScrollOffset::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_CheckScrollOffset, CallFunc_GetScrollOffset_ReturnValue) == 0x000004, "Member 'WBP_PopupEULA_CM_C_CheckScrollOffset::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_CheckScrollOffset, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_PopupEULA_CM_C_CheckScrollOffset::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_CheckScrollOffset, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_PopupEULA_CM_C_CheckScrollOffset::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_CheckScrollOffset, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_PopupEULA_CM_C_CheckScrollOffset::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_CheckScrollOffset, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'WBP_PopupEULA_CM_C_CheckScrollOffset::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_PopupEULA_CM.WBP_PopupEULA_CM_C.ExecuteUbergraph_WBP_PopupEULA_CM
// 0x0220 (0x0220 - 0x0000)
struct WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_525E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_525F[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0088(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5260[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5261[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4_0;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5262[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x00FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5263[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5264[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5265[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0178(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x01A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_Event_ActionValue;                          // 0x01D0(0x0020)(NoDestructor)
	float                                         K2Node_Event_ElapsedTime;                          // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_TriggeredTime;                        // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_Event_SourceAction;                         // 0x01F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5266[0x2];                                     // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM) == 0x000008, "Wrong alignment on WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM");
static_assert(sizeof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM) == 0x000220, "Wrong size on WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, EntryPoint) == 0x000000, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000008, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000028, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00002C, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000030, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_object_Variable) == 0x000038, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x000040, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable) == 0x000048, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_1) == 0x000050, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_0) == 0x000058, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_2) == 0x000068, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_bool_Variable) == 0x000070, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000078, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_Abs_ReturnValue) == 0x000080, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000088, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x0000A8, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x0000AC, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0000B0, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x0000B9, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_object_Variable_1) == 0x0000C0, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_3) == 0x0000C8, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_3_0) == 0x0000D0, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_4) == 0x0000D8, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_bool_Variable_1) == 0x0000E0, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_4_0) == 0x0000E8, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000F0, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000F8, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_CreateDelegate_OutputDelegate) == 0x0000FC, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x00010C, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_5) == 0x000110, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_Select_Default) == 0x000120, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000128, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_Abs_ReturnValue_1) == 0x000130, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000138, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00013C, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_GetScrollOffset_ReturnValue) == 0x000140, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000148, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000150, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_FClamp_ReturnValue) == 0x000158, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_6) == 0x000160, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_7) == 0x000168, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_object_Variable_2) == 0x000170, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000178, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000198, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x00019C, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x0001A0, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_7_0) == 0x0001A8, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_7_0' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, Temp_real_Variable_6_0) == 0x0001B0, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::Temp_real_Variable_6_0' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1) == 0x0001B8, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001C0, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_GetUIManagerWidget_ReturnValue) == 0x0001C8, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_Event_ActionValue) == 0x0001D0, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_Event_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_Event_ElapsedTime) == 0x0001F0, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_Event_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_Event_TriggeredTime) == 0x0001F4, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_Event_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_Event_SourceAction) == 0x0001F8, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_Event_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000200, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_CustomEvent_bNewInputType) == 0x000204, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, K2Node_SwitchEnum_CmpSuccess) == 0x000205, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_FClamp_Max_ImplicitCast) == 0x000208, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000210, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000218, "Member 'WBP_PopupEULA_CM_C_ExecuteUbergraph_WBP_PopupEULA_CM::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_PopupEULA_CM.WBP_PopupEULA_CM_C.GetInputActionHandlingComponent
// 0x0008 (0x0008 - 0x0000)
struct WBP_PopupEULA_CM_C_GetInputActionHandlingComponent final
{
public:
	class US6UI_InputActionHandlingWidgetComponent* ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupEULA_CM_C_GetInputActionHandlingComponent) == 0x000008, "Wrong alignment on WBP_PopupEULA_CM_C_GetInputActionHandlingComponent");
static_assert(sizeof(WBP_PopupEULA_CM_C_GetInputActionHandlingComponent) == 0x000008, "Wrong size on WBP_PopupEULA_CM_C_GetInputActionHandlingComponent");
static_assert(offsetof(WBP_PopupEULA_CM_C_GetInputActionHandlingComponent, ReturnValue) == 0x000000, "Member 'WBP_PopupEULA_CM_C_GetInputActionHandlingComponent::ReturnValue' has a wrong offset!");

// Function WBP_PopupEULA_CM.WBP_PopupEULA_CM_C.HandleInputAction_UIBack_Triggered
// 0x0030 (0x0030 - 0x0000)
struct WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered) == 0x000008, "Wrong alignment on WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered");
static_assert(sizeof(WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered) == 0x000030, "Wrong size on WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered");
static_assert(offsetof(WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered, ActionValue) == 0x000000, "Member 'WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered, ElapsedTime) == 0x000020, "Member 'WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered, TriggeredTime) == 0x000024, "Member 'WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered, SourceAction) == 0x000028, "Member 'WBP_PopupEULA_CM_C_HandleInputAction_UIBack_Triggered::SourceAction' has a wrong offset!");

// Function WBP_PopupEULA_CM.WBP_PopupEULA_CM_C.InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_PopupEULA_CM.WBP_PopupEULA_CM_C.InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2
// 0x0030 (0x0030 - 0x0000)
struct WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2) == 0x000008, "Wrong alignment on WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2");
static_assert(sizeof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2) == 0x000030, "Wrong size on WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2, ActionValue) == 0x000000, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2, ElapsedTime) == 0x000020, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2, TriggeredTime) == 0x000024, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2, SourceAction) == 0x000028, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2::SourceAction' has a wrong offset!");

// Function WBP_PopupEULA_CM.WBP_PopupEULA_CM_C.InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_PopupEULA_CM_C_InpActEvt_IA_UI_MoveCursor_Y_Left_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_PopupEULA_CM.WBP_PopupEULA_CM_C.OnInputChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_PopupEULA_CM_C_OnInputChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PopupEULA_CM_C_OnInputChanged) == 0x000001, "Wrong alignment on WBP_PopupEULA_CM_C_OnInputChanged");
static_assert(sizeof(WBP_PopupEULA_CM_C_OnInputChanged) == 0x000001, "Wrong size on WBP_PopupEULA_CM_C_OnInputChanged");
static_assert(offsetof(WBP_PopupEULA_CM_C_OnInputChanged, bNewInputType) == 0x000000, "Member 'WBP_PopupEULA_CM_C_OnInputChanged::bNewInputType' has a wrong offset!");

}

