#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TIM_ChatCmdSuggestions_CM

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C.BndEvt__WBP_TIM_ChatCmdSuggestions_ListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatCmdSuggestions_CM_C_BndEvt__WBP_TIM_ChatCmdSuggestions_ListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestions_CM_C_BndEvt__WBP_TIM_ChatCmdSuggestions_ListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestions_CM_C_BndEvt__WBP_TIM_ChatCmdSuggestions_ListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestions_CM_C_BndEvt__WBP_TIM_ChatCmdSuggestions_ListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatCmdSuggestions_CM_C_BndEvt__WBP_TIM_ChatCmdSuggestions_ListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_BndEvt__WBP_TIM_ChatCmdSuggestions_ListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_BndEvt__WBP_TIM_ChatCmdSuggestions_ListView_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C.CycleToNextSuggestion
// 0x0028 (0x0028 - 0x0000)
struct WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion final
{
public:
	int32                                         SelectedSuggestionIndex;                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BP_GetNumItemsSelected_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1E[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion) == 0x000028, "Wrong size on WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion, SelectedSuggestionIndex) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion::SelectedSuggestionIndex' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion, CallFunc_BP_GetNumItemsSelected_ReturnValue) == 0x000004, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion::CallFunc_BP_GetNumItemsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion, CallFunc_GetNumItems_ReturnValue) == 0x000010, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000018, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion, CallFunc_GetIndexForItem_ReturnValue) == 0x000020, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToNextSuggestion::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C.CycleToPrevSuggestion
// 0x0040 (0x0040 - 0x0000)
struct WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion final
{
public:
	int32                                         SelectedSuggestionIndex;                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BP_GetNumItemsSelected_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0010(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F20[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion) == 0x000040, "Wrong size on WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion, SelectedSuggestionIndex) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion::SelectedSuggestionIndex' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion, CallFunc_BP_GetNumItemsSelected_ReturnValue) == 0x000004, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion::CallFunc_BP_GetNumItemsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion, CallFunc_GetListItems_ReturnValue) == 0x000010, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion, CallFunc_Array_LastIndex_ReturnValue) == 0x000020, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000030, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion, CallFunc_GetIndexForItem_ReturnValue) == 0x000038, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_CycleToPrevSuggestion::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C.ExecuteUbergraph_WBP_TIM_ChatCmdSuggestions_CM
// 0x0010 (0x0010 - 0x0000)
struct WBP_TIM_ChatCmdSuggestions_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestions_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F21[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestions_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestions_CM) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestions_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestions_CM");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestions_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestions_CM) == 0x000010, "Wrong size on WBP_TIM_ChatCmdSuggestions_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestions_CM");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestions_CM, EntryPoint) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestions_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestions_CM, K2Node_ComponentBoundEvent_Item) == 0x000008, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestions_CM::K2Node_ComponentBoundEvent_Item' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C.GetCompletitionTextPart
// 0x0060 (0x0060 - 0x0000)
struct WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart final
{
public:
	class FText                                   CompletitionText;                                  // 0x0000(0x0018)(Parm, OutParm)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F22[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TIM_ChatCmdSuggestionListItem_C*    K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F23[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart) == 0x000060, "Wrong size on WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart, CompletitionText) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart::CompletitionText' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart, CallFunc_Len_ReturnValue) == 0x000018, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000020, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart, K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item) == 0x000028, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart::K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart, CallFunc_RightChop_ReturnValue) == 0x000038, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart::CallFunc_RightChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_GetCompletitionTextPart::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C.Handle on NavigationNext
// 0x0010 (0x0010 - 0x0000)
struct WBP_TIM_ChatCmdSuggestions_CM_C_Handle_on_NavigationNext final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F24[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestions_CM_C_Handle_on_NavigationNext) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestions_CM_C_Handle_on_NavigationNext");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestions_CM_C_Handle_on_NavigationNext) == 0x000010, "Wrong size on WBP_TIM_ChatCmdSuggestions_CM_C_Handle_on_NavigationNext");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Handle_on_NavigationNext, Param_Navigation) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Handle_on_NavigationNext::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Handle_on_NavigationNext, ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Handle_on_NavigationNext::ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C.IsEmpty
// 0x000C (0x000C - 0x0000)
struct WBP_TIM_ChatCmdSuggestions_CM_C_IsEmpty final
{
public:
	bool                                          Param_IsEmpty;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F25[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestions_CM_C_IsEmpty) == 0x000004, "Wrong alignment on WBP_TIM_ChatCmdSuggestions_CM_C_IsEmpty");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestions_CM_C_IsEmpty) == 0x00000C, "Wrong size on WBP_TIM_ChatCmdSuggestions_CM_C_IsEmpty");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_IsEmpty, Param_IsEmpty) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_IsEmpty::Param_IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_IsEmpty, CallFunc_GetNumItems_ReturnValue) == 0x000004, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_IsEmpty::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_IsEmpty, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_IsEmpty::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C.Populate Command Classes Suggestions
// 0x0078 (0x0078 - 0x0000)
struct WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions final
{
public:
	class FString                                 Param_InString;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class UVAL_ChatCommand_Base*>          CommandClasses;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UObject*>                        Suggestions;                                       // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F26[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ChatCommand_Base*                  CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F27[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F28[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TIM_ChatCmdSuggestionListItem_C*    CallFunc_SpawnObject_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions) == 0x000078, "Wrong size on WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, Param_InString) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::Param_InString' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, CommandClasses) == 0x000010, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::CommandClasses' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, Suggestions) == 0x000020, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::Suggestions' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, CallFunc_Conv_TextToString_ReturnValue) == 0x000050, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, CallFunc_SpawnObject_ReturnValue) == 0x000068, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Command_Classes_Suggestions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C.Populate Strings Suggestions
// 0x0080 (0x0080 - 0x0000)
struct WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions final
{
public:
	class FString                                 Param_InString;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         StringsSuggestions;                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UObject*>                        Suggestions;                                       // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F29[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2A[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TIM_ChatCmdSuggestionListItem_C*    CallFunc_SpawnObject_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions) == 0x000080, "Wrong size on WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, Param_InString) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::Param_InString' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, StringsSuggestions) == 0x000010, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::StringsSuggestions' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, Suggestions) == 0x000020, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::Suggestions' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, CallFunc_SpawnObject_ReturnValue) == 0x000070, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Populate_Strings_Suggestions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C.Scroll Suggestion Index Into View
// 0x0020 (0x0020 - 0x0000)
struct WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View final
{
public:
	int32                                         SuggestionIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View) == 0x000020, "Wrong size on WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View, SuggestionIndex) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View::SuggestionIndex' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View, CallFunc_GetListItems_ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_Scroll_Suggestion_Index_Into_View::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestions_CM.WBP_TIM_ChatCmdSuggestions_CM_C.SetSuggestionsIfChanged
// 0x0098 (0x0098 - 0x0000)
struct WBP_TIM_ChatCmdSuggestions_CM_C_SetSuggestionsIfChanged final
{
public:
	TArray<class UObject*>                        Suggestions;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          SuggestionsChanged;                                // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2C[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedSuggestionIndex;                           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OldSelectedSuggestionText;                         // 0x0018(0x0018)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TIM_ChatCmdSuggestionListItem_C*    K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2D[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TIM_ChatCmdSuggestionListItem_C*    K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item_1; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2E[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2F[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TIM_ChatCmdSuggestionListItem_C*    K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item_2; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestions_CM_C_SetSuggestionsIfChanged) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestions_CM_C_SetSuggestionsIfChanged");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestions_CM_C_SetSuggestionsIfChanged) == 0x000098, "Wrong size on WBP_TIM_ChatCmdSuggestions_CM_C_SetSuggestionsIfChanged");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_SetSuggestionsIfChanged, Suggestions) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_SetSuggestionsIfChanged::Suggestions' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestions_CM_C_SetSuggestionsIfChanged, SuggestionsChanged) == 0x000010, "Member 'WBP_TIM_ChatCmdSuggestions_CM_C_SetSuggestionsIfChanged::SuggestionsChanged' has a wrong offset!");
