#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FullScreenTutorialModalLayout_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FullScreenTutorialModalLayout_CM.WBP_FullScreenTutorialModalLayout_CM_C
// 0x0060 (0x05B8 - 0x0558)
class UWBP_FullScreenTutorialModalLayout_CM_C final : public UVALUI_ModalWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               Box_CenterTwoThirdsSlot;                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Box_LeftThirdSlot;                                 // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Box_RightThirdSlot;                                // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TutorialModalTemplate_CM_C*        CurrentTutorialModal;                              // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          ContentHAlign;                                     // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EVerticalAlignment                            ContentVAlign;                                     // 0x0581(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_440F[0x6];                                     // 0x0582(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Header_Text;                                       // 0x0588(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class UWidget*>                        Page_Widgets;                                      // 0x05A0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	bool                                          Hide_Tutorial_Opt_Out;                             // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_FullScreenTutorialModalLayout_CM(int32 EntryPoint, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UWBP_TutorialModalTemplate_CM_C* CallFunc_Create_ReturnValue, bool K2Node_Event_IsDesignTime, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, TDelegate<void(class UWBP_TutorialModalTemplate_CM_C* TutorialModalTemplate)> K2Node_CreateDelegate_OutputDelegate, EHorizontalAlignment K2Node_Event_ContentHAlign, EVerticalAlignment K2Node_Event_ContentVAlign, class FText K2Node_Event_HeaderText, TArray<class UWidget*>& K2Node_Event_PageWidgets, bool K2Node_Event_HideTutorialOptOut, EHorizontalAlignment Temp_byte_Variable, class USizeBox* K2Node_Select_Default, class UPanelSlot* CallFunc_AddChild_ReturnValue, class USizeBoxSlot* K2Node_DynamicCast_AsSize_Box_Slot, bool K2Node_DynamicCast_bSuccess);
	void HandleInternalDismissButtonClicked(class UWBP_TutorialModalTemplate_CM_C* TutorialModalTemplate, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue);
	void HandleStartClosing_BP(bool bPermitLatentClosing, bool* bOutHasLatentClosingLogic);
	void InitPreOpenModalWidget(EHorizontalAlignment Param_ContentHAlign, EVerticalAlignment Param_ContentVAlign, class FText HeaderText, TArray<class UWidget*>& PageWidgets, bool HideTutorialOptOut);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FullScreenTutorialModalLayout_CM_C">();
	}
	static class UWBP_FullScreenTutorialModalLayout_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FullScreenTutorialModalLayout_CM_C>();
	}
};
static_assert(alignof(UWBP_FullScreenTutorialModalLayout_CM_C) == 0x000008, "Wrong alignment on UWBP_FullScreenTutorialModalLayout_CM_C");
static_assert(sizeof(UWBP_FullScreenTutorialModalLayout_CM_C) == 0x0005B8, "Wrong size on UWBP_FullScreenTutorialModalLayout_CM_C");
static_assert(offsetof(UWBP_FullScreenTutorialModalLayout_CM_C, UberGraphFrame) == 0x000558, "Member 'UWBP_FullScreenTutorialModalLayout_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenTutorialModalLayout_CM_C, Box_CenterTwoThirdsSlot) == 0x000560, "Member 'UWBP_FullScreenTutorialModalLayout_CM_C::Box_CenterTwoThirdsSlot' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenTutorialModalLayout_CM_C, Box_LeftThirdSlot) == 0x000568, "Member 'UWBP_FullScreenTutorialModalLayout_CM_C::Box_LeftThirdSlot' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenTutorialModalLayout_CM_C, Box_RightThirdSlot) == 0x000570, "Member 'UWBP_FullScreenTutorialModalLayout_CM_C::Box_RightThirdSlot' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenTutorialModalLayout_CM_C, CurrentTutorialModal) == 0x000578, "Member 'UWBP_FullScreenTutorialModalLayout_CM_C::CurrentTutorialModal' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenTutorialModalLayout_CM_C, ContentHAlign) == 0x000580, "Member 'UWBP_FullScreenTutorialModalLayout_CM_C::ContentHAlign' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenTutorialModalLayout_CM_C, ContentVAlign) == 0x000581, "Member 'UWBP_FullScreenTutorialModalLayout_CM_C::ContentVAlign' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenTutorialModalLayout_CM_C, Header_Text) == 0x000588, "Member 'UWBP_FullScreenTutorialModalLayout_CM_C::Header_Text' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenTutorialModalLayout_CM_C, Page_Widgets) == 0x0005A0, "Member 'UWBP_FullScreenTutorialModalLayout_CM_C::Page_Widgets' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenTutorialModalLayout_CM_C, Hide_Tutorial_Opt_Out) == 0x0005B0, "Member 'UWBP_FullScreenTutorialModalLayout_CM_C::Hide_Tutorial_Opt_Out' has a wrong offset!");

}

