#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_ManageFriends

#include "Basic.hpp"

#include "F_CommonUIButtonPrompt_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Button_ManageFriends.WBP_Button_ManageFriends_C.BndEvt__WBP_Button_ManageFriends_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Button_ManageFriends_C_BndEvt__WBP_Button_ManageFriends_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_ManageFriends_C_BndEvt__WBP_Button_ManageFriends_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Button_ManageFriends_C_BndEvt__WBP_Button_ManageFriends_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Button_ManageFriends_C_BndEvt__WBP_Button_ManageFriends_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Button_ManageFriends_C_BndEvt__WBP_Button_ManageFriends_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Button_ManageFriends_C_BndEvt__WBP_Button_ManageFriends_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Button_ManageFriends_C_BndEvt__WBP_Button_ManageFriends_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Button_ManageFriends.WBP_Button_ManageFriends_C.BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Button_ManageFriends_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_ManageFriends_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Button_ManageFriends_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Button_ManageFriends_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Button_ManageFriends_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Button_ManageFriends_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Button_ManageFriends_C_BndEvt__WBP_PlayerCharacterRow_Button_Friend_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Button_ManageFriends.WBP_Button_ManageFriends_C.ExecuteUbergraph_WBP_Button_ManageFriends
// 0x0020 (0x0020 - 0x0000)
struct WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0010(0x0008)(NoDestructor)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends) == 0x000008, "Wrong alignment on WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends");
static_assert(sizeof(WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends) == 0x000020, "Wrong size on WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends");
static_assert(offsetof(WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends, EntryPoint) == 0x000000, "Member 'WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends, K2Node_Event_InFocusEvent) == 0x000010, "Member 'WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_Button_ManageFriends_C_ExecuteUbergraph_WBP_Button_ManageFriends::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_Button_ManageFriends.WBP_Button_ManageFriends_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Button_ManageFriends_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Button_ManageFriends_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_Button_ManageFriends_C_OnFocusLost");
static_assert(sizeof(WBP_Button_ManageFriends_C_OnFocusLost) == 0x000008, "Wrong size on WBP_Button_ManageFriends_C_OnFocusLost");
static_assert(offsetof(WBP_Button_ManageFriends_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_Button_ManageFriends_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_Button_ManageFriends.WBP_Button_ManageFriends_C.OnFocusReceived
// 0x0240 (0x0240 - 0x0000)
struct WBP_Button_ManageFriends_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt;          // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt_1;        // 0x0138(0x0040)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0178(0x00B8)()
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_Button_ManageFriends_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Button_ManageFriends_C_OnFocusReceived");
static_assert(sizeof(WBP_Button_ManageFriends_C_OnFocusReceived) == 0x000240, "Wrong size on WBP_Button_ManageFriends_C_OnFocusReceived");
static_assert(offsetof(WBP_Button_ManageFriends_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Button_ManageFriends_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Button_ManageFriends_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Button_ManageFriends_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Button_ManageFriends_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Button_ManageFriends_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_ManageFriends_C_OnFocusReceived, K2Node_MakeStruct_F_CommonUIButtonPrompt) == 0x0000F8, "Member 'WBP_Button_ManageFriends_C_OnFocusReceived::K2Node_MakeStruct_F_CommonUIButtonPrompt' has a wrong offset!");
static_assert(offsetof(WBP_Button_ManageFriends_C_OnFocusReceived, K2Node_MakeStruct_F_CommonUIButtonPrompt_1) == 0x000138, "Member 'WBP_Button_ManageFriends_C_OnFocusReceived::K2Node_MakeStruct_F_CommonUIButtonPrompt_1' has a wrong offset!");
static_assert(offsetof(WBP_Button_ManageFriends_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000178, "Member 'WBP_Button_ManageFriends_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_ManageFriends_C_OnFocusReceived, K2Node_MakeArray_Array) == 0x000230, "Member 'WBP_Button_ManageFriends_C_OnFocusReceived::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_Button_ManageFriends.WBP_Button_ManageFriends_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Button_ManageFriends_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Button_ManageFriends_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Button_ManageFriends_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_Button_ManageFriends_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_Button_ManageFriends_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_Button_ManageFriends_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Button_ManageFriends_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Button_ManageFriends_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_Button_ManageFriends_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

}

