#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TIM_ChatMessage_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "S6Core_structs.hpp"
#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"


namespace SDK::Params
{

// Function WBP_TIM_ChatMessage_CM.WBP_TIM_ChatMessage_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatMessage_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessage_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_TIM_ChatMessage_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_TIM_ChatMessage_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_TIM_ChatMessage_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_TIM_ChatMessage_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_TIM_ChatMessage_CM.WBP_TIM_ChatMessage_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatMessage_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessage_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_TIM_ChatMessage_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_TIM_ChatMessage_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_TIM_ChatMessage_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_TIM_ChatMessage_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_TIM_ChatMessage_CM.WBP_TIM_ChatMessage_CM_C.Can Open Platform Tooltips
// 0x0100 (0x0100 - 0x0000)
struct WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXSXPlatform_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EB6[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetIdFromChatMessageSender_ReturnValue; // 0x0010(0x0030)(HasGetValueTypeHash)
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue;         // 0x0040(0x00B0)()
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips");
static_assert(sizeof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips) == 0x000100, "Wrong size on WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, ReturnValue) == 0x000000, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_IsXSXPlatform_ReturnValue) == 0x000001, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_IsXSXPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_IsPS5Platform_ReturnValue) == 0x000002, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_IsPS5Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_GetPlatformType_ReturnValue) == 0x000003, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_GetNetIdFromChatMessageSender_ReturnValue) == 0x000010, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_GetNetIdFromChatMessageSender_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_GetPresenceForUserId_ReturnValue) == 0x000040, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_GetPresenceForUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_GetActiveWidget_ReturnValue) == 0x0000F0, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F8, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F9, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000FA, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_BooleanAND_ReturnValue) == 0x0000FB, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000FC, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_BooleanAND_ReturnValue_1) == 0x0000FD, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_BooleanAND_ReturnValue_2) == 0x0000FE, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips, CallFunc_BooleanAND_ReturnValue_3) == 0x0000FF, "Member 'WBP_TIM_ChatMessage_CM_C_Can_Open_Platform_Tooltips::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function WBP_TIM_ChatMessage_CM.WBP_TIM_ChatMessage_CM_C.ConstructBoldColorText
// 0x0130 (0x0130 - 0x0000)
struct WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLinearColor                           Color;                                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ColorText;                                         // 0x0028(0x0018)(Parm, OutParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_ColorToHexString_ReturnValue;             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
};
static_assert(alignof(WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText");
static_assert(sizeof(WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText) == 0x000130, "Wrong size on WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText, Text) == 0x000000, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText::Text' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText, Color) == 0x000018, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText::Color' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText, ColorText) == 0x000028, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText::ColorText' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText, CallFunc_ColorToHexString_ReturnValue) == 0x000090, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText::CallFunc_ColorToHexString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText, K2Node_MakeArray_Array) == 0x000108, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructBoldColorText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatMessage_CM.WBP_TIM_ChatMessage_CM_C.ConstructColorText
// 0x0130 (0x0130 - 0x0000)
struct WBP_TIM_ChatMessage_CM_C_ConstructColorText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLinearColor                           Color;                                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ColorText;                                         // 0x0028(0x0018)(Parm, OutParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_ColorToHexString_ReturnValue;             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
};
static_assert(alignof(WBP_TIM_ChatMessage_CM_C_ConstructColorText) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessage_CM_C_ConstructColorText");
static_assert(sizeof(WBP_TIM_ChatMessage_CM_C_ConstructColorText) == 0x000130, "Wrong size on WBP_TIM_ChatMessage_CM_C_ConstructColorText");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructColorText, Text) == 0x000000, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructColorText::Text' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructColorText, Color) == 0x000018, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructColorText::Color' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructColorText, ColorText) == 0x000028, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructColorText::ColorText' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructColorText, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructColorText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructColorText, CallFunc_ColorToHexString_ReturnValue) == 0x000090, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructColorText::CallFunc_ColorToHexString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructColorText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructColorText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructColorText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructColorText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructColorText, K2Node_MakeArray_Array) == 0x000108, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructColorText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ConstructColorText, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WBP_TIM_ChatMessage_CM_C_ConstructColorText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatMessage_CM.WBP_TIM_ChatMessage_CM_C.Display Timestamp
// 0x0002 (0x0002 - 0x0000)
struct WBP_TIM_ChatMessage_CM_C_Display_Timestamp final
{
public:
	bool                                          Display;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessage_CM_C_Display_Timestamp) == 0x000001, "Wrong alignment on WBP_TIM_ChatMessage_CM_C_Display_Timestamp");
static_assert(sizeof(WBP_TIM_ChatMessage_CM_C_Display_Timestamp) == 0x000002, "Wrong size on WBP_TIM_ChatMessage_CM_C_Display_Timestamp");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Display_Timestamp, Display) == 0x000000, "Member 'WBP_TIM_ChatMessage_CM_C_Display_Timestamp::Display' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_Display_Timestamp, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'WBP_TIM_ChatMessage_CM_C_Display_Timestamp::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatMessage_CM.WBP_TIM_ChatMessage_CM_C.DisplayChatMessage
// 0x0148 (0x0148 - 0x0000)
struct WBP_TIM_ChatMessage_CM_C_DisplayChatMessage final
{
public:
	class UBP_TIM_ChatMessageListItem_CM_C*       ListItem;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EB7[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EB8[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALUI_ChatTab                         CallFunc_TryGetTabAndChannelFromMessageConfig_OutTab; // 0x0030(0x0060)(ContainsInstancedReference)
	struct FVALUI_ChatChannel                     CallFunc_TryGetTabAndChannelFromMessageConfig_OutChannel; // 0x0090(0x00B0)()
	bool                                          CallFunc_TryGetTabAndChannelFromMessageConfig_ReturnValue; // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessage_CM_C_DisplayChatMessage) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessage_CM_C_DisplayChatMessage");
static_assert(sizeof(WBP_TIM_ChatMessage_CM_C_DisplayChatMessage) == 0x000148, "Wrong size on WBP_TIM_ChatMessage_CM_C_DisplayChatMessage");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_DisplayChatMessage, ListItem) == 0x000000, "Member 'WBP_TIM_ChatMessage_CM_C_DisplayChatMessage::ListItem' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_DisplayChatMessage, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatMessage_CM_C_DisplayChatMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_DisplayChatMessage, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_TIM_ChatMessage_CM_C_DisplayChatMessage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_DisplayChatMessage, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'WBP_TIM_ChatMessage_CM_C_DisplayChatMessage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_DisplayChatMessage, CallFunc_TryGetTabAndChannelFromMessageConfig_OutTab) == 0x000030, "Member 'WBP_TIM_ChatMessage_CM_C_DisplayChatMessage::CallFunc_TryGetTabAndChannelFromMessageConfig_OutTab' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_DisplayChatMessage, CallFunc_TryGetTabAndChannelFromMessageConfig_OutChannel) == 0x000090, "Member 'WBP_TIM_ChatMessage_CM_C_DisplayChatMessage::CallFunc_TryGetTabAndChannelFromMessageConfig_OutChannel' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_DisplayChatMessage, CallFunc_TryGetTabAndChannelFromMessageConfig_ReturnValue) == 0x000140, "Member 'WBP_TIM_ChatMessage_CM_C_DisplayChatMessage::CallFunc_TryGetTabAndChannelFromMessageConfig_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatMessage_CM.WBP_TIM_ChatMessage_CM_C.DisplayNotificationMessage
// 0x0028 (0x0028 - 0x0000)
struct WBP_TIM_ChatMessage_CM_C_DisplayNotificationMessage final
{
public:
	class UBP_TIM_ChatMessageListItem_CM_C*       ListItem;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EB9[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_TIM_ChatMessage_CM_C_DisplayNotificationMessage) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessage_CM_C_DisplayNotificationMessage");
static_assert(sizeof(WBP_TIM_ChatMessage_CM_C_DisplayNotificationMessage) == 0x000028, "Wrong size on WBP_TIM_ChatMessage_CM_C_DisplayNotificationMessage");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_DisplayNotificationMessage, ListItem) == 0x000000, "Member 'WBP_TIM_ChatMessage_CM_C_DisplayNotificationMessage::ListItem' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_DisplayNotificationMessage, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatMessage_CM_C_DisplayNotificationMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_DisplayNotificationMessage, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_TIM_ChatMessage_CM_C_DisplayNotificationMessage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatMessage_CM.WBP_TIM_ChatMessage_CM_C.ExecuteUbergraph_WBP_TIM_ChatMessage_CM
// 0x0800 (0x0800 - 0x0000)
struct WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EBA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x0010(0x0030)(HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x0050(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names;                          // 0x0060(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable;                              // 0x0070(0x0010)(ReferenceParm)
	struct FGuid                                  Temp_struct_Variable_1;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EBB[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EBC[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x00C0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_TIM_ChatMessageListItem_CM_C*       K2Node_DynamicCast_AsBP_TIM_Chat_Message_List_Item_CM; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EBD[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00DC(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EBE[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0118(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0190(0x0078)(ConstParm)
	bool                                          Temp_bool_Variable;                                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EBF[0x3];                                     // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_2;            // 0x020C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC0[0x3];                                     // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaChatMessage                    K2Node_CustomEvent_Message;                        // 0x0220(0x0068)()
	struct FVALUI_ChatChannel                     K2Node_CustomEvent_Channel;                        // 0x0288(0x00B0)()
	struct FUniqueNetIdRepl                       CallFunc_GetNetIdFromChatMessageSender_ReturnValue; // 0x0338(0x0030)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0368(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC1[0x3];                                     // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x03BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC2[0x4];                                     // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue; // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x03D8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x03F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0408(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0458(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x04A8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x04B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x04C8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x04E0(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0508(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0522(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC3[0x5];                                     // 0x0523(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FValeriaGameplaySettings& GameplaySettings)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0530(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC4[0x7];                                     // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0552(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0553(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMessageTargetType                            Temp_byte_Variable;                                // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0555(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC5[0x2];                                     // 0x0556(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* MenuContent)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0558(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC6[0x4];                                     // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSSVAL_CharacterNameAndId             CallFunc_Array_Get_Item;                           // 0x0570(0x0030)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC7[0x2];                                     // 0x05A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC8[0x4];                                     // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x05B0(0x0018)()
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC9[0x7];                                     // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue_1;                   // 0x05D8(0x0030)(HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue_1;                 // 0x0609(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x060A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x060B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ECA[0x4];                                     // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPresence                              K2Node_CustomEvent_OldPresence;                    // 0x0610(0x00B0)()
	struct FPresence                              K2Node_CustomEvent_NewPresence;                    // 0x06C0(0x00B0)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0771(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ECB[0x6];                                     // 0x0772(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetNetIdFromChatMessageSender_ReturnValue_1; // 0x0778(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue_2;                 // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ECC[0x7];                                     // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetNetIdFromChatMessageSender_ReturnValue_2; // 0x07B0(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_Can_Open_Platform_Tooltips_ReturnValue;   // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ECD[0x7];                                     // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x07E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlatformPlayerNameToolTip_C*       CallFunc_Create_ReturnValue;                       // 0x07F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM");
static_assert(sizeof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM) == 0x000800, "Wrong size on WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, EntryPoint) == 0x000000, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_GetNetId_ReturnValue) == 0x000010, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_GetNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_CustomEvent_AccountId) == 0x000050, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_CustomEvent_Names) == 0x000060, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_CustomEvent_Names' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_struct_Variable) == 0x000070, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_struct_Variable_1) == 0x000080, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000098, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A0, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_Event_bIsExpanded) == 0x0000B0, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_Event_bIsSelected) == 0x0000B1, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_Event_ListItemObject) == 0x0000B8, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_CustomEvent_AccountId_1) == 0x0000C0, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_DynamicCast_AsBP_TIM_Chat_Message_List_Item_CM) == 0x0000D0, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_DynamicCast_AsBP_TIM_Chat_Message_List_Item_CM' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_SwitchEnum_CmpSuccess) == 0x0000D9, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_Event_MyGeometry) == 0x0000DC, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_Event_MouseEvent_1) == 0x000118, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_Event_MouseEvent) == 0x000190, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_bool_Variable) == 0x000208, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x00020C, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_bool_Variable_1) == 0x00021C, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_CustomEvent_Message) == 0x000220, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_CustomEvent_Channel) == 0x000288, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_CustomEvent_Channel' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_GetNetIdFromChatMessageSender_ReturnValue) == 0x000338, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_GetNetIdFromChatMessageSender_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_MakeStruct_FormatArgumentData) == 0x000368, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_EqualEqual_ReturnValue) == 0x0003B8, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_EqualEqual_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_GetAccountId_ReturnValue) == 0x0003BC, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_GetCharacterNamesByAccountId_ReturnValue) == 0x0003D0, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_GetCharacterNamesByAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Conv_StringToText_ReturnValue) == 0x0003D8, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0003F0, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_MakeStruct_FormatArgumentData_1) == 0x000408, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_MakeStruct_FormatArgumentData_2) == 0x000458, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_MakeArray_Array) == 0x0004A8, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_MakeArray_Array_1) == 0x0004B8, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Format_ReturnValue) == 0x0004C8, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Format_ReturnValue_1) == 0x0004E0, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Concat_StrStr_ReturnValue) == 0x0004F8, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000508, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_IsValid_ReturnValue) == 0x000520, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_bool_Variable_2) == 0x000521, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_bool_Variable_3) == 0x000522, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000528, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x000530, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Not_PreBool_ReturnValue) == 0x000540, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue_1) == 0x000548, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_bool_Variable_4) == 0x000550, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_bool_Variable_5) == 0x000551, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_bool_Variable_6) == 0x000552, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_bool_Variable_7) == 0x000553, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_byte_Variable) == 0x000554, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_Select_Default) == 0x000555, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x000558, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_int_Array_Index_Variable) == 0x000568, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Array_Get_Item) == 0x000570, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_int_Loop_Counter_Variable) == 0x0005A0, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0005A4, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Less_IntInt_ReturnValue) == 0x0005A5, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Add_IntInt_ReturnValue) == 0x0005A8, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0005B0, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_IsOpen_ReturnValue) == 0x0005C8, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x0005D0, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_GetNetId_ReturnValue_1) == 0x0005D8, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_GetNetId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, Temp_bool_True_if_break_was_hit_Variable) == 0x000608, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_EqualEqual_ReturnValue_1) == 0x000609, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_EqualEqual_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_Not_PreBool_ReturnValue_1) == 0x00060A, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM, CallFunc_BooleanAND_ReturnValue) == 0x00060B, "Member 'WBP_TIM_ChatMessage_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessage_CM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
