#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TutorialModalTemplate_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TutorialModalTemplate_CM.WBP_TutorialModalTemplate_CM_C
// 0x00B8 (0x0378 - 0x02C0)
class UWBP_TutorialModalTemplate_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Backer;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Primary_Next;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Secondary_01_CM_C* Button_Secondary_Back;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CarouselPaginator_CM_C*            CarouselPaginator;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CheckmarkButton_CM_C*              CheckBox_SuppressTutorials;                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CheckBox_SuppressTutorials_ActionWidget;           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_106;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Primary_Next;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SecondaryBack;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_80;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Header;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TutorialOptOut;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_PageContent;                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderText;                                        // 0x0338(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class UWidget*>                        Page_Widgets;                                      // 0x0350(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             OnClickedDismissButton;                            // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UInputAction*                           CheckBoxInputAction;                               // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_TutorialModalTemplate_CM_Button_Primary_Next_K2Node_ComponentBoundEvent_3_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_TutorialModalTemplate_CM_Button_Secondary_Back_K2Node_ComponentBoundEvent_2_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_TutorialModalTemplate_CM_CarouselPaginator_K2Node_ComponentBoundEvent_7_OnActivePageChanged__DelegateSignature(class UWBP_CarouselPaginator_CM_C* Param_CarouselPaginator);
	void BndEvt__WBP_TutorialModalTemplate_CM_CheckBox_SuppressTutorials_K2Node_ComponentBoundEvent_6_OnCheckedStateChanged__DelegateSignature(bool IsSelected);
	void Construct();
	void ExecuteUbergraph_WBP_TutorialModalTemplate_CM(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool K2Node_Event_IsDesignTime, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, ESlateVisibility Temp_byte_Variable, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, int32 CallFunc_GetActiveWidgetIndex_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, ESlateVisibility Temp_byte_Variable_1, int32 CallFunc_Array_Length_ReturnValue_3, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_GetActivePageIndex_ActivePageIndex, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool K2Node_ComponentBoundEvent_IsSelected, class UWBP_CarouselPaginator_CM_C* K2Node_ComponentBoundEvent_CarouselPaginator, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_GetActivePageIndex_ActivePageIndex_1, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, bool Temp_bool_Variable, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue, bool CallFunc_IsTutorialEnabled_ReturnValue, ESlateVisibility K2Node_Select_Default, bool CallFunc_Not_PreBool_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult_1, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue_1, bool CallFunc_IsConsole_ReturnValue, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1);
	void HideTutorialOptOut();
	void OnClickedDismissButton__DelegateSignature(class UWBP_TutorialModalTemplate_CM_C* TutorialModalTemplate);
	void PreConstruct(bool IsDesignTime);
	void RefreshButtonState(int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_GetActivePageIndex_ActivePageIndex, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue);
	void SetInputActionRemind(ESlateVisibility CallFunc_GetVisibility_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TutorialModalTemplate_CM_C">();
	}
	static class UWBP_TutorialModalTemplate_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TutorialModalTemplate_CM_C>();
	}
};
static_assert(alignof(UWBP_TutorialModalTemplate_CM_C) == 0x000008, "Wrong alignment on UWBP_TutorialModalTemplate_CM_C");
static_assert(sizeof(UWBP_TutorialModalTemplate_CM_C) == 0x000378, "Wrong size on UWBP_TutorialModalTemplate_CM_C");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_TutorialModalTemplate_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, Backer) == 0x0002C8, "Member 'UWBP_TutorialModalTemplate_CM_C::Backer' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, Button_Primary_Next) == 0x0002D0, "Member 'UWBP_TutorialModalTemplate_CM_C::Button_Primary_Next' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, Button_Secondary_Back) == 0x0002D8, "Member 'UWBP_TutorialModalTemplate_CM_C::Button_Secondary_Back' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, CarouselPaginator) == 0x0002E0, "Member 'UWBP_TutorialModalTemplate_CM_C::CarouselPaginator' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, CheckBox_SuppressTutorials) == 0x0002E8, "Member 'UWBP_TutorialModalTemplate_CM_C::CheckBox_SuppressTutorials' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, CheckBox_SuppressTutorials_ActionWidget) == 0x0002F0, "Member 'UWBP_TutorialModalTemplate_CM_C::CheckBox_SuppressTutorials_ActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, Image) == 0x0002F8, "Member 'UWBP_TutorialModalTemplate_CM_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, Image_106) == 0x000300, "Member 'UWBP_TutorialModalTemplate_CM_C::Image_106' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, Overlay_Primary_Next) == 0x000308, "Member 'UWBP_TutorialModalTemplate_CM_C::Overlay_Primary_Next' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, Overlay_SecondaryBack) == 0x000310, "Member 'UWBP_TutorialModalTemplate_CM_C::Overlay_SecondaryBack' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, SizeBox_80) == 0x000318, "Member 'UWBP_TutorialModalTemplate_CM_C::SizeBox_80' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, TextBlock_Header) == 0x000320, "Member 'UWBP_TutorialModalTemplate_CM_C::TextBlock_Header' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, TutorialOptOut) == 0x000328, "Member 'UWBP_TutorialModalTemplate_CM_C::TutorialOptOut' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, WidgetSwitcher_PageContent) == 0x000330, "Member 'UWBP_TutorialModalTemplate_CM_C::WidgetSwitcher_PageContent' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, HeaderText) == 0x000338, "Member 'UWBP_TutorialModalTemplate_CM_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, Page_Widgets) == 0x000350, "Member 'UWBP_TutorialModalTemplate_CM_C::Page_Widgets' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, OnClickedDismissButton) == 0x000360, "Member 'UWBP_TutorialModalTemplate_CM_C::OnClickedDismissButton' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialModalTemplate_CM_C, CheckBoxInputAction) == 0x000370, "Member 'UWBP_TutorialModalTemplate_CM_C::CheckBoxInputAction' has a wrong offset!");

}

