#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InteractPlate_PromptEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.ExecuteUbergraph_WBP_InteractPlate_PromptEntry
// 0x0128 (0x0128 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47EF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableComponent*                 K2Node_CustomEvent_InteractableComponent;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Interactable;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInteractEventIndex                           K2Node_CustomEvent_Index;                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F0[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInteractable>         K2Node_DynamicCast_AsInteractable;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F1[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    K2Node_DynamicCast_AsInventory_Component;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F2[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F3[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputSubsystemWithKeyRebinding* CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGetTextParams                         CallFunc_GetText_params;                           // 0x0068(0x0050)()
	bool                                          CallFunc_GetText_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F4[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue;                    // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F5[0x5];                                     // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGetTextParams                         Temp_struct_Variable;                              // 0x00D0(0x0050)()
	bool                                          Temp_bool_Variable;                                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry) == 0x000008, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry) == 0x000128, "Wrong size on WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, EntryPoint) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, K2Node_CustomEvent_InteractableComponent) == 0x000008, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::K2Node_CustomEvent_InteractableComponent' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, K2Node_CustomEvent_Interactable) == 0x000010, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::K2Node_CustomEvent_Interactable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, K2Node_CustomEvent_Index) == 0x000018, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, K2Node_DynamicCast_AsInteractable) == 0x000020, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::K2Node_DynamicCast_AsInteractable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_DoesImplementInterface_ReturnValue) == 0x000031, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, K2Node_DynamicCast_AsInventory_Component) == 0x000038, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::K2Node_DynamicCast_AsInventory_Component' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_GetValeriaCharacter_OutResult) == 0x000054, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000058, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000060, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_GetText_params) == 0x000068, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_GetText_params' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_GetText_ReturnValue) == 0x0000B8, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, K2Node_SwitchEnum_CmpSuccess) == 0x0000B9, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000C0, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, K2Node_Event_IsDesignTime) == 0x0000C8, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_IsConsole_ReturnValue) == 0x0000C9, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_IsDesktop_ReturnValue) == 0x0000CA, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_IsDesktop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, Temp_struct_Variable) == 0x0000D0, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, Temp_bool_Variable) == 0x000120, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_IsVisible_ReturnValue) == 0x000121, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry, CallFunc_BooleanAND_ReturnValue) == 0x000122, "Member 'WBP_InteractPlate_PromptEntry_C_ExecuteUbergraph_WBP_InteractPlate_PromptEntry::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.Get and Set Input Action
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action final
{
public:
	TSoftObjectPtr<class UInputAction>            Temp_softobject_Variable;                          // 0x0000(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F6[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           K2Node_DynamicCast_AsInput_Action;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F7[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           CallFunc_GetDefaultInputActionForEventIndex_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F8[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInteractable>         K2Node_DynamicCast_AsInteractable;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F9[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47FA[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UInputAction>            CallFunc_GetInputActionForEventIndex_ReturnValue;  // 0x0088(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action) == 0x000008, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action) == 0x0000B0, "Wrong size on WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, Temp_softobject_Variable) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000028, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000030, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, K2Node_DynamicCast_AsInput_Action) == 0x000038, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::K2Node_DynamicCast_AsInput_Action' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, CallFunc_GetValeriaPlayerController_OutResult) == 0x000041, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000048, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, CallFunc_GetDefaultInputActionForEventIndex_ReturnValue) == 0x000050, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::CallFunc_GetDefaultInputActionForEventIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, K2Node_DynamicCast_AsInteractable) == 0x000060, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::K2Node_DynamicCast_AsInteractable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, CallFunc_GetValeriaCharacter_OutResult) == 0x000071, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000078, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, K2Node_SwitchEnum_CmpSuccess_1) == 0x000080, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action, CallFunc_GetInputActionForEventIndex_ReturnValue) == 0x000088, "Member 'WBP_InteractPlate_PromptEntry_C_Get_and_Set_Input_Action::CallFunc_GetInputActionForEventIndex_ReturnValue' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.GetInteractableComponent
// 0x0058 (0x0058 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_GetInteractableComponent final
{
public:
	class UObject*                                Param_Interactable;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 InteractableComponent;                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47FB[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_DynamicCast_AsActor_Component;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47FC[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_DynamicCast_AsInteractable_Component;       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent) == 0x000008, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_GetInteractableComponent");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent) == 0x000058, "Wrong size on WBP_InteractPlate_PromptEntry_C_GetInteractableComponent");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent, Param_Interactable) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_GetInteractableComponent::Param_Interactable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent, InteractableComponent) == 0x000008, "Member 'WBP_InteractPlate_PromptEntry_C_GetInteractableComponent::InteractableComponent' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent, K2Node_DynamicCast_AsActor) == 0x000010, "Member 'WBP_InteractPlate_PromptEntry_C_GetInteractableComponent::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_InteractPlate_PromptEntry_C_GetInteractableComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent, K2Node_DynamicCast_AsActor_Component) == 0x000020, "Member 'WBP_InteractPlate_PromptEntry_C_GetInteractableComponent::K2Node_DynamicCast_AsActor_Component' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WBP_InteractPlate_PromptEntry_C_GetInteractableComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'WBP_InteractPlate_PromptEntry_C_GetInteractableComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'WBP_InteractPlate_PromptEntry_C_GetInteractableComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000040, "Member 'WBP_InteractPlate_PromptEntry_C_GetInteractableComponent::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent, K2Node_DynamicCast_AsInteractable_Component) == 0x000048, "Member 'WBP_InteractPlate_PromptEntry_C_GetInteractableComponent::K2Node_DynamicCast_AsInteractable_Component' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_GetInteractableComponent, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'WBP_InteractPlate_PromptEntry_C_GetInteractableComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.OnlyUseIInteractableInputActions
// 0x0018 (0x0018 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_OnlyUseIInteractableInputActions final
{
public:
	bool                                          OnlyUseIInteractableActions;                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47FD[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableComponent*                 CallFunc_GetInteractableComponent_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_OnlyUseIInteractableInputActions) == 0x000008, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_OnlyUseIInteractableInputActions");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_OnlyUseIInteractableInputActions) == 0x000018, "Wrong size on WBP_InteractPlate_PromptEntry_C_OnlyUseIInteractableInputActions");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_OnlyUseIInteractableInputActions, OnlyUseIInteractableActions) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_OnlyUseIInteractableInputActions::OnlyUseIInteractableActions' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_OnlyUseIInteractableInputActions, CallFunc_GetInteractableComponent_ReturnValue) == 0x000008, "Member 'WBP_InteractPlate_PromptEntry_C_OnlyUseIInteractableInputActions::CallFunc_GetInteractableComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_OnlyUseIInteractableInputActions, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_InteractPlate_PromptEntry_C_OnlyUseIInteractableInputActions::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_PreConstruct");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_InteractPlate_PromptEntry_C_PreConstruct");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.SetAmountTextStyle
// 0x0028 (0x0028 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle final
{
public:
	bool                                          ShowDisabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47FE[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47FF[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle) == 0x000008, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle) == 0x000028, "Wrong size on WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle, ShowDisabled) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle::ShowDisabled' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle, Temp_bool_Variable) == 0x000001, "Member 'WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle, Temp_object_Variable) == 0x000008, "Member 'WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle, Temp_object_Variable_1) == 0x000010, "Member 'WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle, K2Node_Select_Default) == 0x000020, "Member 'WBP_InteractPlate_PromptEntry_C_SetAmountTextStyle::K2Node_Select_Default' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.SetBorderStyle
// 0x0028 (0x0028 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_SetBorderStyle final
{
public:
	bool                                          ShowDisabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4800[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_BorderStyle*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_BorderStyle*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4801[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_BorderStyle*                     K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_SetBorderStyle) == 0x000008, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_SetBorderStyle");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_SetBorderStyle) == 0x000028, "Wrong size on WBP_InteractPlate_PromptEntry_C_SetBorderStyle");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetBorderStyle, ShowDisabled) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_SetBorderStyle::ShowDisabled' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetBorderStyle, Temp_bool_Variable) == 0x000001, "Member 'WBP_InteractPlate_PromptEntry_C_SetBorderStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetBorderStyle, Temp_object_Variable) == 0x000008, "Member 'WBP_InteractPlate_PromptEntry_C_SetBorderStyle::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetBorderStyle, Temp_object_Variable_1) == 0x000010, "Member 'WBP_InteractPlate_PromptEntry_C_SetBorderStyle::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetBorderStyle, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_InteractPlate_PromptEntry_C_SetBorderStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetBorderStyle, K2Node_Select_Default) == 0x000020, "Member 'WBP_InteractPlate_PromptEntry_C_SetBorderStyle::K2Node_Select_Default' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.SetDesaturatedAmount
// 0x0018 (0x0018 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount final
{
public:
	bool                                          ShowDisabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4802[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount) == 0x000008, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount) == 0x000018, "Wrong size on WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount, ShowDisabled) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount::ShowDisabled' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000010, "Member 'WBP_InteractPlate_PromptEntry_C_SetDesaturatedAmount::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.SetKeyboardIADescription
// 0x0003 (0x0003 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_SetKeyboardIADescription final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_SetKeyboardIADescription) == 0x000001, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_SetKeyboardIADescription");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_SetKeyboardIADescription) == 0x000003, "Wrong size on WBP_InteractPlate_PromptEntry_C_SetKeyboardIADescription");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetKeyboardIADescription, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_SetKeyboardIADescription::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetKeyboardIADescription, CallFunc_GetVisibility_ReturnValue) == 0x000001, "Member 'WBP_InteractPlate_PromptEntry_C_SetKeyboardIADescription::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetKeyboardIADescription, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'WBP_InteractPlate_PromptEntry_C_SetKeyboardIADescription::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.SetNameTextStyle
// 0x0028 (0x0028 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_SetNameTextStyle final
{
public:
	bool                                          ShowDisabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4803[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4804[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_SetNameTextStyle) == 0x000008, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_SetNameTextStyle");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_SetNameTextStyle) == 0x000028, "Wrong size on WBP_InteractPlate_PromptEntry_C_SetNameTextStyle");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetNameTextStyle, ShowDisabled) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_SetNameTextStyle::ShowDisabled' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetNameTextStyle, Temp_bool_Variable) == 0x000001, "Member 'WBP_InteractPlate_PromptEntry_C_SetNameTextStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetNameTextStyle, Temp_object_Variable) == 0x000008, "Member 'WBP_InteractPlate_PromptEntry_C_SetNameTextStyle::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetNameTextStyle, Temp_object_Variable_1) == 0x000010, "Member 'WBP_InteractPlate_PromptEntry_C_SetNameTextStyle::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetNameTextStyle, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_InteractPlate_PromptEntry_C_SetNameTextStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_SetNameTextStyle, K2Node_Select_Default) == 0x000020, "Member 'WBP_InteractPlate_PromptEntry_C_SetNameTextStyle::K2Node_Select_Default' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.Update
// 0x0018 (0x0018 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_Update final
{
public:
	class UInteractableComponent*                 InteractableComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Param_Interactable;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInteractEventIndex                           Param_Index;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_Update) == 0x000008, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_Update");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_Update) == 0x000018, "Wrong size on WBP_InteractPlate_PromptEntry_C_Update");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Update, InteractableComponent) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_Update::InteractableComponent' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Update, Param_Interactable) == 0x000008, "Member 'WBP_InteractPlate_PromptEntry_C_Update::Param_Interactable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Update, Param_Index) == 0x000010, "Member 'WBP_InteractPlate_PromptEntry_C_Update::Param_Index' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.Update Prompt
// 0x0028 (0x0028 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_Update_Prompt final
{
public:
	bool                                          CallFunc_IsSwitchPlatform_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4805[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4806[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_Update_Prompt) == 0x000008, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_Update_Prompt");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_Update_Prompt) == 0x000028, "Wrong size on WBP_InteractPlate_PromptEntry_C_Update_Prompt");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Update_Prompt, CallFunc_IsSwitchPlatform_ReturnValue) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_Update_Prompt::CallFunc_IsSwitchPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Update_Prompt, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_InteractPlate_PromptEntry_C_Update_Prompt::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Update_Prompt, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_InteractPlate_PromptEntry_C_Update_Prompt::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Update_Prompt, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'WBP_InteractPlate_PromptEntry_C_Update_Prompt::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Update_Prompt, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WBP_InteractPlate_PromptEntry_C_Update_Prompt::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Update_Prompt, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000018, "Member 'WBP_InteractPlate_PromptEntry_C_Update_Prompt::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Update_Prompt, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_InteractPlate_PromptEntry_C_Update_Prompt::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_Update_Prompt, CallFunc_GetVisibility_ReturnValue) == 0x000021, "Member 'WBP_InteractPlate_PromptEntry_C_Update_Prompt::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.UpdateCostUI
// 0x0040 (0x0040 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_UpdateCostUI final
{
public:
	EVitalType                                    VitalType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4807[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VitalAmount;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FShopItemAdditionalCost                AdditionalItem;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         NewParam;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4808[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBox*                         Box;                                               // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text;                                              // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI) == 0x000008, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_UpdateCostUI");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI) == 0x000040, "Wrong size on WBP_InteractPlate_PromptEntry_C_UpdateCostUI");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI, VitalType) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_UpdateCostUI::VitalType' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI, VitalAmount) == 0x000004, "Member 'WBP_InteractPlate_PromptEntry_C_UpdateCostUI::VitalAmount' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI, AdditionalItem) == 0x000008, "Member 'WBP_InteractPlate_PromptEntry_C_UpdateCostUI::AdditionalItem' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI, NewParam) == 0x000018, "Member 'WBP_InteractPlate_PromptEntry_C_UpdateCostUI::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI, Box) == 0x000020, "Member 'WBP_InteractPlate_PromptEntry_C_UpdateCostUI::Box' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI, Text) == 0x000028, "Member 'WBP_InteractPlate_PromptEntry_C_UpdateCostUI::Text' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI, Icon) == 0x000030, "Member 'WBP_InteractPlate_PromptEntry_C_UpdateCostUI::Icon' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'WBP_InteractPlate_PromptEntry_C_UpdateCostUI::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000039, "Member 'WBP_InteractPlate_PromptEntry_C_UpdateCostUI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_UpdateCostUI, CallFunc_BooleanOR_ReturnValue) == 0x00003A, "Member 'WBP_InteractPlate_PromptEntry_C_UpdateCostUI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.UpdateTextStylesPerPlatform
// 0x0001 (0x0001 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_UpdateTextStylesPerPlatform final
{
public:
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_PromptEntry_C_UpdateTextStylesPerPlatform) == 0x000001, "Wrong alignment on WBP_InteractPlate_PromptEntry_C_UpdateTextStylesPerPlatform");
static_assert(sizeof(WBP_InteractPlate_PromptEntry_C_UpdateTextStylesPerPlatform) == 0x000001, "Wrong size on WBP_InteractPlate_PromptEntry_C_UpdateTextStylesPerPlatform");
static_assert(offsetof(WBP_InteractPlate_PromptEntry_C_UpdateTextStylesPerPlatform, CallFunc_IsConsole_ReturnValue) == 0x000000, "Member 'WBP_InteractPlate_PromptEntry_C_UpdateTextStylesPerPlatform::CallFunc_IsConsole_ReturnValue' has a wrong offset!");

// Function WBP_InteractPlate_PromptEntry.WBP_InteractPlate_PromptEntry_C.UpdateUI
// 0x0150 (0x0150 - 0x0000)
struct WBP_InteractPlate_PromptEntry_C_UpdateUI final
{
public:
	class FText                                   Param_Name;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Icon;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowIcon;                                          // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVitalType                                    VitalType;                                         // 0x0025(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4809[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VitalCost;                                         // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVitalType                                    Vital2Type;                                        // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_480A[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Vital2Cost;                                        // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowKey;                                           // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_480B[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FShopItemAdditionalCost>        AdditionalCost;                                    // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ShowDisabled;                                      // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTextOverridden;                                  // 0x0049(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
