#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_Notification_Basic_Error

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Template_Notification_Basic_Error.WBP_Template_Notification_Basic_Error_C
// 0x0030 (0x02F0 - 0x02C0)
class UWBP_Template_Notification_Basic_Error_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInThenOut;                                     // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Dot01;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot02;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Description;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Event;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateAndDismiss();
	void ExecuteUbergraph_WBP_Template_Notification_Basic_Error(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class UUMGSequencePlayer* CallFunc_CreatePlayAnimationProxyObject_Result, class UWidgetAnimationPlayCallbackProxy* CallFunc_CreatePlayAnimationProxyObject_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void Finished_D92811094EBDE830D1BEA4885A7CEAE2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Template_Notification_Basic_Error_C">();
	}
	static class UWBP_Template_Notification_Basic_Error_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Template_Notification_Basic_Error_C>();
	}
};
static_assert(alignof(UWBP_Template_Notification_Basic_Error_C) == 0x000008, "Wrong alignment on UWBP_Template_Notification_Basic_Error_C");
static_assert(sizeof(UWBP_Template_Notification_Basic_Error_C) == 0x0002F0, "Wrong size on UWBP_Template_Notification_Basic_Error_C");
static_assert(offsetof(UWBP_Template_Notification_Basic_Error_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Template_Notification_Basic_Error_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Notification_Basic_Error_C, FadeInThenOut) == 0x0002C8, "Member 'UWBP_Template_Notification_Basic_Error_C::FadeInThenOut' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Notification_Basic_Error_C, Dot01) == 0x0002D0, "Member 'UWBP_Template_Notification_Basic_Error_C::Dot01' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Notification_Basic_Error_C, Dot02) == 0x0002D8, "Member 'UWBP_Template_Notification_Basic_Error_C::Dot02' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Notification_Basic_Error_C, NamedSlot_Description) == 0x0002E0, "Member 'UWBP_Template_Notification_Basic_Error_C::NamedSlot_Description' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Notification_Basic_Error_C, Ak_Event) == 0x0002E8, "Member 'UWBP_Template_Notification_Basic_Error_C::Ak_Event' has a wrong offset!");

}

