#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TutorialModal_CM

#include "Basic.hpp"

#include "S6Core_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Struct_PlatformTutorialModal_CM_structs.hpp"


namespace SDK::Params
{

// Function WBP_TutorialModal_CM.WBP_TutorialModal_CM_C.SetBinkMediaPlay
// 0x0010 (0x0010 - 0x0000)
struct WBP_TutorialModal_CM_C_SetBinkMediaPlay final
{
public:
	class UBinkMediaPlayer*                       BinkPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Rewind_ReturnValue;                       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialModal_CM_C_SetBinkMediaPlay) == 0x000008, "Wrong alignment on WBP_TutorialModal_CM_C_SetBinkMediaPlay");
static_assert(sizeof(WBP_TutorialModal_CM_C_SetBinkMediaPlay) == 0x000010, "Wrong size on WBP_TutorialModal_CM_C_SetBinkMediaPlay");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkMediaPlay, BinkPlayer) == 0x000000, "Member 'WBP_TutorialModal_CM_C_SetBinkMediaPlay::BinkPlayer' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkMediaPlay, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_TutorialModal_CM_C_SetBinkMediaPlay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkMediaPlay, CallFunc_Play_ReturnValue) == 0x000009, "Member 'WBP_TutorialModal_CM_C_SetBinkMediaPlay::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkMediaPlay, CallFunc_Rewind_ReturnValue) == 0x00000A, "Member 'WBP_TutorialModal_CM_C_SetBinkMediaPlay::CallFunc_Rewind_ReturnValue' has a wrong offset!");

// Function WBP_TutorialModal_CM.WBP_TutorialModal_CM_C.SetBinkPlayer
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_TutorialModal_CM_C_SetBinkPlayer final
{
public:
	class UBinkMediaPlayer*                       Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<ERedirectsPlatform, class UBinkMediaPlayer*> PlatformBinkPlayer;                                // 0x0008(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TMap<ECommonInputType, class UBinkMediaPlayer*> WindowsInputTypeBinkPlayer;                        // 0x0058(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UBinkMediaPlayer*                       Value;                                             // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D23[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaPlayer*                       CallFunc_Map_Find_Value;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D24[0x5];                                     // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaPlayer*                       CallFunc_Map_Find_Value_1;                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialModal_CM_C_SetBinkPlayer) == 0x000008, "Wrong alignment on WBP_TutorialModal_CM_C_SetBinkPlayer");
static_assert(sizeof(WBP_TutorialModal_CM_C_SetBinkPlayer) == 0x0000E0, "Wrong size on WBP_TutorialModal_CM_C_SetBinkPlayer");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, Target) == 0x000000, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::Target' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, PlatformBinkPlayer) == 0x000008, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::PlatformBinkPlayer' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, WindowsInputTypeBinkPlayer) == 0x000058, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::WindowsInputTypeBinkPlayer' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, Value) == 0x0000A8, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::Value' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000B0, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000B9, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, CallFunc_Map_Find_Value) == 0x0000C0, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, CallFunc_Map_Find_ReturnValue) == 0x0000C8, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, CallFunc_GetPlatformType_ReturnValue) == 0x0000C9, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000CA, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, CallFunc_Map_Find_Value_1) == 0x0000D0, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, CallFunc_Map_Find_ReturnValue_1) == 0x0000D8, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetBinkPlayer, CallFunc_BooleanAND_ReturnValue) == 0x0000D9, "Member 'WBP_TutorialModal_CM_C_SetBinkPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_TutorialModal_CM.WBP_TutorialModal_CM_C.SetImage
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_TutorialModal_CM_C_SetImage final
{
public:
	class UImage*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<ERedirectsPlatform, class UObject*>      PlatformTexture;                                   // 0x0008(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TMap<ECommonInputType, class UObject*>        WindowsInputTypeTexture;                           // 0x0058(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D25[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Map_Find_Value;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D26[0x5];                                     // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Map_Find_Value_1;                         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialModal_CM_C_SetImage) == 0x000008, "Wrong alignment on WBP_TutorialModal_CM_C_SetImage");
static_assert(sizeof(WBP_TutorialModal_CM_C_SetImage) == 0x0000D8, "Wrong size on WBP_TutorialModal_CM_C_SetImage");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, Target) == 0x000000, "Member 'WBP_TutorialModal_CM_C_SetImage::Target' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, PlatformTexture) == 0x000008, "Member 'WBP_TutorialModal_CM_C_SetImage::PlatformTexture' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, WindowsInputTypeTexture) == 0x000058, "Member 'WBP_TutorialModal_CM_C_SetImage::WindowsInputTypeTexture' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000A8, "Member 'WBP_TutorialModal_CM_C_SetImage::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'WBP_TutorialModal_CM_C_SetImage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000B1, "Member 'WBP_TutorialModal_CM_C_SetImage::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, CallFunc_Map_Find_Value) == 0x0000B8, "Member 'WBP_TutorialModal_CM_C_SetImage::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, CallFunc_Map_Find_ReturnValue) == 0x0000C0, "Member 'WBP_TutorialModal_CM_C_SetImage::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, CallFunc_GetPlatformType_ReturnValue) == 0x0000C1, "Member 'WBP_TutorialModal_CM_C_SetImage::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000C2, "Member 'WBP_TutorialModal_CM_C_SetImage::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, CallFunc_Map_Find_Value_1) == 0x0000C8, "Member 'WBP_TutorialModal_CM_C_SetImage::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, CallFunc_Map_Find_ReturnValue_1) == 0x0000D0, "Member 'WBP_TutorialModal_CM_C_SetImage::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImage, CallFunc_BooleanAND_ReturnValue) == 0x0000D1, "Member 'WBP_TutorialModal_CM_C_SetImage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_TutorialModal_CM.WBP_TutorialModal_CM_C.SetImageMaterial
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_TutorialModal_CM_C_SetImageMaterial final
{
public:
	class UImage*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<ERedirectsPlatform, class UMaterial*>    PlatformTexture;                                   // 0x0008(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TMap<ECommonInputType, class UMaterial*>      WindowsInputTypeTexture;                           // 0x0058(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D27[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              CallFunc_Map_Find_Value;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D28[0x5];                                     // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              CallFunc_Map_Find_Value_1;                         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialModal_CM_C_SetImageMaterial) == 0x000008, "Wrong alignment on WBP_TutorialModal_CM_C_SetImageMaterial");
static_assert(sizeof(WBP_TutorialModal_CM_C_SetImageMaterial) == 0x0000D8, "Wrong size on WBP_TutorialModal_CM_C_SetImageMaterial");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, Target) == 0x000000, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::Target' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, PlatformTexture) == 0x000008, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::PlatformTexture' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, WindowsInputTypeTexture) == 0x000058, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::WindowsInputTypeTexture' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000A8, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000B1, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, CallFunc_Map_Find_Value) == 0x0000B8, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, CallFunc_Map_Find_ReturnValue) == 0x0000C0, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, CallFunc_GetPlatformType_ReturnValue) == 0x0000C1, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000C2, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, CallFunc_Map_Find_Value_1) == 0x0000C8, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, CallFunc_Map_Find_ReturnValue_1) == 0x0000D0, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetImageMaterial, CallFunc_BooleanAND_ReturnValue) == 0x0000D1, "Member 'WBP_TutorialModal_CM_C_SetImageMaterial::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_TutorialModal_CM.WBP_TutorialModal_CM_C.SetMediaPlayer
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_TutorialModal_CM_C_SetMediaPlayer final
{
public:
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<ERedirectsPlatform, class UMediaPlayer*> PlatformMediaPlayer;                               // 0x0008(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TMap<ECommonInputType, class UMediaPlayer*>   WindowsInputTypeMediaPlayer;                       // 0x0058(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMediaPlayer*                           Value;                                             // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D29[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaPlayer*                           CallFunc_Map_Find_Value;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2A[0x5];                                     // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaPlayer*                           CallFunc_Map_Find_Value_1;                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialModal_CM_C_SetMediaPlayer) == 0x000008, "Wrong alignment on WBP_TutorialModal_CM_C_SetMediaPlayer");
static_assert(sizeof(WBP_TutorialModal_CM_C_SetMediaPlayer) == 0x0000E0, "Wrong size on WBP_TutorialModal_CM_C_SetMediaPlayer");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, MediaPlayer) == 0x000000, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::MediaPlayer' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, PlatformMediaPlayer) == 0x000008, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::PlatformMediaPlayer' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, WindowsInputTypeMediaPlayer) == 0x000058, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::WindowsInputTypeMediaPlayer' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, Value) == 0x0000A8, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::Value' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000B0, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000B9, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, CallFunc_Map_Find_Value) == 0x0000C0, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, CallFunc_Map_Find_ReturnValue) == 0x0000C8, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, CallFunc_GetPlatformType_ReturnValue) == 0x0000C9, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000CA, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, CallFunc_Map_Find_Value_1) == 0x0000D0, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, CallFunc_Map_Find_ReturnValue_1) == 0x0000D8, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetMediaPlayer, CallFunc_BooleanAND_ReturnValue) == 0x0000D9, "Member 'WBP_TutorialModal_CM_C_SetMediaPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_TutorialModal_CM.WBP_TutorialModal_CM_C.SetRichText
// 0x0120 (0x0120 - 0x0000)
struct WBP_TutorialModal_CM_C_SetRichText final
{
public:
	class URichTextBlock*                         Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<ERedirectsPlatform, class FText>         PlatformRichText;                                  // 0x0008(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TMap<ECommonInputType, class FText>           WindowsInputTypeRichText;                          // 0x0058(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsWindowsPlatform_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2B[0x5];                                     // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            Temp_byte_Variable;                                // 0x00B8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2C[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x00C0(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2D[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value_1;                         // 0x00E0(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2E[0x5];                                     // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value_2;                         // 0x0100(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialModal_CM_C_SetRichText) == 0x000008, "Wrong alignment on WBP_TutorialModal_CM_C_SetRichText");
static_assert(sizeof(WBP_TutorialModal_CM_C_SetRichText) == 0x000120, "Wrong size on WBP_TutorialModal_CM_C_SetRichText");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, Target) == 0x000000, "Member 'WBP_TutorialModal_CM_C_SetRichText::Target' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, PlatformRichText) == 0x000008, "Member 'WBP_TutorialModal_CM_C_SetRichText::PlatformRichText' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, WindowsInputTypeRichText) == 0x000058, "Member 'WBP_TutorialModal_CM_C_SetRichText::WindowsInputTypeRichText' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_IsWindowsPlatform_ReturnValue) == 0x0000A8, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_IsWindowsPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_IsValid_ReturnValue) == 0x0000A9, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_IsConsolePlatform_ReturnValue) == 0x0000AA, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000B0, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, Temp_byte_Variable) == 0x0000B8, "Member 'WBP_TutorialModal_CM_C_SetRichText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000B9, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_Map_Find_Value) == 0x0000C0, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_Map_Find_ReturnValue) == 0x0000D8, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_Map_Find_Value_1) == 0x0000E0, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_Map_Find_ReturnValue_1) == 0x0000F8, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_BooleanAND_ReturnValue) == 0x0000F9, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_GetPlatformType_ReturnValue) == 0x0000FA, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_Map_Find_Value_2) == 0x000100, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetRichText, CallFunc_Map_Find_ReturnValue_2) == 0x000118, "Member 'WBP_TutorialModal_CM_C_SetRichText::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");

// Function WBP_TutorialModal_CM.WBP_TutorialModal_CM_C.SetText
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_TutorialModal_CM_C_SetText final
{
public:
	class UVALUI_TextBlock_Styled*                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<ERedirectsPlatform, class FText>         PlatformText;                                      // 0x0008(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TMap<ECommonInputType, class FText>           WindowsInputTypeText;                              // 0x0058(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2F[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x00B8(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D30[0x5];                                     // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value_1;                         // 0x00D8(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialModal_CM_C_SetText) == 0x000008, "Wrong alignment on WBP_TutorialModal_CM_C_SetText");
static_assert(sizeof(WBP_TutorialModal_CM_C_SetText) == 0x0000F8, "Wrong size on WBP_TutorialModal_CM_C_SetText");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, Target) == 0x000000, "Member 'WBP_TutorialModal_CM_C_SetText::Target' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, PlatformText) == 0x000008, "Member 'WBP_TutorialModal_CM_C_SetText::PlatformText' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, WindowsInputTypeText) == 0x000058, "Member 'WBP_TutorialModal_CM_C_SetText::WindowsInputTypeText' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000A8, "Member 'WBP_TutorialModal_CM_C_SetText::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'WBP_TutorialModal_CM_C_SetText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000B1, "Member 'WBP_TutorialModal_CM_C_SetText::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, CallFunc_Map_Find_Value) == 0x0000B8, "Member 'WBP_TutorialModal_CM_C_SetText::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, CallFunc_Map_Find_ReturnValue) == 0x0000D0, "Member 'WBP_TutorialModal_CM_C_SetText::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, CallFunc_GetPlatformType_ReturnValue) == 0x0000D1, "Member 'WBP_TutorialModal_CM_C_SetText::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000D2, "Member 'WBP_TutorialModal_CM_C_SetText::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, CallFunc_Map_Find_Value_1) == 0x0000D8, "Member 'WBP_TutorialModal_CM_C_SetText::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, CallFunc_Map_Find_ReturnValue_1) == 0x0000F0, "Member 'WBP_TutorialModal_CM_C_SetText::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetText, CallFunc_BooleanAND_ReturnValue) == 0x0000F1, "Member 'WBP_TutorialModal_CM_C_SetText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_TutorialModal_CM.WBP_TutorialModal_CM_C.SetTutorialModalData
// 0x0060 (0x0060 - 0x0000)
struct WBP_TutorialModal_CM_C_SetTutorialModalData final
{
public:
	TArray<struct FStruct_PlatformTutorialModal_CM> Struct_TutorialModalArray;                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D31[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text;                                              // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         RichText;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       BinkPlayer;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayerType;                                   // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       BinkPlayerValue;                                   // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayerValue;                                  // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           CallFunc_SetMediaPlayer_Value;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       CallFunc_SetBinkPlayer_Value;                      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TutorialModal_CM_C_SetTutorialModalData) == 0x000008, "Wrong alignment on WBP_TutorialModal_CM_C_SetTutorialModalData");
static_assert(sizeof(WBP_TutorialModal_CM_C_SetTutorialModalData) == 0x000060, "Wrong size on WBP_TutorialModal_CM_C_SetTutorialModalData");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetTutorialModalData, Struct_TutorialModalArray) == 0x000000, "Member 'WBP_TutorialModal_CM_C_SetTutorialModalData::Struct_TutorialModalArray' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetTutorialModalData, Param_Index) == 0x000010, "Member 'WBP_TutorialModal_CM_C_SetTutorialModalData::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_TutorialModal_CM_C_SetTutorialModalData, Image) == 0x000018, "Member 'WBP_TutorialModal_CM_C_SetTutorialModalData::Image' has a wrong offset!");
