#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VillagerDebugPlate

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_VillagerDebugPlate.WBP_VillagerDebugPlate_C.ExecuteUbergraph_WBP_VillagerDebugPlate
// 0x02F0 (0x02F0 - 0x0000)
struct WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               K2Node_DynamicCast_AsValeria_Player_Controller;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaVillagerCharacter*              K2Node_CustomEvent_Villager;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetVillagerRowNameByConfigId_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0088(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetVillagerCoreIdByVillagerId_ReturnValue; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1C[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0128(0x0050)(HasGetValueTypeHash)
	class FName                                   CallFunc_GetVillagerRowNameByCoreConfigId_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0180(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0198(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0208(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0220(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0238(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0288(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0298(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1D[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorTagComponent*                     CallFunc_GetTagComponent_ReturnValue;              // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1E[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorTagComponent*                     CallFunc_GetTagComponent_ReturnValue_1;            // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate) == 0x000008, "Wrong alignment on WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate");
static_assert(sizeof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate) == 0x0002F0, "Wrong size on WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, EntryPoint) == 0x000000, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_DynamicCast_AsValeria_Player_Controller) == 0x000010, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_DynamicCast_AsValeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_CustomEvent_Villager) == 0x000020, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_CustomEvent_Villager' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_GetVillagerRowNameByConfigId_ReturnValue) == 0x000030, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_GetVillagerRowNameByConfigId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_Conv_NameToText_ReturnValue) == 0x000088, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_MakeArray_Array) == 0x0000F0, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_GetVillagerCoreIdByVillagerId_ReturnValue) == 0x000100, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_GetVillagerCoreIdByVillagerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_Format_ReturnValue) == 0x000108, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000120, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_MakeStruct_FormatArgumentData_2) == 0x000128, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_GetVillagerRowNameByCoreConfigId_ReturnValue) == 0x000178, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_GetVillagerRowNameByCoreConfigId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000180, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_MakeStruct_FormatArgumentData_3) == 0x000198, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_GetObjectName_ReturnValue) == 0x0001E8, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_MakeArray_Array_1) == 0x0001F8, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_Conv_StringToText_ReturnValue) == 0x000208, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_Format_ReturnValue_1) == 0x000220, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_MakeStruct_FormatArgumentData_4) == 0x000238, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_MakeArray_Array_2) == 0x000288, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_Format_ReturnValue_2) == 0x000298, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_IsValid_ReturnValue) == 0x0002B0, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_GetTagComponent_ReturnValue) == 0x0002B8, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_GetTagComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_IsValid_ReturnValue_1) == 0x0002C0, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, CallFunc_GetTagComponent_ReturnValue_1) == 0x0002C8, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::CallFunc_GetTagComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_CreateDelegate_OutputDelegate) == 0x0002D0, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002E0, "Member 'WBP_VillagerDebugPlate_C_ExecuteUbergraph_WBP_VillagerDebugPlate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_VillagerDebugPlate.WBP_VillagerDebugPlate_C.SetVillager
// 0x0008 (0x0008 - 0x0000)
struct WBP_VillagerDebugPlate_C_SetVillager final
{
public:
	class AValeriaVillagerCharacter*              Param_Villager;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerDebugPlate_C_SetVillager) == 0x000008, "Wrong alignment on WBP_VillagerDebugPlate_C_SetVillager");
static_assert(sizeof(WBP_VillagerDebugPlate_C_SetVillager) == 0x000008, "Wrong size on WBP_VillagerDebugPlate_C_SetVillager");
static_assert(offsetof(WBP_VillagerDebugPlate_C_SetVillager, Param_Villager) == 0x000000, "Member 'WBP_VillagerDebugPlate_C_SetVillager::Param_Villager' has a wrong offset!");

// Function WBP_VillagerDebugPlate.WBP_VillagerDebugPlate_C.UpdateTags
// 0x0160 (0x0160 - 0x0000)
struct WBP_VillagerDebugPlate_C_UpdateTags final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SimpleScaledText_C*                CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1F[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorTagComponent*                     CallFunc_GetTagComponent_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D20[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTagEntry                              CallFunc_Array_Get_Item;                           // 0x003C(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D21[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	class UWBP_SimpleScaledText_C*                CallFunc_Array_Get_Item_1;                         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D22[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerDebugPlate_C_UpdateTags) == 0x000008, "Wrong alignment on WBP_VillagerDebugPlate_C_UpdateTags");
static_assert(sizeof(WBP_VillagerDebugPlate_C_UpdateTags) == 0x000160, "Wrong size on WBP_VillagerDebugPlate_C_UpdateTags");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_GetTagComponent_ReturnValue) == 0x000028, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_GetTagComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000030, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Array_Get_Item) == 0x00003C, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000050, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_GetDebugStringFromGameplayTag_ReturnValue) == 0x0000A8, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_GetDebugStringFromGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D0, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, K2Node_MakeArray_Array) == 0x000120, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Array_Get_Item_1) == 0x000130, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Format_ReturnValue) == 0x000138, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_IsValid_ReturnValue_1) == 0x000150, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Array_Length_ReturnValue_1) == 0x000154, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerDebugPlate_C_UpdateTags, CallFunc_Less_IntInt_ReturnValue_1) == 0x000158, "Member 'WBP_VillagerDebugPlate_C_UpdateTags::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

}

