#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cooking_Minigame_Stirring

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.ExecuteUbergraph_WBP_Cooking_Minigame_Stirring
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F5[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           K2Node_CustomEvent_SizeBoxSlot_0;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               K2Node_CustomEvent_SizeBox_CenterArrow_1;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               K2Node_CustomEvent_SizeBox_CenterArrow;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVALUI_Border_Styled*                   K2Node_CustomEvent_SuccessBorder;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0034(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPaused_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F6[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F7[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F8[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_4;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F9[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_5;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FA[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring) == 0x0000D0, "Wrong size on WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, EntryPoint) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, Temp_bool_Variable) == 0x000004, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_GetVisibility_ReturnValue) == 0x000005, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, K2Node_CustomEvent_SizeBoxSlot_0) == 0x000008, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::K2Node_CustomEvent_SizeBoxSlot_0' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, K2Node_CustomEvent_SizeBox_CenterArrow_1) == 0x000010, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::K2Node_CustomEvent_SizeBox_CenterArrow_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, K2Node_CustomEvent_SizeBox_CenterArrow) == 0x000018, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::K2Node_CustomEvent_SizeBox_CenterArrow' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_AkEventGlobal_ReturnValue) == 0x000020, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000024, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, K2Node_CustomEvent_SuccessBorder) == 0x000028, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::K2Node_CustomEvent_SuccessBorder' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_AkEventGlobal_ReturnValue_2) == 0x000030, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, K2Node_Event_MyGeometry) == 0x000034, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, K2Node_Event_InDeltaTime) == 0x00006C, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_IsPaused_ReturnValue) == 0x000070, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_IsPaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_Not_PreBool_ReturnValue) == 0x000071, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, K2Node_CustomEvent_Show) == 0x000072, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_GetRenderOpacity_ReturnValue) == 0x000084, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000088, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_IsPlaying_ReturnValue) == 0x00008A, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_BooleanAND_ReturnValue) == 0x00008B, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_PlayAnimation_ReturnValue) == 0x000090, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_AkEventGlobal_ReturnValue_3) == 0x000098, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_AkEventGlobal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, K2Node_Select_Default) == 0x0000A0, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000A8, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000B0, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_AkEventGlobal_ReturnValue_4) == 0x0000B8, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_AkEventGlobal_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_IsValid_ReturnValue_1) == 0x0000BC, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_AkEventGlobal_ReturnValue_5) == 0x0000C0, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_AkEventGlobal_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000C8, "Member 'WBP_Cooking_Minigame_Stirring_C_ExecuteUbergraph_WBP_Cooking_Minigame_Stirring::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.MinigameOnStateChanged
// 0x0028 (0x0028 - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged final
{
public:
	class UMinigameComponentBase*                 Comp;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EMinigameState                                PrevState;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMinigameState                                NewState;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FB[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FC[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged) == 0x000028, "Wrong size on WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged, Comp) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged::Comp' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged, PrevState) == 0x000008, "Member 'WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged::PrevState' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged, NewState) == 0x000009, "Member 'WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged, CallFunc_AkEventGlobal_ReturnValue) == 0x00000C, "Member 'WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000014, "Member 'WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000020, "Member 'WBP_Cooking_Minigame_Stirring_C_MinigameOnStateChanged::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring final
{
public:
	class USizeBox*                               SizeBox_CenterArrow;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring) == 0x000008, "Wrong size on WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring, SizeBox_CenterArrow) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring::SizeBox_CenterArrow' has a wrong offset!");

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_0
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_0 final
{
public:
	class USizeBox*                               SizeBox_CenterArrow;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_0) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_0");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_0) == 0x000008, "Wrong size on WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_0");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_0, SizeBox_CenterArrow) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_0::SizeBox_CenterArrow' has a wrong offset!");

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_1
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_1 final
{
public:
	class UVALUI_Border_Styled*                   Param_SuccessBorder;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_1) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_1");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_1) == 0x000008, "Wrong size on WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_1");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_1, Param_SuccessBorder) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_SequenceEvent__ENTRYPOINTWBP_Cooking_Minigame_Stirring_1::Param_SuccessBorder' has a wrong offset!");

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.SetCursorPosition
// 0x0040 (0x0040 - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_SetCursorPosition final
{
public:
	double                                        CurrentCompletion;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsButtonHeld_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FD[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPaused_ReturnValue;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FE[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCompletion_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFinishedState_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FF[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_CurrentCompletion_ImplicitCast; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_SetCursorPosition");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition) == 0x000040, "Wrong size on WBP_Cooking_Minigame_Stirring_C_SetCursorPosition");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, CurrentCompletion) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::CurrentCompletion' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, CallFunc_IsButtonHeld_ReturnValue) == 0x000010, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::CallFunc_IsButtonHeld_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000020, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, CallFunc_IsPaused_ReturnValue) == 0x000021, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::CallFunc_IsPaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, CallFunc_AkEventGlobal_ReturnValue) == 0x000024, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, CallFunc_GetCompletion_ReturnValue) == 0x000028, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::CallFunc_GetCompletion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, CallFunc_IsInFinishedState_ReturnValue) == 0x00002C, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::CallFunc_IsInFinishedState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, CallFunc_Not_PreBool_ReturnValue) == 0x00002D, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, K2Node_VariableSet_CurrentCompletion_ImplicitCast) == 0x000030, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::K2Node_VariableSet_CurrentCompletion_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SetCursorPosition, CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast) == 0x000038, "Member 'WBP_Cooking_Minigame_Stirring_C_SetCursorPosition::CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast' has a wrong offset!");

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.Hide ButtonPrompt
// 0x0001 (0x0001 - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_Hide_ButtonPrompt final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_Hide_ButtonPrompt) == 0x000001, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_Hide_ButtonPrompt");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_Hide_ButtonPrompt) == 0x000001, "Wrong size on WBP_Cooking_Minigame_Stirring_C_Hide_ButtonPrompt");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_Hide_ButtonPrompt, Show) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_Hide_ButtonPrompt::Show' has a wrong offset!");

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.SizeBoxSlot_0_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_SizeBoxSlot_0_Event_0 final
{
public:
	class USizeBoxSlot*                           SizeBoxSlot_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_SizeBoxSlot_0_Event_0) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_SizeBoxSlot_0_Event_0");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_SizeBoxSlot_0_Event_0) == 0x000008, "Wrong size on WBP_Cooking_Minigame_Stirring_C_SizeBoxSlot_0_Event_0");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SizeBoxSlot_0_Event_0, SizeBoxSlot_0) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_SizeBoxSlot_0_Event_0::SizeBoxSlot_0' has a wrong offset!");

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.StartStirAudio
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_StartStirAudio final
{
public:
	class USizeBox*                               SizeBox_CenterArrow;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_StartStirAudio) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_StartStirAudio");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_StartStirAudio) == 0x000008, "Wrong size on WBP_Cooking_Minigame_Stirring_C_StartStirAudio");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_StartStirAudio, SizeBox_CenterArrow) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_StartStirAudio::SizeBox_CenterArrow' has a wrong offset!");

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.StopStirAudio
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_StopStirAudio final
{
public:
	class USizeBox*                               SizeBox_CenterArrow;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_StopStirAudio) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_StopStirAudio");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_StopStirAudio) == 0x000008, "Wrong size on WBP_Cooking_Minigame_Stirring_C_StopStirAudio");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_StopStirAudio, SizeBox_CenterArrow) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_StopStirAudio::SizeBox_CenterArrow' has a wrong offset!");

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.SuccessAudio
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_SuccessAudio final
{
public:
	class UVALUI_Border_Styled*                   Param_SuccessBorder;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_SuccessAudio) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_SuccessAudio");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_SuccessAudio) == 0x000008, "Wrong size on WBP_Cooking_Minigame_Stirring_C_SuccessAudio");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_SuccessAudio, Param_SuccessBorder) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_SuccessAudio::Param_SuccessBorder' has a wrong offset!");

// Function WBP_Cooking_Minigame_Stirring.WBP_Cooking_Minigame_Stirring_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Cooking_Minigame_Stirring_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Stirring_C_Tick) == 0x000004, "Wrong alignment on WBP_Cooking_Minigame_Stirring_C_Tick");
static_assert(sizeof(WBP_Cooking_Minigame_Stirring_C_Tick) == 0x00003C, "Wrong size on WBP_Cooking_Minigame_Stirring_C_Tick");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Cooking_Minigame_Stirring_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Stirring_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Cooking_Minigame_Stirring_C_Tick::InDeltaTime' has a wrong offset!");

}

