#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterNameSelection_CM

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "ValeriaUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterNameSelection_CM.WBP_CharacterNameSelection_CM_C.BndEvt__WBP_CharacterNameSelection_CM_BackButton_NameSelection_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_BackButton_NameSelection_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_BackButton_NameSelection_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_BackButton_NameSelection_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_BackButton_NameSelection_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_BackButton_NameSelection_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_BackButton_NameSelection_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_BackButton_NameSelection_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterNameSelection_CM.WBP_CharacterNameSelection_CM_C.BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EVAL_CharacterNameType                        Type;                                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCommit;                                          // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature, Text) == 0x000000, "Member 'WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature, Type) == 0x000018, "Member 'WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature, IsCommit) == 0x000019, "Member 'WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_FullName_K2Node_ComponentBoundEvent_1_OnNameChanged__DelegateSignature::IsCommit' has a wrong offset!");

// Function WBP_CharacterNameSelection_CM.WBP_CharacterNameSelection_CM_C.BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EVAL_CharacterNameType                        Type;                                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCommit;                                          // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature, Text) == 0x000000, "Member 'WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature, Type) == 0x000018, "Member 'WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature, IsCommit) == 0x000019, "Member 'WBP_CharacterNameSelection_CM_C_BndEvt__WBP_CharacterNameSelection_CM_WBP_CharacterNameInput_PreferredName_K2Node_ComponentBoundEvent_2_OnNameChanged__DelegateSignature::IsCommit' has a wrong offset!");

// Function WBP_CharacterNameSelection_CM.WBP_CharacterNameSelection_CM_C.ExecuteUbergraph_WBP_CharacterNameSelection_CM
// 0x0120 (0x0120 - 0x0000)
struct WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55D5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55D6[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55D7[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55D8[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55D9[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x00E0(0x0018)()
	EVAL_CharacterNameType                        K2Node_ComponentBoundEvent_Type_1;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsCommit_1;             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55DA[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0100(0x0018)()
	EVAL_CharacterNameType                        K2Node_ComponentBoundEvent_Type;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsCommit;               // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM) == 0x000008, "Wrong alignment on WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM");
static_assert(sizeof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM) == 0x000120, "Wrong size on WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, EntryPoint) == 0x000000, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000008, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000028, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00002C, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000030, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_object_Variable) == 0x000038, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_real_Variable) == 0x000048, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_real_Variable_1) == 0x000050, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_real_Variable_0) == 0x000058, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_bool_Variable) == 0x000068, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000070, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000090, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000094, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000098, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000A0, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_object_Variable_1) == 0x0000A8, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_real_Variable_2) == 0x0000B0, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_real_Variable_2_0) == 0x0000B8, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_real_Variable_3) == 0x0000C0, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_bool_Variable_1) == 0x0000C8, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, Temp_real_Variable_3_0) == 0x0000D0, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_ComponentBoundEvent_Button) == 0x0000D8, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_ComponentBoundEvent_Text_1) == 0x0000E0, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_ComponentBoundEvent_Type_1) == 0x0000F8, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_ComponentBoundEvent_Type_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_ComponentBoundEvent_IsCommit_1) == 0x0000F9, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_ComponentBoundEvent_IsCommit_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_ComponentBoundEvent_Text) == 0x000100, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_ComponentBoundEvent_Type) == 0x000118, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, K2Node_ComponentBoundEvent_IsCommit) == 0x000119, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::K2Node_ComponentBoundEvent_IsCommit' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM, CallFunc_GetIsEnabled_ReturnValue) == 0x00011A, "Member 'WBP_CharacterNameSelection_CM_C_ExecuteUbergraph_WBP_CharacterNameSelection_CM::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");

// Function WBP_CharacterNameSelection_CM.WBP_CharacterNameSelection_CM_C.InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_CharacterNameSelection_CM.WBP_CharacterNameSelection_CM_C.InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_CharacterNameSelection_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_CharacterNameSelection_CM.WBP_CharacterNameSelection_CM_C.OnFullNameChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_CharacterNameSelection_CM_C_OnFullNameChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EVAL_CharacterNameType                        Type;                                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Commit;                                         // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterNameSelection_CM_C_OnFullNameChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterNameSelection_CM_C_OnFullNameChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterNameSelection_CM_C_OnFullNameChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_CharacterNameSelection_CM_C_OnFullNameChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_OnFullNameChanged__DelegateSignature, Text) == 0x000000, "Member 'WBP_CharacterNameSelection_CM_C_OnFullNameChanged__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_OnFullNameChanged__DelegateSignature, Type) == 0x000018, "Member 'WBP_CharacterNameSelection_CM_C_OnFullNameChanged__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_OnFullNameChanged__DelegateSignature, Is_Commit) == 0x000019, "Member 'WBP_CharacterNameSelection_CM_C_OnFullNameChanged__DelegateSignature::Is_Commit' has a wrong offset!");

// Function WBP_CharacterNameSelection_CM.WBP_CharacterNameSelection_CM_C.OnPreferredNameChaged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_CharacterNameSelection_CM_C_OnPreferredNameChaged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EVAL_CharacterNameType                        Type;                                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Commit;                                         // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterNameSelection_CM_C_OnPreferredNameChaged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterNameSelection_CM_C_OnPreferredNameChaged__DelegateSignature");
static_assert(sizeof(WBP_CharacterNameSelection_CM_C_OnPreferredNameChaged__DelegateSignature) == 0x000020, "Wrong size on WBP_CharacterNameSelection_CM_C_OnPreferredNameChaged__DelegateSignature");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_OnPreferredNameChaged__DelegateSignature, Text) == 0x000000, "Member 'WBP_CharacterNameSelection_CM_C_OnPreferredNameChaged__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_CharacterNameSelection_CM_C_OnPreferredNameChaged__DelegateSignature, Type) == 0x000018, "Member 'WBP_CharacterNameSelection_CM_C_OnPreferredNameChaged__DelegateSignature::Type' has a wrong offset!");
