#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ComboBox_02_CM

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Slate_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C
// 0x00B0 (0x0370 - 0x02C0)
class UWBP_ComboBox_02_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_CM_C*              Button_Expand_CM;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Backer;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DropdownArrow;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_CurrentSelection;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_ContextMenuAnchor_CM_C*   WBP_Template_ContextMenuAnchor_CM;                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedOptionIndex;                               // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_537A[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           TextOptions;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             OnOptionChanged;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> ComboBoxMenu;                                      // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMenuOpened;                                      // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UVALUI_TextBlockStyle*                  TextBlockStyle;                                    // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  TextJustification;                                 // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FilterOutSelectedOption;                           // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseScrollbar;                                      // 0x0342(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_537B[0x5];                                     // 0x0343(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnOptionFocusLost;                                 // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMenuClosed;                                      // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 Menu_Content_Class;                                // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_0_OnMenuContentCreated__DelegateSignature(class UUserWidget* MenuContent);
	void BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_3_OnMenuClose__DelegateSignature(bool bClosedByLostFocus);
	void Construct();
	void ExecuteUbergraph_WBP_ComboBox_02_CM(int32 EntryPoint, int32 K2Node_CustomEvent_Index, class FText K2Node_CustomEvent_Text, class UUserWidget* CallFunc_GetSelfMenu_SelfMenu, class UWBP_ComboBox_Menu_02_CM_Locale_Specific_C* K2Node_DynamicCast_AsWBP_Combo_Box_Menu_02_CM_Locale_Specific, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_2, bool K2Node_Event_IsDesignTime, class FText CallFunc_GetText_ReturnValue, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue, class FText CallFunc_GetText_ReturnValue_1, TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface, bool K2Node_DynamicCast_bSuccess_1, TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_1, bool K2Node_DynamicCast_bSuccess_2, TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_2, bool K2Node_DynamicCast_bSuccess_3, TDelegate<void(bool bIsOpen)> K2Node_CreateDelegate_OutputDelegate, bool K2Node_CustomEvent_bIsOpen, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, class UUserWidget* K2Node_ComponentBoundEvent_MenuContent, TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_3, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsOpen_ReturnValue, bool K2Node_ComponentBoundEvent_bClosedByLostFocus, const struct FFocusEvent& K2Node_Event_InFocusEvent, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue_1, TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_4, bool K2Node_DynamicCast_bSuccess_5, TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_5, bool K2Node_DynamicCast_bSuccess_6, TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_6, bool K2Node_DynamicCast_bSuccess_7, TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_7, bool K2Node_DynamicCast_bSuccess_8, TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_8, bool K2Node_DynamicCast_bSuccess_9, class UWBP_Template_Button_CM_C* CallFunc_GetButtonSelection_Button_Selection, bool CallFunc_EqualEqual_ClassClass_ReturnValue, TDelegate<void(int32 Index, class FText Text)> K2Node_CreateDelegate_OutputDelegate_1, class UUserWidget* CallFunc_GetSelfMenu_SelfMenu_1, class UWBP_ComboBox_Menu_02_CM_C* K2Node_DynamicCast_AsWBP_Combo_Box_Menu_02_CM, bool K2Node_DynamicCast_bSuccess_10, bool CallFunc_EqualEqual_ClassClass_ReturnValue_1);
	void ForceOnClicked();
	void GetCurrentSelectedItem(class FText* Selected_Text, bool CallFunc_Array_IsValidIndex_ReturnValue);
	void HandleOnOptionSelected(int32 Param_Index, class FText Text);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnMenuClosed__DelegateSignature();
	void OnMenuOpenChanged(bool bIsOpen);
	void OnMenuOpened__DelegateSignature();
	void OnOptionChanged__DelegateSignature(int32 Param_Index, class FText Text);
	void OnOptionFocusLost__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetCurrentOptionToIndex(int32 Param_Index, bool CallFunc_Array_IsValidIndex_ReturnValue);
	void SetNavigation(class UUserWidget* ComboBoxMenuWidget, class UWBP_Template_Button_CM_C* ButtonSelection, const TArray<class UWBP_ComboBox_Menu_Option_02_CM_C*>& OptionWidgets, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, class UWBP_ComboBox_Menu_Option_02_CM_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_2, class UWBP_ComboBox_Menu_Option_02_CM_C* CallFunc_Array_Get_Item_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, int32 Temp_int_Array_Index_Variable, bool CallFunc_Array_IsNotEmpty_ReturnValue, class UWBP_ComboBox_Menu_Option_02_CM_C* CallFunc_Array_Get_Item_2, bool CallFunc_BooleanAND_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, class UWBP_ComboBox_Menu_Option_02_CM_C* CallFunc_Array_Get_Item_3, class UUserWidget* CallFunc_GetSelfMenu_SelfMenu, class UWBP_Template_Button_CM_C* CallFunc_GetButtonSelection_Button_Selection, TArray<class UWBP_ComboBox_Menu_Option_02_CM_C*>& CallFunc_GetOptionWidgets_OptionWidgets, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1);
	void SetStyle();
	void SetTextOptions(TArray<class FText>& Text_Options, int32 Selected_Option, bool CallFunc_Array_IsValidIndex_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ComboBox_02_CM_C">();
	}
	static class UWBP_ComboBox_02_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ComboBox_02_CM_C>();
	}
};
static_assert(alignof(UWBP_ComboBox_02_CM_C) == 0x000008, "Wrong alignment on UWBP_ComboBox_02_CM_C");
static_assert(sizeof(UWBP_ComboBox_02_CM_C) == 0x000370, "Wrong size on UWBP_ComboBox_02_CM_C");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ComboBox_02_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, Button_Expand_CM) == 0x0002C8, "Member 'UWBP_ComboBox_02_CM_C::Button_Expand_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, Image_Backer) == 0x0002D0, "Member 'UWBP_ComboBox_02_CM_C::Image_Backer' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, Image_DropdownArrow) == 0x0002D8, "Member 'UWBP_ComboBox_02_CM_C::Image_DropdownArrow' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, TextBlock_CurrentSelection) == 0x0002E0, "Member 'UWBP_ComboBox_02_CM_C::TextBlock_CurrentSelection' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, WBP_Template_ContextMenuAnchor_CM) == 0x0002E8, "Member 'UWBP_ComboBox_02_CM_C::WBP_Template_ContextMenuAnchor_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, SelectedOptionIndex) == 0x0002F0, "Member 'UWBP_ComboBox_02_CM_C::SelectedOptionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, TextOptions) == 0x0002F8, "Member 'UWBP_ComboBox_02_CM_C::TextOptions' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, OnOptionChanged) == 0x000308, "Member 'UWBP_ComboBox_02_CM_C::OnOptionChanged' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, ComboBoxMenu) == 0x000318, "Member 'UWBP_ComboBox_02_CM_C::ComboBoxMenu' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, OnMenuOpened) == 0x000328, "Member 'UWBP_ComboBox_02_CM_C::OnMenuOpened' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, TextBlockStyle) == 0x000338, "Member 'UWBP_ComboBox_02_CM_C::TextBlockStyle' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, TextJustification) == 0x000340, "Member 'UWBP_ComboBox_02_CM_C::TextJustification' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, FilterOutSelectedOption) == 0x000341, "Member 'UWBP_ComboBox_02_CM_C::FilterOutSelectedOption' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, UseScrollbar) == 0x000342, "Member 'UWBP_ComboBox_02_CM_C::UseScrollbar' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, OnOptionFocusLost) == 0x000348, "Member 'UWBP_ComboBox_02_CM_C::OnOptionFocusLost' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, OnMenuClosed) == 0x000358, "Member 'UWBP_ComboBox_02_CM_C::OnMenuClosed' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_02_CM_C, Menu_Content_Class) == 0x000368, "Member 'UWBP_ComboBox_02_CM_C::Menu_Content_Class' has a wrong offset!");

}

