#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuestTracker

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_QuestTracker.WBP_QuestTracker_C.ExecuteUbergraph_WBP_QuestTracker
// 0x0040 (0x0040 - 0x0000)
struct WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D6E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaPlayerController* Vpc, class AValeriaCharacter* Ctxt)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D6F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker) == 0x000008, "Wrong alignment on WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker");
static_assert(sizeof(WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker) == 0x000040, "Wrong size on WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker");
static_assert(offsetof(WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker, EntryPoint) == 0x000000, "Member 'WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker, CallFunc_GetValeriaPlayerController_OutResult) == 0x000004, "Member 'WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000008, "Member 'WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000028, "Member 'WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000030, "Member 'WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker, CallFunc_CanStartTutorialForFlag_ReturnValue) == 0x000038, "Member 'WBP_QuestTracker_C_ExecuteUbergraph_WBP_QuestTracker::CallFunc_CanStartTutorialForFlag_ReturnValue' has a wrong offset!");

// Function WBP_QuestTracker.WBP_QuestTracker_C.HandleCharacterSpawned
// 0x0010 (0x0010 - 0x0000)
struct WBP_QuestTracker_C_HandleCharacterSpawned final
{
public:
	class AValeriaPlayerController*               Vpc;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      Ctxt;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestTracker_C_HandleCharacterSpawned) == 0x000008, "Wrong alignment on WBP_QuestTracker_C_HandleCharacterSpawned");
static_assert(sizeof(WBP_QuestTracker_C_HandleCharacterSpawned) == 0x000010, "Wrong size on WBP_QuestTracker_C_HandleCharacterSpawned");
static_assert(offsetof(WBP_QuestTracker_C_HandleCharacterSpawned, Vpc) == 0x000000, "Member 'WBP_QuestTracker_C_HandleCharacterSpawned::Vpc' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleCharacterSpawned, Ctxt) == 0x000008, "Member 'WBP_QuestTracker_C_HandleCharacterSpawned::Ctxt' has a wrong offset!");

// Function WBP_QuestTracker.WBP_QuestTracker_C.HandleQuestChanged
// 0x0110 (0x0110 - 0x0000)
struct WBP_QuestTracker_C_HandleQuestChanged final
{
public:
	class UQuestProgressComponent*                QuestProgress;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D70[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVAL_QuestState>                CallFunc_GetAllActiveQuests_ReturnValue;           // 0x0010(0x0010)(ReferenceParm)
	TArray<struct FVAL_QuestState>                CallFunc_SortMainQuestsToBeginning_ReturnValue;    // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D71[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_QuestState                        CallFunc_Array_Get_Item;                           // 0x0040(0x0098)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D72[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D73[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumEntries_ReturnValue;                // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D74[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_BP_CreateEntry_ReturnValue;               // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D75[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PinnedQuest_C*                     K2Node_DynamicCast_AsWBP_Pinned_Quest;             // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestTracker_C_HandleQuestChanged) == 0x000008, "Wrong alignment on WBP_QuestTracker_C_HandleQuestChanged");
static_assert(sizeof(WBP_QuestTracker_C_HandleQuestChanged) == 0x000110, "Wrong size on WBP_QuestTracker_C_HandleQuestChanged");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, QuestProgress) == 0x000000, "Member 'WBP_QuestTracker_C_HandleQuestChanged::QuestProgress' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, Temp_byte_Variable) == 0x000008, "Member 'WBP_QuestTracker_C_HandleQuestChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, CallFunc_GetAllActiveQuests_ReturnValue) == 0x000010, "Member 'WBP_QuestTracker_C_HandleQuestChanged::CallFunc_GetAllActiveQuests_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, CallFunc_SortMainQuestsToBeginning_ReturnValue) == 0x000020, "Member 'WBP_QuestTracker_C_HandleQuestChanged::CallFunc_SortMainQuestsToBeginning_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_QuestTracker_C_HandleQuestChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WBP_QuestTracker_C_HandleQuestChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WBP_QuestTracker_C_HandleQuestChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_QuestTracker_C_HandleQuestChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_QuestTracker_C_HandleQuestChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, CallFunc_Add_IntInt_ReturnValue) == 0x0000DC, "Member 'WBP_QuestTracker_C_HandleQuestChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, Temp_byte_Variable_1) == 0x0000E0, "Member 'WBP_QuestTracker_C_HandleQuestChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, CallFunc_GetNumEntries_ReturnValue) == 0x0000E4, "Member 'WBP_QuestTracker_C_HandleQuestChanged::CallFunc_GetNumEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, Temp_bool_Variable) == 0x0000E8, "Member 'WBP_QuestTracker_C_HandleQuestChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E9, "Member 'WBP_QuestTracker_C_HandleQuestChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, CallFunc_BP_CreateEntry_ReturnValue) == 0x0000F0, "Member 'WBP_QuestTracker_C_HandleQuestChanged::CallFunc_BP_CreateEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, K2Node_Select_Default) == 0x0000F8, "Member 'WBP_QuestTracker_C_HandleQuestChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, K2Node_DynamicCast_AsWBP_Pinned_Quest) == 0x000100, "Member 'WBP_QuestTracker_C_HandleQuestChanged::K2Node_DynamicCast_AsWBP_Pinned_Quest' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_HandleQuestChanged, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'WBP_QuestTracker_C_HandleQuestChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_QuestTracker.WBP_QuestTracker_C.InitializeFromCharacter
// 0x0030 (0x0030 - 0x0000)
struct WBP_QuestTracker_C_InitializeFromCharacter final
{
public:
	TDelegate<void(class UQuestProgressComponent* QuestProgress)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D76[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D77[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestProgressComponent*                CallFunc_GetQuestProgress_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestTracker_C_InitializeFromCharacter) == 0x000008, "Wrong alignment on WBP_QuestTracker_C_InitializeFromCharacter");
static_assert(sizeof(WBP_QuestTracker_C_InitializeFromCharacter) == 0x000030, "Wrong size on WBP_QuestTracker_C_InitializeFromCharacter");
static_assert(offsetof(WBP_QuestTracker_C_InitializeFromCharacter, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_QuestTracker_C_InitializeFromCharacter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_InitializeFromCharacter, CallFunc_GetValeriaCharacter_OutResult) == 0x000010, "Member 'WBP_QuestTracker_C_InitializeFromCharacter::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_InitializeFromCharacter, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000018, "Member 'WBP_QuestTracker_C_InitializeFromCharacter::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_InitializeFromCharacter, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'WBP_QuestTracker_C_InitializeFromCharacter::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_InitializeFromCharacter, CallFunc_GetQuestProgress_ReturnValue) == 0x000028, "Member 'WBP_QuestTracker_C_InitializeFromCharacter::CallFunc_GetQuestProgress_ReturnValue' has a wrong offset!");

// Function WBP_QuestTracker.WBP_QuestTracker_C.On_MenuAnchor_Popin_GetMenuContent
// 0x0060 (0x0060 - 0x0000)
struct WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopinCalloutWidget_C*              MenuContent;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D78[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FTUEPopin_CM_C*                    CallFunc_Redirect_FTUEPopin_Type_FTUEPopin;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D79[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopinCalloutWidget_C*              CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent) == 0x000008, "Wrong alignment on WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent");
static_assert(sizeof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent) == 0x000060, "Wrong size on WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent");
static_assert(offsetof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent, ReturnValue) == 0x000000, "Member 'WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent, MenuContent) == 0x000008, "Member 'WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent::MenuContent' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000018, "Member 'WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent, K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM) == 0x000020, "Member 'WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent::K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent, CallFunc_Redirect_FTUEPopin_Type_FTUEPopin) == 0x000038, "Member 'WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent::CallFunc_Redirect_FTUEPopin_Type_FTUEPopin' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent, CallFunc_SetContent_ReturnValue) == 0x000040, "Member 'WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent::CallFunc_SetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_QuestTracker_C_On_MenuAnchor_Popin_GetMenuContent::CallFunc_Create_ReturnValue' has a wrong offset!");

}

