#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TileEntry_CosmeticThumbnail_CM

#include "Basic.hpp"

#include "S6Core_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB1[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB2[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DB3[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0068(0x0078)(ConstParm)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListItemSelected_ReturnValue;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB4[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB5[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_1;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB6[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Map_Find_Value;                           // 0x0120(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB7[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_2;          // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_1; // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB8[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB9[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CosmeticItemTooltip_C*             CallFunc_Create_ReturnValue;                       // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_3;          // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_2; // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DBA[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM) == 0x0001D0, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, EntryPoint) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_GetPureConsoleVariableBoolValue_ReturnValue) == 0x000004, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_GetPureConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_GetOwningListView_ReturnValue) == 0x000008, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_DynamicCast_AsList_View) == 0x000010, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_GetListItemObject_ReturnValue) == 0x000020, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000028, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_Event_MyGeometry) == 0x00002C, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_Event_MouseEvent) == 0x000068, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_Event_ListItemObject) == 0x0000E0, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_IsListItemSelected_ReturnValue) == 0x0000E8, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_IsListItemSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_Event_bIsSelected) == 0x0000E9, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000F0, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_Event_bIsExpanded) == 0x0000F8, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_GetListItemObject_ReturnValue_1) == 0x000100, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_GetListItemObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_CustomEvent_Loaded) == 0x000108, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item) == 0x000110, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_Map_Find_Value) == 0x000120, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_Map_Find_ReturnValue) == 0x000148, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000149, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_GetListItemObject_ReturnValue_2) == 0x000150, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_GetListItemObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_1) == 0x000158, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_DynamicCast_bSuccess_2) == 0x000160, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000164, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x000178, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_Create_ReturnValue) == 0x000180, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_GetListItemObject_ReturnValue_3) == 0x000188, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_GetListItemObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_2) == 0x000190, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_DynamicCast_bSuccess_3) == 0x000198, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_ComponentBoundEvent_Button_2) == 0x0001A0, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_ComponentBoundEvent_Button_1) == 0x0001A8, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_ComponentBoundEvent_Button) == 0x0001B0, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, Temp_object_Variable) == 0x0001B8, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_DynamicCast_AsTexture_2D) == 0x0001C0, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, K2Node_DynamicCast_bSuccess_4) == 0x0001C8, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_IsValid_ReturnValue) == 0x0001C9, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM, CallFunc_BooleanOR_ReturnValue) == 0x0001CA, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.Get Customization Panel
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel final
{
public:
	class UWBP_CharacterCustomizationPanel_CM_C*  Character_Customization_Panel_CM;                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DBB[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ValeriaPlayerController_C*          K2Node_DynamicCast_AsBP_Valeria_Player_Controller; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DBC[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GameplayUIManager_C*               K2Node_DynamicCast_AsWBP_Gameplay_UIManager;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DBD[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomizationScreen_CM_C* K2Node_DynamicCast_AsWBP_Character_Customization_Screen_CM; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DBE[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PreGameHUD_CM_C*                   K2Node_DynamicCast_AsWBP_Pre_Game_HUD_CM;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DBF[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PregameHUD_PF_C*                   K2Node_DynamicCast_AsWBP_Pregame_HUD_PF;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC0[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomizationPanel_CM_C*  K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC1[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomizationPanel_CM_C*  K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM_1; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel) == 0x0000A8, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, Character_Customization_Panel_CM) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::Character_Customization_Panel_CM' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, CallFunc_GetValeriaPlayerController_OutResult) == 0x000008, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000010, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_AsBP_Valeria_Player_Controller) == 0x000020, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_AsBP_Valeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000030, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Gameplay_UIManager) == 0x000038, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Gameplay_UIManager' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_SwitchEnum_CmpSuccess) == 0x000041, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, CallFunc_GetPlatformType_ReturnValue) == 0x000042, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, CallFunc_IsValid_ReturnValue) == 0x000043, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_SwitchEnum_CmpSuccess_1) == 0x000044, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Character_Customization_Screen_CM) == 0x000048, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Character_Customization_Screen_CM' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000058, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, CallFunc_GetUIManagerWidget_ReturnValue_1) == 0x000060, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::CallFunc_GetUIManagerWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Pre_Game_HUD_CM) == 0x000068, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Pre_Game_HUD_CM' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Pregame_HUD_PF) == 0x000078, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Pregame_HUD_PF' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_4) == 0x000080, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM) == 0x000088, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_5) == 0x000090, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM_1) == 0x000098, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM_1' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel, K2Node_DynamicCast_bSuccess_6) == 0x0000A0, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_Get_Customization_Panel::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.GetItemId
// 0x0038 (0x0038 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId final
{
public:
	struct FGuid                                  Item_Id;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_MakeStruct_Guid;                            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId) == 0x000038, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId, Item_Id) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId::Item_Id' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId, K2Node_MakeStruct_Guid) == 0x000010, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId::K2Node_MakeStruct_Guid' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId, CallFunc_GetListItemObject_ReturnValue) == 0x000020, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId, K2Node_DynamicCast_AsTile_Item_Character_Customization_Item) == 0x000028, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId::K2Node_DynamicCast_AsTile_Item_Character_Customization_Item' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_GetItemId::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.HandleItemSelectionChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_HandleItemSelectionChanged final
{
public:
	bool                                          Param_Selected;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_HandleItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_HandleItemSelectionChanged");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_HandleItemSelectionChanged) == 0x000002, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_HandleItemSelectionChanged");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_HandleItemSelectionChanged, Param_Selected) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_HandleItemSelectionChanged::Param_Selected' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_HandleItemSelectionChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_HandleItemSelectionChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.IsNew
// 0x0002 (0x0002 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_IsNew final
{
public:
	bool                                          New;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_IsNew) == 0x000001, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_IsNew");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_IsNew) == 0x000002, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_IsNew");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_IsNew, New) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_IsNew::New' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_IsNew, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_IsNew::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.OnItemFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_OnItemFocused__DelegateSignature final
{
public:
	class UWBP_TileEntry_CosmeticThumbnail_CM_C*  Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnItemFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_OnItemFocused__DelegateSignature");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnItemFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_OnItemFocused__DelegateSignature");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnItemFocused__DelegateSignature, Widget) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_OnItemFocused__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_OnListItemObjectSet");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_OnListItemObjectSet");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.OnLoaded_E0DBD5684B6A64E6F2859398991C9071
// 0x0008 (0x0008 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_OnLoaded_E0DBD5684B6A64E6F2859398991C9071 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnLoaded_E0DBD5684B6A64E6F2859398991C9071) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_OnLoaded_E0DBD5684B6A64E6F2859398991C9071");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnLoaded_E0DBD5684B6A64E6F2859398991C9071) == 0x000008, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_OnLoaded_E0DBD5684B6A64E6F2859398991C9071");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnLoaded_E0DBD5684B6A64E6F2859398991C9071, Loaded) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_OnLoaded_E0DBD5684B6A64E6F2859398991C9071::Loaded' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_OnMouseEnter");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_OnMouseEnter");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.SeeNew
// 0x0028 (0x0028 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew final
{
public:
	struct FGuid                                  CallFunc_GetItemId_Item_Id;                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC2[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNew_New;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew) == 0x000008, "Wrong alignment on WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew");
static_assert(sizeof(WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew) == 0x000028, "Wrong size on WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew, CallFunc_GetItemId_Item_Id) == 0x000000, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew::CallFunc_GetItemId_Item_Id' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew, CallFunc_GetValeriaPlayerController_OutResult) == 0x000010, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000018, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew, CallFunc_IsValid_Guid_ReturnValue) == 0x000020, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew, CallFunc_IsNew_New) == 0x000022, "Member 'WBP_TileEntry_CosmeticThumbnail_CM_C_SeeNew::CallFunc_IsNew_New' has a wrong offset!");

// Function WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C.SetHovered
// 0x0040 (0x0040 - 0x0000)
struct WBP_TileEntry_CosmeticThumbnail_CM_C_SetHovered final
{
public:
	bool                                          bHorvered;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC3[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC4[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC5[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
