#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RequestItemPicker_CM

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "BP_RadioSliderPregisteredElement_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_RequestItemPicker_CM.WBP_RequestItemPicker_CM_C.BndEvt__WBP_RequestItemPicker_CM_WBP_RadioSlider_CategoryFilters_1_K2Node_ComponentBoundEvent_6_OnSliderMoved__DelegateSignature
// 0x0060 (0x0060 - 0x0000)
struct WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_CM_WBP_RadioSlider_CategoryFilters_1_K2Node_ComponentBoundEvent_6_OnSliderMoved__DelegateSignature final
{
public:
	class UUserWidget*                            ElementWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBP_RadioSliderPregisteredElement      ElementData;                                       // 0x0008(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_CM_WBP_RadioSlider_CategoryFilters_1_K2Node_ComponentBoundEvent_6_OnSliderMoved__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_CM_WBP_RadioSlider_CategoryFilters_1_K2Node_ComponentBoundEvent_6_OnSliderMoved__DelegateSignature");
static_assert(sizeof(WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_CM_WBP_RadioSlider_CategoryFilters_1_K2Node_ComponentBoundEvent_6_OnSliderMoved__DelegateSignature) == 0x000060, "Wrong size on WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_CM_WBP_RadioSlider_CategoryFilters_1_K2Node_ComponentBoundEvent_6_OnSliderMoved__DelegateSignature");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_CM_WBP_RadioSlider_CategoryFilters_1_K2Node_ComponentBoundEvent_6_OnSliderMoved__DelegateSignature, ElementWidget) == 0x000000, "Member 'WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_CM_WBP_RadioSlider_CategoryFilters_1_K2Node_ComponentBoundEvent_6_OnSliderMoved__DelegateSignature::ElementWidget' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_CM_WBP_RadioSlider_CategoryFilters_1_K2Node_ComponentBoundEvent_6_OnSliderMoved__DelegateSignature, ElementData) == 0x000008, "Member 'WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_CM_WBP_RadioSlider_CategoryFilters_1_K2Node_ComponentBoundEvent_6_OnSliderMoved__DelegateSignature::ElementData' has a wrong offset!");

// Function WBP_RequestItemPicker_CM.WBP_RequestItemPicker_CM_C.BndEvt__WBP_RequestItemPicker_TileView_ItemTypes_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_TileView_ItemTypes_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_TileView_ItemTypes_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_TileView_ItemTypes_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_TileView_ItemTypes_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_TileView_ItemTypes_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_TileView_ItemTypes_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_TileView_ItemTypes_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_TileView_ItemTypes_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_RequestItemPicker_CM_C_BndEvt__WBP_RequestItemPicker_TileView_ItemTypes_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_RequestItemPicker_CM.WBP_RequestItemPicker_CM_C.ExecuteUbergraph_WBP_RequestItemPicker_CM
// 0x03E0 (0x03E0 - 0x0000)
struct WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWindowsPlatform_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x0018(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5750[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5751[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0080(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x00A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5752[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5753[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4_0;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x00E8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0110(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5754[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5755[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0150(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0178(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5756[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5757[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_8_0;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x01B8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x01E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_4;                            // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10;                             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9_0;                            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10_0;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11;                             // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_12;                             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_5;                            // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListItem_RequestableItemType_C*        K2Node_DynamicCast_AsList_Item_Requestable_Item_Type; // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5758[0x3];                                     // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5759[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_575A[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_575B[0x6];                                     // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_575C[0x3];                                     // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x027C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Item_Selected_Item_Selected;           // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_575D[0x3];                                     // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_6;                            // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue_1;         // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition_1;       // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_575E[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListItem_RequestableItemType_C*        K2Node_DynamicCast_AsList_Item_Requestable_Item_Type_1; // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Item_Allowed_For_Request_Item_Allowed; // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x02BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_575F[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_EncyclopediaManagerComponent*      CallFunc_GetEncyclopediaManagerComponent_ReturnValue; // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5760[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_ElementWidget;          // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBP_RadioSliderPregisteredElement      K2Node_ComponentBoundEvent_ElementData;            // 0x02E8(0x0058)(ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0340(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5761[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x0358(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0380(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_12_0;                           // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_4; // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5762[0x2];                                     // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult_1;   // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5763[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue_1; // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5764[0x2];                                     // 0x03CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_InScrollOffset_ImplicitCast; // 0x03D8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM) == 0x000008, "Wrong alignment on WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM");
static_assert(sizeof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM) == 0x0003E0, "Wrong size on WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, EntryPoint) == 0x000000, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_IsWindowsPlatform_ReturnValue) == 0x000004, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_IsWindowsPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable) == 0x000008, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_bool_Variable) == 0x000010, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ActionValue_4) == 0x000018, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ActionValue_4' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_4) == 0x000038, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_4' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_4) == 0x00003C, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_4' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_SourceAction_4) == 0x000040, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_SourceAction_4' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_object_Variable) == 0x000048, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000050, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_1) == 0x000058, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_2) == 0x000060, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_1_0) == 0x000068, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_2_0) == 0x000070, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_bool_Variable_1) == 0x000078, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ActionValue_3) == 0x000080, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ActionValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_3) == 0x0000A0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_3) == 0x0000A4, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_SourceAction_3) == 0x0000A8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_SourceAction_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000B0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_object_Variable_1) == 0x0000B8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_3) == 0x0000C0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_3_0) == 0x0000C8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_4) == 0x0000D0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_bool_Variable_2) == 0x0000D8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_4_0) == 0x0000E0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x0000E8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000108, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x00010C, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x000110, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_object_Variable_2) == 0x000118, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_2) == 0x000120, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_5) == 0x000128, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_6) == 0x000130, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_5_0) == 0x000138, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_5_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_6_0) == 0x000140, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_6_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_bool_Variable_3) == 0x000148, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000150, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000170, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000174, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000178, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_3) == 0x000180, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_object_Variable_3) == 0x000188, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_7) == 0x000190, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_7_0) == 0x000198, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_7_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_8) == 0x0001A0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_bool_Variable_4) == 0x0001A8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_8_0) == 0x0001B0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_8_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x0001B8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x0001D8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x0001DC, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0001E0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_object_Variable_4) == 0x0001E8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x0001F0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_9) == 0x0001F8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_10) == 0x000200, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_9_0) == 0x000208, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_9_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_10_0) == 0x000210, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_10_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_11) == 0x000218, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_12) == 0x000220, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000228, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_object_Variable_5) == 0x000230, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_DynamicCast_AsList_Item_Requestable_Item_Type) == 0x000238, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_DynamicCast_AsList_Item_Requestable_Item_Type' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000244, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000248, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000250, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x000258, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000260, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_DynamicCast_bSuccess_1) == 0x000268, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_IsValid_ReturnValue) == 0x000269, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_ComponentBoundEvent_Item) == 0x000270, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_ComponentBoundEvent_bIsSelected) == 0x000278, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_CreateDelegate_OutputDelegate) == 0x00027C, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_Is_Item_Selected_Item_Selected) == 0x00028C, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_Is_Item_Selected_Item_Selected' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_object_Variable_6) == 0x000290, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_BP_GetSelectedItem_ReturnValue_1) == 0x000298, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_BP_GetSelectedItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_DynamicCast_AsItem_Type_Definition_1) == 0x0002A0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_DynamicCast_AsItem_Type_Definition_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_DynamicCast_bSuccess_2) == 0x0002A8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_DynamicCast_AsList_Item_Requestable_Item_Type_1) == 0x0002B0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_DynamicCast_AsList_Item_Requestable_Item_Type_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_DynamicCast_bSuccess_3) == 0x0002B8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_Is_Item_Allowed_For_Request_Item_Allowed) == 0x0002B9, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_Is_Item_Allowed_For_Request_Item_Allowed' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_BooleanAND_ReturnValue) == 0x0002BA, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_GetValeriaPlayerController_OutResult) == 0x0002BB, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x0002C0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_GetEncyclopediaManagerComponent_ReturnValue) == 0x0002C8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_GetEncyclopediaManagerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_SwitchEnum_CmpSuccess) == 0x0002D0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_CustomEvent_Loaded) == 0x0002D8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_ComponentBoundEvent_ElementWidget) == 0x0002E0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_ComponentBoundEvent_ElementWidget' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_ComponentBoundEvent_ElementData) == 0x0002E8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_ComponentBoundEvent_ElementData' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000340, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_IsVisible_ReturnValue) == 0x000350, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ActionValue_5) == 0x000358, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ActionValue_5' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_5) == 0x000378, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_5' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_5) == 0x00037C, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_5' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_EnhancedInputActionEvent_SourceAction_5) == 0x000380, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_EnhancedInputActionEvent_SourceAction_5' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_12_0) == 0x000388, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_12_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, Temp_real_Variable_0) == 0x000390, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_4) == 0x000398, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_IsVisible_ReturnValue_1) == 0x000399, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_GetScrollOffset_ReturnValue) == 0x00039C, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_GetValeriaPlayerController_OutResult_1) == 0x0003A0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_GetValeriaPlayerController_OutResult_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_GetValeriaPlayerController_ReturnValue_1) == 0x0003A8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_GetValeriaPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0003B0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x0003B8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0003C0, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_CanStartTutorialForFlag_ReturnValue) == 0x0003C8, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_CanStartTutorialForFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, K2Node_SwitchEnum_CmpSuccess_1) == 0x0003C9, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM, CallFunc_GetIndexForItem_ReturnValue) == 0x0003CC, "Member 'WBP_RequestItemPicker_CM_C_ExecuteUbergraph_WBP_RequestItemPicker_CM::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
