#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterRespecConfirmation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterRespecConfirmation.WBP_CharacterRespecConfirmation_C
// 0x0038 (0x0590 - 0x0558)
class UWBP_CharacterRespecConfirmation_C final : public UVALUI_ModalWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                TextBlock_WeeklyReset;                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_PopupSecondary_02_CM_C*   WBP_Template_PopupSecondary_02_CM;                 // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnConfirm;                                         // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCancel;                                          // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_CharacterRespecConfirmation_WBP_Template_PopupSecondary_02_CM_K2Node_ComponentBoundEvent_0_Confirm__DelegateSignature();
	void BndEvt__WBP_CharacterRespecConfirmation_WBP_Template_PopupSecondary_02_CM_K2Node_ComponentBoundEvent_1_Cancel__DelegateSignature();
	void CloseSelf(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue);
	void ExecuteUbergraph_WBP_CharacterRespecConfirmation(int32 EntryPoint, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, class UInputAction* Temp_object_Variable, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, double Temp_real_Variable, double Temp_real_Variable_1, double Temp_real_Variable_0, double Temp_real_Variable_1_0, bool Temp_bool_Variable, bool K2Node_Event_IsDesignTime, class FText CallFunc_GetServerResetText_Result);
	void GetServerResetText(class FText* Result, const struct FDateTime& CallFunc_GetS6WeeklyResetTime_ReturnValue, class FText CallFunc_AsTimeZoneDate_DateTime_ReturnValue, class FText CallFunc_GetText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue);
	void InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void OnCancel__DelegateSignature();
	void OnConfirm__DelegateSignature();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterRespecConfirmation_C">();
	}
	static class UWBP_CharacterRespecConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterRespecConfirmation_C>();
	}
};
static_assert(alignof(UWBP_CharacterRespecConfirmation_C) == 0x000008, "Wrong alignment on UWBP_CharacterRespecConfirmation_C");
static_assert(sizeof(UWBP_CharacterRespecConfirmation_C) == 0x000590, "Wrong size on UWBP_CharacterRespecConfirmation_C");
static_assert(offsetof(UWBP_CharacterRespecConfirmation_C, UberGraphFrame) == 0x000558, "Member 'UWBP_CharacterRespecConfirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRespecConfirmation_C, TextBlock_WeeklyReset) == 0x000560, "Member 'UWBP_CharacterRespecConfirmation_C::TextBlock_WeeklyReset' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRespecConfirmation_C, WBP_Template_PopupSecondary_02_CM) == 0x000568, "Member 'UWBP_CharacterRespecConfirmation_C::WBP_Template_PopupSecondary_02_CM' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRespecConfirmation_C, OnConfirm) == 0x000570, "Member 'UWBP_CharacterRespecConfirmation_C::OnConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRespecConfirmation_C, OnCancel) == 0x000580, "Member 'UWBP_CharacterRespecConfirmation_C::OnCancel' has a wrong offset!");

}

