#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCustomizationScreen_CM

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"
#include "ValeriaDTOs_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterCustomizationScreen_CM.WBP_CharacterCustomizationScreen_CM_C.BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterCustomizationScreen_CM.WBP_CharacterCustomizationScreen_CM_C.BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_7_OnLoadoutUpdated__DelegateSignature
// 0x0068 (0x0068 - 0x0000)
struct WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_7_OnLoadoutUpdated__DelegateSignature final
{
public:
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload Context_Payload;                                   // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_7_OnLoadoutUpdated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_7_OnLoadoutUpdated__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_7_OnLoadoutUpdated__DelegateSignature) == 0x000068, "Wrong size on WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_7_OnLoadoutUpdated__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_7_OnLoadoutUpdated__DelegateSignature, Context_Payload) == 0x000000, "Member 'WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_7_OnLoadoutUpdated__DelegateSignature::Context_Payload' has a wrong offset!");

// Function WBP_CharacterCustomizationScreen_CM.WBP_CharacterCustomizationScreen_CM_C.BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_8_OnPrimaryTabSelectionChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_8_OnPrimaryTabSelectionChanged__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_8_OnPrimaryTabSelectionChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_8_OnPrimaryTabSelectionChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_8_OnPrimaryTabSelectionChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_8_OnPrimaryTabSelectionChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_8_OnPrimaryTabSelectionChanged__DelegateSignature, TabId) == 0x000000, "Member 'WBP_CharacterCustomizationScreen_CM_C_BndEvt__WBP_CharacterCustomizationScreen_CM_WBP_CharacterCustomizationPanel_CM_K2Node_ComponentBoundEvent_8_OnPrimaryTabSelectionChanged__DelegateSignature::TabId' has a wrong offset!");

// Function WBP_CharacterCustomizationScreen_CM.WBP_CharacterCustomizationScreen_CM_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterCustomizationScreen_CM_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationScreen_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_CharacterCustomizationScreen_CM_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_CharacterCustomizationScreen_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_CharacterCustomizationScreen_CM_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_CharacterCustomizationScreen_CM_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomizationScreen_CM.WBP_CharacterCustomizationScreen_CM_C.CancelCharacterCustomization
// 0x0020 (0x0020 - 0x0000)
struct WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GameplayUIManager_C*               K2Node_DynamicCast_AsWBP_Gameplay_UIManager;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization");
static_assert(sizeof(WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization) == 0x000020, "Wrong size on WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization, K2Node_DynamicCast_AsWBP_Gameplay_UIManager) == 0x000010, "Member 'WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization::K2Node_DynamicCast_AsWBP_Gameplay_UIManager' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_CharacterCustomizationScreen_CM_C_CancelCharacterCustomization::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_CharacterCustomizationScreen_CM.WBP_CharacterCustomizationScreen_CM_C.Completed_DEC2B92144906D52957CCEBAA54C0FB4
// 0x0070 (0x0070 - 0x0000)
struct WBP_CharacterCustomizationScreen_CM_C_Completed_DEC2B92144906D52957CCEBAA54C0FB4 final
{
public:
	class UVALUI_CharacterCustomizationPanelBase* CharacterCustomizationPanel;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload ContextPayload;                                    // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CharacterCustomizationScreen_CM_C_Completed_DEC2B92144906D52957CCEBAA54C0FB4) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationScreen_CM_C_Completed_DEC2B92144906D52957CCEBAA54C0FB4");
static_assert(sizeof(WBP_CharacterCustomizationScreen_CM_C_Completed_DEC2B92144906D52957CCEBAA54C0FB4) == 0x000070, "Wrong size on WBP_CharacterCustomizationScreen_CM_C_Completed_DEC2B92144906D52957CCEBAA54C0FB4");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_Completed_DEC2B92144906D52957CCEBAA54C0FB4, CharacterCustomizationPanel) == 0x000000, "Member 'WBP_CharacterCustomizationScreen_CM_C_Completed_DEC2B92144906D52957CCEBAA54C0FB4::CharacterCustomizationPanel' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_Completed_DEC2B92144906D52957CCEBAA54C0FB4, ContextPayload) == 0x000008, "Member 'WBP_CharacterCustomizationScreen_CM_C_Completed_DEC2B92144906D52957CCEBAA54C0FB4::ContextPayload' has a wrong offset!");

// Function WBP_CharacterCustomizationScreen_CM.WBP_CharacterCustomizationScreen_CM_C.DisplayConfirmWindow
// 0x0048 (0x0048 - 0x0000)
struct WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow final
{
public:
	class UWBP_CharacterRespecConfirmation_C*     CharacterRespecConfirmationModal;                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CharacterRespecConfirmation_C*     CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow");
static_assert(sizeof(WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow) == 0x000048, "Wrong size on WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow, CharacterRespecConfirmationModal) == 0x000000, "Member 'WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow::CharacterRespecConfirmationModal' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000038, "Member 'WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow, CallFunc_Create_ReturnValue) == 0x000040, "Member 'WBP_CharacterCustomizationScreen_CM_C_DisplayConfirmWindow::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomizationScreen_CM.WBP_CharacterCustomizationScreen_CM_C.ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM
// 0x2230 (0x2230 - 0x0000)
struct WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_CharacterCustomizationPanelBase* K2Node_CustomEvent_CharacterCustomizationPanel;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload K2Node_CustomEvent_ContextPayload;                 // 0x0010(0x0068)(ConstParm)
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload Temp_struct_Variable;                              // 0x0080(0x0068)()
	class UVALUI_CharacterCustomizationPanelBase* Temp_object_Variable;                              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload K2Node_MakeStruct_VALUI_CharCustomization_UpdateLoadoutContextPayload; // 0x00F0(0x0068)()
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x0158(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x0180(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB1[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB2[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x01C0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x01E8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB3[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_2;                            // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB4[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0228(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0250(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB5[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB6[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x028C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x029C(0x0014)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x02B0(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB7[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB8[0x6];                                     // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0398(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x03C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_4;                            // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0400(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0428(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_5;                            // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1; // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10;                             // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9_0;                            // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10_0;                           // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11;                             // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0468(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0478(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0488(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0498(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue; // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB9[0x3];                                     // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UVALUI_CharacterCustomizationPanelBase* CharacterCustomizationPanel, struct FVALUI_CharCustomization_UpdateLoadoutContextPayload& ContextPayload)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x04AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CBA[0x7];                                     // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FGuid>                            CallFunc_GetUnownedItems_UnownedItems;             // 0x04C8(0x0050)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPureConsoleVariableBoolValue_ReturnValue_1; // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CBB[0x2];                                     // 0x051A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Set_Length_ReturnValue_1;                 // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0522(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0523(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CharacterCustomizationPanel_CM_C* CustomizationPanel, class UVAL_CharacterCustomizationItemBase* ItemSelected)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0524(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CBC[0x4];                                     // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue_1; // 0x0538(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALDTOS_MetaCharacterFormat           K2Node_CustomEvent_NewMetaData;                    // 0x0540(0x0778)()
	bool                                          K2Node_CustomEvent_ShouldApplyCustomization;       // 0x0CB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShouldApplyBodyData;            // 0x0CB9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CBD[0x2];                                     // 0x0CBA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0CBC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CBE[0x4];                                     // 0x0CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharacterCustomizationLoadout     CallFunc_PersistenceDTOsToLoadout_ReturnValue;     // 0x0CD0(0x0900)()
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload K2Node_CustomEvent_ContextPayload_1;               // 0x15D0(0x0068)(ConstParm)
	bool                                          CallFunc_IsLoadoutEmpty_ReturnValue;               // 0x1638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CBF[0x7];                                     // 0x1639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x1640(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x1648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC0[0x3];                                     // 0x1649(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FVALUI_CharCustomization_UpdateLoadoutContextPayload& ContextPayload)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x164C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC1[0x4];                                     // 0x165C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x1660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<struct FGuid>                            CallFunc_GetUnownedItems_UnownedItems_1;           // 0x1668(0x0050)()
	class AVAL_CharacterRenderStudio*             K2Node_Event_CharacterRenderStudio;                // 0x16B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_Event_TargetCharacterActor;                 // 0x16C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationModeConfig  K2Node_Event_ModeConfig;                           // 0x16C8(0x0010)(NoDestructor)
	class UValeriaCharacterMoveComponent*         CallFunc_GetValeriaCharacterMovementComponent_ReturnValue; // 0x16D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_AsyncUpdateLoadout*              CallFunc_UpdateLoadout_ReturnValue;                // 0x16E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlidingEnabled_ReturnValue;             // 0x16E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x16E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC2[0x6];                                     // 0x16EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload K2Node_ComponentBoundEvent_Context_Payload;        // 0x16F0(0x0068)()
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x1758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x1760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC3[0x7];                                     // 0x1761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x1768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationItem_Torso*  K2Node_DynamicCast_AsVAL_Character_Customization_Item_Torso; // 0x1770(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x1778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC4[0x3];                                     // 0x1779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x177C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x178C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC5[0x4];                                     // 0x179C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x17A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x17A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC6[0x7];                                     // 0x17A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCameraActorForCosmeticAsset_ReturnValue; // 0x17B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x17B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyActiveFilters_HasActiveFilters;     // 0x17B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x17BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x17BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x17BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x17BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC7[0x2];                                     // 0x17BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x17C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_ActionValue_1;                  // 0x17D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_ApplyCustomizationToActorContext         Temp_byte_Variable;                                // 0x17D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC8[0x7];                                     // 0x17D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_ActionValue;                    // 0x17E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x17E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x17F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x1800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC9[0x7];                                     // 0x1801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x1808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x1810(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVAL_ApplyCustomizationToActorContext         Temp_byte_Variable_1;                              // 0x1828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CCA[0x3];                                     // 0x1829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x182C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool HidePremiumItems, bool OnlyShowOwned, TArray<struct FVAL_CharacterCustomization_CosmeticTagFilterStruct>& CurrentSelectedFilters)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x183C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_HidePremiumItems;               // 0x184C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_OnlyShowOwned;                  // 0x184D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CCB[0x2];                                     // 0x184E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVAL_CharacterCustomization_CosmeticTagFilterStruct> K2Node_CustomEvent_CurrentSelectedFilters;         // 0x1850(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x1860(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPromptItemVisible_IsVisible;            // 0x1870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CCC[0x7];                                     // 0x1871(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x1878(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_OpenStorePayload                  K2Node_MakeStruct_VAL_OpenStorePayload;            // 0x1880(0x0028)()
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x18A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_UIManagerWidgetBase*             K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base;  // 0x18B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x18B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CCD[0x7];                                     // 0x18B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVAL_GameplayUIBridgeInterface> CallFunc_OpenPremiumStore_self_CastInput;          // 0x18C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x18D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x18D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CCE[0x7];                                     // 0x18D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue_2; // 0x18E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x18E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CCF[0x7];                                     // 0x18E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharacterCustomizationLoadout     CallFunc_GetCurrentLoadout_ReturnValue;            // 0x18F0(0x0900)(ConstParm)
	class UVAL_ApplyCustomizationsToActorProxy*   CallFunc_ApplyCustomizationsToActor_ReturnValue;   // 0x21F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x21F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x2200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GameplayUIManager_C*               K2Node_DynamicCast_AsWBP_Gameplay_UIManager;       // 0x2208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x2210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x2211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x2212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_ApplyCustomizationToActorContext         K2Node_Select_Default;                             // 0x2213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CD0[0x4];                                     // 0x2214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ApplyCustomizationsToActorProxy*   CallFunc_ApplyCustomizationsToActor_ReturnValue_1; // 0x2218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x2220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CD1[0x3];                                     // 0x2221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetViewTargetWithBlend_BlendTime_ImplicitCast; // 0x2224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x2228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM) == 0x000010, "Wrong alignment on WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM");
static_assert(sizeof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM) == 0x002230, "Wrong size on WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, EntryPoint) == 0x000000, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, K2Node_CustomEvent_CharacterCustomizationPanel) == 0x000008, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::K2Node_CustomEvent_CharacterCustomizationPanel' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, K2Node_CustomEvent_ContextPayload) == 0x000010, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::K2Node_CustomEvent_ContextPayload' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, CallFunc_GetCharacterCustomizationComponent_ReturnValue) == 0x000078, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::CallFunc_GetCharacterCustomizationComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_struct_Variable) == 0x000080, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_object_Variable) == 0x0000E8, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, K2Node_MakeStruct_VALUI_CharCustomization_UpdateLoadoutContextPayload) == 0x0000F0, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::K2Node_MakeStruct_VALUI_CharCustomization_UpdateLoadoutContextPayload' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, K2Node_EnhancedInputActionEvent_ActionValue_4) == 0x000158, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::K2Node_EnhancedInputActionEvent_ActionValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_4) == 0x000178, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_4) == 0x00017C, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, K2Node_EnhancedInputActionEvent_SourceAction_4) == 0x000180, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::K2Node_EnhancedInputActionEvent_SourceAction_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_object_Variable_1) == 0x000188, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000190, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_real_Variable) == 0x000198, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_real_Variable_1) == 0x0001A0, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_real_Variable_0) == 0x0001A8, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_real_Variable_1_0) == 0x0001B0, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_bool_Variable) == 0x0001B8, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, K2Node_EnhancedInputActionEvent_ActionValue_3) == 0x0001C0, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::K2Node_EnhancedInputActionEvent_ActionValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_3) == 0x0001E0, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_3) == 0x0001E4, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, K2Node_EnhancedInputActionEvent_SourceAction_3) == 0x0001E8, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::K2Node_EnhancedInputActionEvent_SourceAction_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0001F0, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_object_Variable_2) == 0x0001F8, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_real_Variable_2) == 0x000200, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_real_Variable_2_0) == 0x000208, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_real_Variable_3) == 0x000210, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_bool_Variable_1) == 0x000218, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM, Temp_real_Variable_3_0) == 0x000220, "Member 'WBP_CharacterCustomizationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationScreen_CM::Temp_real_Variable_3_0' has a wrong offset!");
