#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Guild_TransferOwnershipConfirmation_Modal_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"


namespace SDK::Params
{

// Function WBP_Guild_TransferOwnershipConfirmation_Modal_CM.WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C.ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x0024(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55E0[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names;                          // 0x0038(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable;                              // 0x0058(0x0010)(ReferenceParm)
	struct FGuid                                  Temp_struct_Variable_1;                            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55E1[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM) == 0x000008, "Wrong alignment on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM");
static_assert(sizeof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM) == 0x0000E0, "Wrong size on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, EntryPoint) == 0x000000, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, K2Node_CustomEvent_AccountId_1) == 0x000004, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, K2Node_CustomEvent_AccountId) == 0x000024, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, K2Node_CustomEvent_Names) == 0x000038, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::K2Node_CustomEvent_Names' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, Temp_struct_Variable) == 0x000058, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, Temp_struct_Variable_1) == 0x000068, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000090, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A8, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, CallFunc_GetUIManagerWidget_ReturnValue) == 0x0000B0, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, K2Node_Event_IsDesignTime) == 0x0000B8, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, CallFunc_GetAccountId_ReturnValue) == 0x0000BC, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x0000CC, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, CallFunc_GetCharacterNamesByAccountId_ReturnValue) == 0x0000D0, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::CallFunc_GetCharacterNamesByAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_ExecuteUbergraph_WBP_Guild_TransferOwnershipConfirmation_Modal_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Guild_TransferOwnershipConfirmation_Modal_CM.WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C.HandleTransferFailure
// 0x0010 (0x0010 - 0x0000)
struct WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_HandleTransferFailure final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_HandleTransferFailure) == 0x000008, "Wrong alignment on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_HandleTransferFailure");
static_assert(sizeof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_HandleTransferFailure) == 0x000010, "Wrong size on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_HandleTransferFailure");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_HandleTransferFailure, ErrorMessage) == 0x000000, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_HandleTransferFailure::ErrorMessage' has a wrong offset!");

// Function WBP_Guild_TransferOwnershipConfirmation_Modal_CM.WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C.OnFailure_CA4DF942458EB985F2A7B2B5D03939C9
// 0x0010 (0x0010 - 0x0000)
struct WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnFailure_CA4DF942458EB985F2A7B2B5D03939C9 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnFailure_CA4DF942458EB985F2A7B2B5D03939C9) == 0x000004, "Wrong alignment on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnFailure_CA4DF942458EB985F2A7B2B5D03939C9");
static_assert(sizeof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnFailure_CA4DF942458EB985F2A7B2B5D03939C9) == 0x000010, "Wrong size on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnFailure_CA4DF942458EB985F2A7B2B5D03939C9");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnFailure_CA4DF942458EB985F2A7B2B5D03939C9, AccountId) == 0x000000, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnFailure_CA4DF942458EB985F2A7B2B5D03939C9::AccountId' has a wrong offset!");

// Function WBP_Guild_TransferOwnershipConfirmation_Modal_CM.WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C.OnSuccess_CA4DF942458EB985F2A7B2B5D03939C9
// 0x0020 (0x0020 - 0x0000)
struct WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnSuccess_CA4DF942458EB985F2A7B2B5D03939C9 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Names;                                             // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnSuccess_CA4DF942458EB985F2A7B2B5D03939C9) == 0x000008, "Wrong alignment on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnSuccess_CA4DF942458EB985F2A7B2B5D03939C9");
static_assert(sizeof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnSuccess_CA4DF942458EB985F2A7B2B5D03939C9) == 0x000020, "Wrong size on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnSuccess_CA4DF942458EB985F2A7B2B5D03939C9");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnSuccess_CA4DF942458EB985F2A7B2B5D03939C9, AccountId) == 0x000000, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnSuccess_CA4DF942458EB985F2A7B2B5D03939C9::AccountId' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnSuccess_CA4DF942458EB985F2A7B2B5D03939C9, Names) == 0x000010, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_OnSuccess_CA4DF942458EB985F2A7B2B5D03939C9::Names' has a wrong offset!");

// Function WBP_Guild_TransferOwnershipConfirmation_Modal_CM.WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_PreConstruct");
static_assert(sizeof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_PreConstruct");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Guild_TransferOwnershipConfirmation_Modal_CM.WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C.TransferOwnership
// 0x02B8 (0x02B8 - 0x0000)
struct WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership final
{
public:
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x0018(0x0030)(HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetUserMembership_bOutHasMembership;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55E2[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PlayerGuild                       CallFunc_TryGetUserMembership_PlayerGuild;         // 0x0060(0x0118)()
	bool                                          CallFunc_TryGetUserMembership_ReturnValue;         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55E3[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x017C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55E4[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PlayerGuild                       K2Node_SetFieldsInStruct_StructOut;                // 0x0190(0x0118)()
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanTransferGuildOwnership_ReturnValue;    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership) == 0x000008, "Wrong alignment on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership");
static_assert(sizeof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership) == 0x0002B8, "Wrong size on WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000008, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000010, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, CallFunc_GetNetId_ReturnValue) == 0x000018, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::CallFunc_GetNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, CallFunc_TryGetUserMembership_bOutHasMembership) == 0x000058, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::CallFunc_TryGetUserMembership_bOutHasMembership' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, CallFunc_TryGetUserMembership_PlayerGuild) == 0x000060, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::CallFunc_TryGetUserMembership_PlayerGuild' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, CallFunc_TryGetUserMembership_ReturnValue) == 0x000178, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::CallFunc_TryGetUserMembership_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, K2Node_CreateDelegate_OutputDelegate_1) == 0x00017C, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, K2Node_SetFieldsInStruct_StructOut) == 0x000190, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x0002A8, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, CallFunc_CanTransferGuildOwnership_ReturnValue) == 0x0002B0, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::CallFunc_CanTransferGuildOwnership_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, CallFunc_BooleanAND_ReturnValue) == 0x0002B1, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership, CallFunc_BooleanAND_ReturnValue_1) == 0x0002B2, "Member 'WBP_Guild_TransferOwnershipConfirmation_Modal_CM_C_TransferOwnership::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

