#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListEntry_Request_CM

#include "Basic.hpp"

#include "OnlineSubsystemValeria_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_Request_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_Request_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_ListEntry_Request_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_Request_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_Request_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_ListEntry_Request_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.CanFulfillRequestNow
// 0x0028 (0x0028 - 0x0000)
struct WBP_ListEntry_Request_CM_C_CanFulfillRequestNow final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5788[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5789[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemAmountInX_ByType_ReturnValue;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DateTimeDateTime_ReturnValue;     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_CanFulfillRequestNow) == 0x000008, "Wrong alignment on WBP_ListEntry_Request_CM_C_CanFulfillRequestNow");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_CanFulfillRequestNow) == 0x000028, "Wrong size on WBP_ListEntry_Request_CM_C_CanFulfillRequestNow");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_CanFulfillRequestNow, Return) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_CanFulfillRequestNow::Return' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_CanFulfillRequestNow, CallFunc_GetValeriaCharacter_OutResult) == 0x000001, "Member 'WBP_ListEntry_Request_CM_C_CanFulfillRequestNow::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_CanFulfillRequestNow, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_ListEntry_Request_CM_C_CanFulfillRequestNow::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_CanFulfillRequestNow, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_ListEntry_Request_CM_C_CanFulfillRequestNow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_CanFulfillRequestNow, CallFunc_UtcNow_ReturnValue) == 0x000018, "Member 'WBP_ListEntry_Request_CM_C_CanFulfillRequestNow::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_CanFulfillRequestNow, CallFunc_GetItemAmountInX_ByType_ReturnValue) == 0x000020, "Member 'WBP_ListEntry_Request_CM_C_CanFulfillRequestNow::CallFunc_GetItemAmountInX_ByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_CanFulfillRequestNow, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'WBP_ListEntry_Request_CM_C_CanFulfillRequestNow::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_CanFulfillRequestNow, CallFunc_Greater_DateTimeDateTime_ReturnValue) == 0x000025, "Member 'WBP_ListEntry_Request_CM_C_CanFulfillRequestNow::CallFunc_Greater_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_CanFulfillRequestNow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000026, "Member 'WBP_ListEntry_Request_CM_C_CanFulfillRequestNow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.ExecuteUbergraph_WBP_ListEntry_Request_CM
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListItem_Request_C*                    K2Node_DynamicCast_AsList_Item_Request;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578A[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FDateTime& NewTime)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDateTime& NewTime)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Temp_struct_Variable;                              // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanFulfillRequestNow_Return;              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578B[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable_1;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578C[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578D[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           K2Node_MakeStruct_ValeriaItem;                     // 0x00C8(0x0060)()
	class UWBP_ItemRequest_FulfillConfirmationModal_C* CallFunc_Create_ReturnValue;                       // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemRequest_FulfillConfirmationModal_Console_C* CallFunc_Create_ReturnValue_1;                     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x0140(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names;                          // 0x0150(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_RequestsPanel_CM_C*                K2Node_Event_RequestPanel_1;                       // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_RequestsPanel_Console_C*           K2Node_Event_RequestPanel;                         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDateTime& NewTime)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x01B0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM) == 0x000008, "Wrong alignment on WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM) == 0x0001E8, "Wrong size on WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, EntryPoint) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_Event_bIsExpanded) == 0x000006, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_Event_bIsSelected) == 0x000007, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_DynamicCast_AsList_Item_Request) == 0x000010, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_DynamicCast_AsList_Item_Request' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, Temp_struct_Variable) == 0x00003C, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_CanFulfillRequestNow_Return) == 0x00005C, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_CanFulfillRequestNow_Return' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, Temp_struct_Variable_1) == 0x000060, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_GetAccountId_ReturnValue) == 0x000088, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_GetCharacterNamesByAccountId_ReturnValue) == 0x000098, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_GetCharacterNamesByAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000A0, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_IsValid_ReturnValue_2) == 0x0000A8, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_DynamicCast_AsItem_Type_Definition) == 0x0000B0, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_IsValid_ReturnValue_3) == 0x0000B9, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000C0, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_MakeStruct_ValeriaItem) == 0x0000C8, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_MakeStruct_ValeriaItem' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_Create_ReturnValue) == 0x000128, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_Create_ReturnValue_1) == 0x000130, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000138, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CustomEvent_AccountId) == 0x000140, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CustomEvent_Names) == 0x000150, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CustomEvent_Names' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x000160, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x000170, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CreateDelegate_OutputDelegate_5) == 0x000180, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_Event_RequestPanel_1) == 0x000190, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_Event_RequestPanel_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_Event_RequestPanel) == 0x000198, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_Event_RequestPanel' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001A0, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CustomEvent_AccountId_1) == 0x0001B0, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001C0, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001D0, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_IsDesktop_ReturnValue) == 0x0001E0, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_IsDesktop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM, CallFunc_IsConsole_ReturnValue) == 0x0001E1, "Member 'WBP_ListEntry_Request_CM_C_ExecuteUbergraph_WBP_ListEntry_Request_CM::CallFunc_IsConsole_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.HandleFulfillModalConfirmed
// 0x0060 (0x0060 - 0x0000)
struct WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed final
{
public:
	class UInventoryRequestManager*               CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578E[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_ExpandableArea_CM_C*>       CallFunc_GetVisibleCategories_VisibleCategoryDropdowns; // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UVALUI_ListView_Styled*>         CallFunc_GetVisibleCategories_VisibleCategoryLists; // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_ExpandableArea_CM_C*               CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FulfillRequest_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed) == 0x000008, "Wrong alignment on WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed) == 0x000060, "Wrong size on WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed, CallFunc_GetVisibleCategories_VisibleCategoryDropdowns) == 0x000010, "Member 'WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed::CallFunc_GetVisibleCategories_VisibleCategoryDropdowns' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed, CallFunc_GetVisibleCategories_VisibleCategoryLists) == 0x000020, "Member 'WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed::CallFunc_GetVisibleCategories_VisibleCategoryLists' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed, CallFunc_FulfillRequest_ReturnValue) == 0x000058, "Member 'WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed::CallFunc_FulfillRequest_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'WBP_ListEntry_Request_CM_C_HandleFulfillModalConfirmed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.HandleFulfillRequestFailed
// 0x0010 (0x0010 - 0x0000)
struct WBP_ListEntry_Request_CM_C_HandleFulfillRequestFailed final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_HandleFulfillRequestFailed) == 0x000008, "Wrong alignment on WBP_ListEntry_Request_CM_C_HandleFulfillRequestFailed");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_HandleFulfillRequestFailed) == 0x000010, "Wrong size on WBP_ListEntry_Request_CM_C_HandleFulfillRequestFailed");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_HandleFulfillRequestFailed, ErrorMessage) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_HandleFulfillRequestFailed::ErrorMessage' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.HandleOnUpdateTime
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_Request_CM_C_HandleOnUpdateTime final
{
public:
	struct FDateTime                              NewTime;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_HandleOnUpdateTime) == 0x000008, "Wrong alignment on WBP_ListEntry_Request_CM_C_HandleOnUpdateTime");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_HandleOnUpdateTime) == 0x000008, "Wrong size on WBP_ListEntry_Request_CM_C_HandleOnUpdateTime");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_HandleOnUpdateTime, NewTime) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_HandleOnUpdateTime::NewTime' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.OnFailure_429674864E3B061D4A1078A7334FE5DC
// 0x0010 (0x0010 - 0x0000)
struct WBP_ListEntry_Request_CM_C_OnFailure_429674864E3B061D4A1078A7334FE5DC final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_OnFailure_429674864E3B061D4A1078A7334FE5DC) == 0x000004, "Wrong alignment on WBP_ListEntry_Request_CM_C_OnFailure_429674864E3B061D4A1078A7334FE5DC");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_OnFailure_429674864E3B061D4A1078A7334FE5DC) == 0x000010, "Wrong size on WBP_ListEntry_Request_CM_C_OnFailure_429674864E3B061D4A1078A7334FE5DC");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_OnFailure_429674864E3B061D4A1078A7334FE5DC, AccountId) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_OnFailure_429674864E3B061D4A1078A7334FE5DC::AccountId' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.OnFocusReceived
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_ListEntry_Request_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_ListEntry_Request_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_OnFocusReceived) == 0x0000F8, "Wrong size on WBP_ListEntry_Request_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_ListEntry_Request_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_ListEntry_Request_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_Request_CM_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ListEntry_Request_CM_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ListEntry_Request_CM_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_Request_CM_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_ListEntry_Request_CM_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_ListEntry_Request_CM_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.OnSuccess_429674864E3B061D4A1078A7334FE5DC
// 0x0020 (0x0020 - 0x0000)
struct WBP_ListEntry_Request_CM_C_OnSuccess_429674864E3B061D4A1078A7334FE5DC final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Names;                                             // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_OnSuccess_429674864E3B061D4A1078A7334FE5DC) == 0x000008, "Wrong alignment on WBP_ListEntry_Request_CM_C_OnSuccess_429674864E3B061D4A1078A7334FE5DC");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_OnSuccess_429674864E3B061D4A1078A7334FE5DC) == 0x000020, "Wrong size on WBP_ListEntry_Request_CM_C_OnSuccess_429674864E3B061D4A1078A7334FE5DC");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_OnSuccess_429674864E3B061D4A1078A7334FE5DC, AccountId) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_OnSuccess_429674864E3B061D4A1078A7334FE5DC::AccountId' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_OnSuccess_429674864E3B061D4A1078A7334FE5DC, Names) == 0x000010, "Member 'WBP_ListEntry_Request_CM_C_OnSuccess_429674864E3B061D4A1078A7334FE5DC::Names' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.SetupBinds
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_Request_CM_C_SetupBinds final
{
public:
	class UWBP_RequestsPanel_CM_C*                RequestPanel;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_SetupBinds) == 0x000008, "Wrong alignment on WBP_ListEntry_Request_CM_C_SetupBinds");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_SetupBinds) == 0x000008, "Wrong size on WBP_ListEntry_Request_CM_C_SetupBinds");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_SetupBinds, RequestPanel) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_SetupBinds::RequestPanel' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.SetupBinds_Console
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_Request_CM_C_SetupBinds_Console final
{
public:
	class UWBP_RequestsPanel_Console_C*           RequestPanel;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_SetupBinds_Console) == 0x000008, "Wrong alignment on WBP_ListEntry_Request_CM_C_SetupBinds_Console");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_SetupBinds_Console) == 0x000008, "Wrong size on WBP_ListEntry_Request_CM_C_SetupBinds_Console");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_SetupBinds_Console, RequestPanel) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_SetupBinds_Console::RequestPanel' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.UpdateForOperationStatus
// 0x0002 (0x0002 - 0x0000)
struct WBP_ListEntry_Request_CM_C_UpdateForOperationStatus final
{
public:
	bool                                          bIsPendingOperation;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_UpdateForOperationStatus) == 0x000001, "Wrong alignment on WBP_ListEntry_Request_CM_C_UpdateForOperationStatus");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_UpdateForOperationStatus) == 0x000002, "Wrong size on WBP_ListEntry_Request_CM_C_UpdateForOperationStatus");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_UpdateForOperationStatus, bIsPendingOperation) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_UpdateForOperationStatus::bIsPendingOperation' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_UpdateForOperationStatus, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_ListEntry_Request_CM_C_UpdateForOperationStatus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_Request_CM.WBP_ListEntry_Request_CM_C.UpdateRemainingTime
// 0x0018 (0x0018 - 0x0000)
struct WBP_ListEntry_Request_CM_C_UpdateRemainingTime final
{
public:
	struct FDateTime                              CurrentTime;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanFulfillRequestNow_Return;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_Request_CM_C_UpdateRemainingTime) == 0x000008, "Wrong alignment on WBP_ListEntry_Request_CM_C_UpdateRemainingTime");
static_assert(sizeof(WBP_ListEntry_Request_CM_C_UpdateRemainingTime) == 0x000018, "Wrong size on WBP_ListEntry_Request_CM_C_UpdateRemainingTime");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_UpdateRemainingTime, CurrentTime) == 0x000000, "Member 'WBP_ListEntry_Request_CM_C_UpdateRemainingTime::CurrentTime' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_Request_CM_C_UpdateRemainingTime, CallFunc_CanFulfillRequestNow_Return) == 0x000008, "Member 'WBP_ListEntry_Request_CM_C_UpdateRemainingTime::CallFunc_CanFulfillRequestNow_Return' has a wrong offset!");
