#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsPanel_CM

#include "Basic.hpp"

#include "E_CloseKeyRebindMenuType_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "KeyRebinding_structs.hpp"
#include "ValeriaUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsPanel_CM_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature final
{
public:
	class UVALUI_TabButtonHostBase*               TabButtonHost;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsPanel_CM_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature");
static_assert(sizeof(WBP_SettingsPanel_CM_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsPanel_CM_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature");
static_assert(offsetof(WBP_SettingsPanel_CM_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature, TabButtonHost) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature::TabButtonHost' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsPanel_CM_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_SettingsPanel_CM_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_SettingsPanel_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_SettingsPanel_CM_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_SettingsPanel_CM_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.ExecutePrePopupAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsPanel_CM_C_ExecutePrePopupAction final
{
public:
	E_CloseKeyRebindMenuType                      PrePopupAction;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_ExecutePrePopupAction) == 0x000001, "Wrong alignment on WBP_SettingsPanel_CM_C_ExecutePrePopupAction");
static_assert(sizeof(WBP_SettingsPanel_CM_C_ExecutePrePopupAction) == 0x000001, "Wrong size on WBP_SettingsPanel_CM_C_ExecutePrePopupAction");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecutePrePopupAction, PrePopupAction) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_ExecutePrePopupAction::PrePopupAction' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.ExecuteUbergraph_WBP_SettingsPanel_CM
// 0x03A8 (0x03A8 - 0x0000)
struct WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FB8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FB9[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FBA[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GraphicsSettings_UnappliedChangesWindow_CM_C* CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GraphicsSettings_RestartWindow_CM_C* CallFunc_Create_ReturnValue_1;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TabButtonHostBase*               K2Node_ComponentBoundEvent_TabButtonHost;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTabName_ReturnValue;             // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FBB[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALUI_InstantiatedTabButtonInfo       CallFunc_TryGetTabInfo_OutInfo;                    // 0x0098(0x0068)(ContainsInstancedReference)
	bool                                          CallFunc_TryGetTabInfo_ReturnValue;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FBC[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActiveTabName_ReturnValue_1;           // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FBD[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALUI_InstantiatedTabButtonInfo       CallFunc_TryGetTabInfo_OutInfo_1;                  // 0x0110(0x0068)(ContainsInstancedReference)
	bool                                          CallFunc_TryGetTabInfo_ReturnValue_1;              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FBE[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidgetInputExtended*  K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FBF[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_KeyRebindInterface_C> K2Node_Event_OwnerWidget;                          // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CloseKeyRebindMenuType                      K2Node_Event_PrePopupAction_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC0[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyRebind_DisplayResult               K2Node_Event_KeyRebindResultInfo;                  // 0x01A8(0x00E0)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnappliedWindowChanges_Value;          // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC1[0x6];                                     // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRestartSuggested_Value;                 // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC2[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNextTabName_ReturnValue;               // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC3[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetNextTabName_Output;                    // 0x0304(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNextTabName_ReturnValue_1;             // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC4[0x3];                                     // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetNextTabName_Output_1;                  // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CloseKeyRebindMenuType                      K2Node_Event_PrePopupAction;                       // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC5[0x2];                                     // 0x031A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x031C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC6[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0330(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0358(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC7[0x3];                                     // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0374(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0384(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0394(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM) == 0x000008, "Wrong alignment on WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM");
static_assert(sizeof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM) == 0x0003A8, "Wrong size on WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, EntryPoint) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_object_Variable) == 0x000038, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_real_Variable) == 0x000048, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_real_Variable_1) == 0x000050, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_real_Variable_0) == 0x000058, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_bool_Variable) == 0x000068, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_Create_ReturnValue) == 0x000070, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_Create_ReturnValue_1) == 0x000078, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_ComponentBoundEvent_TabButtonHost) == 0x000080, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_ComponentBoundEvent_TabButtonHost' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000088, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_GetActiveTabName_ReturnValue) == 0x00008C, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_GetActiveTabName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_Event_IsDesignTime) == 0x000094, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_TryGetTabInfo_OutInfo) == 0x000098, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_TryGetTabInfo_OutInfo' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_TryGetTabInfo_ReturnValue) == 0x000100, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_TryGetTabInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_GetActiveTabName_ReturnValue_1) == 0x000104, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_GetActiveTabName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_TryGetTabInfo_OutInfo_1) == 0x000110, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_TryGetTabInfo_OutInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_TryGetTabInfo_ReturnValue_1) == 0x000178, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_TryGetTabInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended) == 0x000180, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_Event_OwnerWidget) == 0x000190, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_Event_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_Event_PrePopupAction_1) == 0x0001A0, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_Event_PrePopupAction_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_Event_KeyRebindResultInfo) == 0x0001A8, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_Event_KeyRebindResultInfo' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x000288, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000290, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_bool_Variable_1) == 0x000298, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_HasUnappliedWindowChanges_Value) == 0x000299, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_HasUnappliedWindowChanges_Value' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_real_Variable_2) == 0x0002A0, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_CreateDelegate_OutputDelegate) == 0x0002A8, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002B8, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0002C8, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_IsRestartSuggested_Value) == 0x0002D0, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_IsRestartSuggested_Value' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_GetUIManagerWidget_ReturnValue_1) == 0x0002D8, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_GetUIManagerWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_real_Variable_3) == 0x0002E0, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002E8, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_object_Variable_1) == 0x0002F8, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_GetNextTabName_ReturnValue) == 0x000300, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_GetNextTabName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_GetNextTabName_Output) == 0x000304, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_GetNextTabName_Output' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_GetNextTabName_ReturnValue_1) == 0x00030C, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_GetNextTabName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_GetNextTabName_Output_1) == 0x000310, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_GetNextTabName_Output_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_Event_PrePopupAction) == 0x000318, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_Event_PrePopupAction' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_SwitchEnum_CmpSuccess) == 0x000319, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x00031C, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000330, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000350, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000354, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000358, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_real_Variable_3_0) == 0x000360, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, Temp_real_Variable_2_0) == 0x000368, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000370, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x000374, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_CreateDelegate_OutputDelegate_5) == 0x000384, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM, K2Node_CreateDelegate_OutputDelegate_6) == 0x000394, "Member 'WBP_SettingsPanel_CM_C_ExecuteUbergraph_WBP_SettingsPanel_CM::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.GetNextTabName
// 0x0050 (0x0050 - 0x0000)
struct WBP_SettingsPanel_CM_C_GetNextTabName final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC8[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Output;                                            // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextIndex;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetTabNames_ReturnValue;                  // 0x0010(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTabName_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetTabNames_ReturnValue_1;                // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC9[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_GetNextTabName) == 0x000008, "Wrong alignment on WBP_SettingsPanel_CM_C_GetNextTabName");
static_assert(sizeof(WBP_SettingsPanel_CM_C_GetNextTabName) == 0x000050, "Wrong size on WBP_SettingsPanel_CM_C_GetNextTabName");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, Condition) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::Condition' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, ReturnValue) == 0x000001, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, Output) == 0x000004, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::Output' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, NextIndex) == 0x00000C, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::NextIndex' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, CallFunc_GetTabNames_ReturnValue) == 0x000010, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::CallFunc_GetTabNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, CallFunc_GetActiveTabName_ReturnValue) == 0x000028, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::CallFunc_GetActiveTabName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, CallFunc_GetTabNames_ReturnValue_1) == 0x000030, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::CallFunc_GetTabNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, CallFunc_Array_Find_ReturnValue) == 0x000044, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_GetNextTabName, CallFunc_Subtract_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_SettingsPanel_CM_C_GetNextTabName::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.Handing Input Action Switch Tab
// 0x0010 (0x0010 - 0x0000)
struct WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab final
{
public:
	bool                                          bLeftSwitch;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNextTabName_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FCA[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetNextTabName_Output;                    // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrySetActiveTabName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab) == 0x000004, "Wrong alignment on WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab");
static_assert(sizeof(WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab) == 0x000010, "Wrong size on WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab");
static_assert(offsetof(WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab, bLeftSwitch) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab::bLeftSwitch' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab, CallFunc_GetNextTabName_ReturnValue) == 0x000001, "Member 'WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab::CallFunc_GetNextTabName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab, CallFunc_GetNextTabName_Output) == 0x000004, "Member 'WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab::CallFunc_GetNextTabName_Output' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab, CallFunc_TrySetActiveTabName_ReturnValue) == 0x00000C, "Member 'WBP_SettingsPanel_CM_C_Handing_Input_Action_Switch_Tab::CallFunc_TrySetActiveTabName_ReturnValue' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.HasUnappliedWindowChanges
// 0x0002 (0x0002 - 0x0000)
struct WBP_SettingsPanel_CM_C_HasUnappliedWindowChanges final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnappliedWindowChanges_Value;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_HasUnappliedWindowChanges) == 0x000001, "Wrong alignment on WBP_SettingsPanel_CM_C_HasUnappliedWindowChanges");
static_assert(sizeof(WBP_SettingsPanel_CM_C_HasUnappliedWindowChanges) == 0x000002, "Wrong size on WBP_SettingsPanel_CM_C_HasUnappliedWindowChanges");
static_assert(offsetof(WBP_SettingsPanel_CM_C_HasUnappliedWindowChanges, Value) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_HasUnappliedWindowChanges::Value' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_HasUnappliedWindowChanges, CallFunc_HasUnappliedWindowChanges_Value) == 0x000001, "Member 'WBP_SettingsPanel_CM_C_HasUnappliedWindowChanges::CallFunc_HasUnappliedWindowChanges_Value' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_SettingsPanel_CM_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.IsRestartSuggested
// 0x0002 (0x0002 - 0x0000)
struct WBP_SettingsPanel_CM_C_IsRestartSuggested final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRestartSuggested_Value;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_IsRestartSuggested) == 0x000001, "Wrong alignment on WBP_SettingsPanel_CM_C_IsRestartSuggested");
static_assert(sizeof(WBP_SettingsPanel_CM_C_IsRestartSuggested) == 0x000002, "Wrong size on WBP_SettingsPanel_CM_C_IsRestartSuggested");
static_assert(offsetof(WBP_SettingsPanel_CM_C_IsRestartSuggested, Value) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_IsRestartSuggested::Value' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_IsRestartSuggested, CallFunc_IsRestartSuggested_Value) == 0x000001, "Member 'WBP_SettingsPanel_CM_C_IsRestartSuggested::CallFunc_IsRestartSuggested_Value' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsPanel_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SettingsPanel_CM_C_PreConstruct");
static_assert(sizeof(WBP_SettingsPanel_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_SettingsPanel_CM_C_PreConstruct");
static_assert(offsetof(WBP_SettingsPanel_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.PreswitchCheckforKeyRebindMenu
// 0x0038 (0x0038 - 0x0000)
struct WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu final
{
public:
	E_CloseKeyRebindMenuType                      ExcuteStatus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FCB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_KeyRebindInterface_C> K2Node_DynamicCast_AsBPI_Key_Rebind_Interface;     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FCC[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_KeyRebindInterface_C> CallFunc_ToggleButtonCheckPopup_OwnerWidget_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu) == 0x000008, "Wrong alignment on WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu");
static_assert(sizeof(WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu) == 0x000038, "Wrong size on WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu");
static_assert(offsetof(WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu, ExcuteStatus) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu::ExcuteStatus' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu, K2Node_DynamicCast_AsBPI_Key_Rebind_Interface) == 0x000010, "Member 'WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu::K2Node_DynamicCast_AsBPI_Key_Rebind_Interface' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu, CallFunc_ToggleButtonCheckPopup_OwnerWidget_CastInput) == 0x000028, "Member 'WBP_SettingsPanel_CM_C_PreswitchCheckforKeyRebindMenu::CallFunc_ToggleButtonCheckPopup_OwnerWidget_CastInput' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.RefreshKeyRebindTips
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_SettingsPanel_CM_C_RefreshKeyRebindTips final
{
public:
	struct FKeyRebind_DisplayResult               KeyRebindResultInfo;                               // 0x0000(0x00E0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_RefreshKeyRebindTips) == 0x000008, "Wrong alignment on WBP_SettingsPanel_CM_C_RefreshKeyRebindTips");
static_assert(sizeof(WBP_SettingsPanel_CM_C_RefreshKeyRebindTips) == 0x0000E0, "Wrong size on WBP_SettingsPanel_CM_C_RefreshKeyRebindTips");
static_assert(offsetof(WBP_SettingsPanel_CM_C_RefreshKeyRebindTips, KeyRebindResultInfo) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_RefreshKeyRebindTips::KeyRebindResultInfo' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.ToggleButtonCheckPopup
// 0x0018 (0x0018 - 0x0000)
struct WBP_SettingsPanel_CM_C_ToggleButtonCheckPopup final
{
public:
	TScriptInterface<class IBPI_KeyRebindInterface_C> OwnerWidget;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CloseKeyRebindMenuType                      PrePopupAction;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_ToggleButtonCheckPopup) == 0x000008, "Wrong alignment on WBP_SettingsPanel_CM_C_ToggleButtonCheckPopup");
static_assert(sizeof(WBP_SettingsPanel_CM_C_ToggleButtonCheckPopup) == 0x000018, "Wrong size on WBP_SettingsPanel_CM_C_ToggleButtonCheckPopup");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ToggleButtonCheckPopup, OwnerWidget) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_ToggleButtonCheckPopup::OwnerWidget' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_ToggleButtonCheckPopup, PrePopupAction) == 0x000010, "Member 'WBP_SettingsPanel_CM_C_ToggleButtonCheckPopup::PrePopupAction' has a wrong offset!");

// Function WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_SettingsPanel_CM_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_CM_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_SettingsPanel_CM_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_SettingsPanel_CM_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_SettingsPanel_CM_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_SettingsPanel_CM_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_SettingsPanel_CM_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_CM_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_SettingsPanel_CM_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

