#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TileEntry_CosmeticThumbnail_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S6Core_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TileEntry_CosmeticThumbnail_CM.WBP_TileEntry_CosmeticThumbnail_CM_C
// 0x00B8 (0x0378 - 0x02C0)
class UWBP_TileEntry_CosmeticThumbnail_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Equipped;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_New;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Unowned;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_Root_CM;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NullItem;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedFrame;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedIcon;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Thumbnail;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Unhovered;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SelectedFrame;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ItemImage;                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_RenderPreview;                                 // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Owned;                                             // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DAF[0x6];                                     // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             NullItemImage;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HoveredAnimationPlayed;                            // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB0[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomization_TileView_C* OwningCharCustTileView;                            // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnItemFocused;                                     // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_TileEntry_CosmeticThumbnail_CM_Button_Root_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_TileEntry_CosmeticThumbnail_CM(int32 EntryPoint, bool CallFunc_GetPureConsoleVariableBoolValue_ReturnValue, class UListViewBase* CallFunc_GetOwningListView_ReturnValue, class UListView* K2Node_DynamicCast_AsList_View, bool K2Node_DynamicCast_bSuccess, class UObject* CallFunc_GetListItemObject_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, const struct FGeometry& K2Node_Event_MyGeometry, struct FPointerEvent& K2Node_Event_MouseEvent, class UObject* K2Node_Event_ListItemObject, bool CallFunc_IsListItemSelected_ReturnValue, bool K2Node_Event_bIsSelected, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, bool K2Node_Event_bIsExpanded, class UObject* CallFunc_GetListItemObject_ReturnValue_1, class UObject* K2Node_CustomEvent_Loaded, class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item, bool K2Node_DynamicCast_bSuccess_1, TSoftObjectPtr<class UTexture2D> CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_IsValidSoftObjectReference_ReturnValue, class UObject* CallFunc_GetListItemObject_ReturnValue_2, class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_1, bool K2Node_DynamicCast_bSuccess_2, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UWBP_CosmeticItemTooltip_C* CallFunc_Create_ReturnValue, class UObject* CallFunc_GetListItemObject_ReturnValue_3, class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item_2, bool K2Node_DynamicCast_bSuccess_3, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_2, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, class UObject* Temp_object_Variable, class UTexture2D* K2Node_DynamicCast_AsTexture_2D, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_IsValid_ReturnValue, bool CallFunc_BooleanOR_ReturnValue);
	void Get_Customization_Panel(class UWBP_CharacterCustomizationPanel_CM_C** Character_Customization_Panel_CM, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class ABP_ValeriaPlayerController_C* K2Node_DynamicCast_AsBP_Valeria_Player_Controller, bool K2Node_DynamicCast_bSuccess, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, class UWBP_GameplayUIManager_C* K2Node_DynamicCast_AsWBP_Gameplay_UIManager, bool K2Node_DynamicCast_bSuccess_1, bool K2Node_SwitchEnum_CmpSuccess, ERedirectsPlatform CallFunc_GetPlatformType_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, class UWBP_CharacterCustomizationScreen_CM_C* K2Node_DynamicCast_AsWBP_Character_Customization_Screen_CM, bool K2Node_DynamicCast_bSuccess_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue_1, class UWBP_PreGameHUD_CM_C* K2Node_DynamicCast_AsWBP_Pre_Game_HUD_CM, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_IsValid_ReturnValue_1, class UWBP_PregameHUD_PF_C* K2Node_DynamicCast_AsWBP_Pregame_HUD_PF, bool K2Node_DynamicCast_bSuccess_4, class UWBP_CharacterCustomizationPanel_CM_C* K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM, bool K2Node_DynamicCast_bSuccess_5, class UWBP_CharacterCustomizationPanel_CM_C* K2Node_DynamicCast_AsWBP_Character_Customization_Panel_CM_1, bool K2Node_DynamicCast_bSuccess_6);
	void GetItemId(struct FGuid* Item_Id, const struct FGuid& K2Node_MakeStruct_Guid, class UObject* CallFunc_GetListItemObject_ReturnValue, class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item, bool K2Node_DynamicCast_bSuccess);
	void HandleItemSelectionChanged(bool Param_Selected, bool K2Node_SwitchEnum_CmpSuccess);
	void IsNew(bool* New, bool CallFunc_IsVisible_ReturnValue);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnInitialized();
	void OnItemFocused__DelegateSignature(class UWBP_TileEntry_CosmeticThumbnail_CM_C* Widget);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnLoaded_E0DBD5684B6A64E6F2859398991C9071(class UObject* Loaded);
	void OnMouseEnter(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void SeeNew(const struct FGuid& CallFunc_GetItemId_Item_Id, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, bool CallFunc_IsValid_Guid_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_IsNew_New);
	void SetHovered(bool bHorvered, bool Temp_bool_Variable, class UAkAudioEvent* Temp_object_Variable, class UAkAudioEvent* Temp_object_Variable_1, class UAkAudioEvent* K2Node_Select_Default, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1);
	void SetNew(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, class UObject* CallFunc_GetListItemObject_ReturnValue, class UTileItem_CharacterCustomizationItem_C* K2Node_DynamicCast_AsTile_Item_Character_Customization_Item, bool K2Node_DynamicCast_bSuccess, ESlateVisibility K2Node_Select_Default);
	void SetOwned(bool Param_Owned, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility K2Node_Select_Default);
	void SetSelected(bool Param_Selected, ESlateVisibility Temp_byte_Variable, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_1, class UObject* CallFunc_GetListItemObject_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UListViewBase* CallFunc_GetOwningListView_ReturnValue, class UListView* K2Node_DynamicCast_AsList_View, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_GetIndexForItem_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool Temp_bool_Variable_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, ESlateVisibility K2Node_Select_Default, class UWidget* K2Node_Select_Default_1);
	void UpdateThumbnailImage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TileEntry_CosmeticThumbnail_CM_C">();
	}
	static class UWBP_TileEntry_CosmeticThumbnail_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TileEntry_CosmeticThumbnail_CM_C>();
	}
};
static_assert(alignof(UWBP_TileEntry_CosmeticThumbnail_CM_C) == 0x000008, "Wrong alignment on UWBP_TileEntry_CosmeticThumbnail_CM_C");
static_assert(sizeof(UWBP_TileEntry_CosmeticThumbnail_CM_C) == 0x000378, "Wrong size on UWBP_TileEntry_CosmeticThumbnail_CM_C");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Hovered) == 0x0002C8, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Border_Equipped) == 0x0002D0, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Border_Equipped' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Border_New) == 0x0002D8, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Border_New' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Border_Unowned) == 0x0002E0, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Border_Unowned' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Button_Root_CM) == 0x0002E8, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Button_Root_CM' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Image_Hovered) == 0x0002F0, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Image_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Image_NullItem) == 0x0002F8, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Image_NullItem' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Image_Selected) == 0x000300, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Image_SelectedFrame) == 0x000308, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Image_SelectedFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Image_SelectedIcon) == 0x000310, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Image_SelectedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Image_Thumbnail) == 0x000318, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Image_Thumbnail' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Image_Unhovered) == 0x000320, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Image_Unhovered' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Overlay_SelectedFrame) == 0x000328, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Overlay_SelectedFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, WidgetSwitcher) == 0x000330, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, WidgetSwitcher_ItemImage) == 0x000338, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::WidgetSwitcher_ItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, MID_RenderPreview) == 0x000340, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::MID_RenderPreview' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Owned) == 0x000348, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Owned' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, Selected) == 0x000349, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, NullItemImage) == 0x000350, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::NullItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, HoveredAnimationPlayed) == 0x000358, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::HoveredAnimationPlayed' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, OwningCharCustTileView) == 0x000360, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::OwningCharCustTileView' has a wrong offset!");
static_assert(offsetof(UWBP_TileEntry_CosmeticThumbnail_CM_C, OnItemFocused) == 0x000368, "Member 'UWBP_TileEntry_CosmeticThumbnail_CM_C::OnItemFocused' has a wrong offset!");

}

