#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCustomizationOptions_CM

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterCustomizationOptions_CM.WBP_CharacterCustomizationOptions_CM_C.BndEvt__WBP_CharacterCreationPanel_CM_Button_Randomize_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_Button_Randomize_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_Button_Randomize_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_Button_Randomize_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_Button_Randomize_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_Button_Randomize_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_Button_Randomize_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_Button_Randomize_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterCustomizationOptions_CM.WBP_CharacterCustomizationOptions_CM_C.BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature final
{
public:
	class UVALUI_EmoteButtonContainer*            Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_EmoteButton*                     ButtonClicked;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UEmoteDataAsset*                  EmoteDataAsset;                                    // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature) == 0x000018, "Wrong size on WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature, Container) == 0x000000, "Member 'WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature::Container' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature, ButtonClicked) == 0x000008, "Member 'WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature::ButtonClicked' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature, EmoteDataAsset) == 0x000010, "Member 'WBP_CharacterCustomizationOptions_CM_C_BndEvt__WBP_CharacterCreationPanel_CM_EmoteBar_K2Node_ComponentBoundEvent_3_OnEmoteContainerButtonClicked__DelegateSignature::EmoteDataAsset' has a wrong offset!");

// Function WBP_CharacterCustomizationOptions_CM.WBP_CharacterCustomizationOptions_CM_C.ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55DB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55DC[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55DD[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55DE[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55DF[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVALUI_EmoteButtonContainer*            K2Node_ComponentBoundEvent_Container;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_EmoteButton*                     K2Node_ComponentBoundEvent_ButtonClicked;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UEmoteDataAsset*                  K2Node_ComponentBoundEvent_EmoteDataAsset;         // 0x00E8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM");
static_assert(sizeof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM) == 0x0000F8, "Wrong size on WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, EntryPoint) == 0x000000, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000008, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000028, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00002C, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000030, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_object_Variable) == 0x000038, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_real_Variable) == 0x000048, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_real_Variable_1) == 0x000050, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_real_Variable_0) == 0x000058, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_bool_Variable) == 0x000068, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000070, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000090, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000094, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000098, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000A0, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_object_Variable_1) == 0x0000A8, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_real_Variable_2) == 0x0000B0, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_real_Variable_2_0) == 0x0000B8, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_real_Variable_3) == 0x0000C0, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_bool_Variable_1) == 0x0000C8, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, Temp_real_Variable_3_0) == 0x0000D0, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_ComponentBoundEvent_Container) == 0x0000D8, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_ComponentBoundEvent_Container' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_ComponentBoundEvent_ButtonClicked) == 0x0000E0, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_ComponentBoundEvent_ButtonClicked' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_ComponentBoundEvent_EmoteDataAsset) == 0x0000E8, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_ComponentBoundEvent_EmoteDataAsset' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM, K2Node_ComponentBoundEvent_Button) == 0x0000F0, "Member 'WBP_CharacterCustomizationOptions_CM_C_ExecuteUbergraph_WBP_CharacterCustomizationOptions_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_CharacterCustomizationOptions_CM.WBP_CharacterCustomizationOptions_CM_C.InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_CharacterCreation_Continue_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_CharacterCustomizationOptions_CM.WBP_CharacterCustomizationOptions_CM_C.InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_CharacterCustomizationOptions_CM_C_InpActEvt_IA_UI_RandomCharacter_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_CharacterCustomizationOptions_CM.WBP_CharacterCustomizationOptions_CM_C.OnEmoteBarClicked__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_CharacterCustomizationOptions_CM_C_OnEmoteBarClicked__DelegateSignature final
{
public:
	class UVALUI_EmoteButtonContainer*            Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_EmoteButton*                     ButtonClicked;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEmoteDataAsset*                        EmoteDataAsset;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomizationOptions_CM_C_OnEmoteBarClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomizationOptions_CM_C_OnEmoteBarClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomizationOptions_CM_C_OnEmoteBarClicked__DelegateSignature) == 0x000018, "Wrong size on WBP_CharacterCustomizationOptions_CM_C_OnEmoteBarClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_OnEmoteBarClicked__DelegateSignature, Container) == 0x000000, "Member 'WBP_CharacterCustomizationOptions_CM_C_OnEmoteBarClicked__DelegateSignature::Container' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_OnEmoteBarClicked__DelegateSignature, ButtonClicked) == 0x000008, "Member 'WBP_CharacterCustomizationOptions_CM_C_OnEmoteBarClicked__DelegateSignature::ButtonClicked' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomizationOptions_CM_C_OnEmoteBarClicked__DelegateSignature, EmoteDataAsset) == 0x000010, "Member 'WBP_CharacterCustomizationOptions_CM_C_OnEmoteBarClicked__DelegateSignature::EmoteDataAsset' has a wrong offset!");

}

