#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StandaloneInventory_CM

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_2_OnInventorySlotFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_2_OnInventorySlotFocused__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_2_OnInventorySlotFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_2_OnInventorySlotFocused__DelegateSignature");
static_assert(sizeof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_2_OnInventorySlotFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_2_OnInventorySlotFocused__DelegateSignature");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_2_OnInventorySlotFocused__DelegateSignature, Widget) == 0x000000, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_2_OnInventorySlotFocused__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature final
{
public:
	class UWBP_Inventory_CM_C*                    Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 Bag;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature");
static_assert(sizeof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature) == 0x000018, "Wrong size on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature, Inventory) == 0x000000, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature::Inventory' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature, Bag) == 0x000008, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature::Bag' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature, Param_Slot) == 0x000010, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature final
{
public:
	class UWBP_Inventory_CM_C*                    Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 Bag;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature");
static_assert(sizeof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature) == 0x000018, "Wrong size on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature, Inventory) == 0x000000, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature::Inventory' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature, Bag) == 0x000008, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature::Bag' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature, Param_Slot) == 0x000010, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_3_OnInventorySlotFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_3_OnInventorySlotFocused__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_3_OnInventorySlotFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_3_OnInventorySlotFocused__DelegateSignature");
static_assert(sizeof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_3_OnInventorySlotFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_3_OnInventorySlotFocused__DelegateSignature");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_3_OnInventorySlotFocused__DelegateSignature, Widget) == 0x000000, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_3_OnInventorySlotFocused__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature final
{
public:
	class UWBP_Inventory_CM_C*                    Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 Bag;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature");
static_assert(sizeof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature) == 0x000018, "Wrong size on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature, Inventory) == 0x000000, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature::Inventory' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature, Bag) == 0x000008, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature::Bag' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature, Param_Slot) == 0x000010, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature final
{
public:
	class UWBP_Inventory_CM_C*                    Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 Bag;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature");
static_assert(sizeof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature) == 0x000018, "Wrong size on WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature, Inventory) == 0x000000, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature::Inventory' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature, Bag) == 0x000008, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature::Bag' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature, Param_Slot) == 0x000010, "Member 'WBP_StandaloneInventory_CM_C_BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.BP_OnHandleBackAction
// 0x0008 (0x0008 - 0x0000)
struct WBP_StandaloneInventory_CM_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BFA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StandaloneInventory_CM_C_BP_OnHandleBackAction) == 0x000004, "Wrong alignment on WBP_StandaloneInventory_CM_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_StandaloneInventory_CM_C_BP_OnHandleBackAction) == 0x000008, "Wrong size on WBP_StandaloneInventory_CM_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_StandaloneInventory_CM_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_BP_OnHandleBackAction, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_StandaloneInventory_CM_C_BP_OnHandleBackAction::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.CloseInventory
// 0x0008 (0x0008 - 0x0000)
struct WBP_StandaloneInventory_CM_C_CloseInventory final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BFB[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StandaloneInventory_CM_C_CloseInventory) == 0x000004, "Wrong alignment on WBP_StandaloneInventory_CM_C_CloseInventory");
static_assert(sizeof(WBP_StandaloneInventory_CM_C_CloseInventory) == 0x000008, "Wrong size on WBP_StandaloneInventory_CM_C_CloseInventory");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_CloseInventory, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_StandaloneInventory_CM_C_CloseInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_CloseInventory, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_StandaloneInventory_CM_C_CloseInventory::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.ExecuteUbergraph_WBP_StandaloneInventory_CM
// 0x0270 (0x0270 - 0x0000)
struct WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BFC[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BFD[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BFE[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BFF[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       K2Node_CustomEvent_Vitals;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVital_ReturnValue;                     // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVital_ReturnValue_1;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00E8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0100(0x0018)()
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C00[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    K2Node_CustomEvent_Inventory;                      // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C01[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfOverflowSlots_ReturnValue;     // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C02[0x1];                                     // 0x013F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_WaitForValeriaCharacter_valeriaCharacter; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTooltipForVital_ReturnValue;           // 0x0150(0x0018)()
	class FText                                   CallFunc_GetTooltipForVital_ReturnValue_1;         // 0x0168(0x0018)()
	class FText                                   CallFunc_GetTooltipForVital_ReturnValue_2;         // 0x0180(0x0018)()
	class FText                                   CallFunc_GetTooltipForVital_ReturnValue_3;         // 0x0198(0x0018)()
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;              // 0x01B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C03[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Inventory_CM_C*                    K2Node_ComponentBoundEvent_Inventory_3;            // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 K2Node_ComponentBoundEvent_Bag_3;                  // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                K2Node_ComponentBoundEvent_Slot_3;                 // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Inventory_CM_C*                    K2Node_ComponentBoundEvent_Inventory_2;            // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 K2Node_ComponentBoundEvent_Bag_2;                  // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                K2Node_ComponentBoundEvent_Slot_2;                 // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_1;               // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C04[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0204(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVitalsComponent* Vitals)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C05[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C06[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Inventory_CM_C*                    K2Node_ComponentBoundEvent_Inventory_1;            // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 K2Node_ComponentBoundEvent_Bag_1;                  // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                K2Node_ComponentBoundEvent_Slot_1;                 // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Inventory_CM_C*                    K2Node_ComponentBoundEvent_Inventory;              // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 K2Node_ComponentBoundEvent_Bag;                    // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                K2Node_ComponentBoundEvent_Slot;                   // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C07[0x2];                                     // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM) == 0x000008, "Wrong alignment on WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM");
static_assert(sizeof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM) == 0x000270, "Wrong size on WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, EntryPoint) == 0x000000, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000008, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000028, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00002C, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000030, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_object_Variable) == 0x000038, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_real_Variable) == 0x000048, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_real_Variable_1) == 0x000050, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_real_Variable_0) == 0x000058, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_bool_Variable) == 0x000068, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000070, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000090, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000094, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000098, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000A0, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_object_Variable_1) == 0x0000A8, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_real_Variable_2) == 0x0000B0, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_real_Variable_2_0) == 0x0000B8, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_real_Variable_3) == 0x0000C0, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_bool_Variable_1) == 0x0000C8, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, Temp_real_Variable_3_0) == 0x0000D0, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_CustomEvent_Vitals) == 0x0000D8, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_CustomEvent_Vitals' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_GetVital_ReturnValue) == 0x0000E0, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_GetVital_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_GetVital_ReturnValue_1) == 0x0000E4, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_GetVital_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_Conv_IntToText_ReturnValue) == 0x0000E8, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000100, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000118, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_CustomEvent_Inventory) == 0x000120, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_CustomEvent_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_GetValeriaCharacter_OutResult) == 0x000128, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000130, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_GetNumberOfOverflowSlots_ReturnValue) == 0x000138, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_GetNumberOfOverflowSlots_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_Greater_IntInt_ReturnValue) == 0x00013C, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_Less_IntInt_ReturnValue) == 0x00013D, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_SwitchEnum_CmpSuccess) == 0x00013E, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_WaitForValeriaCharacter_valeriaCharacter) == 0x000140, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_WaitForValeriaCharacter_valeriaCharacter' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_GetInventory_ReturnValue) == 0x000148, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_GetTooltipForVital_ReturnValue) == 0x000150, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_GetTooltipForVital_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_GetTooltipForVital_ReturnValue_1) == 0x000168, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_GetTooltipForVital_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_GetTooltipForVital_ReturnValue_2) == 0x000180, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_GetTooltipForVital_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_GetTooltipForVital_ReturnValue_3) == 0x000198, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_GetTooltipForVital_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x0001B0, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_CreateDelegate_OutputDelegate) == 0x0001B4, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Inventory_3) == 0x0001C8, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Inventory_3' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Bag_3) == 0x0001D0, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Bag_3' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Slot_3) == 0x0001D8, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Slot_3' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Inventory_2) == 0x0001E0, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Inventory_2' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Bag_2) == 0x0001E8, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Bag_2' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Slot_2) == 0x0001F0, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Slot_2' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Widget_1) == 0x0001F8, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_IsValid_ReturnValue) == 0x000200, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000204, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000214, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Widget) == 0x000228, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_IsValid_ReturnValue_1) == 0x000230, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Inventory_1) == 0x000238, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Inventory_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Bag_1) == 0x000240, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Bag_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Slot_1) == 0x000248, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Inventory) == 0x000250, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Bag) == 0x000258, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Bag' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_ComponentBoundEvent_Slot) == 0x000260, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_ComponentBoundEvent_Slot' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, K2Node_Event_IsDesignTime) == 0x000268, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_IsConsolePlatform_ReturnValue) == 0x000269, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM, CallFunc_AkEventGlobal_ReturnValue_3) == 0x00026C, "Member 'WBP_StandaloneInventory_CM_C_ExecuteUbergraph_WBP_StandaloneInventory_CM::CallFunc_AkEventGlobal_ReturnValue_3' has a wrong offset!");

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.GetAllInventoryWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_StandaloneInventory_CM_C_GetAllInventoryWidgets final
{
public:
	TArray<class UWBP_Inventory_CM_C*>            InventoryWidgets;                                  // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWBP_Inventory_CM_C*>            K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_StandaloneInventory_CM_C_GetAllInventoryWidgets) == 0x000008, "Wrong alignment on WBP_StandaloneInventory_CM_C_GetAllInventoryWidgets");
static_assert(sizeof(WBP_StandaloneInventory_CM_C_GetAllInventoryWidgets) == 0x000020, "Wrong size on WBP_StandaloneInventory_CM_C_GetAllInventoryWidgets");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_GetAllInventoryWidgets, InventoryWidgets) == 0x000000, "Member 'WBP_StandaloneInventory_CM_C_GetAllInventoryWidgets::InventoryWidgets' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_GetAllInventoryWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_StandaloneInventory_CM_C_GetAllInventoryWidgets::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.GetCharacterInventory
// 0x0028 (0x0028 - 0x0000)
struct WBP_StandaloneInventory_CM_C_GetCharacterInventory final
{
public:
	class UPlayerInventoryComponent*              Inventory;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C08[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C09[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StandaloneInventory_CM_C_GetCharacterInventory) == 0x000008, "Wrong alignment on WBP_StandaloneInventory_CM_C_GetCharacterInventory");
static_assert(sizeof(WBP_StandaloneInventory_CM_C_GetCharacterInventory) == 0x000028, "Wrong size on WBP_StandaloneInventory_CM_C_GetCharacterInventory");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_GetCharacterInventory, Inventory) == 0x000000, "Member 'WBP_StandaloneInventory_CM_C_GetCharacterInventory::Inventory' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_GetCharacterInventory, CallFunc_GetValeriaCharacter_OutResult) == 0x000008, "Member 'WBP_StandaloneInventory_CM_C_GetCharacterInventory::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_GetCharacterInventory, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_StandaloneInventory_CM_C_GetCharacterInventory::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_GetCharacterInventory, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_StandaloneInventory_CM_C_GetCharacterInventory::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_StandaloneInventory_CM_C_GetCharacterInventory, CallFunc_GetInventory_ReturnValue) == 0x000020, "Member 'WBP_StandaloneInventory_CM_C_GetCharacterInventory::CallFunc_GetInventory_ReturnValue' has a wrong offset!");

// Function WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C.HandleButtonClicked
// 0x02C8 (0x02C8 - 0x0000)
struct WBP_StandaloneInventory_CM_C_HandleButtonClicked final
{
public:
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bRightClick;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C0A[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogueManagerComponent*              DialogueManager;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               PlayerController;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C0B[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBagSlotLocation                       K2Node_MakeStruct_BagSlotLocation;                 // 0x0028(0x0008)(NoDestructor)
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C0C[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogueManagerComponent*              CallFunc_GetDialogueManager_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C0D[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           CallFunc_GetItem_Item;                             // 0x0050(0x0060)()
	struct FValeriaItem                           CallFunc_GetItem_Item_1;                           // 0x00B0(0x0060)()
	struct FValeriaItem                           CallFunc_GetItem_Item_2;                           // 0x0110(0x0060)()
	struct FValeriaItem                           CallFunc_GetItem_Item_3;                           // 0x0170(0x0060)()
	struct FValeriaItem                           CallFunc_GetItem_Item_4;                           // 0x01D0(0x0060)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
