#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActionBarRowTick

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActionBarRowTick.WBP_ActionBarRowTick_C
// 0x0020 (0x02E0 - 0x02C0)
class UWBP_ActionBarRowTick_C final : public UUserWidget
{
public:
	class UImage*                                 CarouselDot_Large;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CarouselDot_Small;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_187;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          PreventSpamBeginPlay;                              // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Toggle(bool IsOn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActionBarRowTick_C">();
	}
	static class UWBP_ActionBarRowTick_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActionBarRowTick_C>();
	}
};
static_assert(alignof(UWBP_ActionBarRowTick_C) == 0x000008, "Wrong alignment on UWBP_ActionBarRowTick_C");
static_assert(sizeof(UWBP_ActionBarRowTick_C) == 0x0002E0, "Wrong size on UWBP_ActionBarRowTick_C");
static_assert(offsetof(UWBP_ActionBarRowTick_C, CarouselDot_Large) == 0x0002C0, "Member 'UWBP_ActionBarRowTick_C::CarouselDot_Large' has a wrong offset!");
static_assert(offsetof(UWBP_ActionBarRowTick_C, CarouselDot_Small) == 0x0002C8, "Member 'UWBP_ActionBarRowTick_C::CarouselDot_Small' has a wrong offset!");
static_assert(offsetof(UWBP_ActionBarRowTick_C, WidgetSwitcher_187) == 0x0002D0, "Member 'UWBP_ActionBarRowTick_C::WidgetSwitcher_187' has a wrong offset!");
static_assert(offsetof(UWBP_ActionBarRowTick_C, PreventSpamBeginPlay) == 0x0002D8, "Member 'UWBP_ActionBarRowTick_C::PreventSpamBeginPlay' has a wrong offset!");

}

