#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HousePlotMode

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.ExecuteUbergraph_WBP_HousePlotMode
// 0x0100 (0x0100 - 0x0000)
struct WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B0[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B1[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EHousingPermissionLevel Level)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0040(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B2[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* Character, bool Flag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlacementPickupModeActive_ReturnValue;  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B3[0x1];                                     // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaPlayerController* PC)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B4[0x2];                                     // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnectedButtonApplicable_bApplicable;  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B5[0x2];                                     // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPlacementComponent* PC)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFreePlacementButtonApplicable_bApplicable; // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B6[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B7[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHousingPermissionLevel                       K2Node_CustomEvent_level;                          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode) == 0x000008, "Wrong alignment on WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode");
static_assert(sizeof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode) == 0x000100, "Wrong size on WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, EntryPoint) == 0x000000, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, Temp_byte_Variable) == 0x000004, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, Temp_bool_Variable) == 0x000005, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, Temp_int_Variable) == 0x000008, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, Temp_int_Variable_1) == 0x00000C, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, Temp_bool_Variable_1) == 0x000010, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, Temp_byte_Variable_2) == 0x000012, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_Event_MyGeometry) == 0x000040, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_Event_InDeltaTime) == 0x000078, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_GetValeriaCharacter_OutResult) == 0x00007C, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000080, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000098, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_IsPlacementPickupModeActive_ReturnValue) == 0x0000A0, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_IsPlacementPickupModeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_SwitchEnum_CmpSuccess) == 0x0000A1, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, Temp_byte_Variable_3) == 0x0000A2, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A4, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_IsVisible_ReturnValue) == 0x0000B4, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_GetValeriaPlayerController_OutResult) == 0x0000B5, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_GetValeriaPlayerController_ReturnValue_1) == 0x0000B8, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_GetValeriaPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_IsConnectedButtonApplicable_bApplicable) == 0x0000C0, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_IsConnectedButtonApplicable_bApplicable' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_IsInputKeyDown_ReturnValue) == 0x0000C1, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_IsInputKeyDown_ReturnValue_1) == 0x0000C2, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_IsInputKeyDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000C3, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_BooleanOR_ReturnValue) == 0x0000C4, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, Temp_bool_Variable_2) == 0x0000C5, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C8, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_Select_Default) == 0x0000D8, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_IsFreePlacementButtonApplicable_bApplicable) == 0x0000DC, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_IsFreePlacementButtonApplicable_bApplicable' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0000E0, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_CanStartTutorialForFlag_ReturnValue) == 0x0000E8, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_CanStartTutorialForFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_Select_Default_1) == 0x0000E9, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x0000F0, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_CustomEvent_level) == 0x0000F8, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_CustomEvent_level' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_Event_IsDesignTime) == 0x0000F9, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_CustomEvent_bNewInputType) == 0x0000FA, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000FB, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, CallFunc_BooleanAND_ReturnValue) == 0x0000FC, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode, K2Node_Select_Default_2) == 0x0000FD, "Member 'WBP_HousePlotMode_C_ExecuteUbergraph_WBP_HousePlotMode::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.Is on Occupied Housing Plot
// 0x0050 (0x0050 - 0x0000)
struct WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               K2Node_DynamicCast_AsValeria_Player_Controller;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B9[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHousingPlotActor*                      CallFunc_GetOccupiedHousingPlot_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAtHome_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47BA[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HousingPlotActor_C*                 K2Node_DynamicCast_AsBP_Housing_Plot_Actor;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalCharacterAtThisPlot__IsInside;     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalCharacterAtThisPlot__HasCharacterLoaded; // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47BB[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInHousingEditMode_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot) == 0x000008, "Wrong alignment on WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot");
static_assert(sizeof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot) == 0x000050, "Wrong size on WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, ReturnValue) == 0x000000, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, K2Node_DynamicCast_AsValeria_Player_Controller) == 0x000010, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::K2Node_DynamicCast_AsValeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, CallFunc_GetOccupiedHousingPlot_ReturnValue) == 0x000020, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::CallFunc_GetOccupiedHousingPlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, CallFunc_IsAtHome_ReturnValue) == 0x000028, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::CallFunc_IsAtHome_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, K2Node_DynamicCast_AsBP_Housing_Plot_Actor) == 0x000030, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::K2Node_DynamicCast_AsBP_Housing_Plot_Actor' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, CallFunc_IsLocalCharacterAtThisPlot__IsInside) == 0x000039, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::CallFunc_IsLocalCharacterAtThisPlot__IsInside' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, CallFunc_IsLocalCharacterAtThisPlot__HasCharacterLoaded) == 0x00003A, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::CallFunc_IsLocalCharacterAtThisPlot__HasCharacterLoaded' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, CallFunc_IsValid_ReturnValue) == 0x00003B, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000040, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, CallFunc_IsInHousingEditMode_ReturnValue) == 0x000048, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::CallFunc_IsInHousingEditMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'WBP_HousePlotMode_C_Is_on_Occupied_Housing_Plot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.IsConnectedButtonApplicable
// 0x0040 (0x0040 - 0x0000)
struct WBP_HousePlotMode_C_IsConnectedButtonApplicable final
{
public:
	bool                                          bApplicable;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47BC[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47BD[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractorComponent*                   CallFunc_GetInteractorComponent_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlacementPickupModeActive_ReturnValue;  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47BE[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFenceMeshComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_IsConnectedButtonApplicable) == 0x000008, "Wrong alignment on WBP_HousePlotMode_C_IsConnectedButtonApplicable");
static_assert(sizeof(WBP_HousePlotMode_C_IsConnectedButtonApplicable) == 0x000040, "Wrong size on WBP_HousePlotMode_C_IsConnectedButtonApplicable");
static_assert(offsetof(WBP_HousePlotMode_C_IsConnectedButtonApplicable, bApplicable) == 0x000000, "Member 'WBP_HousePlotMode_C_IsConnectedButtonApplicable::bApplicable' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsConnectedButtonApplicable, CallFunc_GetValeriaCharacter_OutResult) == 0x000001, "Member 'WBP_HousePlotMode_C_IsConnectedButtonApplicable::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsConnectedButtonApplicable, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_HousePlotMode_C_IsConnectedButtonApplicable::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsConnectedButtonApplicable, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_HousePlotMode_C_IsConnectedButtonApplicable::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsConnectedButtonApplicable, CallFunc_GetInteractorComponent_ReturnValue) == 0x000018, "Member 'WBP_HousePlotMode_C_IsConnectedButtonApplicable::CallFunc_GetInteractorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsConnectedButtonApplicable, CallFunc_IsPlacementPickupModeActive_ReturnValue) == 0x000020, "Member 'WBP_HousePlotMode_C_IsConnectedButtonApplicable::CallFunc_IsPlacementPickupModeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsConnectedButtonApplicable, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_HousePlotMode_C_IsConnectedButtonApplicable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsConnectedButtonApplicable, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'WBP_HousePlotMode_C_IsConnectedButtonApplicable::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsConnectedButtonApplicable, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'WBP_HousePlotMode_C_IsConnectedButtonApplicable::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsConnectedButtonApplicable, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'WBP_HousePlotMode_C_IsConnectedButtonApplicable::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.IsFreePlacementButtonApplicable
// 0x0028 (0x0028 - 0x0000)
struct WBP_HousePlotMode_C_IsFreePlacementButtonApplicable final
{
public:
	bool                                          bApplicable;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47BF[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C0[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlacementComponent*                    CallFunc_GetPlacement_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlacementPickupModeActive_ReturnValue;  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlacing_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_IsFreePlacementButtonApplicable) == 0x000008, "Wrong alignment on WBP_HousePlotMode_C_IsFreePlacementButtonApplicable");
static_assert(sizeof(WBP_HousePlotMode_C_IsFreePlacementButtonApplicable) == 0x000028, "Wrong size on WBP_HousePlotMode_C_IsFreePlacementButtonApplicable");
static_assert(offsetof(WBP_HousePlotMode_C_IsFreePlacementButtonApplicable, bApplicable) == 0x000000, "Member 'WBP_HousePlotMode_C_IsFreePlacementButtonApplicable::bApplicable' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsFreePlacementButtonApplicable, CallFunc_GetValeriaCharacter_OutResult) == 0x000001, "Member 'WBP_HousePlotMode_C_IsFreePlacementButtonApplicable::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsFreePlacementButtonApplicable, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_HousePlotMode_C_IsFreePlacementButtonApplicable::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsFreePlacementButtonApplicable, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_HousePlotMode_C_IsFreePlacementButtonApplicable::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsFreePlacementButtonApplicable, CallFunc_GetPlacement_ReturnValue) == 0x000018, "Member 'WBP_HousePlotMode_C_IsFreePlacementButtonApplicable::CallFunc_GetPlacement_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsFreePlacementButtonApplicable, CallFunc_IsPlacementPickupModeActive_ReturnValue) == 0x000020, "Member 'WBP_HousePlotMode_C_IsFreePlacementButtonApplicable::CallFunc_IsPlacementPickupModeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_IsFreePlacementButtonApplicable, CallFunc_IsPlacing_ReturnValue) == 0x000021, "Member 'WBP_HousePlotMode_C_IsFreePlacementButtonApplicable::CallFunc_IsPlacing_ReturnValue' has a wrong offset!");

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.On Get User Menu Content 2
// 0x0068 (0x0068 - 0x0000)
struct WBP_HousePlotMode_C_On_Get_User_Menu_Content_2 final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C1[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C2[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FTUEPopin_CM_C*                    CallFunc_Redirect_FTUEPopin_Type_FTUEPopin;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopinCalloutWidget_C*              CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C3[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2) == 0x000008, "Wrong alignment on WBP_HousePlotMode_C_On_Get_User_Menu_Content_2");
static_assert(sizeof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2) == 0x000068, "Wrong size on WBP_HousePlotMode_C_On_Get_User_Menu_Content_2");
static_assert(offsetof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2, ReturnValue) == 0x000000, "Member 'WBP_HousePlotMode_C_On_Get_User_Menu_Content_2::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_HousePlotMode_C_On_Get_User_Menu_Content_2::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'WBP_HousePlotMode_C_On_Get_User_Menu_Content_2::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2, K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM) == 0x000018, "Member 'WBP_HousePlotMode_C_On_Get_User_Menu_Content_2::K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_HousePlotMode_C_On_Get_User_Menu_Content_2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'WBP_HousePlotMode_C_On_Get_User_Menu_Content_2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2, CallFunc_Redirect_FTUEPopin_Type_FTUEPopin) == 0x000040, "Member 'WBP_HousePlotMode_C_On_Get_User_Menu_Content_2::CallFunc_Redirect_FTUEPopin_Type_FTUEPopin' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'WBP_HousePlotMode_C_On_Get_User_Menu_Content_2::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2, CallFunc_Create_ReturnValue) == 0x000050, "Member 'WBP_HousePlotMode_C_On_Get_User_Menu_Content_2::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_HousePlotMode_C_On_Get_User_Menu_Content_2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_Get_User_Menu_Content_2, CallFunc_SetContent_ReturnValue) == 0x000060, "Member 'WBP_HousePlotMode_C_On_Get_User_Menu_Content_2::CallFunc_SetContent_ReturnValue' has a wrong offset!");

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.On GetUserMenuContent 1
// 0x0068 (0x0068 - 0x0000)
struct WBP_HousePlotMode_C_On_GetUserMenuContent_1 final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C4[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C5[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FTUEPopin_CM_C*                    CallFunc_Redirect_FTUEPopin_Type_FTUEPopin;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopinCalloutWidget_C*              CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C6[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_On_GetUserMenuContent_1) == 0x000008, "Wrong alignment on WBP_HousePlotMode_C_On_GetUserMenuContent_1");
static_assert(sizeof(WBP_HousePlotMode_C_On_GetUserMenuContent_1) == 0x000068, "Wrong size on WBP_HousePlotMode_C_On_GetUserMenuContent_1");
static_assert(offsetof(WBP_HousePlotMode_C_On_GetUserMenuContent_1, ReturnValue) == 0x000000, "Member 'WBP_HousePlotMode_C_On_GetUserMenuContent_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_GetUserMenuContent_1, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_HousePlotMode_C_On_GetUserMenuContent_1::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_GetUserMenuContent_1, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'WBP_HousePlotMode_C_On_GetUserMenuContent_1::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_GetUserMenuContent_1, K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM) == 0x000018, "Member 'WBP_HousePlotMode_C_On_GetUserMenuContent_1::K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_GetUserMenuContent_1, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_HousePlotMode_C_On_GetUserMenuContent_1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_GetUserMenuContent_1, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'WBP_HousePlotMode_C_On_GetUserMenuContent_1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_GetUserMenuContent_1, CallFunc_Redirect_FTUEPopin_Type_FTUEPopin) == 0x000040, "Member 'WBP_HousePlotMode_C_On_GetUserMenuContent_1::CallFunc_Redirect_FTUEPopin_Type_FTUEPopin' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_GetUserMenuContent_1, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'WBP_HousePlotMode_C_On_GetUserMenuContent_1::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_GetUserMenuContent_1, CallFunc_Create_ReturnValue) == 0x000050, "Member 'WBP_HousePlotMode_C_On_GetUserMenuContent_1::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_GetUserMenuContent_1, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_HousePlotMode_C_On_GetUserMenuContent_1::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_On_GetUserMenuContent_1, CallFunc_SetContent_ReturnValue) == 0x000060, "Member 'WBP_HousePlotMode_C_On_GetUserMenuContent_1::CallFunc_SetContent_ReturnValue' has a wrong offset!");

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.OnInputMethodChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct WBP_HousePlotMode_C_OnInputMethodChanged_Event final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_OnInputMethodChanged_Event) == 0x000001, "Wrong alignment on WBP_HousePlotMode_C_OnInputMethodChanged_Event");
static_assert(sizeof(WBP_HousePlotMode_C_OnInputMethodChanged_Event) == 0x000001, "Wrong size on WBP_HousePlotMode_C_OnInputMethodChanged_Event");
static_assert(offsetof(WBP_HousePlotMode_C_OnInputMethodChanged_Event, bNewInputType) == 0x000000, "Member 'WBP_HousePlotMode_C_OnInputMethodChanged_Event::bNewInputType' has a wrong offset!");

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_HousePlotMode_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_HousePlotMode_C_PreConstruct");
static_assert(sizeof(WBP_HousePlotMode_C_PreConstruct) == 0x000001, "Wrong size on WBP_HousePlotMode_C_PreConstruct");
static_assert(offsetof(WBP_HousePlotMode_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_HousePlotMode_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.ShowCurrentHousingPermission
// 0x0001 (0x0001 - 0x0000)
struct WBP_HousePlotMode_C_ShowCurrentHousingPermission final
{
public:
	EHousingPermissionLevel                       Level;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_ShowCurrentHousingPermission) == 0x000001, "Wrong alignment on WBP_HousePlotMode_C_ShowCurrentHousingPermission");
static_assert(sizeof(WBP_HousePlotMode_C_ShowCurrentHousingPermission) == 0x000001, "Wrong size on WBP_HousePlotMode_C_ShowCurrentHousingPermission");
static_assert(offsetof(WBP_HousePlotMode_C_ShowCurrentHousingPermission, Level) == 0x000000, "Member 'WBP_HousePlotMode_C_ShowCurrentHousingPermission::Level' has a wrong offset!");

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_HousePlotMode_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_Tick) == 0x000004, "Wrong alignment on WBP_HousePlotMode_C_Tick");
static_assert(sizeof(WBP_HousePlotMode_C_Tick) == 0x00003C, "Wrong size on WBP_HousePlotMode_C_Tick");
static_assert(offsetof(WBP_HousePlotMode_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_HousePlotMode_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_HousePlotMode_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.UpdateFreePlacementModeIcon
// 0x0018 (0x0018 - 0x0000)
struct WBP_HousePlotMode_C_UpdateFreePlacementModeIcon final
{
public:
	class UPlacementComponent*                    Placement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFreePlacementModeActive_ReturnValue;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C7[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_UpdateFreePlacementModeIcon) == 0x000008, "Wrong alignment on WBP_HousePlotMode_C_UpdateFreePlacementModeIcon");
static_assert(sizeof(WBP_HousePlotMode_C_UpdateFreePlacementModeIcon) == 0x000018, "Wrong size on WBP_HousePlotMode_C_UpdateFreePlacementModeIcon");
static_assert(offsetof(WBP_HousePlotMode_C_UpdateFreePlacementModeIcon, Placement) == 0x000000, "Member 'WBP_HousePlotMode_C_UpdateFreePlacementModeIcon::Placement' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_UpdateFreePlacementModeIcon, Temp_bool_Variable) == 0x000008, "Member 'WBP_HousePlotMode_C_UpdateFreePlacementModeIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_UpdateFreePlacementModeIcon, CallFunc_IsFreePlacementModeActive_ReturnValue) == 0x000009, "Member 'WBP_HousePlotMode_C_UpdateFreePlacementModeIcon::CallFunc_IsFreePlacementModeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_UpdateFreePlacementModeIcon, Temp_int_Variable) == 0x00000C, "Member 'WBP_HousePlotMode_C_UpdateFreePlacementModeIcon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_UpdateFreePlacementModeIcon, Temp_int_Variable_1) == 0x000010, "Member 'WBP_HousePlotMode_C_UpdateFreePlacementModeIcon::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HousePlotMode_C_UpdateFreePlacementModeIcon, K2Node_Select_Default) == 0x000014, "Member 'WBP_HousePlotMode_C_UpdateFreePlacementModeIcon::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HousePlotMode.WBP_HousePlotMode_C.UpdatePermissionVisibility
// 0x0019 (0x0019 - 0x0000)
struct WBP_HousePlotMode_C_UpdatePermissionVisibility final
{
public:
	EHousingPermissionLevel                       Permission;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHousingPermissionLevel                       Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHousingPermissionLevel                       Temp_byte_Variable_11;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_17;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_18;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_19;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_20;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_21;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HousePlotMode_C_UpdatePermissionVisibility) == 0x000001, "Wrong alignment on WBP_HousePlotMode_C_UpdatePermissionVisibility");
static_assert(sizeof(WBP_HousePlotMode_C_UpdatePermissionVisibility) == 0x000019, "Wrong size on WBP_HousePlotMode_C_UpdatePermissionVisibility");
