#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonUIButtonPromptItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "F_CommonUIButtonPrompt_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CommonUIButtonPromptItem.WBP_CommonUIButtonPromptItem_C
// 0x00B8 (0x03A0 - 0x02E8)
class UWBP_CommonUIButtonPromptItem_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CommonInputActionWidget_C*         CommonInputActionWidget_IA;                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                DescTextWidget;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                PromptInfo;                                        // 0x0300(0x0040)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FSlateColor> ColorMap;                                          // 0x0340(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           SpecialGameplayTag;                                // 0x0390(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnable;                                          // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CommonUIButtonPromptItem(int32 EntryPoint, bool K2Node_Event_IsDesignTime);
	void GetCurrentPromptInfo(struct FF_CommonUIButtonPrompt* NewParam, class FText CallFunc_GetText_ReturnValue, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt);
	void GetEnabled(bool* Param_IsEnable);
	void InitPromptItem(const struct FF_CommonUIButtonPrompt& New_Prompt_Info, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FMargin& K2Node_MakeStruct_Margin, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_TextIsEmpty_ReturnValue);
	void OverrideTextColor(const struct FSlateColor& DefaultTextColor, const struct FSlateColor& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	void PreConstruct(bool IsDesignTime);
	void ResetOpacity();
	void SetDisableOpacity(double DisableOpacity, float CallFunc_SetRenderOpacity_InOpacity_ImplicitCast);
	void SetEnabled(bool Enable);
	void SetText(class FText NewText);
	void Update_Widget_by_Tag(const struct FGameplayTag& GameplayTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CommonUIButtonPromptItem_C">();
	}
	static class UWBP_CommonUIButtonPromptItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CommonUIButtonPromptItem_C>();
	}
};
static_assert(alignof(UWBP_CommonUIButtonPromptItem_C) == 0x000008, "Wrong alignment on UWBP_CommonUIButtonPromptItem_C");
static_assert(sizeof(UWBP_CommonUIButtonPromptItem_C) == 0x0003A0, "Wrong size on UWBP_CommonUIButtonPromptItem_C");
static_assert(offsetof(UWBP_CommonUIButtonPromptItem_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_CommonUIButtonPromptItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPromptItem_C, CommonInputActionWidget_IA) == 0x0002F0, "Member 'UWBP_CommonUIButtonPromptItem_C::CommonInputActionWidget_IA' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPromptItem_C, DescTextWidget) == 0x0002F8, "Member 'UWBP_CommonUIButtonPromptItem_C::DescTextWidget' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPromptItem_C, PromptInfo) == 0x000300, "Member 'UWBP_CommonUIButtonPromptItem_C::PromptInfo' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPromptItem_C, ColorMap) == 0x000340, "Member 'UWBP_CommonUIButtonPromptItem_C::ColorMap' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPromptItem_C, SpecialGameplayTag) == 0x000390, "Member 'UWBP_CommonUIButtonPromptItem_C::SpecialGameplayTag' has a wrong offset!");
static_assert(offsetof(UWBP_CommonUIButtonPromptItem_C, IsEnable) == 0x000398, "Member 'UWBP_CommonUIButtonPromptItem_C::IsEnable' has a wrong offset!");

}

