#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PhotoCameraScreen_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Palia_structs.hpp"
#include "S6UICore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_PhotoCameraScreen_CM.WBP_PhotoCameraScreen_CM_C.ApplyMagnification
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_PhotoCameraScreen_CM_C_ApplyMagnification final
{
public:
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_2;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B45[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B46[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character_1;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSelfieMode_bWantsSelfieMode;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B47[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue_3;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast_1;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AudioZoomRTPC_Zoom_ImplicitCast;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_OutRangeA_ImplicitCast;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_OutRangeA_ImplicitCast_1; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_OutRangeB_ImplicitCast;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_OutRangeB_ImplicitCast_1; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AudioZoomRTPC_Zoom_ImplicitCast_1;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_InRangeB_ImplicitCast;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_InRangeA_ImplicitCast;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFPSPhotoModeFOV_Value_ImplicitCast;    // 0x00A0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B48[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_InRangeB_ImplicitCast_1;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_InRangeA_ImplicitCast_1;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSelfieModeDollyDistance_Value_ImplicitCast; // 0x00B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification) == 0x000008, "Wrong alignment on WBP_PhotoCameraScreen_CM_C_ApplyMagnification");
static_assert(sizeof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification) == 0x0000C0, "Wrong size on WBP_PhotoCameraScreen_CM_C_ApplyMagnification");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_GetValue_ReturnValue) == 0x000000, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_GetValue_ReturnValue_1) == 0x000004, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000008, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_GetValue_ReturnValue_2) == 0x000010, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_GetValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, K2Node_DynamicCast_AsValeria_Character) == 0x000018, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::K2Node_DynamicCast_AsValeria_Character' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_GetOwningPlayerPawn_ReturnValue_1) == 0x000028, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_GetOwningPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, K2Node_DynamicCast_AsValeria_Character_1) == 0x000030, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::K2Node_DynamicCast_AsValeria_Character_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_IsInSelfieMode_bWantsSelfieMode) == 0x000039, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_IsInSelfieMode_bWantsSelfieMode' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_GetValue_ReturnValue_3) == 0x00003C, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_GetValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_ReturnValue) == 0x000040, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000048, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000050, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_Value_ImplicitCast_1) == 0x000058, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_AudioZoomRTPC_Zoom_ImplicitCast) == 0x000060, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_AudioZoomRTPC_Zoom_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_OutRangeA_ImplicitCast) == 0x000068, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_OutRangeA_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_OutRangeA_ImplicitCast_1) == 0x000070, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_OutRangeA_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_OutRangeB_ImplicitCast) == 0x000078, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_OutRangeB_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_OutRangeB_ImplicitCast_1) == 0x000080, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_OutRangeB_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_AudioZoomRTPC_Zoom_ImplicitCast_1) == 0x000088, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_AudioZoomRTPC_Zoom_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_InRangeB_ImplicitCast) == 0x000090, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_InRangeB_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_InRangeA_ImplicitCast) == 0x000098, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_InRangeA_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_SetFPSPhotoModeFOV_Value_ImplicitCast) == 0x0000A0, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_SetFPSPhotoModeFOV_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_InRangeB_ImplicitCast_1) == 0x0000A8, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_InRangeB_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_MapRangeClamped_InRangeA_ImplicitCast_1) == 0x0000B0, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_MapRangeClamped_InRangeA_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ApplyMagnification, CallFunc_SetSelfieModeDollyDistance_Value_ImplicitCast) == 0x0000B8, "Member 'WBP_PhotoCameraScreen_CM_C_ApplyMagnification::CallFunc_SetSelfieModeDollyDistance_Value_ImplicitCast' has a wrong offset!");

// Function WBP_PhotoCameraScreen_CM.WBP_PhotoCameraScreen_CM_C.AudioZoomRTPC
// 0x0018 (0x0018 - 0x0000)
struct WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC final
{
public:
	double                                        Zoom;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Pawn;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B49[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC) == 0x000008, "Wrong alignment on WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC");
static_assert(sizeof(WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC) == 0x000018, "Wrong size on WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC, Zoom) == 0x000000, "Member 'WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC::Zoom' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC, Pawn) == 0x000008, "Member 'WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC::Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC, CallFunc_IsLocallyControlled_ReturnValue) == 0x000010, "Member 'WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC, CallFunc_AkEventGlobal_ReturnValue) == 0x000014, "Member 'WBP_PhotoCameraScreen_CM_C_AudioZoomRTPC::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");

// Function WBP_PhotoCameraScreen_CM.WBP_PhotoCameraScreen_CM_C.BndEvt__Slider_96_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_PhotoCameraScreen_CM_C_BndEvt__Slider_96_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhotoCameraScreen_CM_C_BndEvt__Slider_96_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_PhotoCameraScreen_CM_C_BndEvt__Slider_96_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_PhotoCameraScreen_CM_C_BndEvt__Slider_96_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_PhotoCameraScreen_CM_C_BndEvt__Slider_96_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_BndEvt__Slider_96_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_PhotoCameraScreen_CM_C_BndEvt__Slider_96_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_PhotoCameraScreen_CM.WBP_PhotoCameraScreen_CM_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_PhotoCameraScreen_CM_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhotoCameraScreen_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_PhotoCameraScreen_CM_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_PhotoCameraScreen_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_PhotoCameraScreen_CM_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_PhotoCameraScreen_CM_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_PhotoCameraScreen_CM.WBP_PhotoCameraScreen_CM_C.CapturePhoto
// 0x0020 (0x0020 - 0x0000)
struct WBP_PhotoCameraScreen_CM_C_CapturePhoto final
{
public:
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PhotographyManager*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_CreateCapturedPhotograph_ReturnValue;     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhotoCameraScreen_CM_C_CapturePhoto) == 0x000008, "Wrong alignment on WBP_PhotoCameraScreen_CM_C_CapturePhoto");
static_assert(sizeof(WBP_PhotoCameraScreen_CM_C_CapturePhoto) == 0x000020, "Wrong size on WBP_PhotoCameraScreen_CM_C_CapturePhoto");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_CapturePhoto, CallFunc_AkEventGlobal_ReturnValue) == 0x000000, "Member 'WBP_PhotoCameraScreen_CM_C_CapturePhoto::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_CapturePhoto, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_PhotoCameraScreen_CM_C_CapturePhoto::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_CapturePhoto, CallFunc_CreateCapturedPhotograph_ReturnValue) == 0x000010, "Member 'WBP_PhotoCameraScreen_CM_C_CapturePhoto::CallFunc_CreateCapturedPhotograph_ReturnValue' has a wrong offset!");

// Function WBP_PhotoCameraScreen_CM.WBP_PhotoCameraScreen_CM_C.CheckInputMode
// 0x0010 (0x0010 - 0x0000)
struct WBP_PhotoCameraScreen_CM_C_CheckInputMode final
{
public:
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhotoCameraScreen_CM_C_CheckInputMode) == 0x000008, "Wrong alignment on WBP_PhotoCameraScreen_CM_C_CheckInputMode");
static_assert(sizeof(WBP_PhotoCameraScreen_CM_C_CheckInputMode) == 0x000010, "Wrong size on WBP_PhotoCameraScreen_CM_C_CheckInputMode");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_CheckInputMode, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_PhotoCameraScreen_CM_C_CheckInputMode::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_CheckInputMode, CallFunc_GetCurrentInputType_ReturnValue) == 0x000008, "Member 'WBP_PhotoCameraScreen_CM_C_CheckInputMode::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_CheckInputMode, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'WBP_PhotoCameraScreen_CM_C_CheckInputMode::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_PhotoCameraScreen_CM.WBP_PhotoCameraScreen_CM_C.ExecuteUbergraph_WBP_PhotoCameraScreen_CM
// 0x0428 (0x0428 - 0x0000)
struct WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PhotographyManager*                CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x0010(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4C[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4D[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x0078(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4E[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x00B0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x00D8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4F[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_1;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_1;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B50[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0128(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0150(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B51[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0160(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0188(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_4; // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B52[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_1;                            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_1;                            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B53[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x01D8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0200(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_5; // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B54[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B55[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_7_0;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_UIManagerWidgetBase*             K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base;  // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B56[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerCameraManager*               K2Node_DynamicCast_AsVAL_Player_Camera_Manager;    // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B57[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_PlayerCameraManager*               K2Node_DynamicCast_AsVAL_Player_Camera_Manager_1;  // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B58[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UVAL_PhotographyManager* PhotographyManager)> K2Node_CreateDelegate_OutputDelegate;              // 0x028C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_PhotographyManager* PhotographyManager, class UVAL_CapturedPhotograph* CapturedPhotograph)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x029C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B59[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerCameraManager*               K2Node_DynamicCast_AsVAL_Player_Camera_Manager_2;  // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5A[0x2];                                     // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_MakeStruct_Guid;                            // 0x02DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_RegisterInputActionBinding_ReturnValue;   // 0x02EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5B[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_8;                              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_4;                            // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_6;     // 0x0328(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_6;     // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_6;   // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_6;    // 0x0350(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9_0;                            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8_0;                            // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_6; // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5C[0x3];                                     // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_4;              // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_5;              // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_6;              // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_7;              // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_8;              // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_9;              // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5D[0x4];                                     // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_StateViewModel*                   CallFunc_GetViewModel_ReturnValue;                 // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS6UI_InputMode                        CallFunc_CreateInputMode_GameAndUI_ReturnValue;    // 0x0390(0x0010)(NoDestructor)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5E[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ValeriaCharacter_C*                 K2Node_DynamicCast_AsBP_Valeria_Character;         // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5F[0x5];                                     // 0x03BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ValeriaCharacter_C*                 K2Node_DynamicCast_AsBP_Valeria_Character_1;       // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B60[0x2];                                     // 0x03DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x03DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B61[0x3];                                     // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B62[0x7];                                     // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PhotographyManager*                CallFunc_GetLocalPlayerSubsystem_ReturnValue_5;    // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue_1;    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B63[0x7];                                     // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_6;    // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM) == 0x000008, "Wrong alignment on WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM");
static_assert(sizeof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM) == 0x000428, "Wrong size on WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, EntryPoint) == 0x000000, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_ActionValue_5) == 0x000010, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_ActionValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_5) == 0x000030, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_5' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_5) == 0x000034, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_5' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_SourceAction_5) == 0x000038, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_SourceAction_5' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_object_Variable) == 0x000040, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000048, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_real_Variable) == 0x000050, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_real_Variable_1) == 0x000058, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_real_Variable_0) == 0x000060, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_real_Variable_1_0) == 0x000068, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_bool_Variable) == 0x000070, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_ActionValue_4) == 0x000078, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_ActionValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_4) == 0x000098, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_4' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_4) == 0x00009C, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_4' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_SourceAction_4) == 0x0000A0, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_SourceAction_4' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000A8, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_ActionValue_3) == 0x0000B0, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_ActionValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_3) == 0x0000D0, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_3' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_3) == 0x0000D4, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_3' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_SourceAction_3) == 0x0000D8, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_SourceAction_3' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_object_Variable_1) == 0x0000E0, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_2) == 0x0000E8, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_real_Variable_2) == 0x0000F0, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_real_Variable_3) == 0x0000F8, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_real_Variable_2_0) == 0x000100, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_real_Variable_3_0) == 0x000108, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_real_Variable_3_1) == 0x000110, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_real_Variable_3_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_real_Variable_2_1) == 0x000118, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_real_Variable_2_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_bool_Variable_1) == 0x000120, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000128, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000148, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x00014C, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x000150, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_3) == 0x000158, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000160, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000180, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000184, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000188, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, Temp_object_Variable_2) == 0x000190, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_4) == 0x000198, "Member 'WBP_PhotoCameraScreen_CM_C_ExecuteUbergraph_WBP_PhotoCameraScreen_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_4' has a wrong offset!");
