#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TIM_CreateChannel_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TIM_CreateChannel_Button.WBP_TIM_CreateChannel_Button_C
// 0x0058 (0x0318 - 0x02C0)
class UWBP_TIM_CreateChannel_Button_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Button_Icon_CM_C*                  WBP_Button_Icon_CM;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Tooltip;                                           // 0x02D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EnabledToolTip;                                    // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DisabledToolTip;                                   // 0x0300(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WBP_TIM_CreateChannel_Button_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Disable_Button();
	void Enable_Button();
	void ExecuteUbergraph_WBP_TIM_CreateChannel_Button(int32 EntryPoint, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class UWBP_TIM_CreateChannel_ModalDialog_C* CallFunc_Create_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TIM_CreateChannel_Button_C">();
	}
	static class UWBP_TIM_CreateChannel_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TIM_CreateChannel_Button_C>();
	}
};
static_assert(alignof(UWBP_TIM_CreateChannel_Button_C) == 0x000008, "Wrong alignment on UWBP_TIM_CreateChannel_Button_C");
static_assert(sizeof(UWBP_TIM_CreateChannel_Button_C) == 0x000318, "Wrong size on UWBP_TIM_CreateChannel_Button_C");
static_assert(offsetof(UWBP_TIM_CreateChannel_Button_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_TIM_CreateChannel_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_CreateChannel_Button_C, WBP_Button_Icon_CM) == 0x0002C8, "Member 'UWBP_TIM_CreateChannel_Button_C::WBP_Button_Icon_CM' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_CreateChannel_Button_C, Tooltip) == 0x0002D0, "Member 'UWBP_TIM_CreateChannel_Button_C::Tooltip' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_CreateChannel_Button_C, EnabledToolTip) == 0x0002E8, "Member 'UWBP_TIM_CreateChannel_Button_C::EnabledToolTip' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_CreateChannel_Button_C, DisabledToolTip) == 0x000300, "Member 'UWBP_TIM_CreateChannel_Button_C::DisabledToolTip' has a wrong offset!");

}

