#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TIM_CreateChannel_ModalDialog

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TIM_CreateChannel_ModalDialog.WBP_TIM_CreateChannel_ModalDialog_C.BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelAbbreviation_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelAbbreviation_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelAbbreviation_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelAbbreviation_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelAbbreviation_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelAbbreviation_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelAbbreviation_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelAbbreviation_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_TIM_CreateChannel_ModalDialog.WBP_TIM_CreateChannel_ModalDialog_C.BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelName_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelName_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelName_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelName_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelName_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelName_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelName_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_ChannelName_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_TIM_CreateChannel_ModalDialog.WBP_TIM_CreateChannel_ModalDialog_C.BndEvt__WBP_TIM_CreateChannel_ModalDialog_VALUI_CheckBox_Styled_84_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_VALUI_CheckBox_Styled_84_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_VALUI_CheckBox_Styled_84_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_VALUI_CheckBox_Styled_84_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_VALUI_CheckBox_Styled_84_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_VALUI_CheckBox_Styled_84_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_VALUI_CheckBox_Styled_84_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_BndEvt__WBP_TIM_CreateChannel_ModalDialog_VALUI_CheckBox_Styled_84_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_TIM_CreateChannel_ModalDialog.WBP_TIM_CreateChannel_ModalDialog_C.CloseSelf
// 0x0010 (0x0010 - 0x0000)
struct WBP_TIM_CreateChannel_ModalDialog_C_CloseSelf final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_CreateChannel_ModalDialog_C_CloseSelf) == 0x000008, "Wrong alignment on WBP_TIM_CreateChannel_ModalDialog_C_CloseSelf");
static_assert(sizeof(WBP_TIM_CreateChannel_ModalDialog_C_CloseSelf) == 0x000010, "Wrong size on WBP_TIM_CreateChannel_ModalDialog_C_CloseSelf");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_CloseSelf, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_CloseSelf::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_CloseSelf, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_CloseSelf::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_TIM_CreateChannel_ModalDialog.WBP_TIM_CreateChannel_ModalDialog_C.DisplayError
// 0x0010 (0x0010 - 0x0000)
struct WBP_TIM_CreateChannel_ModalDialog_C_DisplayError final
{
public:
	class FString                                 Error;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_CreateChannel_ModalDialog_C_DisplayError) == 0x000008, "Wrong alignment on WBP_TIM_CreateChannel_ModalDialog_C_DisplayError");
static_assert(sizeof(WBP_TIM_CreateChannel_ModalDialog_C_DisplayError) == 0x000010, "Wrong size on WBP_TIM_CreateChannel_ModalDialog_C_DisplayError");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_DisplayError, Error) == 0x000000, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_DisplayError::Error' has a wrong offset!");

// Function WBP_TIM_CreateChannel_ModalDialog.WBP_TIM_CreateChannel_ModalDialog_C.EnforceTextLengthLimit
// 0x0088 (0x0088 - 0x0000)
struct WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit final
{
public:
	class UWidget*                                Textbox;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         MaxLength;                                         // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5722[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditableTextBox*                       K2Node_DynamicCast_AsText_Box;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5723[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              K2Node_DynamicCast_AsText_Box__Multi_Line_;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5724[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5725[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
};
static_assert(alignof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit) == 0x000008, "Wrong alignment on WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit");
static_assert(sizeof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit) == 0x000088, "Wrong size on WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, Textbox) == 0x000000, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::Textbox' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, Text) == 0x000008, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::Text' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, MaxLength) == 0x000020, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::MaxLength' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, K2Node_DynamicCast_AsText_Box) == 0x000028, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::K2Node_DynamicCast_AsText_Box' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, K2Node_DynamicCast_AsText_Box__Multi_Line_) == 0x000048, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::K2Node_DynamicCast_AsText_Box__Multi_Line_' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, CallFunc_Len_ReturnValue) == 0x000054, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, CallFunc_Left_ReturnValue) == 0x000058, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_EnforceTextLengthLimit::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_TIM_CreateChannel_ModalDialog.WBP_TIM_CreateChannel_ModalDialog_C.ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog
// 0x0090 (0x0090 - 0x0000)
struct WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5726[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0020(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5727[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0040(0x0018)(ConstParm)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0058(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_4;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_5;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog) == 0x000008, "Wrong alignment on WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog");
static_assert(sizeof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog) == 0x000090, "Wrong size on WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, EntryPoint) == 0x000000, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, K2Node_ComponentBoundEvent_Text_1) == 0x000020, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, CallFunc_TextIsEmpty_ReturnValue) == 0x000038, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, K2Node_ComponentBoundEvent_Text) == 0x000040, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, CallFunc_GetText_ReturnValue_1) == 0x000058, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000070, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, CallFunc_BooleanNOR_ReturnValue) == 0x000071, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, K2Node_Event_IsDesignTime) == 0x000072, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, K2Node_ComponentBoundEvent_bIsChecked) == 0x000073, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, CallFunc_AkEventGlobal_ReturnValue) == 0x000074, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000078, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, CallFunc_AkEventGlobal_ReturnValue_2) == 0x00007C, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, CallFunc_AkEventGlobal_ReturnValue_3) == 0x000080, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::CallFunc_AkEventGlobal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, CallFunc_AkEventGlobal_ReturnValue_4) == 0x000084, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::CallFunc_AkEventGlobal_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog, CallFunc_AkEventGlobal_ReturnValue_5) == 0x000088, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_ExecuteUbergraph_WBP_TIM_CreateChannel_ModalDialog::CallFunc_AkEventGlobal_ReturnValue_5' has a wrong offset!");

// Function WBP_TIM_CreateChannel_ModalDialog.WBP_TIM_CreateChannel_ModalDialog_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_CreateChannel_ModalDialog_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_CreateChannel_ModalDialog_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TIM_CreateChannel_ModalDialog_C_PreConstruct");
static_assert(sizeof(WBP_TIM_CreateChannel_ModalDialog_C_PreConstruct) == 0x000001, "Wrong size on WBP_TIM_CreateChannel_ModalDialog_C_PreConstruct");
static_assert(offsetof(WBP_TIM_CreateChannel_ModalDialog_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TIM_CreateChannel_ModalDialog_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

