#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_DescriptionBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_DescriptionBox.WBP_Settings_DescriptionBox_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_Settings_DescriptionBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                TextBlock_Description;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Name;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ClearSettingsDescription();
	void ExecuteUbergraph_WBP_Settings_DescriptionBox(int32 EntryPoint, class FText K2Node_CustomEvent_SetName, class FText K2Node_CustomEvent_SetDescription);
	void UpdateSettingsDescription(class FText SetName, class FText SetDescription);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_DescriptionBox_C">();
	}
	static class UWBP_Settings_DescriptionBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_DescriptionBox_C>();
	}
};
static_assert(alignof(UWBP_Settings_DescriptionBox_C) == 0x000008, "Wrong alignment on UWBP_Settings_DescriptionBox_C");
static_assert(sizeof(UWBP_Settings_DescriptionBox_C) == 0x0002D8, "Wrong size on UWBP_Settings_DescriptionBox_C");
static_assert(offsetof(UWBP_Settings_DescriptionBox_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Settings_DescriptionBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_DescriptionBox_C, TextBlock_Description) == 0x0002C8, "Member 'UWBP_Settings_DescriptionBox_C::TextBlock_Description' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_DescriptionBox_C, TextBlock_Name) == 0x0002D0, "Member 'UWBP_Settings_DescriptionBox_C::TextBlock_Name' has a wrong offset!");

}

