#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Notification_ShippingBin_GoldReceived

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Notification_ShippingBin_GoldReceived.WBP_Notification_ShippingBin_GoldReceived_C.BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_0_OnFinishedIntroTransitionAnimation__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_0_OnFinishedIntroTransitionAnimation__DelegateSignature final
{
public:
	class UWBP_Template_Notification_Major_C*     MajorNotificationTemplate;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_0_OnFinishedIntroTransitionAnimation__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_0_OnFinishedIntroTransitionAnimation__DelegateSignature");
static_assert(sizeof(WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_0_OnFinishedIntroTransitionAnimation__DelegateSignature) == 0x000008, "Wrong size on WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_0_OnFinishedIntroTransitionAnimation__DelegateSignature");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_0_OnFinishedIntroTransitionAnimation__DelegateSignature, MajorNotificationTemplate) == 0x000000, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_0_OnFinishedIntroTransitionAnimation__DelegateSignature::MajorNotificationTemplate' has a wrong offset!");

// Function WBP_Notification_ShippingBin_GoldReceived.WBP_Notification_ShippingBin_GoldReceived_C.BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_1_OnFinishedOutroTransitionAnimation__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_1_OnFinishedOutroTransitionAnimation__DelegateSignature final
{
public:
	class UWBP_Template_Notification_Major_C*     MajorNotificationTemplate;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_1_OnFinishedOutroTransitionAnimation__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_1_OnFinishedOutroTransitionAnimation__DelegateSignature");
static_assert(sizeof(WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_1_OnFinishedOutroTransitionAnimation__DelegateSignature) == 0x000008, "Wrong size on WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_1_OnFinishedOutroTransitionAnimation__DelegateSignature");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_1_OnFinishedOutroTransitionAnimation__DelegateSignature, MajorNotificationTemplate) == 0x000000, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_BndEvt__WBP_Notification_FriendInvite_Received_WBP_Template_Major_K2Node_ComponentBoundEvent_1_OnFinishedOutroTransitionAnimation__DelegateSignature::MajorNotificationTemplate' has a wrong offset!");

// Function WBP_Notification_ShippingBin_GoldReceived.WBP_Notification_ShippingBin_GoldReceived_C.ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_Event_UserID;                               // 0x0020(0x0030)(HasGetValueTypeHash)
	class UVALUI_NotificationQueue*               K2Node_Event_NotificationQueue_1;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_Event_NotificationId_1;                     // 0x0058(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVALUI_NotificationQueue*               K2Node_Event_NotificationQueue;                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_Event_NotificationId;                       // 0x0070(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539E[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostGlobalEvent_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539F[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWBP_Template_Notification_Major_C*     K2Node_ComponentBoundEvent_MajorNotificationTemplate_1; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Template_Notification_Major_C*     K2Node_ComponentBoundEvent_MajorNotificationTemplate; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryDismissNotification_ReturnValue;       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived) == 0x000008, "Wrong alignment on WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived");
static_assert(sizeof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived) == 0x0000C8, "Wrong size on WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, EntryPoint) == 0x000000, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, Temp_object_Variable) == 0x000008, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, Temp_object_Variable_1) == 0x000018, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, K2Node_Event_UserID) == 0x000020, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::K2Node_Event_UserID' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, K2Node_Event_NotificationQueue_1) == 0x000050, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::K2Node_Event_NotificationQueue_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, K2Node_Event_NotificationId_1) == 0x000058, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::K2Node_Event_NotificationId_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, K2Node_Event_NotificationQueue) == 0x000068, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::K2Node_Event_NotificationQueue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, K2Node_Event_NotificationId) == 0x000070, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::K2Node_Event_NotificationId' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, Temp_bool_Variable) == 0x000080, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, K2Node_Select_Default) == 0x000088, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, CallFunc_PostGlobalEvent_ReturnValue) == 0x000090, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::CallFunc_PostGlobalEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000A8, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, K2Node_ComponentBoundEvent_MajorNotificationTemplate_1) == 0x0000B0, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::K2Node_ComponentBoundEvent_MajorNotificationTemplate_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, K2Node_ComponentBoundEvent_MajorNotificationTemplate) == 0x0000B8, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::K2Node_ComponentBoundEvent_MajorNotificationTemplate' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived, CallFunc_TryDismissNotification_ReturnValue) == 0x0000C0, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_ExecuteUbergraph_WBP_Notification_ShippingBin_GoldReceived::CallFunc_TryDismissNotification_ReturnValue' has a wrong offset!");

// Function WBP_Notification_ShippingBin_GoldReceived.WBP_Notification_ShippingBin_GoldReceived_C.HandleNotificationDismissed
// 0x0018 (0x0018 - 0x0000)
struct WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationDismissed final
{
public:
	class UVALUI_NotificationQueue*               Param_NotificationQueue;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Param_NotificationId;                              // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationDismissed) == 0x000008, "Wrong alignment on WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationDismissed");
static_assert(sizeof(WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationDismissed) == 0x000018, "Wrong size on WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationDismissed");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationDismissed, Param_NotificationQueue) == 0x000000, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationDismissed::Param_NotificationQueue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationDismissed, Param_NotificationId) == 0x000008, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationDismissed::Param_NotificationId' has a wrong offset!");

// Function WBP_Notification_ShippingBin_GoldReceived.WBP_Notification_ShippingBin_GoldReceived_C.HandleNotificationShown
// 0x0018 (0x0018 - 0x0000)
struct WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationShown final
{
public:
	class UVALUI_NotificationQueue*               Param_NotificationQueue;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Param_NotificationId;                              // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationShown) == 0x000008, "Wrong alignment on WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationShown");
static_assert(sizeof(WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationShown) == 0x000018, "Wrong size on WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationShown");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationShown, Param_NotificationQueue) == 0x000000, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationShown::Param_NotificationQueue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationShown, Param_NotificationId) == 0x000008, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_HandleNotificationShown::Param_NotificationId' has a wrong offset!");

// Function WBP_Notification_ShippingBin_GoldReceived.WBP_Notification_ShippingBin_GoldReceived_C.Init Pre Push Notification
// 0x0088 (0x0088 - 0x0000)
struct WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification final
{
public:
	int32                                         GoldAmount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
};
static_assert(alignof(WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification) == 0x000008, "Wrong alignment on WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification");
static_assert(sizeof(WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification) == 0x000088, "Wrong size on WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification, GoldAmount) == 0x000000, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification::GoldAmount' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_Init_Pre_Push_Notification::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Notification_ShippingBin_GoldReceived.WBP_Notification_ShippingBin_GoldReceived_C.InitPrePushNotification
// 0x0030 (0x0030 - 0x0000)
struct WBP_Notification_ShippingBin_GoldReceived_C_InitPrePushNotification final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_ShippingBin_GoldReceived_C_InitPrePushNotification) == 0x000008, "Wrong alignment on WBP_Notification_ShippingBin_GoldReceived_C_InitPrePushNotification");
static_assert(sizeof(WBP_Notification_ShippingBin_GoldReceived_C_InitPrePushNotification) == 0x000030, "Wrong size on WBP_Notification_ShippingBin_GoldReceived_C_InitPrePushNotification");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_InitPrePushNotification, UserId) == 0x000000, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_InitPrePushNotification::UserId' has a wrong offset!");

// Function WBP_Notification_ShippingBin_GoldReceived.WBP_Notification_ShippingBin_GoldReceived_C.MatchesNotification
// 0x0048 (0x0048 - 0x0000)
struct WBP_Notification_ShippingBin_GoldReceived_C_MatchesNotification final
{
public:
	class FText                                   NotificationText;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TSoftObjectPtr<class UTexture2D>              NotificationIcon;                                  // 0x0018(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_ShippingBin_GoldReceived_C_MatchesNotification) == 0x000008, "Wrong alignment on WBP_Notification_ShippingBin_GoldReceived_C_MatchesNotification");
static_assert(sizeof(WBP_Notification_ShippingBin_GoldReceived_C_MatchesNotification) == 0x000048, "Wrong size on WBP_Notification_ShippingBin_GoldReceived_C_MatchesNotification");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_MatchesNotification, NotificationText) == 0x000000, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_MatchesNotification::NotificationText' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_MatchesNotification, NotificationIcon) == 0x000018, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_MatchesNotification::NotificationIcon' has a wrong offset!");
static_assert(offsetof(WBP_Notification_ShippingBin_GoldReceived_C_MatchesNotification, ReturnValue) == 0x000040, "Member 'WBP_Notification_ShippingBin_GoldReceived_C_MatchesNotification::ReturnValue' has a wrong offset!");

}

