#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HotBar_PF

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Palia_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "EHotBarState_PF_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.Activate Highlighted Slot
// 0x0028 (0x0028 - 0x0000)
struct WBP_HotBar_PF_C_Activate_Highlighted_Slot final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9E[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HotBarSlot_PF_C*                   K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_Activate_Highlighted_Slot) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_Activate_Highlighted_Slot");
static_assert(sizeof(WBP_HotBar_PF_C_Activate_Highlighted_Slot) == 0x000028, "Wrong size on WBP_HotBar_PF_C_Activate_Highlighted_Slot");
static_assert(offsetof(WBP_HotBar_PF_C_Activate_Highlighted_Slot, Temp_int_Variable) == 0x000000, "Member 'WBP_HotBar_PF_C_Activate_Highlighted_Slot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Activate_Highlighted_Slot, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_HotBar_PF_C_Activate_Highlighted_Slot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Activate_Highlighted_Slot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_HotBar_PF_C_Activate_Highlighted_Slot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Activate_Highlighted_Slot, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_HotBar_PF_C_Activate_Highlighted_Slot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Activate_Highlighted_Slot, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_HotBar_PF_C_Activate_Highlighted_Slot::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Activate_Highlighted_Slot, K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF) == 0x000018, "Member 'WBP_HotBar_PF_C_Activate_Highlighted_Slot::K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Activate_Highlighted_Slot, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_HotBar_PF_C_Activate_Highlighted_Slot::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.BndEvt__WBP_HotBar_PF_Button_Cancel_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_Cancel_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_Cancel_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_Cancel_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_Cancel_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_Cancel_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_Cancel_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_Cancel_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.BndEvt__WBP_HotBar_PF_Button_NextBar_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextBar_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextBar_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextBar_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextBar_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextBar_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextBar_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextBar_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.BndEvt__WBP_HotBar_PF_Button_NextSlot_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextSlot_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextSlot_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextSlot_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextSlot_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextSlot_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextSlot_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_NextSlot_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.BndEvt__WBP_HotBar_PF_Button_PreviousBar_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousBar_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousBar_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousBar_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousBar_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousBar_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousBar_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousBar_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.BndEvt__WBP_HotBar_PF_Button_PreviousSlot_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousSlot_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousSlot_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousSlot_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousSlot_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousSlot_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousSlot_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_PreviousSlot_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.BndEvt__WBP_HotBar_PF_Button_UseItem_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_UseItem_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_UseItem_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_UseItem_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_UseItem_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_UseItem_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_UseItem_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_HotBar_PF_C_BndEvt__WBP_HotBar_PF_Button_UseItem_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.CancelSelect
// 0x0018 (0x0018 - 0x0000)
struct WBP_HotBar_PF_C_CancelSelect final
{
public:
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_CancelSelect) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_CancelSelect");
static_assert(sizeof(WBP_HotBar_PF_C_CancelSelect) == 0x000018, "Wrong size on WBP_HotBar_PF_C_CancelSelect");
static_assert(offsetof(WBP_HotBar_PF_C_CancelSelect, CallFunc_GetValeriaCharacter_OutResult) == 0x000000, "Member 'WBP_HotBar_PF_C_CancelSelect::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CancelSelect, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_HotBar_PF_C_CancelSelect::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CancelSelect, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_HotBar_PF_C_CancelSelect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.CancelUseItem
// 0x0001 (0x0001 - 0x0000)
struct WBP_HotBar_PF_C_CancelUseItem final
{
public:
	bool                                          IsSelect;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_CancelUseItem) == 0x000001, "Wrong alignment on WBP_HotBar_PF_C_CancelUseItem");
static_assert(sizeof(WBP_HotBar_PF_C_CancelUseItem) == 0x000001, "Wrong size on WBP_HotBar_PF_C_CancelUseItem");
static_assert(offsetof(WBP_HotBar_PF_C_CancelUseItem, IsSelect) == 0x000000, "Member 'WBP_HotBar_PF_C_CancelUseItem::IsSelect' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.CheckNextSlot
// 0x0120 (0x0120 - 0x0000)
struct WBP_HotBar_PF_C_CheckNextSlot final
{
public:
	int32                                         NextSlot;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    InvComponent;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OutIndex;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutSlotIndex;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA1[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA2[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBagSlotLocation                       CallFunc_GetLocationAtActionBarIndex_ReturnValue;  // 0x0030(0x0008)(NoDestructor)
	struct FValeriaItem                           CallFunc_GetItemAt_ReturnValue;                    // 0x0038(0x0060)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemIsEmpty_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA3[0x1];                                     // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBagSlotLocation                       CallFunc_GetLocationAtActionBarIndex_ReturnValue_1; // 0x00A8(0x0008)(NoDestructor)
	struct FValeriaItem                           CallFunc_GetItemAt_ReturnValue_1;                  // 0x00B0(0x0060)()
	bool                                          CallFunc_ItemIsEmpty_ReturnValue_1;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA4[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_CheckNextSlot) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_CheckNextSlot");
static_assert(sizeof(WBP_HotBar_PF_C_CheckNextSlot) == 0x000120, "Wrong size on WBP_HotBar_PF_C_CheckNextSlot");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, NextSlot) == 0x000000, "Member 'WBP_HotBar_PF_C_CheckNextSlot::NextSlot' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, InvComponent) == 0x000008, "Member 'WBP_HotBar_PF_C_CheckNextSlot::InvComponent' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, OutIndex) == 0x000010, "Member 'WBP_HotBar_PF_C_CheckNextSlot::OutIndex' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, OutSlotIndex) == 0x000014, "Member 'WBP_HotBar_PF_C_CheckNextSlot::OutSlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, Temp_bool_Variable) == 0x000019, "Member 'WBP_HotBar_PF_C_CheckNextSlot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001B, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, Temp_int_Variable) == 0x000020, "Member 'WBP_HotBar_PF_C_CheckNextSlot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, Temp_int_Variable_1) == 0x000028, "Member 'WBP_HotBar_PF_C_CheckNextSlot::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, Temp_bool_Variable_1) == 0x00002C, "Member 'WBP_HotBar_PF_C_CheckNextSlot::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_GetLocationAtActionBarIndex_ReturnValue) == 0x000030, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_GetLocationAtActionBarIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_GetItemAt_ReturnValue) == 0x000038, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000098, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_ItemIsEmpty_ReturnValue) == 0x000099, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_ItemIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_Not_PreBool_ReturnValue_1) == 0x00009A, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_Add_IntInt_ReturnValue_1) == 0x00009C, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, Temp_int_Variable_2) == 0x0000A0, "Member 'WBP_HotBar_PF_C_CheckNextSlot::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, K2Node_Select_Default) == 0x0000A4, "Member 'WBP_HotBar_PF_C_CheckNextSlot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_GetLocationAtActionBarIndex_ReturnValue_1) == 0x0000A8, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_GetLocationAtActionBarIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_GetItemAt_ReturnValue_1) == 0x0000B0, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_GetItemAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_ItemIsEmpty_ReturnValue_1) == 0x000110, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_ItemIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_Subtract_IntInt_ReturnValue) == 0x000114, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_Not_PreBool_ReturnValue_2) == 0x000118, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000119, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_BooleanAND_ReturnValue) == 0x00011A, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_CheckNextSlot, CallFunc_Greater_IntInt_ReturnValue) == 0x00011B, "Member 'WBP_HotBar_PF_C_CheckNextSlot::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.Convert Default Location To Filter Items Position
// 0x0028 (0x0028 - 0x0000)
struct WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position final
{
public:
	int32                                         DefaultColumnsIndex;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultRowIndex;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBagSlotLocation                       Location;                                          // 0x0008(0x0008)(Parm, OutParm, NoDestructor)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBagSlotLocation                       CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position) == 0x000004, "Wrong alignment on WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position");
static_assert(sizeof(WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position) == 0x000028, "Wrong size on WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position");
static_assert(offsetof(WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position, DefaultColumnsIndex) == 0x000000, "Member 'WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position::DefaultColumnsIndex' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position, DefaultRowIndex) == 0x000004, "Member 'WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position::DefaultRowIndex' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position, Location) == 0x000008, "Member 'WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position::Location' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position, CallFunc_Multiply_IntInt_ReturnValue) == 0x000010, "Member 'WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position, CallFunc_Array_Get_Item) == 0x00001C, "Member 'WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'WBP_HotBar_PF_C_Convert_Default_Location_To_Filter_Items_Position::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.Create Hot Bar Buttons
// 0x0080 (0x0080 - 0x0000)
struct WBP_HotBar_PF_C_Create_Hot_Bar_Buttons final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_HotBarSlot_PF_C*                   CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA5[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA6[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool ConfirmUseItem)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_HotBarSlot_PF_C* SlotRef, int32 SlotNumber)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA7[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HotBarSlot_PF_C*                   K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA8[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_Create_Hot_Bar_Buttons");
static_assert(sizeof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons) == 0x000080, "Wrong size on WBP_HotBar_PF_C_Create_Hot_Bar_Buttons");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, Temp_int_Variable) == 0x000010, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, Temp_int_Variable_1) == 0x000028, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000030, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, CallFunc_GetChildrenCount_ReturnValue) == 0x000060, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000064, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, CallFunc_GetChildAt_ReturnValue) == 0x000068, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF) == 0x000070, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000079, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Hot_Bar_Buttons, K2Node_MakeStruct_Left_ImplicitCast) == 0x00007C, "Member 'WBP_HotBar_PF_C_Create_Hot_Bar_Buttons::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.Create Row Ticks
// 0x0098 (0x0098 - 0x0000)
struct WBP_HotBar_PF_C_Create_Row_Ticks final
{
public:
	int32                                         NumberOfWidgets;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA9[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAdditionalEnsureWidgetsOptions        K2Node_MakeStruct_AdditionalEnsureWidgetsOptions;  // 0x0010(0x0028)(NoDestructor)
	int32                                         CallFunc_GetNumberOfActionBarRows_ReturnValue;     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Min_ReturnValue_1;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 RowTickNumber, class UWBP_HotBarRowTick_PF_C* RowTick)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAA[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAB[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HotBarRowTick_PF_C*                K2Node_DynamicCast_AsWBP_Hot_Bar_Row_Tick_PF;      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAC[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_Create_Row_Ticks) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_Create_Row_Ticks");
static_assert(sizeof(WBP_HotBar_PF_C_Create_Row_Ticks) == 0x000098, "Wrong size on WBP_HotBar_PF_C_Create_Row_Ticks");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, NumberOfWidgets) == 0x000000, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::NumberOfWidgets' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, Temp_int_Variable) == 0x000004, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000009, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, K2Node_MakeStruct_AdditionalEnsureWidgetsOptions) == 0x000010, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::K2Node_MakeStruct_AdditionalEnsureWidgetsOptions' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, CallFunc_GetNumberOfActionBarRows_ReturnValue) == 0x000038, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::CallFunc_GetNumberOfActionBarRows_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, CallFunc_Min_ReturnValue) == 0x00003C, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, K2Node_MakeStruct_Margin) == 0x000040, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, CallFunc_Min_ReturnValue_1) == 0x000050, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::CallFunc_Min_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, CallFunc_GetChildrenCount_ReturnValue) == 0x000064, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, CallFunc_GetChildAt_ReturnValue) == 0x000068, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, CallFunc_Subtract_IntInt_ReturnValue) == 0x000070, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000078, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000080, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, K2Node_DynamicCast_AsWBP_Hot_Bar_Row_Tick_PF) == 0x000088, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::K2Node_DynamicCast_AsWBP_Hot_Bar_Row_Tick_PF' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Create_Row_Ticks, K2Node_MakeStruct_Left_ImplicitCast) == 0x000094, "Member 'WBP_HotBar_PF_C_Create_Row_Ticks::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.DeactivateAllSlots
// 0x0030 (0x0030 - 0x0000)
struct WBP_HotBar_PF_C_DeactivateAllSlots final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAE[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HotBarSlot_PF_C*                   K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BAF[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB0[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_DeactivateAllSlots) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_DeactivateAllSlots");
static_assert(sizeof(WBP_HotBar_PF_C_DeactivateAllSlots) == 0x000030, "Wrong size on WBP_HotBar_PF_C_DeactivateAllSlots");
static_assert(offsetof(WBP_HotBar_PF_C_DeactivateAllSlots, Temp_int_Variable) == 0x000000, "Member 'WBP_HotBar_PF_C_DeactivateAllSlots::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_DeactivateAllSlots, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_HotBar_PF_C_DeactivateAllSlots::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_DeactivateAllSlots, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'WBP_HotBar_PF_C_DeactivateAllSlots::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_DeactivateAllSlots, K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF) == 0x000018, "Member 'WBP_HotBar_PF_C_DeactivateAllSlots::K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_DeactivateAllSlots, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_HotBar_PF_C_DeactivateAllSlots::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_DeactivateAllSlots, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_HotBar_PF_C_DeactivateAllSlots::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_DeactivateAllSlots, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_HotBar_PF_C_DeactivateAllSlots::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_DeactivateAllSlots, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_HotBar_PF_C_DeactivateAllSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.Deselect Slot
// 0x0028 (0x0028 - 0x0000)
struct WBP_HotBar_PF_C_Deselect_Slot final
{
public:
	bool                                          ShouldUpdateEquipped;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldRemoveHighlight;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB2[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HotBarSlot_PF_C*                   K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBar_PF_C_Deselect_Slot) == 0x000008, "Wrong alignment on WBP_HotBar_PF_C_Deselect_Slot");
static_assert(sizeof(WBP_HotBar_PF_C_Deselect_Slot) == 0x000028, "Wrong size on WBP_HotBar_PF_C_Deselect_Slot");
static_assert(offsetof(WBP_HotBar_PF_C_Deselect_Slot, ShouldUpdateEquipped) == 0x000000, "Member 'WBP_HotBar_PF_C_Deselect_Slot::ShouldUpdateEquipped' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Deselect_Slot, Param_Index) == 0x000004, "Member 'WBP_HotBar_PF_C_Deselect_Slot::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Deselect_Slot, ShouldRemoveHighlight) == 0x000008, "Member 'WBP_HotBar_PF_C_Deselect_Slot::ShouldRemoveHighlight' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Deselect_Slot, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_HotBar_PF_C_Deselect_Slot::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Deselect_Slot, K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF) == 0x000018, "Member 'WBP_HotBar_PF_C_Deselect_Slot::K2Node_DynamicCast_AsWBP_Hot_Bar_Slot_PF' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Deselect_Slot, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_HotBar_PF_C_Deselect_Slot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Deselect_Slot, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_HotBar_PF_C_Deselect_Slot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotBar_PF_C_Deselect_Slot, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000022, "Member 'WBP_HotBar_PF_C_Deselect_Slot::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");

// Function WBP_HotBar_PF.WBP_HotBar_PF_C.ExecuteUbergraph_WBP_HotBar_PF
// 0x0618 (0x0618 - 0x0000)
struct WBP_HotBar_PF_C_ExecuteUbergraph_WBP_HotBar_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FValeriaGameplaySettings& GameplaySettings)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB3[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_7;     // 0x0018(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_7;     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_7;   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_7;    // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB4[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB5[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_6;     // 0x0080(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_6;     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_6;   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_6;    // 0x00A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
