#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AmmoPouch_TutorialModal2

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_AmmoPouch_TutorialModal2.WBP_AmmoPouch_TutorialModal2_C.ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2
// 0x0018 (0x0018 - 0x0000)
struct WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6178[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaPlayer*                       CallFunc_SetTutorialModalData_BinkPlayerValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           CallFunc_SetTutorialModalData_MediaPlayerValue;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2) == 0x000008, "Wrong alignment on WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2");
static_assert(sizeof(WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2) == 0x000018, "Wrong size on WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2");
static_assert(offsetof(WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2, EntryPoint) == 0x000000, "Member 'WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2, CallFunc_SetTutorialModalData_BinkPlayerValue) == 0x000008, "Member 'WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2::CallFunc_SetTutorialModalData_BinkPlayerValue' has a wrong offset!");
static_assert(offsetof(WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2, CallFunc_SetTutorialModalData_MediaPlayerValue) == 0x000010, "Member 'WBP_AmmoPouch_TutorialModal2_C_ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2::CallFunc_SetTutorialModalData_MediaPlayerValue' has a wrong offset!");

}

