#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PingTime

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PingTime.WBP_PingTime_C.ExecuteUbergraph_WBP_PingTime
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FValeriaGameplaySettings& GameplaySettings)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D74[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0040(0x0014)()
	uint8                                         Pad_4D75[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetCompressedPing_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D76[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue_1;              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D77[0x2];                                     // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0088(0x0014)()
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x00A0(0x0014)()
	uint8                                         Pad_4D78[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B8(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D79[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FValeriaGameplaySettings& GameplaySettings)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime) == 0x000008, "Wrong alignment on WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime");
static_assert(sizeof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime) == 0x0000F8, "Wrong size on WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, EntryPoint) == 0x000000, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, Temp_bool_Variable) == 0x000014, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, Temp_bool_Variable_1) == 0x000015, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, K2Node_MakeStruct_SlateColor_1) == 0x00002C, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, K2Node_MakeStruct_SlateColor_2) == 0x000040, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, CallFunc_GetCompressedPing_ReturnValue) == 0x000070, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::CallFunc_GetCompressedPing_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000078, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, CallFunc_Less_ByteByte_ReturnValue) == 0x000080, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, CallFunc_Less_ByteByte_ReturnValue_1) == 0x000081, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::CallFunc_Less_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000084, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, K2Node_Select_Default) == 0x000088, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, CallFunc_Multiply_IntInt_ReturnValue) == 0x00009C, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, K2Node_Select_Default_1) == 0x0000A0, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B8, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x0000D8, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E0, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime, CallFunc_GetValeriaGameUserSettings_ReturnValue_1) == 0x0000F0, "Member 'WBP_PingTime_C_ExecuteUbergraph_WBP_PingTime::CallFunc_GetValeriaGameUserSettings_ReturnValue_1' has a wrong offset!");

// Function WBP_PingTime.WBP_PingTime_C.HandleDebugSettingsChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_PingTime_C_HandleDebugSettingsChanged final
{
public:
	struct FValeriaGameplaySettings               GameplaySettings;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_PingTime_C_HandleDebugSettingsChanged) == 0x000004, "Wrong alignment on WBP_PingTime_C_HandleDebugSettingsChanged");
static_assert(sizeof(WBP_PingTime_C_HandleDebugSettingsChanged) == 0x000018, "Wrong size on WBP_PingTime_C_HandleDebugSettingsChanged");
static_assert(offsetof(WBP_PingTime_C_HandleDebugSettingsChanged, GameplaySettings) == 0x000000, "Member 'WBP_PingTime_C_HandleDebugSettingsChanged::GameplaySettings' has a wrong offset!");

// Function WBP_PingTime.WBP_PingTime_C.UpdateVisibility
// 0x0028 (0x0028 - 0x0000)
struct WBP_PingTime_C_UpdateVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D7A[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreCheatsEnabled_Result;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D7B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PingTime_C_UpdateVisibility) == 0x000008, "Wrong alignment on WBP_PingTime_C_UpdateVisibility");
static_assert(sizeof(WBP_PingTime_C_UpdateVisibility) == 0x000028, "Wrong size on WBP_PingTime_C_UpdateVisibility");
static_assert(offsetof(WBP_PingTime_C_UpdateVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_PingTime_C_UpdateVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_UpdateVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_PingTime_C_UpdateVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_UpdateVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_PingTime_C_UpdateVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_UpdateVisibility, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_PingTime_C_UpdateVisibility::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_UpdateVisibility, CallFunc_AreCheatsEnabled_Result) == 0x000010, "Member 'WBP_PingTime_C_UpdateVisibility::CallFunc_AreCheatsEnabled_Result' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_UpdateVisibility, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000018, "Member 'WBP_PingTime_C_UpdateVisibility::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_UpdateVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'WBP_PingTime_C_UpdateVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PingTime_C_UpdateVisibility, K2Node_Select_Default) == 0x000021, "Member 'WBP_PingTime_C_UpdateVisibility::K2Node_Select_Default' has a wrong offset!");

}

