#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoginScreen_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.OnKeyDown
// 0x02C0 (0x02C0 - 0x0000)
struct WBP_LoginScreen_CM_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0148(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DF4[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0208(0x00B8)()
};
static_assert(alignof(WBP_LoginScreen_CM_C_OnKeyDown) == 0x000008, "Wrong alignment on WBP_LoginScreen_CM_C_OnKeyDown");
static_assert(sizeof(WBP_LoginScreen_CM_C_OnKeyDown) == 0x0002C0, "Wrong size on WBP_LoginScreen_CM_C_OnKeyDown");
static_assert(offsetof(WBP_LoginScreen_CM_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'WBP_LoginScreen_CM_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'WBP_LoginScreen_CM_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'WBP_LoginScreen_CM_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'WBP_LoginScreen_CM_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000148, "Member 'WBP_LoginScreen_CM_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000200, "Member 'WBP_LoginScreen_CM_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000208, "Member 'WBP_LoginScreen_CM_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.HandleMoveToNextField
// 0x0001 (0x0001 - 0x0000)
struct WBP_LoginScreen_CM_C_HandleMoveToNextField final
{
public:
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_HandleMoveToNextField) == 0x000001, "Wrong alignment on WBP_LoginScreen_CM_C_HandleMoveToNextField");
static_assert(sizeof(WBP_LoginScreen_CM_C_HandleMoveToNextField) == 0x000001, "Wrong size on WBP_LoginScreen_CM_C_HandleMoveToNextField");
static_assert(offsetof(WBP_LoginScreen_CM_C_HandleMoveToNextField, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000000, "Member 'WBP_LoginScreen_CM_C_HandleMoveToNextField::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.EnableLoginButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_LoginScreen_CM_C_EnableLoginButton final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_EnableLoginButton) == 0x000001, "Wrong alignment on WBP_LoginScreen_CM_C_EnableLoginButton");
static_assert(sizeof(WBP_LoginScreen_CM_C_EnableLoginButton) == 0x000001, "Wrong size on WBP_LoginScreen_CM_C_EnableLoginButton");
static_assert(offsetof(WBP_LoginScreen_CM_C_EnableLoginButton, IsEnabled) == 0x000000, "Member 'WBP_LoginScreen_CM_C_EnableLoginButton::IsEnabled' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.Compute Login Wait Timer
// 0x0060 (0x0060 - 0x0000)
struct WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer final
{
public:
	double                                        NewLoginWaitTimer;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DF5[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DF6[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DF7[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer) == 0x000008, "Wrong alignment on WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer");
static_assert(sizeof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer) == 0x000060, "Wrong size on WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, NewLoginWaitTimer) == 0x000000, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::NewLoginWaitTimer' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, Temp_int_Variable) == 0x000010, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, CallFunc_FClamp_ReturnValue) == 0x000030, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000040, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_LoginScreen_CM_C_Compute_Login_Wait_Timer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.DisplayLoginWait
// 0x0018 (0x0018 - 0x0000)
struct WBP_LoginScreen_CM_C_DisplayLoginWait final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_LoginScreen_CM_C_DisplayLoginWait) == 0x000008, "Wrong alignment on WBP_LoginScreen_CM_C_DisplayLoginWait");
static_assert(sizeof(WBP_LoginScreen_CM_C_DisplayLoginWait) == 0x000018, "Wrong size on WBP_LoginScreen_CM_C_DisplayLoginWait");
static_assert(offsetof(WBP_LoginScreen_CM_C_DisplayLoginWait, Text) == 0x000000, "Member 'WBP_LoginScreen_CM_C_DisplayLoginWait::Text' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.HandleLoginFailure
// 0x0038 (0x0038 - 0x0000)
struct WBP_LoginScreen_CM_C_HandleLoginFailure final
{
public:
	class FString                                 Error_Message;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Error_Code;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DF8[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetErrorTextFromError_Text;               // 0x0018(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_HandleLoginFailure) == 0x000008, "Wrong alignment on WBP_LoginScreen_CM_C_HandleLoginFailure");
static_assert(sizeof(WBP_LoginScreen_CM_C_HandleLoginFailure) == 0x000038, "Wrong size on WBP_LoginScreen_CM_C_HandleLoginFailure");
static_assert(offsetof(WBP_LoginScreen_CM_C_HandleLoginFailure, Error_Message) == 0x000000, "Member 'WBP_LoginScreen_CM_C_HandleLoginFailure::Error_Message' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_HandleLoginFailure, Error_Code) == 0x000010, "Member 'WBP_LoginScreen_CM_C_HandleLoginFailure::Error_Code' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_HandleLoginFailure, CallFunc_GetErrorTextFromError_Text) == 0x000018, "Member 'WBP_LoginScreen_CM_C_HandleLoginFailure::CallFunc_GetErrorTextFromError_Text' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_HandleLoginFailure, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_LoginScreen_CM_C_HandleLoginFailure::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.Get_BorderStyled_CapsLockWarning_Visibility_0
// 0x0006 (0x0006 - 0x0000)
struct WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreCapsLocked_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0) == 0x000001, "Wrong alignment on WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0");
static_assert(sizeof(WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0) == 0x000006, "Wrong size on WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0");
static_assert(offsetof(WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0, ReturnValue) == 0x000000, "Member 'WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0, Temp_bool_Variable) == 0x000001, "Member 'WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0, Temp_byte_Variable) == 0x000002, "Member 'WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0, CallFunc_AreCapsLocked_ReturnValue) == 0x000004, "Member 'WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0::CallFunc_AreCapsLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0, K2Node_Select_Default) == 0x000005, "Member 'WBP_LoginScreen_CM_C_Get_BorderStyled_CapsLockWarning_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.GetErrorTextFromError
// 0x0150 (0x0150 - 0x0000)
struct WBP_LoginScreen_CM_C_GetErrorTextFromError final
{
public:
	int32                                         ErrorCode;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DF9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0018(0x0018)(Parm, OutParm)
	class FText                                   ErrorText;                                         // 0x0030(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DFA[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DFB[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_3;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DFC[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
};
static_assert(alignof(WBP_LoginScreen_CM_C_GetErrorTextFromError) == 0x000008, "Wrong alignment on WBP_LoginScreen_CM_C_GetErrorTextFromError");
static_assert(sizeof(WBP_LoginScreen_CM_C_GetErrorTextFromError) == 0x000150, "Wrong size on WBP_LoginScreen_CM_C_GetErrorTextFromError");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, ErrorCode) == 0x000000, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::ErrorCode' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, ErrorMessage) == 0x000008, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, Text) == 0x000018, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::Text' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, ErrorText) == 0x000030, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::ErrorText' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_Contains_ReturnValue) == 0x000060, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000B8, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_Contains_ReturnValue_1) == 0x000110, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, K2Node_MakeArray_Array) == 0x000118, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000128, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000129, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00012A, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00012B, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x00012C, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_BooleanOR_ReturnValue) == 0x00012D, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x00012E, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_Contains_ReturnValue_2) == 0x00012F, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_Contains_ReturnValue_3) == 0x000130, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_GetErrorTextFromError, CallFunc_Format_ReturnValue) == 0x000138, "Member 'WBP_LoginScreen_CM_C_GetErrorTextFromError::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.Login Player
// 0x0080 (0x0080 - 0x0000)
struct WBP_LoginScreen_CM_C_Login_Player final
{
public:
	class FString                                 AccountUsername;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Password;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsPasswordEmpty;                                   // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DFD[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PregameUIManager_C*                K2Node_DynamicCast_AsWBP_Pregame_UIManager;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DFE[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DFF[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E00[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_Login_Player) == 0x000008, "Wrong alignment on WBP_LoginScreen_CM_C_Login_Player");
static_assert(sizeof(WBP_LoginScreen_CM_C_Login_Player) == 0x000080, "Wrong size on WBP_LoginScreen_CM_C_Login_Player");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, AccountUsername) == 0x000000, "Member 'WBP_LoginScreen_CM_C_Login_Player::AccountUsername' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, Password) == 0x000010, "Member 'WBP_LoginScreen_CM_C_Login_Player::Password' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, IsPasswordEmpty) == 0x000020, "Member 'WBP_LoginScreen_CM_C_Login_Player::IsPasswordEmpty' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000030, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000038, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, K2Node_DynamicCast_AsWBP_Pregame_UIManager) == 0x000040, "Member 'WBP_LoginScreen_CM_C_Login_Player::K2Node_DynamicCast_AsWBP_Pregame_UIManager' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_LoginScreen_CM_C_Login_Player::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000049, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000050, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_GetActiveWidget_ReturnValue) == 0x000058, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000060, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_BooleanAND_ReturnValue) == 0x000061, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_Not_PreBool_ReturnValue) == 0x000062, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000068, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_Len_ReturnValue) == 0x000070, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000074, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Login_Player, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000078, "Member 'WBP_LoginScreen_CM_C_Login_Player::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.OnLoginFailure
// 0x0018 (0x0018 - 0x0000)
struct WBP_LoginScreen_CM_C_OnLoginFailure final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_OnLoginFailure) == 0x000008, "Wrong alignment on WBP_LoginScreen_CM_C_OnLoginFailure");
static_assert(sizeof(WBP_LoginScreen_CM_C_OnLoginFailure) == 0x000018, "Wrong size on WBP_LoginScreen_CM_C_OnLoginFailure");
static_assert(offsetof(WBP_LoginScreen_CM_C_OnLoginFailure, ErrorMessage) == 0x000000, "Member 'WBP_LoginScreen_CM_C_OnLoginFailure::ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_OnLoginFailure, ErrorCode) == 0x000010, "Member 'WBP_LoginScreen_CM_C_OnLoginFailure::ErrorCode' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.BndEvt__PasswordInputBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_LoginScreen_CM_C_BndEvt__PasswordInputBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_BndEvt__PasswordInputBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginScreen_CM_C_BndEvt__PasswordInputBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_LoginScreen_CM_C_BndEvt__PasswordInputBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_LoginScreen_CM_C_BndEvt__PasswordInputBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_LoginScreen_CM_C_BndEvt__PasswordInputBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_LoginScreen_CM_C_BndEvt__PasswordInputBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_BndEvt__PasswordInputBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_LoginScreen_CM_C_BndEvt__PasswordInputBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LoginScreen_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LoginScreen_CM_C_PreConstruct");
static_assert(sizeof(WBP_LoginScreen_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_LoginScreen_CM_C_PreConstruct");
static_assert(offsetof(WBP_LoginScreen_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LoginScreen_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.BndEvt__WBP_LoginScreen_PasswordInputBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_PasswordInputBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_PasswordInputBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_PasswordInputBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_PasswordInputBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_PasswordInputBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_PasswordInputBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_PasswordInputBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_UsernameInputBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_LoginScreen_CM_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_Tick) == 0x000004, "Wrong alignment on WBP_LoginScreen_CM_C_Tick");
static_assert(sizeof(WBP_LoginScreen_CM_C_Tick) == 0x00003C, "Wrong size on WBP_LoginScreen_CM_C_Tick");
static_assert(offsetof(WBP_LoginScreen_CM_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_LoginScreen_CM_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_CM_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_LoginScreen_CM_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.BndEvt__WBP_LoginScreen_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_LoginScreen_CM_C_BndEvt__WBP_LoginScreen_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_LoginScreen_CM.WBP_LoginScreen_CM_C.ExecuteUbergraph_WBP_LoginScreen_CM
// 0x0338 (0x0338 - 0x0000)
struct WBP_LoginScreen_CM_C_ExecuteUbergraph_WBP_LoginScreen_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E01[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& ErrorMessage, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E02[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ErrorCode;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E03[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0038(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0050(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TryGetCommandlineKeyValuePair_Value;      // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetCommandlineKeyValuePair_ReturnValue; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E04[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_TryGetCommandlineKeyValuePair_Value_1;    // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetCommandlineKeyValuePair_ReturnValue_1; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E05[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_3;                 // 0x00B8(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_1;         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E06[0x1];                                     // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_2;                 // 0x00D8(0x0018)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x00F0(0x0018)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0108(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E07[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_4;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_5;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EndsWith_ReturnValue;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E08[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E09[0x2];                                     // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0178(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_6;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_7;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E0A[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_8;              // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_9;              // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E0B[0x5];                                     // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_10;             // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_11;             // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E0C[0x6];                                     // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E0D[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
