#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GraphicsSettings_Quality_CM

#include "Basic.hpp"

#include "S6Core_structs.hpp"
#include "EScalabilitySetting_structs.hpp"


namespace SDK::Params
{

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_AntiAliasing_CM_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_AntiAliasing_CM_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5470[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_AntiAliasing_CM_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_AntiAliasing_CM_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_AntiAliasing_CM_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_AntiAliasing_CM_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_AntiAliasing_CM_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_AntiAliasing_CM_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_AntiAliasing_CM_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_AntiAliasing_CM_K2Node_ComponentBoundEvent_14_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Effects_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Effects_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5471[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Effects_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Effects_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Effects_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Effects_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Effects_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Effects_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Effects_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Effects_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Foliage_CM_K2Node_ComponentBoundEvent_18_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Foliage_CM_K2Node_ComponentBoundEvent_18_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5472[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Foliage_CM_K2Node_ComponentBoundEvent_18_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Foliage_CM_K2Node_ComponentBoundEvent_18_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Foliage_CM_K2Node_ComponentBoundEvent_18_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Foliage_CM_K2Node_ComponentBoundEvent_18_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Foliage_CM_K2Node_ComponentBoundEvent_18_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Foliage_CM_K2Node_ComponentBoundEvent_18_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Foliage_CM_K2Node_ComponentBoundEvent_18_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Foliage_CM_K2Node_ComponentBoundEvent_18_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Postprocessing_CM_K2Node_ComponentBoundEvent_17_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Postprocessing_CM_K2Node_ComponentBoundEvent_17_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5473[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Postprocessing_CM_K2Node_ComponentBoundEvent_17_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Postprocessing_CM_K2Node_ComponentBoundEvent_17_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Postprocessing_CM_K2Node_ComponentBoundEvent_17_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Postprocessing_CM_K2Node_ComponentBoundEvent_17_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Postprocessing_CM_K2Node_ComponentBoundEvent_17_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Postprocessing_CM_K2Node_ComponentBoundEvent_17_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Postprocessing_CM_K2Node_ComponentBoundEvent_17_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Postprocessing_CM_K2Node_ComponentBoundEvent_17_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_QualityPresets_CM_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_QualityPresets_CM_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5474[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_QualityPresets_CM_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_QualityPresets_CM_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_QualityPresets_CM_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_QualityPresets_CM_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_QualityPresets_CM_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_QualityPresets_CM_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_QualityPresets_CM_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_QualityPresets_CM_K2Node_ComponentBoundEvent_10_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ResolutionScale_CM_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ResolutionScale_CM_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5475[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ResolutionScale_CM_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ResolutionScale_CM_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ResolutionScale_CM_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ResolutionScale_CM_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ResolutionScale_CM_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ResolutionScale_CM_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ResolutionScale_CM_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ResolutionScale_CM_K2Node_ComponentBoundEvent_11_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Shadows_CM_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Shadows_CM_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5476[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Shadows_CM_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Shadows_CM_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Shadows_CM_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Shadows_CM_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Shadows_CM_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Shadows_CM_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Shadows_CM_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Shadows_CM_K2Node_ComponentBoundEvent_13_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Textures_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Textures_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5477[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Textures_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Textures_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Textures_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Textures_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Textures_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Textures_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Textures_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_Textures_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ViewDistance_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ViewDistance_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5478[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ViewDistance_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ViewDistance_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ViewDistance_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ViewDistance_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ViewDistance_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ViewDistance_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ViewDistance_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_BndEvt__WBP_GraphicsSettings_Quality_CM_Combobox_ViewDistance_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.ChangeQualitySetting
// 0x0058 (0x0058 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EScalabilitySetting                           ScalabilityType;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5479[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_547A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetResolutionScaleValueEx_NewScaleValue_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting) == 0x000058, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting, Param_Index) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting, ScalabilityType) == 0x000004, "Member 'WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting::ScalabilityType' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting, CallFunc_Conv_TextToString_ReturnValue) == 0x000010, "Member 'WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting, CallFunc_Split_LeftS) == 0x000020, "Member 'WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting, CallFunc_Split_RightS) == 0x000030, "Member 'WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting, CallFunc_Split_ReturnValue) == 0x000040, "Member 'WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting, CallFunc_Conv_StringToDouble_ReturnValue) == 0x000048, "Member 'WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting, CallFunc_SetResolutionScaleValueEx_NewScaleValue_ImplicitCast) == 0x000050, "Member 'WBP_GraphicsSettings_Quality_CM_C_ChangeQualitySetting::CallFunc_SetResolutionScaleValueEx_NewScaleValue_ImplicitCast' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_547B[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0010(0x0018)()
	class FText                                   K2Node_CustomEvent_Description;                    // 0x0028(0x0018)()
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_8;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_8;                 // 0x0058(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Index_7;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_547C[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_7;                 // 0x0078(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Index_6;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_547D[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_6;                 // 0x0098(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Index_5;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_547E[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_5;                 // 0x00B8(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Index_4;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_547F[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_4;                 // 0x00D8(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Index_3;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5480[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_3;                 // 0x00F8(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Index_2;                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5481[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_2;                 // 0x0118(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5482[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0138(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5483[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0158(0x0018)()
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText Name, class FText Description)> K2Node_CreateDelegate_OutputDelegate;              // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5484[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit; // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5485[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5486[0x3];                                     // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM) == 0x0001D8, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, EntryPoint) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_bool_Variable) == 0x000004, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_bool_Variable_2) == 0x000006, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_bool_Variable_3) == 0x000007, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_bool_Variable_4) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_bool_Variable_5) == 0x000009, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_bool_Variable_6) == 0x00000A, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_bool_Variable_7) == 0x00000B, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_bool_Variable_8) == 0x00000C, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_byte_Variable) == 0x00000D, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_CustomEvent_Name) == 0x000010, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_CustomEvent_Description) == 0x000028, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_CustomEvent_Description' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, CallFunc_GetAllChildren_ReturnValue) == 0x000040, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Index_8) == 0x000054, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Index_8' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Text_8) == 0x000058, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Text_8' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Index_7) == 0x000070, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Index_7' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Text_7) == 0x000078, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Text_7' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Index_6) == 0x000090, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Index_6' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Text_6) == 0x000098, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Text_6' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Index_5) == 0x0000B0, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Index_5' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Text_5) == 0x0000B8, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Text_5' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Index_4) == 0x0000D0, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Index_4' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Text_4) == 0x0000D8, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Text_4' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Index_3) == 0x0000F0, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Index_3' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Text_3) == 0x0000F8, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Text_3' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Index_2) == 0x000110, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Index_2' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Text_2) == 0x000118, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Text_2' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Index_1) == 0x000130, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Index_1' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Text_1) == 0x000138, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Index) == 0x000150, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_ComponentBoundEvent_Text) == 0x000158, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, CallFunc_GetGameUserSettings_ReturnValue) == 0x000170, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000178, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000180, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_int_Array_Index_Variable) == 0x000190, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000194, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit) == 0x0001B0, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x0001C0, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, Temp_int_Loop_Counter_Variable) == 0x0001C8, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, CallFunc_Less_IntInt_ReturnValue) == 0x0001CC, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, CallFunc_Add_IntInt_ReturnValue) == 0x0001D0, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, CallFunc_GetPlatformType_ReturnValue) == 0x0001D4, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM, K2Node_Select_Default) == 0x0001D5, "Member 'WBP_GraphicsSettings_Quality_CM_C_ExecuteUbergraph_WBP_GraphicsSettings_Quality_CM::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.HandleSettingsItemHovered
// 0x0030 (0x0030 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_HandleSettingsItemHovered final
{
public:
	class FText                                   Param_Name;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_HandleSettingsItemHovered) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_HandleSettingsItemHovered");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_HandleSettingsItemHovered) == 0x000030, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_HandleSettingsItemHovered");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_HandleSettingsItemHovered, Param_Name) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_HandleSettingsItemHovered::Param_Name' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_HandleSettingsItemHovered, Description) == 0x000018, "Member 'WBP_GraphicsSettings_Quality_CM_C_HandleSettingsItemHovered::Description' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.ShouldSuggestRestart
// 0x0001 (0x0001 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_ShouldSuggestRestart final
{
public:
	bool                                          ShouldSuggest;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_ShouldSuggestRestart) == 0x000001, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_ShouldSuggestRestart");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_ShouldSuggestRestart) == 0x000001, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_ShouldSuggestRestart");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_ShouldSuggestRestart, ShouldSuggest) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_ShouldSuggestRestart::ShouldSuggest' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.UpdatePresetSettings
// 0x0018 (0x0018 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings final
{
public:
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOverallScalabilityLevel_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings) == 0x000008, "Wrong alignment on WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings");
static_assert(sizeof(WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings) == 0x000018, "Wrong size on WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000000, "Member 'WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings, CallFunc_GetOverallScalabilityLevel_ReturnValue) == 0x000010, "Member 'WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings::CallFunc_GetOverallScalabilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_GraphicsSettings_Quality_CM_C_UpdatePresetSettings::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GraphicsSettings_Quality_CM.WBP_GraphicsSettings_Quality_CM_C.UpdateQualitySettingsToMatchAppliedSettings
// 0x0060 (0x0060 - 0x0000)
struct WBP_GraphicsSettings_Quality_CM_C_UpdateQualitySettingsToMatchAppliedSettings final
{
public:
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFoliageQuality_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPostProcessingQuality_ReturnValue;     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTextureQuality_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAntiAliasingQuality_ReturnValue;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewDistanceQuality_ReturnValue;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOverallScalabilityLevel_ReturnValue;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetResolutionScaleInformationEx_CurrentScaleNormalized; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
