#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyRebindingGuide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KeyRebindingGuide.WBP_KeyRebindingGuide_C
// 0x0070 (0x0330 - 0x02C0)
class UWBP_KeyRebindingGuide_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_67;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_RichTextBlock_Styled*            RichText_Tips;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TxtSelectedCatagoryDescription;                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TxtSelectedCatagoryDescription_1;                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TxtSelectedCategory;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TxtSelectedCategory_NS;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TxtSelectedCategory_PC;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Gamepad;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_KB;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_72;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           HideTipsTimerHandle;                               // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         TipsDelayTime;                                     // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CurrentInputType;                                  // 0x032C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BoundSuccessfulTip(class FText KeyName, class FText ChordKeyName, class FText InputActionName, class FText ConflicActionName, bool bIsUnbound, class FText InvalidName, class FText KeysName, bool Temp_bool_Variable, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, bool CallFunc_TextIsEmpty_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue, class FText CallFunc_Format_ReturnValue_1, bool Temp_bool_Variable_1, bool CallFunc_EqualEqual_TextText_ReturnValue, bool CallFunc_EqualEqual_TextText_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_4, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_5, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_6, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_7, class FText CallFunc_Format_ReturnValue_2, bool Temp_bool_Variable_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_8, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_3, class FText K2Node_Select_Default, class FText CallFunc_Format_ReturnValue_3, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_9, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_4, bool CallFunc_TextIsEmpty_ReturnValue_1, class FText CallFunc_Format_ReturnValue_4, class FText K2Node_Select_Default_1, class FText K2Node_Select_Default_2);
	void Construct();
	void ExecuteUbergraph_WBP_KeyRebindingGuide(int32 EntryPoint, ECommonInputType Temp_byte_Variable, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class UVerticalBox* Temp_object_Variable, class UVerticalBox* Temp_object_Variable_1, class FText K2Node_CustomEvent_KeyName, class FText K2Node_CustomEvent_ChordKeyName, class FText K2Node_CustomEvent_InputActionName, class FText K2Node_CustomEvent_ConflicActionName, bool K2Node_CustomEvent_bIsUnbound, const struct FTimerHandle& CallFunc_K2_InvalidateTimerHandle_ReturnValue, bool CallFunc_K2_IsValidTimerHandle_ReturnValue, const struct FTimerHandle& CallFunc_K2_InvalidateTimerHandle_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, float CallFunc_GetPromptDelayTime_ReturnValue, bool K2Node_Event_IsDesignTime, class UVerticalBox* K2Node_Select_Default);
	void HiddenTips();
	void PreConstruct(bool IsDesignTime);
	void UpdateBoundTips(class FText KeyName, class FText ChordKeyName, class FText InputActionName, class FText ConflicActionName, bool bIsUnbound);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KeyRebindingGuide_C">();
	}
	static class UWBP_KeyRebindingGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KeyRebindingGuide_C>();
	}
};
static_assert(alignof(UWBP_KeyRebindingGuide_C) == 0x000008, "Wrong alignment on UWBP_KeyRebindingGuide_C");
static_assert(sizeof(UWBP_KeyRebindingGuide_C) == 0x000330, "Wrong size on UWBP_KeyRebindingGuide_C");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_KeyRebindingGuide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, Image_67) == 0x0002C8, "Member 'UWBP_KeyRebindingGuide_C::Image_67' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, Overlay_0) == 0x0002D0, "Member 'UWBP_KeyRebindingGuide_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, RichText_Tips) == 0x0002D8, "Member 'UWBP_KeyRebindingGuide_C::RichText_Tips' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, TxtSelectedCatagoryDescription) == 0x0002E0, "Member 'UWBP_KeyRebindingGuide_C::TxtSelectedCatagoryDescription' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, TxtSelectedCatagoryDescription_1) == 0x0002E8, "Member 'UWBP_KeyRebindingGuide_C::TxtSelectedCatagoryDescription_1' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, TxtSelectedCategory) == 0x0002F0, "Member 'UWBP_KeyRebindingGuide_C::TxtSelectedCategory' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, TxtSelectedCategory_NS) == 0x0002F8, "Member 'UWBP_KeyRebindingGuide_C::TxtSelectedCategory_NS' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, TxtSelectedCategory_PC) == 0x000300, "Member 'UWBP_KeyRebindingGuide_C::TxtSelectedCategory_PC' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, VerticalBox_Gamepad) == 0x000308, "Member 'UWBP_KeyRebindingGuide_C::VerticalBox_Gamepad' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, VerticalBox_KB) == 0x000310, "Member 'UWBP_KeyRebindingGuide_C::VerticalBox_KB' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, WidgetSwitcher_72) == 0x000318, "Member 'UWBP_KeyRebindingGuide_C::WidgetSwitcher_72' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, HideTipsTimerHandle) == 0x000320, "Member 'UWBP_KeyRebindingGuide_C::HideTipsTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, TipsDelayTime) == 0x000328, "Member 'UWBP_KeyRebindingGuide_C::TipsDelayTime' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingGuide_C, CurrentInputType) == 0x00032C, "Member 'UWBP_KeyRebindingGuide_C::CurrentInputType' has a wrong offset!");

}

