#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrafterRecipeStep_Ingredient

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_CrafterRecipeStep_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CrafterRecipeStep_Ingredient.WBP_CrafterRecipeStep_Ingredient_C
// 0x0028 (0x0378 - 0x0350)
class UWBP_CrafterRecipeStep_Ingredient_C final : public UWBP_CrafterRecipeStep_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_CrafterRecipeStep_Ingredient_C; // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         IngredientIndex;                                   // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61B2[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRecipe_RequireItem                    Required;                                          // 0x0360(0x0018)(Edit, BlueprintVisible, NoDestructor)

public:
	void ExecuteUbergraph_WBP_CrafterRecipeStep_Ingredient(int32 EntryPoint, bool CallFunc_GreaterEqual_IntInt_ReturnValue, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, class UCrafterComponent* K2Node_Event_Crafter, int32 K2Node_Event_SlotIndex, bool CallFunc_IsRequestStepDone_ReturnValue);
	void OnCrafterSlotUpdated(class UCrafterComponent* Crafter, int32 SlotIndex);
	void SetStyle();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_Contributed_Icon(EComplexRecipeCueState RecipeCueState, bool FullyAdded, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UCookingSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, EComplexRecipeCueState CallFunc_GetCookingRecipeCueStateForIngredient_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsIngredientFullyAdded_ReturnValue, bool CallFunc_IsIngredientExpired_ReturnValue, bool CallFunc_IsIngredientActive_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void UpdateIngredient(const struct FCrafterIngredient& Ingredient, int32 Param_Index, class FName CallFunc_GetTagName_ReturnValue, const struct FIngredientTagConfig& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, bool CallFunc_IsValid_ReturnValue, class FText CallFunc_GetIngredientRequestText_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CrafterRecipeStep_Ingredient_C">();
	}
	static class UWBP_CrafterRecipeStep_Ingredient_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CrafterRecipeStep_Ingredient_C>();
	}
};
static_assert(alignof(UWBP_CrafterRecipeStep_Ingredient_C) == 0x000008, "Wrong alignment on UWBP_CrafterRecipeStep_Ingredient_C");
static_assert(sizeof(UWBP_CrafterRecipeStep_Ingredient_C) == 0x000378, "Wrong size on UWBP_CrafterRecipeStep_Ingredient_C");
static_assert(offsetof(UWBP_CrafterRecipeStep_Ingredient_C, UberGraphFrame_WBP_CrafterRecipeStep_Ingredient_C) == 0x000350, "Member 'UWBP_CrafterRecipeStep_Ingredient_C::UberGraphFrame_WBP_CrafterRecipeStep_Ingredient_C' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipeStep_Ingredient_C, IngredientIndex) == 0x000358, "Member 'UWBP_CrafterRecipeStep_Ingredient_C::IngredientIndex' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterRecipeStep_Ingredient_C, Required) == 0x000360, "Member 'UWBP_CrafterRecipeStep_Ingredient_C::Required' has a wrong offset!");

}

