#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CollectionsWheel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CollectionsWheel.WBP_CollectionsWheel_C.CheckWantsToSelect
// 0x0002 (0x0002 - 0x0000)
struct WBP_CollectionsWheel_C_CheckWantsToSelect final
{
public:
	bool                                          WantsToSelect;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CollectionsWheel_C_CheckWantsToSelect) == 0x000001, "Wrong alignment on WBP_CollectionsWheel_C_CheckWantsToSelect");
static_assert(sizeof(WBP_CollectionsWheel_C_CheckWantsToSelect) == 0x000002, "Wrong size on WBP_CollectionsWheel_C_CheckWantsToSelect");
static_assert(offsetof(WBP_CollectionsWheel_C_CheckWantsToSelect, WantsToSelect) == 0x000000, "Member 'WBP_CollectionsWheel_C_CheckWantsToSelect::WantsToSelect' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_CheckWantsToSelect, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'WBP_CollectionsWheel_C_CheckWantsToSelect::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_CollectionsWheel.WBP_CollectionsWheel_C.ExecuteUbergraph_WBP_CollectionsWheel
// 0x0090 (0x0090 - 0x0000)
struct WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E23[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E24[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E25[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel) == 0x000008, "Wrong alignment on WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel");
static_assert(sizeof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel) == 0x000090, "Wrong size on WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, EntryPoint) == 0x000000, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, Temp_object_Variable) == 0x000038, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, Temp_real_Variable) == 0x000048, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, Temp_real_Variable_1) == 0x000050, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, Temp_real_Variable_0) == 0x000058, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, Temp_bool_Variable) == 0x000068, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000069, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'WBP_CollectionsWheel_C_ExecuteUbergraph_WBP_CollectionsWheel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_CollectionsWheel.WBP_CollectionsWheel_C.FinishSelecting
// 0x0020 (0x0020 - 0x0000)
struct WBP_CollectionsWheel_C_FinishSelecting final
{
public:
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CollectionsWheel_C> K2Node_DynamicCast_AsBPI_Collections_Wheel;        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CollectionsWheel_C_FinishSelecting) == 0x000008, "Wrong alignment on WBP_CollectionsWheel_C_FinishSelecting");
static_assert(sizeof(WBP_CollectionsWheel_C_FinishSelecting) == 0x000020, "Wrong size on WBP_CollectionsWheel_C_FinishSelecting");
static_assert(offsetof(WBP_CollectionsWheel_C_FinishSelecting, CallFunc_GetActiveWidget_ReturnValue) == 0x000000, "Member 'WBP_CollectionsWheel_C_FinishSelecting::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_FinishSelecting, K2Node_DynamicCast_AsBPI_Collections_Wheel) == 0x000008, "Member 'WBP_CollectionsWheel_C_FinishSelecting::K2Node_DynamicCast_AsBPI_Collections_Wheel' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_FinishSelecting, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_CollectionsWheel_C_FinishSelecting::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_CollectionsWheel.WBP_CollectionsWheel_C.IncrementWidgetSwitcher
// 0x0058 (0x0058 - 0x0000)
struct WBP_CollectionsWheel_C_IncrementWidgetSwitcher final
{
public:
	int32                                         NextActiveIndex;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalNumWidgets;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CollectionsWheel_C> K2Node_DynamicCast_AsBPI_Collections_Wheel;        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E26[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CollectionsWheel_C> K2Node_DynamicCast_AsBPI_Collections_Wheel_1;      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E27[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumWidgets_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher) == 0x000008, "Wrong alignment on WBP_CollectionsWheel_C_IncrementWidgetSwitcher");
static_assert(sizeof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher) == 0x000058, "Wrong size on WBP_CollectionsWheel_C_IncrementWidgetSwitcher");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, NextActiveIndex) == 0x000000, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::NextActiveIndex' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, TotalNumWidgets) == 0x000004, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::TotalNumWidgets' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, K2Node_DynamicCast_AsBPI_Collections_Wheel) == 0x000010, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::K2Node_DynamicCast_AsBPI_Collections_Wheel' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000028, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, K2Node_DynamicCast_AsBPI_Collections_Wheel_1) == 0x000030, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::K2Node_DynamicCast_AsBPI_Collections_Wheel_1' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, CallFunc_GetNumWidgets_ReturnValue) == 0x000044, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::CallFunc_GetNumWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, CallFunc_SelectInt_ReturnValue) == 0x000048, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x00004C, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_IncrementWidgetSwitcher, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'WBP_CollectionsWheel_C_IncrementWidgetSwitcher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CollectionsWheel.WBP_CollectionsWheel_C.InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_CollectionsWheel_C_InpActEvt_IA_IncrementCollectionsWheel_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_CollectionsWheel.WBP_CollectionsWheel_C.OnMouseButtonDown
// 0x0240 (0x0240 - 0x0000)
struct WBP_CollectionsWheel_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0220(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CollectionsWheel_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_CollectionsWheel_C_OnMouseButtonDown");
static_assert(sizeof(WBP_CollectionsWheel_C_OnMouseButtonDown) == 0x000240, "Wrong size on WBP_CollectionsWheel_C_OnMouseButtonDown");
static_assert(offsetof(WBP_CollectionsWheel_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_CollectionsWheel_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_CollectionsWheel_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_CollectionsWheel_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'WBP_CollectionsWheel_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000220, "Member 'WBP_CollectionsWheel_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000238, "Member 'WBP_CollectionsWheel_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function WBP_CollectionsWheel.WBP_CollectionsWheel_C.OnMouseWheel
// 0x0220 (0x0220 - 0x0000)
struct WBP_CollectionsWheel_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(WBP_CollectionsWheel_C_OnMouseWheel) == 0x000008, "Wrong alignment on WBP_CollectionsWheel_C_OnMouseWheel");
static_assert(sizeof(WBP_CollectionsWheel_C_OnMouseWheel) == 0x000220, "Wrong size on WBP_CollectionsWheel_C_OnMouseWheel");
static_assert(offsetof(WBP_CollectionsWheel_C_OnMouseWheel, MyGeometry) == 0x000000, "Member 'WBP_CollectionsWheel_C_OnMouseWheel::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_OnMouseWheel, MouseEvent) == 0x000038, "Member 'WBP_CollectionsWheel_C_OnMouseWheel::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_OnMouseWheel, ReturnValue) == 0x0000B0, "Member 'WBP_CollectionsWheel_C_OnMouseWheel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_OnMouseWheel, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'WBP_CollectionsWheel_C_OnMouseWheel::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_CollectionsWheel.WBP_CollectionsWheel_C.Start Selecting
// 0x0028 (0x0028 - 0x0000)
struct WBP_CollectionsWheel_C_Start_Selecting final
{
public:
	class UWBP_MainWidget_CM_C*                   MainWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CollectionsWheel_C> K2Node_DynamicCast_AsBPI_Collections_Wheel;        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CollectionsWheel_C_Start_Selecting) == 0x000008, "Wrong alignment on WBP_CollectionsWheel_C_Start_Selecting");
static_assert(sizeof(WBP_CollectionsWheel_C_Start_Selecting) == 0x000028, "Wrong size on WBP_CollectionsWheel_C_Start_Selecting");
static_assert(offsetof(WBP_CollectionsWheel_C_Start_Selecting, MainWidget) == 0x000000, "Member 'WBP_CollectionsWheel_C_Start_Selecting::MainWidget' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_Start_Selecting, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_CollectionsWheel_C_Start_Selecting::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_Start_Selecting, K2Node_DynamicCast_AsBPI_Collections_Wheel) == 0x000010, "Member 'WBP_CollectionsWheel_C_Start_Selecting::K2Node_DynamicCast_AsBPI_Collections_Wheel' has a wrong offset!");
static_assert(offsetof(WBP_CollectionsWheel_C_Start_Selecting, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_CollectionsWheel_C_Start_Selecting::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

