#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuffSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BuffSlot.WBP_BuffSlot_C
// 0x00B0 (0x0370 - 0x02C0)
class UWBP_BuffSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_Border_Styled*                   Border_Stacks;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   Button_BuffSlot;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BuffArrow;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BuffBacker;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Stacks;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FBuffActivation                        BuffActivation;                                    // 0x0300(0x0048)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UMaterialInstanceDynamic*               ProgressMaterial;                                  // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CircleThickness;                                   // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_BuffSlotTooltip_C*                 TooltipWidgt;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Construct();
	void ExecuteUbergraph_WBP_BuffSlot(int32 EntryPoint, bool K2Node_Event_bIsExpanded, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, bool K2Node_Event_bIsSelected, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class UBuffComponent* CallFunc_GetBuffs_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, float CallFunc_GetPercentUsedFromActivation_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UObject* K2Node_Event_ListItemObject, class UWBP_BuffSlotTooltip_C* CallFunc_Create_ReturnValue, class UBP_ListItem_Buff_C* K2Node_DynamicCast_AsBP_List_Item_Buff, bool K2Node_DynamicCast_bSuccess);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void RemoveBuff(EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, class UBuffComponent* CallFunc_GetBuffs_ReturnValue);
	void SetBuffActivationForSlot(const struct FBuffActivation& Param_BuffActivation, bool NewLocalVar, const struct FBuffConfig& BuffConfig, ESlateVisibility Temp_byte_Variable, const struct FBuffConfig& CallFunc_GetBuffConfigById_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_Greater_DoubleDouble_ReturnValue, ESlateVisibility Temp_byte_Variable_1, int64 CallFunc_Conv_IntToInt64_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, bool Temp_bool_Variable, ESlateVisibility K2Node_Select_Default, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool Temp_bool_Variable_1, ESlateVisibility K2Node_Select_Default_1, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class UBuffComponent* CallFunc_GetBuffs_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, float CallFunc_GetPercentUsedFromActivation_ReturnValue, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush_1, double CallFunc_Greater_DoubleDouble_A_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BuffSlot_C">();
	}
	static class UWBP_BuffSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuffSlot_C>();
	}
};
static_assert(alignof(UWBP_BuffSlot_C) == 0x000008, "Wrong alignment on UWBP_BuffSlot_C");
static_assert(sizeof(UWBP_BuffSlot_C) == 0x000370, "Wrong size on UWBP_BuffSlot_C");
static_assert(offsetof(UWBP_BuffSlot_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_BuffSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, Border_Stacks) == 0x0002C8, "Member 'UWBP_BuffSlot_C::Border_Stacks' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, Button_BuffSlot) == 0x0002D0, "Member 'UWBP_BuffSlot_C::Button_BuffSlot' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, IconImage) == 0x0002D8, "Member 'UWBP_BuffSlot_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, Image_BuffArrow) == 0x0002E0, "Member 'UWBP_BuffSlot_C::Image_BuffArrow' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, Image_BuffBacker) == 0x0002E8, "Member 'UWBP_BuffSlot_C::Image_BuffBacker' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, Progress) == 0x0002F0, "Member 'UWBP_BuffSlot_C::Progress' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, TextBlock_Stacks) == 0x0002F8, "Member 'UWBP_BuffSlot_C::TextBlock_Stacks' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, BuffActivation) == 0x000300, "Member 'UWBP_BuffSlot_C::BuffActivation' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, ProgressMaterial) == 0x000348, "Member 'UWBP_BuffSlot_C::ProgressMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, Color) == 0x000350, "Member 'UWBP_BuffSlot_C::Color' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, CircleThickness) == 0x000360, "Member 'UWBP_BuffSlot_C::CircleThickness' has a wrong offset!");
static_assert(offsetof(UWBP_BuffSlot_C, TooltipWidgt) == 0x000368, "Member 'UWBP_BuffSlot_C::TooltipWidgt' has a wrong offset!");

}

