#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_OpenContextMenuButton_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C
// 0x0110 (0x03D0 - 0x02C0)
class UWBP_Social_OpenContextMenuButton_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_46;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              MenuButton;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FocusTip_CM_C*                     WBP_FocusTip_CM;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_ContextMenuAnchor_CM_C*   WBP_Template_ContextMenuAnchor_CM;                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPointerEvent                          Mouse_Event;                                       // 0x02E8(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0360(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UWBP_Social_CharacterContextMenu_CM_C*  ContextMenuWidget_;                                // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMenuOpened;                                      // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMenuClosed;                                      // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMarkFocusUI;                                     // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsShowFocusTip;                                   // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Social_OpenContextMenuButton_CM_MenuButton_K2Node_ComponentBoundEvent_1_OnFocused__DelegateSignature();
	void BndEvt__WBP_Social_OpenContextMenuButton_CM_MenuButton_K2Node_ComponentBoundEvent_2_OnUnfocused__DelegateSignature();
	void BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void CloseContextMenu(bool bIsNeedFocuse, bool CallFunc_IsOpen_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void Construct();
	void ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM(int32 EntryPoint, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, int32 CallFunc_AkEventGlobal_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, const struct FUniqueNetIdRepl& K2Node_CustomEvent_UserId, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, TDelegate<void(class UUserWidget* MenuContent)> K2Node_CreateDelegate_OutputDelegate, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, bool CallFunc_EqualEqual_ReturnValue, ESlateVisibility K2Node_Select_Default, const struct FFocusEvent& K2Node_Event_InFocusEvent);
	void Handle_on_Menu_Button_Pressed(class UWBP_Social_CharacterContextMenu_CM_C* ContentWidget, bool bIsNeedFocuse, bool CallFunc_IsOpen_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void HandleOnFocused();
	void HandleOnMenuContextCreated(class UUserWidget* MenuContent, class UWBP_Social_CharacterContextMenu_CM_C* K2Node_DynamicCast_AsWBP_Social_Character_Context_Menu_CM, bool K2Node_DynamicCast_bSuccess, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(class UWBP_Social_CharacterContextMenu_CM_C* ContentWidget)> K2Node_CreateDelegate_OutputDelegate_1);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt_1, const struct FEventReply& CallFunc_Handled_ReturnValue, TArray<struct FF_CommonUIButtonPrompt>& K2Node_MakeArray_Array);
	void OnMarkFocusUI__DelegateSignature(class UWidget* Widget, TArray<struct FF_CommonUIButtonPrompt>& UIPrompt);
	void OnMenuClosed__DelegateSignature();
	void OnMenuOpened__DelegateSignature(class UWBP_Social_CharacterContextMenu_CM_C* ContextMenuWidget);
	void SetUserId(const struct FUniqueNetIdRepl& Param_UserId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Social_OpenContextMenuButton_CM_C">();
	}
	static class UWBP_Social_OpenContextMenuButton_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Social_OpenContextMenuButton_CM_C>();
	}
};
static_assert(alignof(UWBP_Social_OpenContextMenuButton_CM_C) == 0x000008, "Wrong alignment on UWBP_Social_OpenContextMenuButton_CM_C");
static_assert(sizeof(UWBP_Social_OpenContextMenuButton_CM_C) == 0x0003D0, "Wrong size on UWBP_Social_OpenContextMenuButton_CM_C");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, Image_46) == 0x0002C8, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::Image_46' has a wrong offset!");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, MenuButton) == 0x0002D0, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::MenuButton' has a wrong offset!");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, WBP_FocusTip_CM) == 0x0002D8, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::WBP_FocusTip_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, WBP_Template_ContextMenuAnchor_CM) == 0x0002E0, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::WBP_Template_ContextMenuAnchor_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, Mouse_Event) == 0x0002E8, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::Mouse_Event' has a wrong offset!");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, UserId) == 0x000360, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::UserId' has a wrong offset!");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, ContextMenuWidget_) == 0x000390, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::ContextMenuWidget_' has a wrong offset!");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, OnMenuOpened) == 0x000398, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::OnMenuOpened' has a wrong offset!");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, OnMenuClosed) == 0x0003A8, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::OnMenuClosed' has a wrong offset!");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, OnMarkFocusUI) == 0x0003B8, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::OnMarkFocusUI' has a wrong offset!");
static_assert(offsetof(UWBP_Social_OpenContextMenuButton_CM_C, bIsShowFocusTip) == 0x0003C8, "Member 'UWBP_Social_OpenContextMenuButton_CM_C::bIsShowFocusTip' has a wrong offset!");

}

