#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TIM_ChatCmdSuggestion_CM

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TIM_ChatCmdSuggestion_CM.WBP_TIM_ChatCmdSuggestion_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestion_CM.WBP_TIM_ChatCmdSuggestion_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestion_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestion_CM.WBP_TIM_ChatCmdSuggestion_CM_C.ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM
// 0x0020 (0x0020 - 0x0000)
struct WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TIM_ChatCmdSuggestionListItem_C*    K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM) == 0x000020, "Wrong size on WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM, EntryPoint) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM, K2Node_Event_bIsExpanded) == 0x000004, "Member 'WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM, K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item) == 0x000010, "Member 'WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM::K2Node_DynamicCast_AsBP_TIM_Chat_Cmd_Suggestion_List_Item' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM, K2Node_Event_bIsSelected) == 0x000019, "Member 'WBP_TIM_ChatCmdSuggestion_CM_C_ExecuteUbergraph_WBP_TIM_ChatCmdSuggestion_CM::K2Node_Event_bIsSelected' has a wrong offset!");

// Function WBP_TIM_ChatCmdSuggestion_CM.WBP_TIM_ChatCmdSuggestion_CM_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatCmdSuggestion_CM_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatCmdSuggestion_CM_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_TIM_ChatCmdSuggestion_CM_C_OnListItemObjectSet");
static_assert(sizeof(WBP_TIM_ChatCmdSuggestion_CM_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_TIM_ChatCmdSuggestion_CM_C_OnListItemObjectSet");
static_assert(offsetof(WBP_TIM_ChatCmdSuggestion_CM_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_TIM_ChatCmdSuggestion_CM_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

}

