#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameplayUIManager

#include "Basic.hpp"

#include "Struct_TutorialModalName_CM_structs.hpp"
#include "Palia_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Struct_CrossPlatformFTUEPopin_CM_structs.hpp"
#include "Slate_structs.hpp"
#include "S6Core_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "S6UICore_structs.hpp"
#include "F_GenericErrorModalPayload_structs.hpp"


namespace SDK::Params
{

// Function WBP_GameplayUIManager.WBP_GameplayUIManager_C.AddLoadingScreenWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameplayUIManager_C_AddLoadingScreenWidget final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplayUIManager_C_AddLoadingScreenWidget) == 0x000008, "Wrong alignment on WBP_GameplayUIManager_C_AddLoadingScreenWidget");
static_assert(sizeof(WBP_GameplayUIManager_C_AddLoadingScreenWidget) == 0x000008, "Wrong size on WBP_GameplayUIManager_C_AddLoadingScreenWidget");
static_assert(offsetof(WBP_GameplayUIManager_C_AddLoadingScreenWidget, Widget) == 0x000000, "Member 'WBP_GameplayUIManager_C_AddLoadingScreenWidget::Widget' has a wrong offset!");

// Function WBP_GameplayUIManager.WBP_GameplayUIManager_C.CheckAdjustNotifications
// 0x0060 (0x0060 - 0x0000)
struct WBP_GameplayUIManager_C_CheckAdjustNotifications final
{
public:
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0000(0x0020)(NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x0028(0x0020)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplayUIManager_C_CheckAdjustNotifications) == 0x000008, "Wrong alignment on WBP_GameplayUIManager_C_CheckAdjustNotifications");
static_assert(sizeof(WBP_GameplayUIManager_C_CheckAdjustNotifications) == 0x000060, "Wrong size on WBP_GameplayUIManager_C_CheckAdjustNotifications");
static_assert(offsetof(WBP_GameplayUIManager_C_CheckAdjustNotifications, K2Node_MakeStruct_Anchors) == 0x000000, "Member 'WBP_GameplayUIManager_C_CheckAdjustNotifications::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CheckAdjustNotifications, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'WBP_GameplayUIManager_C_CheckAdjustNotifications::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CheckAdjustNotifications, K2Node_MakeStruct_Anchors_1) == 0x000028, "Member 'WBP_GameplayUIManager_C_CheckAdjustNotifications::K2Node_MakeStruct_Anchors_1' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CheckAdjustNotifications, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000048, "Member 'WBP_GameplayUIManager_C_CheckAdjustNotifications::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CheckAdjustNotifications, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000050, "Member 'WBP_GameplayUIManager_C_CheckAdjustNotifications::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CheckAdjustNotifications, CallFunc_GetPlatformType_ReturnValue) == 0x000058, "Member 'WBP_GameplayUIManager_C_CheckAdjustNotifications::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CheckAdjustNotifications, K2Node_SwitchEnum_CmpSuccess) == 0x000059, "Member 'WBP_GameplayUIManager_C_CheckAdjustNotifications::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_GameplayUIManager.WBP_GameplayUIManager_C.CreateFTUEPopinWidget
// 0x0080 (0x0080 - 0x0000)
struct WBP_GameplayUIManager_C_CreateFTUEPopinWidget final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Content;                                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_FTUEPopin_CM_C*                    OutputPin;                                         // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   ContentText;                                       // 0x0038(0x0018)(Edit, BlueprintVisible)
	class FText                                   TitleText;                                         // 0x0050(0x0018)(Edit, BlueprintVisible)
	class UWBP_FTUEPopin_CM_C*                    FTUEPopin;                                         // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_FTUEPopin_CM_C*                    CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplayUIManager_C_CreateFTUEPopinWidget) == 0x000008, "Wrong alignment on WBP_GameplayUIManager_C_CreateFTUEPopinWidget");
static_assert(sizeof(WBP_GameplayUIManager_C_CreateFTUEPopinWidget) == 0x000080, "Wrong size on WBP_GameplayUIManager_C_CreateFTUEPopinWidget");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateFTUEPopinWidget, Title) == 0x000000, "Member 'WBP_GameplayUIManager_C_CreateFTUEPopinWidget::Title' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateFTUEPopinWidget, Content) == 0x000018, "Member 'WBP_GameplayUIManager_C_CreateFTUEPopinWidget::Content' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateFTUEPopinWidget, OutputPin) == 0x000030, "Member 'WBP_GameplayUIManager_C_CreateFTUEPopinWidget::OutputPin' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateFTUEPopinWidget, ContentText) == 0x000038, "Member 'WBP_GameplayUIManager_C_CreateFTUEPopinWidget::ContentText' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateFTUEPopinWidget, TitleText) == 0x000050, "Member 'WBP_GameplayUIManager_C_CreateFTUEPopinWidget::TitleText' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateFTUEPopinWidget, FTUEPopin) == 0x000068, "Member 'WBP_GameplayUIManager_C_CreateFTUEPopinWidget::FTUEPopin' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateFTUEPopinWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000070, "Member 'WBP_GameplayUIManager_C_CreateFTUEPopinWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateFTUEPopinWidget, CallFunc_Create_ReturnValue) == 0x000078, "Member 'WBP_GameplayUIManager_C_CreateFTUEPopinWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_GameplayUIManager.WBP_GameplayUIManager_C.CreateNormalFTUEPopinWidget
// 0x0068 (0x0068 - 0x0000)
struct WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget final
{
public:
	class FName                                   DefaultFTUEPopinType;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_FTUEPopin_CM_C*                    ReturnFTUEPopinWidget;                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_FTUEPopin_CM_C*                    FTUEPopinWidget;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   DefaultFTUEPopinName;                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_FTUEPopin_CM_C*                    CallFunc_CreateSpecialFTUEPopinWidget_ReturnFTUEPopinWidget; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_RedirecType_Title;                        // 0x0028(0x0018)()
	class FText                                   CallFunc_RedirecType_Content;                      // 0x0040(0x0018)()
	bool                                          CallFunc_RedirecType_EnableFound;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CFF[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FTUEPopin_CM_C*                    CallFunc_CreateFTUEPopinWidget_OutputPin;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget) == 0x000008, "Wrong alignment on WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget");
static_assert(sizeof(WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget) == 0x000068, "Wrong size on WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget, DefaultFTUEPopinType) == 0x000000, "Member 'WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget::DefaultFTUEPopinType' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget, ReturnFTUEPopinWidget) == 0x000008, "Member 'WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget::ReturnFTUEPopinWidget' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget, FTUEPopinWidget) == 0x000010, "Member 'WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget::FTUEPopinWidget' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget, DefaultFTUEPopinName) == 0x000018, "Member 'WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget::DefaultFTUEPopinName' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget, CallFunc_CreateSpecialFTUEPopinWidget_ReturnFTUEPopinWidget) == 0x000020, "Member 'WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget::CallFunc_CreateSpecialFTUEPopinWidget_ReturnFTUEPopinWidget' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget, CallFunc_RedirecType_Title) == 0x000028, "Member 'WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget::CallFunc_RedirecType_Title' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget, CallFunc_RedirecType_Content) == 0x000040, "Member 'WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget::CallFunc_RedirecType_Content' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget, CallFunc_RedirecType_EnableFound) == 0x000058, "Member 'WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget::CallFunc_RedirecType_EnableFound' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget, CallFunc_CreateFTUEPopinWidget_OutputPin) == 0x000060, "Member 'WBP_GameplayUIManager_C_CreateNormalFTUEPopinWidget::CallFunc_CreateFTUEPopinWidget_OutputPin' has a wrong offset!");

// Function WBP_GameplayUIManager.WBP_GameplayUIManager_C.CreateSpecialFTUEPopinWidget
// 0x0060 (0x0060 - 0x0000)
struct WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget final
{
public:
	class FName                                   DefaultFTUEPopinType;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_FTUEPopin_CM_C*                    ReturnFTUEPopinWidget;                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_FTUEPopin_CM_C*                    FTUEPopinWidget;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   DefaultFTUEPopinName;                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_RedirecType_Title;                        // 0x0020(0x0018)()
	class FText                                   CallFunc_RedirecType_Content;                      // 0x0038(0x0018)()
	bool                                          CallFunc_RedirecType_EnableFound;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D00[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FTUEPopin_CM_C*                    CallFunc_CreateFTUEPopinWidget_OutputPin;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget) == 0x000008, "Wrong alignment on WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget");
static_assert(sizeof(WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget) == 0x000060, "Wrong size on WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget, DefaultFTUEPopinType) == 0x000000, "Member 'WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget::DefaultFTUEPopinType' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget, ReturnFTUEPopinWidget) == 0x000008, "Member 'WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget::ReturnFTUEPopinWidget' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget, FTUEPopinWidget) == 0x000010, "Member 'WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget::FTUEPopinWidget' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget, DefaultFTUEPopinName) == 0x000018, "Member 'WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget::DefaultFTUEPopinName' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget, CallFunc_RedirecType_Title) == 0x000020, "Member 'WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget::CallFunc_RedirecType_Title' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget, CallFunc_RedirecType_Content) == 0x000038, "Member 'WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget::CallFunc_RedirecType_Content' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget, CallFunc_RedirecType_EnableFound) == 0x000050, "Member 'WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget::CallFunc_RedirecType_EnableFound' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget, CallFunc_CreateFTUEPopinWidget_OutputPin) == 0x000058, "Member 'WBP_GameplayUIManager_C_CreateSpecialFTUEPopinWidget::CallFunc_CreateFTUEPopinWidget_OutputPin' has a wrong offset!");

// Function WBP_GameplayUIManager.WBP_GameplayUIManager_C.DisplayLoadingScreen
// 0x0018 (0x0018 - 0x0000)
struct WBP_GameplayUIManager_C_DisplayLoadingScreen final
{
public:
	bool                                          Display;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D01[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_PlayerControllerBase*              CallFunc_GetValeriaPlayerController_PC;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplayUIManager_C_DisplayLoadingScreen) == 0x000008, "Wrong alignment on WBP_GameplayUIManager_C_DisplayLoadingScreen");
static_assert(sizeof(WBP_GameplayUIManager_C_DisplayLoadingScreen) == 0x000018, "Wrong size on WBP_GameplayUIManager_C_DisplayLoadingScreen");
static_assert(offsetof(WBP_GameplayUIManager_C_DisplayLoadingScreen, Display) == 0x000000, "Member 'WBP_GameplayUIManager_C_DisplayLoadingScreen::Display' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_DisplayLoadingScreen, CallFunc_GetValeriaPlayerController_PC) == 0x000008, "Member 'WBP_GameplayUIManager_C_DisplayLoadingScreen::CallFunc_GetValeriaPlayerController_PC' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_DisplayLoadingScreen, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000010, "Member 'WBP_GameplayUIManager_C_DisplayLoadingScreen::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");

// Function WBP_GameplayUIManager.WBP_GameplayUIManager_C.DisplayMatchmakingErrorResult
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_GameplayUIManager_C_DisplayMatchmakingErrorResult final
{
public:
	struct FOSSVAL_MatchmakingResult              Result;                                            // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GameplayUIManager_C_DisplayMatchmakingErrorResult) == 0x000008, "Wrong alignment on WBP_GameplayUIManager_C_DisplayMatchmakingErrorResult");
static_assert(sizeof(WBP_GameplayUIManager_C_DisplayMatchmakingErrorResult) == 0x0000C0, "Wrong size on WBP_GameplayUIManager_C_DisplayMatchmakingErrorResult");
static_assert(offsetof(WBP_GameplayUIManager_C_DisplayMatchmakingErrorResult, Result) == 0x000000, "Member 'WBP_GameplayUIManager_C_DisplayMatchmakingErrorResult::Result' has a wrong offset!");

// Function WBP_GameplayUIManager.WBP_GameplayUIManager_C.EnterLoginState
// 0x0010 (0x0010 - 0x0000)
struct WBP_GameplayUIManager_C_EnterLoginState final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D02[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_StateUserWidget*                  K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplayUIManager_C_EnterLoginState) == 0x000008, "Wrong alignment on WBP_GameplayUIManager_C_EnterLoginState");
static_assert(sizeof(WBP_GameplayUIManager_C_EnterLoginState) == 0x000010, "Wrong size on WBP_GameplayUIManager_C_EnterLoginState");
static_assert(offsetof(WBP_GameplayUIManager_C_EnterLoginState, Temp_bool_Variable) == 0x000000, "Member 'WBP_GameplayUIManager_C_EnterLoginState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_EnterLoginState, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_GameplayUIManager_C_EnterLoginState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameplayUIManager_C_EnterLoginState, K2Node_Select_Default) == 0x000008, "Member 'WBP_GameplayUIManager_C_EnterLoginState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GameplayUIManager.WBP_GameplayUIManager_C.ExecuteUbergraph_WBP_GameplayUIManager
// 0x1A60 (0x1A60 - 0x0000)
struct WBP_GameplayUIManager_C_ExecuteUbergraph_WBP_GameplayUIManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D03[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D04[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D05[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_RedirectStateType_ReturnValue;            // 0x0028(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_CharacterRenderStudio*             CallFunc_GetCharacterRenderStudio_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D06[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PaliaPassHUD_C>   K2Node_DynamicCast_AsBPI_Palia_Pass_HUD;           // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestPaliaPassScene_ReturnValue;        // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D07[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GpPopup_AnchoredPopupBase_C*       CallFunc_Create_ReturnValue;                       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_CharacterRenderStudio* Studio, EVAL_CharacterRenderStudioState State)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D08[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GpPopup_DescriptivePopupBase_C*    CallFunc_Create_ReturnValue_1;                     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UXIntentSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_CharacterRenderStudio* Studio, EVAL_CharacterRenderStudioState State)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D09[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GpPopup_AlignedPopupBase_C*        CallFunc_Create_ReturnValue_2;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BuildIsShipping_ReturnValue;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0A[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Notification_DebugTest_C*          CallFunc_Create_ReturnValue_3;                     // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Notification_DebugTest_WithBindings_C* CallFunc_Create_ReturnValue_4;                     // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_5;            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Notification_DebugTest_WithBindings_C* CallFunc_Create_ReturnValue_5;                     // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_PushNotification_ReturnValue;             // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_PushNotification_ReturnValue_1;           // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_PushNotification_ReturnValue_2;           // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_1;           // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0B[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0188(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_6;            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_RedirectStateType_ReturnValue_1;          // 0x0198(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_2;           // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_2;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0C[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_2;                             // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_6;                     // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_3;           // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_3;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0D[0x3];                                     // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_PushNotification_ReturnValue_3;           // 0x01F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0204(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryEnterGameplayState_Succeeded;          // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0E[0x2];                                     // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D0F[0x2];                                     // 0x0222(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaPlayerController* Vpc, class AValeriaCharacter* Ctxt)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0224(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationModeConfig  K2Node_Event_Config;                               // 0x0234(0x0010)(ConstParm, NoDestructor)
	EVAL_GameplayMenuMode                         K2Node_Event_Mode;                                 // 0x0244(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0247(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_2;                       // 0x0248(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ES6UI_ModalWidgetState                        CallFunc_GetModalWidgetState_ReturnValue;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D10[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_ModalInterface_PMenu_C> K2Node_DynamicCast_AsBP_Modal_Interface_PMenu;     // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D11[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InventoryHUD_C>   K2Node_DynamicCast_AsBPI_Inventory_HUD;            // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D12[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D13[0x2];                                     // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_3;                             // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_BookId;                               // 0x02A0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D14[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_4;           // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_4;                // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D15[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_3;                       // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x02C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_4;                             // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_RegisterInputActionBinding_ReturnValue;   // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_5;           // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_5;                // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D16[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_7;            // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_7;                     // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_StablesActor;                         // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_StateUserWidget*                  K2Node_DynamicCast_AsS6UI_State_User_Widget;       // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D17[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  K2Node_Event_IdOfPhotoToNavigateTo_1;              // 0x031C(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldSelectPhoto_1;                 // 0x032C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D18[0x3];                                     // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  K2Node_Event_IdOfPhotoToNavigateTo;                // 0x0330(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldSelectPhoto;                   // 0x0340(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D19[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemVariantCustomizerComponent*        K2Node_Event_Customizer;                           // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AVAL_TeleporterBase*                    K2Node_Event_Teleporter;                           // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_CharacterRenderStudio* Studio)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0358(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCharacterCustomManager*                CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_CharacterRenderStudio*             CallFunc_GetCharacterRenderStudio_ReturnValue_1;   // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1A[0x3];                                     // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x03A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x03B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_villagerConfigId;                     // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UVillagerStoreConfig*             K2Node_Event_storeConfig;                          // 0x03D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1B[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_OpenStorePayload                  K2Node_Event_payload;                              // 0x03E8(0x0028)(ConstParm)
	class UVillagerStoreComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_repairStationActor;                   // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAllowPurchases;                      // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAllowRepairKitsFromStorage;          // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1C[0x2];                                     // 0x0422(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_tag;                                  // 0x0424(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1D[0x4];                                     // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameInstance*                   K2Node_DynamicCast_AsValeria_Game_Instance;        // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1E[0x7];                                     // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_5;                             // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1F[0x7];                                     // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_6;           // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_6;                // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D20[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_4;                       // 0x0468(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class US6UI_StateUserWidget*                  K2Node_CustomEvent_Screen;                         // 0x0470(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_6;                             // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_5;                       // 0x0480(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_7;           // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_7;                // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D21[0x7];                                     // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_25;                      // 0x0498(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBP_NotificationFactory_MainWidget_C*   CallFunc_SpawnObject_ReturnValue;                  // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_8;            // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bFadeIn)>                 K2Node_CreateDelegate_OutputDelegate_11;           // 0x04B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               K2Node_DynamicCast_AsValeria_Player_Controller;    // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D22[0x7];                                     // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelerComponent*                      K2Node_Event_LevelerComponent;                     // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ES6UI_ModalWidgetState                        CallFunc_GetModalWidgetState_ReturnValue_1;        // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D23[0x6];                                     // 0x04DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVAL_BundleShrineConfigAsset*     K2Node_Event_BundleShrineConfigAsset;              // 0x04E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<ES6UI_ModalWidgetState>                  K2Node_MakeSet_Set;                                // 0x04E8(0x0050)(ConstParm)
	TSet<ES6UI_ModalWidgetState>                  K2Node_MakeSet_Set_1;                              // 0x0538(0x0050)(ConstParm)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue_1;               // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x058A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D24[0x5];                                     // 0x058B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrafterComponent*                      K2Node_Event_CrafterComponent;                     // 0x0590(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_7;                             // 0x0598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCrafterComponent_Automatic*            K2Node_DynamicCast_AsCrafter_Component_Automatic;  // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D25[0x7];                                     // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsS6UI_Modal_Widget_Base;  // 0x05B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_8;                // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D26[0x7];                                     // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  CallFunc_Create_ReturnValue_8;                     // 0x05C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UShippingBinComponent*                  K2Node_Event_ShippingBinComponent;                 // 0x05C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EAmmoType                                     K2Node_Event_AmmoType;                             // 0x05D0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D27[0x7];                                     // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHousingPlotActor*                      K2Node_Event_HousingPlot;                          // 0x05D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_9;            // 0x05E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   K2Node_CustomEvent_AssetClass_1;                   // 0x05E8(0x0028)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_10;           // 0x0610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_9;                     // 0x0618(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_8;                             // 0x0620(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_11;           // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_8;           // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_9;                // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D28[0x7];                                     // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_6;                       // 0x0640(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_10;                    // 0x0648(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_ModalInterface_Collections_C> K2Node_DynamicCast_AsBP_Modal_Interface_Collections; // 0x0650(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D29[0x7];                                     // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  K2Node_DynamicCast_AsS6UI_Modal_Widget_Base;       // 0x0668(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D2A[0x7];                                     // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_26;                      // 0x0678(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_12;           // 0x0680(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0688(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_9;                             // 0x0690(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_10;                            // 0x0698(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_9;           // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_10;               // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D2B[0x7];                                     // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget_10;          // 0x06B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_11;               // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D2C[0x7];                                     // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_13;           // 0x06C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_7;                       // 0x06C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_27;                      // 0x06D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
