#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsItem_Dropdown_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5453[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_ComboBox_02_CM_K2Node_ComponentBoundEvent_6_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_BndEvt__WBP_SettingsItem_Dropdown_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM
// 0x0048 (0x0048 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5454[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM) == 0x000008, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM) == 0x000048, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM, EntryPoint) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM, K2Node_ComponentBoundEvent_Index) == 0x000004, "Member 'WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM, K2Node_ComponentBoundEvent_Text) == 0x000008, "Member 'WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM, CallFunc_TextIsEmpty_ReturnValue) == 0x000020, "Member 'WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM, K2Node_ComponentBoundEvent_Button_2) == 0x000028, "Member 'WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000030, "Member 'WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM, K2Node_ComponentBoundEvent_Button) == 0x000038, "Member 'WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000040, "Member 'WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM, K2Node_Event_IsDesignTime) == 0x000044, "Member 'WBP_SettingsItem_Dropdown_CM_C_ExecuteUbergraph_WBP_SettingsItem_Dropdown_CM::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_SettingsItem_Dropdown_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5455[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_SettingsItem_Dropdown_CM_C_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_PreConstruct");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_PreConstruct");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.SetCurrentOptionToIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_SetCurrentOptionToIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_SetCurrentOptionToIndex) == 0x000004, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_SetCurrentOptionToIndex");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_SetCurrentOptionToIndex) == 0x000004, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_SetCurrentOptionToIndex");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_SetCurrentOptionToIndex, Param_Index) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_SetCurrentOptionToIndex::Param_Index' has a wrong offset!");

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.SetItemName
// 0x0018 (0x0018 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_SetItemName final
{
public:
	class FText                                   Param_ItemName;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_SetItemName) == 0x000008, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_SetItemName");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_SetItemName) == 0x000018, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_SetItemName");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_SetItemName, Param_ItemName) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_SetItemName::Param_ItemName' has a wrong offset!");

// Function WBP_SettingsItem_Dropdown_CM.WBP_SettingsItem_Dropdown_CM_C.SetTextOptions
// 0x0018 (0x0018 - 0x0000)
struct WBP_SettingsItem_Dropdown_CM_C_SetTextOptions final
{
public:
	TArray<class FText>                           Param_Text_Options;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Param_Selected_Option;                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Dropdown_CM_C_SetTextOptions) == 0x000008, "Wrong alignment on WBP_SettingsItem_Dropdown_CM_C_SetTextOptions");
static_assert(sizeof(WBP_SettingsItem_Dropdown_CM_C_SetTextOptions) == 0x000018, "Wrong size on WBP_SettingsItem_Dropdown_CM_C_SetTextOptions");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_SetTextOptions, Param_Text_Options) == 0x000000, "Member 'WBP_SettingsItem_Dropdown_CM_C_SetTextOptions::Param_Text_Options' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Dropdown_CM_C_SetTextOptions, Param_Selected_Option) == 0x000010, "Member 'WBP_SettingsItem_Dropdown_CM_C_SetTextOptions::Param_Selected_Option' has a wrong offset!");

}

