#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlacementMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlacementMode.WBP_PlacementMode_C
// 0x0080 (0x0368 - 0x02E8)
class UWBP_PlacementMode_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CommonUIButtonPromptItem_C*        CancelImage;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        ExitPlacementModeImage;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        FreePlacementImage;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        GridLockImage;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ItemInfoSlot;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        PlaceImage;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              PlacementModeIconSwitcher;                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        PlacementModeImage;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        RotationCCWImage;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        RotationCWImage;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionBarItemInfo_C*               WBP_ActionBarItemInfo;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_EditModeButton;                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_FreePlacement;                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_GridLock;                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_PlacementMode(int32 EntryPoint, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, TDelegate<void(class UPlacementComponent* PC)> K2Node_CreateDelegate_OutputDelegate, class UPlacementComponent* CallFunc_GetPlacement_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, TDelegate<void(class AValeriaCharacter* Character, bool Flag)> K2Node_CreateDelegate_OutputDelegate_1, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult_1, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_1, TDelegate<void(class AValeriaCharacter* Character, bool Flag)> K2Node_CreateDelegate_OutputDelegate_2, class UPlacementComponent* CallFunc_GetPlacement_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1, TDelegate<void(class UPlacementComponent* PC)> K2Node_CreateDelegate_OutputDelegate_3, bool Temp_bool_Variable, TDelegate<void(class AValeriaCharacter* Character, bool Flag)> K2Node_CreateDelegate_OutputDelegate_4, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_5, TDelegate<void(class AValeriaCharacter* Character, bool Flag)> K2Node_CreateDelegate_OutputDelegate_6, ESlateVisibility K2Node_CustomEvent_InVisibility, bool K2Node_SwitchEnum_CmpSuccess_2, TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_7, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult_2, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_2, class UPlacementComponent* CallFunc_GetPlacement_ReturnValue_2, bool CallFunc_IsPlacementMoveModifierActive_ReturnValue, TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> CallFunc_GetItemTypeToPlace_ReturnValue, bool CallFunc_IsPlacementPickupModeActive_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_3, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, ESlateVisibility CallFunc_GetVisibility_ReturnValue, ECommonInputType K2Node_CustomEvent_bNewInputType, bool K2Node_SwitchEnum_CmpSuccess_4, bool CallFunc_Set_Item_Definition_Displays, ESlateVisibility K2Node_Select_Default);
	void On_Visibility_Changed(ESlateVisibility InVisibility);
	void OnInputMethodChanged_Event(ECommonInputType bNewInputType);
	void UpdateFreePlacementIcon(class UPlacementComponent* PlacementComponent, bool Temp_bool_Variable, bool CallFunc_IsFreePlacementModeActive_ReturnValue, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 K2Node_Select_Default);
	void UpdateGridLockIcon(class AValeriaCharacter* Character, bool Flag, bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 K2Node_Select_Default);
	void UpdatePlacementModeIcon(class AValeriaCharacter* Character, bool Flag, int32 Temp_int_Variable, int32 Temp_int_Variable_1, bool Temp_bool_Variable, int32 Temp_int_Variable_2, int32 Temp_int_Variable_3, bool Temp_bool_Variable_1, int32 K2Node_Select_Default, int32 K2Node_Select_Default_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlacementMode_C">();
	}
	static class UWBP_PlacementMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlacementMode_C>();
	}
};
static_assert(alignof(UWBP_PlacementMode_C) == 0x000008, "Wrong alignment on UWBP_PlacementMode_C");
static_assert(sizeof(UWBP_PlacementMode_C) == 0x000368, "Wrong size on UWBP_PlacementMode_C");
static_assert(offsetof(UWBP_PlacementMode_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_PlacementMode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, CancelImage) == 0x0002F0, "Member 'UWBP_PlacementMode_C::CancelImage' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, ExitPlacementModeImage) == 0x0002F8, "Member 'UWBP_PlacementMode_C::ExitPlacementModeImage' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, FreePlacementImage) == 0x000300, "Member 'UWBP_PlacementMode_C::FreePlacementImage' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, GridLockImage) == 0x000308, "Member 'UWBP_PlacementMode_C::GridLockImage' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, Image) == 0x000310, "Member 'UWBP_PlacementMode_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, ItemInfoSlot) == 0x000318, "Member 'UWBP_PlacementMode_C::ItemInfoSlot' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, PlaceImage) == 0x000320, "Member 'UWBP_PlacementMode_C::PlaceImage' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, PlacementModeIconSwitcher) == 0x000328, "Member 'UWBP_PlacementMode_C::PlacementModeIconSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, PlacementModeImage) == 0x000330, "Member 'UWBP_PlacementMode_C::PlacementModeImage' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, RotationCCWImage) == 0x000338, "Member 'UWBP_PlacementMode_C::RotationCCWImage' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, RotationCWImage) == 0x000340, "Member 'UWBP_PlacementMode_C::RotationCWImage' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, WBP_ActionBarItemInfo) == 0x000348, "Member 'UWBP_PlacementMode_C::WBP_ActionBarItemInfo' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, WidgetSwitcher_EditModeButton) == 0x000350, "Member 'UWBP_PlacementMode_C::WidgetSwitcher_EditModeButton' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, WidgetSwitcher_FreePlacement) == 0x000358, "Member 'UWBP_PlacementMode_C::WidgetSwitcher_FreePlacement' has a wrong offset!");
static_assert(offsetof(UWBP_PlacementMode_C, WidgetSwitcher_GridLock) == 0x000360, "Member 'UWBP_PlacementMode_C::WidgetSwitcher_GridLock' has a wrong offset!");

}

