#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ComboBoxButton_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ComboBoxButton_CM.WBP_ComboBoxButton_CM_C
// 0x0400 (0x06C0 - 0x02C0)
class UWBP_ComboBoxButton_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_CM_C*              Button_Expand_CM;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DropdownArrow;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_ContextMenuAnchor_CM_C*   WBP_Template_ContextMenuAnchor_CM;                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedOptionIndex;                               // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5393[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           TextOptions;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnOptionChanged;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUserWidget*                            ComboBox;                                          // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ComboBoxClass;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMenuOpened;                                      // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	uint8                                         Pad_5394[0x8];                                     // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            In_Image_Brush;                                    // 0x0340(0x00D0)(Edit, BlueprintVisible)
	struct FSlateBrush                            In_Dropdown_Menu_Brush;                            // 0x0410(0x00D0)(Edit, BlueprintVisible)
	bool                                          ShouldMenuOpen;                                    // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5395[0x7];                                     // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ButtonStyle_Expanded_CM;                           // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ButtonStyle_Collapsed_CM;                          // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           In_Input_Action;                                   // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMenuCreated;                                     // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSlateBrush                            In_Image_Selected_Brush;                           // 0x0510(0x00D0)(Edit, BlueprintVisible)
	struct FSlateBrush                            In_Dropdown_Menu_Selected_Brush;                   // 0x05E0(0x00D0)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnMenuClosed;                                      // 0x06B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_ComboBoxButton_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ComboBoxButton_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ComboBoxButton_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ComboBoxButton_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ComboBoxButton_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_0_OnMenuContentCreated__DelegateSignature(class UUserWidget* MenuContent);
	void CloseMenu();
	void ExecuteUbergraph_WBP_ComboBoxButton_CM(int32 EntryPoint, TDelegate<void(bool bIsOpen)> K2Node_CreateDelegate_OutputDelegate, bool K2Node_CustomEvent_bIsOpen, double Temp_real_Variable, double Temp_real_Variable_1, int32 CallFunc_AkEventGlobal_ReturnValue, bool K2Node_Event_IsDesignTime, int32 CallFunc_AkEventGlobal_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_2, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_3, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_2, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, bool CallFunc_IsHovered_ReturnValue, class UUserWidget* K2Node_ComponentBoundEvent_MenuContent, bool Temp_bool_Variable, double K2Node_Select_Default, class UUserWidget* CallFunc_HandleMenuAnchorGetUserMenuContent_ReturnValue, bool CallFunc_ShouldOpenDueToClick_ReturnValue, bool CallFunc_ShouldOpenDueToClick_ReturnValue_1, float CallFunc_SetRenderTransformAngle_Angle_ImplicitCast);
	class UUserWidget* HandleGetMenuContent();
	void OnMenuClosed__DelegateSignature();
	void OnMenuCreated__DelegateSignature(class UUserWidget* MenuContent);
	void OnMenuOpenChanged(bool bIsOpen);
	void OnMenuOpened__DelegateSignature();
	void OnOptionChanged__DelegateSignature(int32 Param_Index, class FText Text);
	void PreConstruct(bool IsDesignTime);
	void ToggleMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ComboBoxButton_CM_C">();
	}
	static class UWBP_ComboBoxButton_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ComboBoxButton_CM_C>();
	}
};
static_assert(alignof(UWBP_ComboBoxButton_CM_C) == 0x000010, "Wrong alignment on UWBP_ComboBoxButton_CM_C");
static_assert(sizeof(UWBP_ComboBoxButton_CM_C) == 0x0006C0, "Wrong size on UWBP_ComboBoxButton_CM_C");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ComboBoxButton_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, Button_Expand_CM) == 0x0002C8, "Member 'UWBP_ComboBoxButton_CM_C::Button_Expand_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, CommonActionWidget) == 0x0002D0, "Member 'UWBP_ComboBoxButton_CM_C::CommonActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, Image_DropdownArrow) == 0x0002D8, "Member 'UWBP_ComboBoxButton_CM_C::Image_DropdownArrow' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, Image_Icon) == 0x0002E0, "Member 'UWBP_ComboBoxButton_CM_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, WBP_Template_ContextMenuAnchor_CM) == 0x0002E8, "Member 'UWBP_ComboBoxButton_CM_C::WBP_Template_ContextMenuAnchor_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, SelectedOptionIndex) == 0x0002F0, "Member 'UWBP_ComboBoxButton_CM_C::SelectedOptionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, TextOptions) == 0x0002F8, "Member 'UWBP_ComboBoxButton_CM_C::TextOptions' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, OnOptionChanged) == 0x000308, "Member 'UWBP_ComboBoxButton_CM_C::OnOptionChanged' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, ComboBox) == 0x000318, "Member 'UWBP_ComboBoxButton_CM_C::ComboBox' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, ComboBoxClass) == 0x000320, "Member 'UWBP_ComboBoxButton_CM_C::ComboBoxClass' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, OnMenuOpened) == 0x000328, "Member 'UWBP_ComboBoxButton_CM_C::OnMenuOpened' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, In_Image_Brush) == 0x000340, "Member 'UWBP_ComboBoxButton_CM_C::In_Image_Brush' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, In_Dropdown_Menu_Brush) == 0x000410, "Member 'UWBP_ComboBoxButton_CM_C::In_Dropdown_Menu_Brush' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, ShouldMenuOpen) == 0x0004E0, "Member 'UWBP_ComboBoxButton_CM_C::ShouldMenuOpen' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, ButtonStyle_Expanded_CM) == 0x0004E8, "Member 'UWBP_ComboBoxButton_CM_C::ButtonStyle_Expanded_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, ButtonStyle_Collapsed_CM) == 0x0004F0, "Member 'UWBP_ComboBoxButton_CM_C::ButtonStyle_Collapsed_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, In_Input_Action) == 0x0004F8, "Member 'UWBP_ComboBoxButton_CM_C::In_Input_Action' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, OnMenuCreated) == 0x000500, "Member 'UWBP_ComboBoxButton_CM_C::OnMenuCreated' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, In_Image_Selected_Brush) == 0x000510, "Member 'UWBP_ComboBoxButton_CM_C::In_Image_Selected_Brush' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, In_Dropdown_Menu_Selected_Brush) == 0x0005E0, "Member 'UWBP_ComboBoxButton_CM_C::In_Dropdown_Menu_Selected_Brush' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBoxButton_CM_C, OnMenuClosed) == 0x0006B0, "Member 'UWBP_ComboBoxButton_CM_C::OnMenuClosed' has a wrong offset!");

}

