#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListEntry_Social_Follower_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ListEntry_Social_Follower_CM.WBP_ListEntry_Social_Follower_CM_C
// 0x0058 (0x03F8 - 0x03A0)
class UWBP_ListEntry_Social_Follower_CM_C final : public UCommonUserWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Primary_AddFriend;                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class US6UI_CustomNavigationGroup*            CustomNavigationGroup_Follower;                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerCharacterRow_CM_C*           WBP_PlayerCharacterRow_CM;                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListItem_SocialConnection_C*           Connection;                                        // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnInspectPlayerCharacter;                          // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnAddFriendClicked;                                // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMarkFocusUI;                                     // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_ListEntry_Social_Follower_CM_Button_Primary_AddFriend_12_K2Node_ComponentBoundEvent_2_ButtonHovered__DelegateSignature();
	void BndEvt__WBP_ListEntry_Social_Follower_CM_Button_Primary_AddFriend_12_K2Node_ComponentBoundEvent_5_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_ListEntry_Social_Follower_CM_Button_Primary_AddFriend_K2Node_ComponentBoundEvent_0_OnFocus__DelegateSignature();
	void BndEvt__WBP_ListEntry_Social_Follower_CM_S6UI_CustomNavigationGroup_Follower_K2Node_ComponentBoundEvent_3_OnCustomNavigationGroupInitialized__DelegateSignature(class US6UI_CustomNavigationGroup* NavGroup);
	void BndEvt__WBP_ListEntry_Social_Follower_CM_S6UI_CustomNavigationGroup_Follower_K2Node_ComponentBoundEvent_4_OnNavigated__DelegateSignature(class US6UI_CustomNavigationGroup* NavGroup);
	void BndEvt__WBP_ListEntry_Social_Follower_CM_WBP_PlayerCharacterRow_CM_K2Node_ComponentBoundEvent_6_OnCharacterProfileImageClicked__DelegateSignature(class UWBP_PlayerCharacterProfileImage_CM_C* CharacterProfileImageWidget);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Construct();
	void ExecuteUbergraph_WBP_ListEntry_Social_Follower_CM(int32 EntryPoint, class US6UI_CustomNavigationGroup* K2Node_ComponentBoundEvent_NavGroup, bool K2Node_Event_bIsExpanded, bool K2Node_Event_bIsSelected, class UObject* K2Node_Event_ListItemObject, class UListItem_SocialConnection_C* K2Node_DynamicCast_AsList_Item_Social_Connection, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_PostGlobalEvent_ReturnValue, int32 CallFunc_PostGlobalEvent_ReturnValue_1, class UWBP_PlayerCharacterProfileImage_CM_C* K2Node_ComponentBoundEvent_CharacterProfileImageWidget, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt_1, TArray<struct FF_CommonUIButtonPrompt>& K2Node_MakeArray_Array, class US6UI_CustomNavigationGroup* K2Node_ComponentBoundEvent_NavGroup_1, TArray<class UWidget*>& K2Node_MakeArray_Array_1);
	void GetCustomNavigationGroup(class US6UI_CustomNavigationGroup** NavigationGroup);
	void OnAddFriendClicked__DelegateSignature(class UWBP_ListEntry_Social_Follower_CM_C* Widget, const struct FUniqueNetIdRepl& UserId);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnInspectPlayerCharacter__DelegateSignature(class UWBP_ListEntry_Social_Follower_CM_C* Widget, const struct FUniqueNetIdRepl& UserId);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnMarkFocusUI__DelegateSignature(class UWidget* Widget, TArray<struct FF_CommonUIButtonPrompt>& UIPrompt);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ListEntry_Social_Follower_CM_C">();
	}
	static class UWBP_ListEntry_Social_Follower_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ListEntry_Social_Follower_CM_C>();
	}
};
static_assert(alignof(UWBP_ListEntry_Social_Follower_CM_C) == 0x000008, "Wrong alignment on UWBP_ListEntry_Social_Follower_CM_C");
static_assert(sizeof(UWBP_ListEntry_Social_Follower_CM_C) == 0x0003F8, "Wrong size on UWBP_ListEntry_Social_Follower_CM_C");
static_assert(offsetof(UWBP_ListEntry_Social_Follower_CM_C, UberGraphFrame) == 0x0003A0, "Member 'UWBP_ListEntry_Social_Follower_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_Social_Follower_CM_C, Button_Primary_AddFriend) == 0x0003A8, "Member 'UWBP_ListEntry_Social_Follower_CM_C::Button_Primary_AddFriend' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_Social_Follower_CM_C, CustomNavigationGroup_Follower) == 0x0003B0, "Member 'UWBP_ListEntry_Social_Follower_CM_C::CustomNavigationGroup_Follower' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_Social_Follower_CM_C, WBP_PlayerCharacterRow_CM) == 0x0003B8, "Member 'UWBP_ListEntry_Social_Follower_CM_C::WBP_PlayerCharacterRow_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_Social_Follower_CM_C, Connection) == 0x0003C0, "Member 'UWBP_ListEntry_Social_Follower_CM_C::Connection' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_Social_Follower_CM_C, OnInspectPlayerCharacter) == 0x0003C8, "Member 'UWBP_ListEntry_Social_Follower_CM_C::OnInspectPlayerCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_Social_Follower_CM_C, OnAddFriendClicked) == 0x0003D8, "Member 'UWBP_ListEntry_Social_Follower_CM_C::OnAddFriendClicked' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_Social_Follower_CM_C, OnMarkFocusUI) == 0x0003E8, "Member 'UWBP_ListEntry_Social_Follower_CM_C::OnMarkFocusUI' has a wrong offset!");

}

