#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GoldCapWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GoldCapWarning.WBP_GoldCapWarning_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_GoldCapWarning_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               IconOverlay;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            TooltipMenuAnchor;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GoldCapWarning(int32 EntryPoint, const struct FFocusEvent& K2Node_Event_InFocusEvent, const struct FGeometry& K2Node_Event_MyGeometry, struct FPointerEvent& K2Node_Event_MouseEvent_1, struct FPointerEvent& K2Node_Event_MouseEvent);
	class UUserWidget* MakeTooltipWidget(class UWBP_BasicTooltip_C* Param_ToolTipWidget, class UWBP_BasicTooltip_C* CallFunc_Create_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnMouseEnter(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void OnMouseLeave(struct FPointerEvent& MouseEvent);
	void UpdateVisibility(int32 TotalItemValue, bool* Param_IsVisible, bool Visible, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class UVitalsComponent* CallFunc_GetVitals_ReturnValue, ESlateVisibility K2Node_Select_Default, int32 CallFunc_GetVitalMax_ReturnValue, int32 CallFunc_GetVital_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GoldCapWarning_C">();
	}
	static class UWBP_GoldCapWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GoldCapWarning_C>();
	}
};
static_assert(alignof(UWBP_GoldCapWarning_C) == 0x000008, "Wrong alignment on UWBP_GoldCapWarning_C");
static_assert(sizeof(UWBP_GoldCapWarning_C) == 0x0002D8, "Wrong size on UWBP_GoldCapWarning_C");
static_assert(offsetof(UWBP_GoldCapWarning_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_GoldCapWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GoldCapWarning_C, IconOverlay) == 0x0002C8, "Member 'UWBP_GoldCapWarning_C::IconOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_GoldCapWarning_C, TooltipMenuAnchor) == 0x0002D0, "Member 'UWBP_GoldCapWarning_C::TooltipMenuAnchor' has a wrong offset!");

}

