#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerSupportPopup_Pf

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S6UICore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerSupportPopup_Pf.WBP_PlayerSupportPopup_Pf_C
// 0x0038 (0x0590 - 0x0558)
class UWBP_PlayerSupportPopup_Pf_C final : public US6UI_ModalWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_RichTextBlock_Styled*            ExpireText;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_RichTextBlock_Styled*            InstructionText;                                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AnimatedLoading_Chapaa_C*          LoadingIcon;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QrCode_C*                          QrCode;                                            // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        QrCodeSwitcher;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_PopupSecondary_02_PF_C*   WBP_Template_PopupSecondary_02_PF;                 // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PlayerSupportPopup_Pf_WBP_Template_PopupSecondary_02_PF_K2Node_ComponentBoundEvent_3_Cancel__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_PlayerSupportPopup_Pf(int32 EntryPoint, int32 CallFunc_AkEventGlobal_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, const class FString& K2Node_CustomEvent_Link, class FText CallFunc_Conv_StringToText_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, class FText CallFunc_Format_ReturnValue, TDelegate<void(const class FString& Link)> K2Node_CreateDelegate_OutputDelegate_2, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, const class FString& CallFunc_MakeLiteralString_ReturnValue, class FText CallFunc_Format_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_2, class FText CallFunc_Format_ReturnValue_2, int32 CallFunc_AkEventGlobal_ReturnValue_1);
	void On_Link_Received(const class FString& Link);
	void Show_Qr_Code();
	void Show_Qr_Error();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerSupportPopup_Pf_C">();
	}
	static class UWBP_PlayerSupportPopup_Pf_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerSupportPopup_Pf_C>();
	}
};
static_assert(alignof(UWBP_PlayerSupportPopup_Pf_C) == 0x000008, "Wrong alignment on UWBP_PlayerSupportPopup_Pf_C");
static_assert(sizeof(UWBP_PlayerSupportPopup_Pf_C) == 0x000590, "Wrong size on UWBP_PlayerSupportPopup_Pf_C");
static_assert(offsetof(UWBP_PlayerSupportPopup_Pf_C, UberGraphFrame) == 0x000558, "Member 'UWBP_PlayerSupportPopup_Pf_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerSupportPopup_Pf_C, ExpireText) == 0x000560, "Member 'UWBP_PlayerSupportPopup_Pf_C::ExpireText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerSupportPopup_Pf_C, InstructionText) == 0x000568, "Member 'UWBP_PlayerSupportPopup_Pf_C::InstructionText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerSupportPopup_Pf_C, LoadingIcon) == 0x000570, "Member 'UWBP_PlayerSupportPopup_Pf_C::LoadingIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerSupportPopup_Pf_C, QrCode) == 0x000578, "Member 'UWBP_PlayerSupportPopup_Pf_C::QrCode' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerSupportPopup_Pf_C, QrCodeSwitcher) == 0x000580, "Member 'UWBP_PlayerSupportPopup_Pf_C::QrCodeSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerSupportPopup_Pf_C, WBP_Template_PopupSecondary_02_PF) == 0x000588, "Member 'UWBP_PlayerSupportPopup_Pf_C::WBP_Template_PopupSecondary_02_PF' has a wrong offset!");

}

