#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_PopupMain_01_CM

#include "Basic.hpp"

#include "BP_TopBackerSettings_CloseButton_structs.hpp"


namespace SDK::Params
{

// Function WBP_Template_PopupMain_01_CM.WBP_Template_PopupMain_01_CM_C.CheckResetSettings
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Template_PopupMain_01_CM_C_CheckResetSettings final
{
public:
	struct FBP_TopBackerSettings_CloseButton      TempSettings;                                      // 0x0000(0x00A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_PopupMain_01_CM_C_CheckResetSettings) == 0x000008, "Wrong alignment on WBP_Template_PopupMain_01_CM_C_CheckResetSettings");
static_assert(sizeof(WBP_Template_PopupMain_01_CM_C_CheckResetSettings) == 0x0000A8, "Wrong size on WBP_Template_PopupMain_01_CM_C_CheckResetSettings");
static_assert(offsetof(WBP_Template_PopupMain_01_CM_C_CheckResetSettings, TempSettings) == 0x000000, "Member 'WBP_Template_PopupMain_01_CM_C_CheckResetSettings::TempSettings' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_01_CM_C_CheckResetSettings, CallFunc_IsConsolePlatform_ReturnValue) == 0x0000A0, "Member 'WBP_Template_PopupMain_01_CM_C_CheckResetSettings::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");

// Function WBP_Template_PopupMain_01_CM.WBP_Template_PopupMain_01_CM_C.ExecuteUbergraph_WBP_Template_PopupMain_01_CM
// 0x0018 (0x0018 - 0x0000)
struct WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_516E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Is_Visible;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM) == 0x000008, "Wrong alignment on WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM");
static_assert(sizeof(WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM) == 0x000018, "Wrong size on WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM");
static_assert(offsetof(WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM, EntryPoint) == 0x000000, "Member 'WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM, K2Node_Event_IsDesignTime) == 0x000011, "Member 'WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM, K2Node_CustomEvent_Is_Visible) == 0x000012, "Member 'WBP_Template_PopupMain_01_CM_C_ExecuteUbergraph_WBP_Template_PopupMain_01_CM::K2Node_CustomEvent_Is_Visible' has a wrong offset!");

// Function WBP_Template_PopupMain_01_CM.WBP_Template_PopupMain_01_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Template_PopupMain_01_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_PopupMain_01_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Template_PopupMain_01_CM_C_PreConstruct");
static_assert(sizeof(WBP_Template_PopupMain_01_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_Template_PopupMain_01_CM_C_PreConstruct");
static_assert(offsetof(WBP_Template_PopupMain_01_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Template_PopupMain_01_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Template_PopupMain_01_CM.WBP_Template_PopupMain_01_CM_C.Set Close Button Visibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_Template_PopupMain_01_CM_C_Set_Close_Button_Visibility final
{
public:
	bool                                          Is_Visible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_PopupMain_01_CM_C_Set_Close_Button_Visibility) == 0x000001, "Wrong alignment on WBP_Template_PopupMain_01_CM_C_Set_Close_Button_Visibility");
static_assert(sizeof(WBP_Template_PopupMain_01_CM_C_Set_Close_Button_Visibility) == 0x000001, "Wrong size on WBP_Template_PopupMain_01_CM_C_Set_Close_Button_Visibility");
static_assert(offsetof(WBP_Template_PopupMain_01_CM_C_Set_Close_Button_Visibility, Is_Visible) == 0x000000, "Member 'WBP_Template_PopupMain_01_CM_C_Set_Close_Button_Visibility::Is_Visible' has a wrong offset!");

// Function WBP_Template_PopupMain_01_CM.WBP_Template_PopupMain_01_CM_C.SetHeaderText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Template_PopupMain_01_CM_C_SetHeaderText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Template_PopupMain_01_CM_C_SetHeaderText) == 0x000008, "Wrong alignment on WBP_Template_PopupMain_01_CM_C_SetHeaderText");
static_assert(sizeof(WBP_Template_PopupMain_01_CM_C_SetHeaderText) == 0x000018, "Wrong size on WBP_Template_PopupMain_01_CM_C_SetHeaderText");
static_assert(offsetof(WBP_Template_PopupMain_01_CM_C_SetHeaderText, InText) == 0x000000, "Member 'WBP_Template_PopupMain_01_CM_C_SetHeaderText::InText' has a wrong offset!");

}

