#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Notification_NewInboundGuildInvitation_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_Notification_NewInboundGuildInvitation_CM.WBP_Notification_NewInboundGuildInvitation_CM_C.BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_2_OnFinishedOutroTransitionAnimation__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_2_OnFinishedOutroTransitionAnimation__DelegateSignature final
{
public:
	class UWBP_Template_Notification_Major_C*     MajorNotificationTemplate;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_2_OnFinishedOutroTransitionAnimation__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_2_OnFinishedOutroTransitionAnimation__DelegateSignature");
static_assert(sizeof(WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_2_OnFinishedOutroTransitionAnimation__DelegateSignature) == 0x000008, "Wrong size on WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_2_OnFinishedOutroTransitionAnimation__DelegateSignature");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_2_OnFinishedOutroTransitionAnimation__DelegateSignature, MajorNotificationTemplate) == 0x000000, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_2_OnFinishedOutroTransitionAnimation__DelegateSignature::MajorNotificationTemplate' has a wrong offset!");

// Function WBP_Notification_NewInboundGuildInvitation_CM.WBP_Notification_NewInboundGuildInvitation_CM_C.BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_3_OnFinishedIntroTransitionAnimation__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_3_OnFinishedIntroTransitionAnimation__DelegateSignature final
{
public:
	class UWBP_Template_Notification_Major_C*     MajorNotificationTemplate;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_3_OnFinishedIntroTransitionAnimation__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_3_OnFinishedIntroTransitionAnimation__DelegateSignature");
static_assert(sizeof(WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_3_OnFinishedIntroTransitionAnimation__DelegateSignature) == 0x000008, "Wrong size on WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_3_OnFinishedIntroTransitionAnimation__DelegateSignature");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_3_OnFinishedIntroTransitionAnimation__DelegateSignature, MajorNotificationTemplate) == 0x000000, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_BndEvt__WBP_Notification_NewInboundNeighborhoodInvitation_WBP_Template_Major_K2Node_ComponentBoundEvent_3_OnFinishedIntroTransitionAnimation__DelegateSignature::MajorNotificationTemplate' has a wrong offset!");

// Function WBP_Notification_NewInboundGuildInvitation_CM.WBP_Notification_NewInboundGuildInvitation_CM_C.ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM
// 0x0298 (0x0298 - 0x0000)
struct WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x0024(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A1[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names;                          // 0x0038(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable;                              // 0x0058(0x0010)(ReferenceParm)
	struct FGuid                                  Temp_struct_Variable_1;                            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	class UVALUI_NotificationQueue*               K2Node_Event_NotificationQueue_1;                  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_Event_NotificationId_1;                     // 0x00A0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostGlobalEvent_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostGlobalEvent_ReturnValue_1;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostGlobalEvent_ReturnValue_2;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A2[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_NotificationQueue*               K2Node_Event_NotificationQueue;                    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_Event_NotificationId;                       // 0x00E8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Template_Notification_Major_C*     K2Node_ComponentBoundEvent_MajorNotificationTemplate_1; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Template_Notification_Major_C*     K2Node_ComponentBoundEvent_MajorNotificationTemplate; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryDismissNotification_ReturnValue;       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A3[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostGlobalEvent_ReturnValue_3;            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A4[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_PlayerGuild                       CallFunc_TryGetPlayerGuild_OutPlayerGuildInfo;     // 0x0150(0x0118)()
	bool                                          CallFunc_TryGetPlayerGuild_ReturnValue;            // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A5[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x026C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x027C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A6[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0290(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM) == 0x000008, "Wrong alignment on WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM");
static_assert(sizeof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM) == 0x000298, "Wrong size on WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, EntryPoint) == 0x000000, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_CustomEvent_AccountId_1) == 0x000004, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_CustomEvent_AccountId) == 0x000024, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_CustomEvent_Names) == 0x000038, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_CustomEvent_Names' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, Temp_struct_Variable) == 0x000058, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, Temp_struct_Variable_1) == 0x000068, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000078, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_Event_NotificationQueue_1) == 0x000098, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_Event_NotificationQueue_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_Event_NotificationId_1) == 0x0000A0, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_Event_NotificationId_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C0, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_PostGlobalEvent_ReturnValue) == 0x0000D0, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_PostGlobalEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_PostGlobalEvent_ReturnValue_1) == 0x0000D4, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_PostGlobalEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_PostGlobalEvent_ReturnValue_2) == 0x0000D8, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_PostGlobalEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_Event_NotificationQueue) == 0x0000E0, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_Event_NotificationQueue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_Event_NotificationId) == 0x0000E8, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_Event_NotificationId' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_ComponentBoundEvent_MajorNotificationTemplate_1) == 0x0000F8, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_ComponentBoundEvent_MajorNotificationTemplate_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_ComponentBoundEvent_MajorNotificationTemplate) == 0x000100, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_ComponentBoundEvent_MajorNotificationTemplate' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x000108, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_GetAccountId_ReturnValue) == 0x000118, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_GetCharacterNamesByAccountId_ReturnValue) == 0x000128, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_GetCharacterNamesByAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_TryDismissNotification_ReturnValue) == 0x000130, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_TryDismissNotification_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000138, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_PostGlobalEvent_ReturnValue_3) == 0x000140, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_PostGlobalEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000148, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_TryGetPlayerGuild_OutPlayerGuildInfo) == 0x000150, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_TryGetPlayerGuild_OutPlayerGuildInfo' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_TryGetPlayerGuild_ReturnValue) == 0x000268, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_TryGetPlayerGuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_CreateDelegate_OutputDelegate_5) == 0x00026C, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, K2Node_CreateDelegate_OutputDelegate_6) == 0x00027C, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000290, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_ExecuteUbergraph_WBP_Notification_NewInboundGuildInvitation_CM::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WBP_Notification_NewInboundGuildInvitation_CM.WBP_Notification_NewInboundGuildInvitation_CM_C.HandleNotificationDismissed
// 0x0018 (0x0018 - 0x0000)
struct WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationDismissed final
{
public:
	class UVALUI_NotificationQueue*               Param_NotificationQueue;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Param_NotificationId;                              // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationDismissed) == 0x000008, "Wrong alignment on WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationDismissed");
static_assert(sizeof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationDismissed) == 0x000018, "Wrong size on WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationDismissed");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationDismissed, Param_NotificationQueue) == 0x000000, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationDismissed::Param_NotificationQueue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationDismissed, Param_NotificationId) == 0x000008, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationDismissed::Param_NotificationId' has a wrong offset!");

// Function WBP_Notification_NewInboundGuildInvitation_CM.WBP_Notification_NewInboundGuildInvitation_CM_C.HandleNotificationShown
// 0x0018 (0x0018 - 0x0000)
struct WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationShown final
{
public:
	class UVALUI_NotificationQueue*               Param_NotificationQueue;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Param_NotificationId;                              // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationShown) == 0x000008, "Wrong alignment on WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationShown");
static_assert(sizeof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationShown) == 0x000018, "Wrong size on WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationShown");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationShown, Param_NotificationQueue) == 0x000000, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationShown::Param_NotificationQueue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationShown, Param_NotificationId) == 0x000008, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_HandleNotificationShown::Param_NotificationId' has a wrong offset!");

// Function WBP_Notification_NewInboundGuildInvitation_CM.WBP_Notification_NewInboundGuildInvitation_CM_C.HandlePlayerGuildManagerAcceptInvitationFailed
// 0x0010 (0x0010 - 0x0000)
struct WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerAcceptInvitationFailed final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerAcceptInvitationFailed) == 0x000008, "Wrong alignment on WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerAcceptInvitationFailed");
static_assert(sizeof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerAcceptInvitationFailed) == 0x000010, "Wrong size on WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerAcceptInvitationFailed");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerAcceptInvitationFailed, ErrorMessage) == 0x000000, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerAcceptInvitationFailed::ErrorMessage' has a wrong offset!");

// Function WBP_Notification_NewInboundGuildInvitation_CM.WBP_Notification_NewInboundGuildInvitation_CM_C.HandlePlayerGuildManagerDeclineInvitationFailed
// 0x0010 (0x0010 - 0x0000)
struct WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerDeclineInvitationFailed final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerDeclineInvitationFailed) == 0x000008, "Wrong alignment on WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerDeclineInvitationFailed");
static_assert(sizeof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerDeclineInvitationFailed) == 0x000010, "Wrong size on WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerDeclineInvitationFailed");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerDeclineInvitationFailed, ErrorMessage) == 0x000000, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_HandlePlayerGuildManagerDeclineInvitationFailed::ErrorMessage' has a wrong offset!");

// Function WBP_Notification_NewInboundGuildInvitation_CM.WBP_Notification_NewInboundGuildInvitation_CM_C.MatchesNotification
// 0x0048 (0x0048 - 0x0000)
struct WBP_Notification_NewInboundGuildInvitation_CM_C_MatchesNotification final
{
public:
	class FText                                   NotificationText;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TSoftObjectPtr<class UTexture2D>              NotificationIcon;                                  // 0x0018(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_NewInboundGuildInvitation_CM_C_MatchesNotification) == 0x000008, "Wrong alignment on WBP_Notification_NewInboundGuildInvitation_CM_C_MatchesNotification");
static_assert(sizeof(WBP_Notification_NewInboundGuildInvitation_CM_C_MatchesNotification) == 0x000048, "Wrong size on WBP_Notification_NewInboundGuildInvitation_CM_C_MatchesNotification");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_MatchesNotification, NotificationText) == 0x000000, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_MatchesNotification::NotificationText' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_MatchesNotification, NotificationIcon) == 0x000018, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_MatchesNotification::NotificationIcon' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_MatchesNotification, ReturnValue) == 0x000040, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_MatchesNotification::ReturnValue' has a wrong offset!");

// Function WBP_Notification_NewInboundGuildInvitation_CM.WBP_Notification_NewInboundGuildInvitation_CM_C.OnFailure_607BDA9A452CF30FCB2059A1D6CE5E03
// 0x0010 (0x0010 - 0x0000)
struct WBP_Notification_NewInboundGuildInvitation_CM_C_OnFailure_607BDA9A452CF30FCB2059A1D6CE5E03 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_NewInboundGuildInvitation_CM_C_OnFailure_607BDA9A452CF30FCB2059A1D6CE5E03) == 0x000004, "Wrong alignment on WBP_Notification_NewInboundGuildInvitation_CM_C_OnFailure_607BDA9A452CF30FCB2059A1D6CE5E03");
static_assert(sizeof(WBP_Notification_NewInboundGuildInvitation_CM_C_OnFailure_607BDA9A452CF30FCB2059A1D6CE5E03) == 0x000010, "Wrong size on WBP_Notification_NewInboundGuildInvitation_CM_C_OnFailure_607BDA9A452CF30FCB2059A1D6CE5E03");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_OnFailure_607BDA9A452CF30FCB2059A1D6CE5E03, AccountId) == 0x000000, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_OnFailure_607BDA9A452CF30FCB2059A1D6CE5E03::AccountId' has a wrong offset!");

// Function WBP_Notification_NewInboundGuildInvitation_CM.WBP_Notification_NewInboundGuildInvitation_CM_C.OnSuccess_607BDA9A452CF30FCB2059A1D6CE5E03
// 0x0020 (0x0020 - 0x0000)
struct WBP_Notification_NewInboundGuildInvitation_CM_C_OnSuccess_607BDA9A452CF30FCB2059A1D6CE5E03 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Names;                                             // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Notification_NewInboundGuildInvitation_CM_C_OnSuccess_607BDA9A452CF30FCB2059A1D6CE5E03) == 0x000008, "Wrong alignment on WBP_Notification_NewInboundGuildInvitation_CM_C_OnSuccess_607BDA9A452CF30FCB2059A1D6CE5E03");
static_assert(sizeof(WBP_Notification_NewInboundGuildInvitation_CM_C_OnSuccess_607BDA9A452CF30FCB2059A1D6CE5E03) == 0x000020, "Wrong size on WBP_Notification_NewInboundGuildInvitation_CM_C_OnSuccess_607BDA9A452CF30FCB2059A1D6CE5E03");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_OnSuccess_607BDA9A452CF30FCB2059A1D6CE5E03, AccountId) == 0x000000, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_OnSuccess_607BDA9A452CF30FCB2059A1D6CE5E03::AccountId' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_OnSuccess_607BDA9A452CF30FCB2059A1D6CE5E03, Names) == 0x000010, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_OnSuccess_607BDA9A452CF30FCB2059A1D6CE5E03::Names' has a wrong offset!");

// Function WBP_Notification_NewInboundGuildInvitation_CM.WBP_Notification_NewInboundGuildInvitation_CM_C.UpdateTexts
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Notification_NewInboundGuildInvitation_CM_C_UpdateTexts final
{
public:
	class FText                                   PlayerGuildName;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InstigatorCharacterName;                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
};
static_assert(alignof(WBP_Notification_NewInboundGuildInvitation_CM_C_UpdateTexts) == 0x000008, "Wrong alignment on WBP_Notification_NewInboundGuildInvitation_CM_C_UpdateTexts");
static_assert(sizeof(WBP_Notification_NewInboundGuildInvitation_CM_C_UpdateTexts) == 0x0000F8, "Wrong size on WBP_Notification_NewInboundGuildInvitation_CM_C_UpdateTexts");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_UpdateTexts, PlayerGuildName) == 0x000000, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_UpdateTexts::PlayerGuildName' has a wrong offset!");
static_assert(offsetof(WBP_Notification_NewInboundGuildInvitation_CM_C_UpdateTexts, InstigatorCharacterName) == 0x000018, "Member 'WBP_Notification_NewInboundGuildInvitation_CM_C_UpdateTexts::InstigatorCharacterName' has a wrong offset!");
