#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Block_ModalDialogue_PF

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "Engine_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_Block_ModalDialogue_PF.WBP_Block_ModalDialogue_PF_C.BlockErrorSent__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_Block_ModalDialogue_PF_C_BlockErrorSent__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	EVAL_SocialBlockError                         BlockError;                                        // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Block_ModalDialogue_PF_C_BlockErrorSent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Block_ModalDialogue_PF_C_BlockErrorSent__DelegateSignature");
static_assert(sizeof(WBP_Block_ModalDialogue_PF_C_BlockErrorSent__DelegateSignature) == 0x000038, "Wrong size on WBP_Block_ModalDialogue_PF_C_BlockErrorSent__DelegateSignature");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_BlockErrorSent__DelegateSignature, UserId) == 0x000000, "Member 'WBP_Block_ModalDialogue_PF_C_BlockErrorSent__DelegateSignature::UserId' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_BlockErrorSent__DelegateSignature, BlockError) == 0x000030, "Member 'WBP_Block_ModalDialogue_PF_C_BlockErrorSent__DelegateSignature::BlockError' has a wrong offset!");

// Function WBP_Block_ModalDialogue_PF.WBP_Block_ModalDialogue_PF_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Block_ModalDialogue_PF_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Block_ModalDialogue_PF_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_Block_ModalDialogue_PF_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_Block_ModalDialogue_PF_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_Block_ModalDialogue_PF_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_Block_ModalDialogue_PF_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_Block_ModalDialogue_PF.WBP_Block_ModalDialogue_PF_C.ExecuteUbergraph_WBP_Block_ModalDialogue_PF
// 0x0328 (0x0328 - 0x0000)
struct WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_536E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable;                              // 0x0008(0x0010)(ReferenceParm)
	struct FGuid                                  Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x0028(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names;                          // 0x0038(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x00C0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x00E8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_536F[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5370[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0128(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0150(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5371[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5372[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_FocusedParentWidget;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewWidgetCreated;                     // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5373[0x6];                                     // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate;              // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5374[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x01D8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5375[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0200(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0218(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0268(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0280(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0290(0x0018)()
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5376[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Event_ParentWidget;                         // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Event_ParentFocusedWidget;                  // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportPlayerModalDialog_PF_C*      CallFunc_Create_ReturnValue;                       // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVAL_SocialBlockError                         CallFunc_RequestBlockUser_ReturnValue;             // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5377[0x6];                                     // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SubWidgetFocusable_C> K2Node_DynamicCast_AsBPI_Sub_Widget_Focusable;     // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5378[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SubWidgetFocusable_C> K2Node_DynamicCast_AsBPI_Sub_Widget_Focusable_1;   // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5379[0x2];                                     // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0314(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF) == 0x000008, "Wrong alignment on WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF");
static_assert(sizeof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF) == 0x000328, "Wrong size on WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, EntryPoint) == 0x000000, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_struct_Variable) == 0x000008, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_CustomEvent_AccountId) == 0x000028, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_CustomEvent_Names) == 0x000038, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_CustomEvent_Names' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_MakeArray_Array) == 0x0000B0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x0000C0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x0000E0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x0000E4, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x0000E8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_object_Variable) == 0x0000F0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x0000F8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_real_Variable) == 0x000100, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_real_Variable_1) == 0x000108, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_real_Variable_0) == 0x000110, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_real_Variable_1_0) == 0x000118, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_bool_Variable) == 0x000120, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000128, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000148, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00014C, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000150, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000158, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_object_Variable_1) == 0x000160, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_real_Variable_2) == 0x000168, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_real_Variable_2_0) == 0x000170, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_real_Variable_3) == 0x000178, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_bool_Variable_1) == 0x000180, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, Temp_real_Variable_3_0) == 0x000188, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_GetOwningPlayer_ReturnValue) == 0x000190, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_Event_FocusedParentWidget) == 0x000198, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_Event_FocusedParentWidget' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_Event_NewWidgetCreated) == 0x000199, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_Event_NewWidgetCreated' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_GetUIManagerWidget_ReturnValue) == 0x0001A0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_CreateDelegate_OutputDelegate) == 0x0001A8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_AkEventGlobal_ReturnValue) == 0x0001B8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_Event_IsDesignTime) == 0x0001BC, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_GetAccountId_ReturnValue) == 0x0001C0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_GetCharacterNamesByAccountId_ReturnValue) == 0x0001D0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_GetCharacterNamesByAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_CustomEvent_AccountId_1) == 0x0001D8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_IsValid_ReturnValue) == 0x0001E8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_MakeLiteralString_ReturnValue) == 0x0001F0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000200, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_MakeStruct_FormatArgumentData_1) == 0x000218, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_Format_ReturnValue) == 0x000268, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_MakeArray_Array_1) == 0x000280, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_Format_ReturnValue_1) == 0x000290, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_AkEventGlobal_ReturnValue_1) == 0x0002A8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_Event_ParentWidget) == 0x0002B0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_Event_ParentWidget' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_Event_ParentFocusedWidget) == 0x0002B8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_Event_ParentFocusedWidget' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0002C0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_Create_ReturnValue) == 0x0002C8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_GetUIManagerWidget_ReturnValue_1) == 0x0002D0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_GetUIManagerWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0002D8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_RequestBlockUser_ReturnValue) == 0x0002E0, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_RequestBlockUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0002E1, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_DynamicCast_AsBPI_Sub_Widget_Focusable) == 0x0002E8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_DynamicCast_AsBPI_Sub_Widget_Focusable' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_DynamicCast_bSuccess) == 0x0002F8, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_DynamicCast_AsBPI_Sub_Widget_Focusable_1) == 0x000300, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_DynamicCast_AsBPI_Sub_Widget_Focusable_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_DynamicCast_bSuccess_1) == 0x000310, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, CallFunc_IsValid_ReturnValue_1) == 0x000311, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF, K2Node_CreateDelegate_OutputDelegate_1) == 0x000314, "Member 'WBP_Block_ModalDialogue_PF_C_ExecuteUbergraph_WBP_Block_ModalDialogue_PF::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_Block_ModalDialogue_PF.WBP_Block_ModalDialogue_PF_C.InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_BlockPlayer_OnlyBlock_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_Block_ModalDialogue_PF.WBP_Block_ModalDialogue_PF_C.InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_Block_ModalDialogue_PF_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_Block_ModalDialogue_PF.WBP_Block_ModalDialogue_PF_C.OnFailure_4326F87E411B7F4C536D669B13F6CA0A
// 0x0010 (0x0010 - 0x0000)
struct WBP_Block_ModalDialogue_PF_C_OnFailure_4326F87E411B7F4C536D669B13F6CA0A final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Block_ModalDialogue_PF_C_OnFailure_4326F87E411B7F4C536D669B13F6CA0A) == 0x000004, "Wrong alignment on WBP_Block_ModalDialogue_PF_C_OnFailure_4326F87E411B7F4C536D669B13F6CA0A");
static_assert(sizeof(WBP_Block_ModalDialogue_PF_C_OnFailure_4326F87E411B7F4C536D669B13F6CA0A) == 0x000010, "Wrong size on WBP_Block_ModalDialogue_PF_C_OnFailure_4326F87E411B7F4C536D669B13F6CA0A");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_OnFailure_4326F87E411B7F4C536D669B13F6CA0A, AccountId) == 0x000000, "Member 'WBP_Block_ModalDialogue_PF_C_OnFailure_4326F87E411B7F4C536D669B13F6CA0A::AccountId' has a wrong offset!");

// Function WBP_Block_ModalDialogue_PF.WBP_Block_ModalDialogue_PF_C.OnSubWidgetClosed
// 0x0002 (0x0002 - 0x0000)
struct WBP_Block_ModalDialogue_PF_C_OnSubWidgetClosed final
{
public:
	bool                                          FocusedParentWidget;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewWidgetCreated;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Block_ModalDialogue_PF_C_OnSubWidgetClosed) == 0x000001, "Wrong alignment on WBP_Block_ModalDialogue_PF_C_OnSubWidgetClosed");
static_assert(sizeof(WBP_Block_ModalDialogue_PF_C_OnSubWidgetClosed) == 0x000002, "Wrong size on WBP_Block_ModalDialogue_PF_C_OnSubWidgetClosed");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_OnSubWidgetClosed, FocusedParentWidget) == 0x000000, "Member 'WBP_Block_ModalDialogue_PF_C_OnSubWidgetClosed::FocusedParentWidget' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_OnSubWidgetClosed, NewWidgetCreated) == 0x000001, "Member 'WBP_Block_ModalDialogue_PF_C_OnSubWidgetClosed::NewWidgetCreated' has a wrong offset!");

// Function WBP_Block_ModalDialogue_PF.WBP_Block_ModalDialogue_PF_C.OnSuccess_4326F87E411B7F4C536D669B13F6CA0A
// 0x0020 (0x0020 - 0x0000)
struct WBP_Block_ModalDialogue_PF_C_OnSuccess_4326F87E411B7F4C536D669B13F6CA0A final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Names;                                             // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Block_ModalDialogue_PF_C_OnSuccess_4326F87E411B7F4C536D669B13F6CA0A) == 0x000008, "Wrong alignment on WBP_Block_ModalDialogue_PF_C_OnSuccess_4326F87E411B7F4C536D669B13F6CA0A");
static_assert(sizeof(WBP_Block_ModalDialogue_PF_C_OnSuccess_4326F87E411B7F4C536D669B13F6CA0A) == 0x000020, "Wrong size on WBP_Block_ModalDialogue_PF_C_OnSuccess_4326F87E411B7F4C536D669B13F6CA0A");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_OnSuccess_4326F87E411B7F4C536D669B13F6CA0A, AccountId) == 0x000000, "Member 'WBP_Block_ModalDialogue_PF_C_OnSuccess_4326F87E411B7F4C536D669B13F6CA0A::AccountId' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_OnSuccess_4326F87E411B7F4C536D669B13F6CA0A, Names) == 0x000010, "Member 'WBP_Block_ModalDialogue_PF_C_OnSuccess_4326F87E411B7F4C536D669B13F6CA0A::Names' has a wrong offset!");

// Function WBP_Block_ModalDialogue_PF.WBP_Block_ModalDialogue_PF_C.OnWidgetCreated
// 0x0010 (0x0010 - 0x0000)
struct WBP_Block_ModalDialogue_PF_C_OnWidgetCreated final
{
public:
	class UWidget*                                ParentWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ParentFocusedWidget;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Block_ModalDialogue_PF_C_OnWidgetCreated) == 0x000008, "Wrong alignment on WBP_Block_ModalDialogue_PF_C_OnWidgetCreated");
static_assert(sizeof(WBP_Block_ModalDialogue_PF_C_OnWidgetCreated) == 0x000010, "Wrong size on WBP_Block_ModalDialogue_PF_C_OnWidgetCreated");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_OnWidgetCreated, ParentWidget) == 0x000000, "Member 'WBP_Block_ModalDialogue_PF_C_OnWidgetCreated::ParentWidget' has a wrong offset!");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_OnWidgetCreated, ParentFocusedWidget) == 0x000008, "Member 'WBP_Block_ModalDialogue_PF_C_OnWidgetCreated::ParentFocusedWidget' has a wrong offset!");

// Function WBP_Block_ModalDialogue_PF.WBP_Block_ModalDialogue_PF_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Block_ModalDialogue_PF_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Block_ModalDialogue_PF_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Block_ModalDialogue_PF_C_PreConstruct");
static_assert(sizeof(WBP_Block_ModalDialogue_PF_C_PreConstruct) == 0x000001, "Wrong size on WBP_Block_ModalDialogue_PF_C_PreConstruct");
static_assert(offsetof(WBP_Block_ModalDialogue_PF_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Block_ModalDialogue_PF_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

