#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerCharacterRow_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerCharacterRow_CM.WBP_PlayerCharacterRow_CM_C
// 0x00E8 (0x0488 - 0x03A0)
class UWBP_PlayerCharacterRow_CM_C final : public UCommonUserWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_FontAwesomeGlyph_C*                Glyph_PresenceStatus;                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MutedContainer;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Buttons;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_TopLeft_Icon;                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_CharacterTitle;                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_RichPresenceStatus;                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_CharacterInfo;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlatformPlayerName_C*              WBP_PlatformPlayerName;                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerCharacterProfileImage_CM_C*  WBP_PlayerCharacterProfileImage_CM;                // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_OpenContextMenuButton_CM_C* WBP_Social_OpenContextMenuButton_CM;               // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x03F8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bUseOfflinePresenceVisualCue;                      // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5790[0x7];                                     // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CharacterName;                                     // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CharacterNameTooltip;                              // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCharacterProfileImageClicked;                    // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bContextMenuAllowed;                               // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EHorizontalAlignment                          CharacterInfo_HAlign;                              // 0x0461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EVerticalAlignment                            CharacterInfo_VAlign;                              // 0x0462(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5791[0x1];                                     // 0x0463(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                CharacterInfo_Padding;                             // 0x0464(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	ESlateVisibility                              CharacterInfo_Visibility;                          // 0x0474(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DebugRandomizePortrait;                            // 0x0475(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5792[0x2];                                     // 0x0476(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnMarkFocusUI;                                     // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_PlayerCharacterRow_CM_WBP_Social_OpenContextMenuButton_CM_K2Node_ComponentBoundEvent_2_OnMarkFocusUI__DelegateSignature(class UWidget* Widget, TArray<struct FF_CommonUIButtonPrompt>& UIPrompt);
	void Destruct();
	void DisplayMuted(bool Muted);
	class UWidget* DoCustomNavigation(EUINavigation Param_Navigation, bool K2Node_SwitchEnum_CmpSuccess);
	void ExecuteUbergraph_WBP_PlayerCharacterRow_CM(int32 EntryPoint, struct FGuid& K2Node_CustomEvent_AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& K2Node_CustomEvent_Names, TArray<struct FOSSVAL_CharacterNameAndId>& Temp_struct_Variable, const struct FGuid& Temp_struct_Variable_1, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_3, TDelegate<void(class FName CharacterName, bool bMuted)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void(class FName CharacterName, bool bMuted)> K2Node_CreateDelegate_OutputDelegate_2, bool K2Node_Event_IsDesignTime, class UHorizontalBoxSlot* K2Node_DynamicCast_AsHorizontal_Box_Slot, bool K2Node_DynamicCast_bSuccess, struct FGuid& K2Node_CustomEvent_AccountId_1, TDelegate<void(struct FGuid& AccountId)> K2Node_CreateDelegate_OutputDelegate_3, ESlateVisibility Temp_byte_Variable, const struct FGuid& CallFunc_GetAccountId_ReturnValue, class UChatManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_4, class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue, bool CallFunc_IsValid_ReturnValue, TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_4, ESlateVisibility Temp_byte_Variable_1, class UWidget* K2Node_ComponentBoundEvent_Widget, TArray<struct FF_CommonUIButtonPrompt>& K2Node_ComponentBoundEvent_uiprompt, TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_5, bool Temp_bool_Variable, TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_6, ESlateVisibility K2Node_Select_Default, TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_7, class UChatManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_5);
	void HandleFriendsManagerRelationshipsChanged(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds);
	void HandleOnCharacterMuted(class FName Param_CharacterName, bool bMuted, class FName CallFunc_Conv_StringToName_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue);
	void HandleOnContextMenuClosed();
	void HandlePresenceChange(const struct FPresence& OldPresence, const struct FPresence& NewPresence, bool CallFunc_EqualEqual_ReturnValue);
	void OnCharacterProfileImageClicked__DelegateSignature(class UWBP_PlayerCharacterProfileImage_CM_C* CharacterProfileImageWidget);
	void OnFailure_0E85F836453B6664C70D7CA0FCCF570A(struct FGuid& AccountId);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnInitialized();
	void OnMarkFocusUI__DelegateSignature(class UWidget* Widget, TArray<struct FF_CommonUIButtonPrompt>& UIPrompt);
	void OnSuccess_0E85F836453B6664C70D7CA0FCCF570A(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names);
	void PreConstruct(bool IsDesignTime);
	void SetUser(const struct FUniqueNetIdRepl& Param_UserId, bool Param_DebugRandomizePortrait);
	void UpdateFriendshipStatus();
	void UpdateFromUserId();
	void UpdateMuted(class UChatManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue, bool CallFunc_IsUserMuted_ReturnValue);
	void UpdatePresence(const struct FPresence& CachedPresence, const struct FLinearColor& Temp_struct_Variable, bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, const struct FLinearColor& Temp_struct_Variable_1, bool Temp_bool_Variable_4, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, const struct FLinearColor& K2Node_Select_Default, bool K2Node_Select_Default_1, ESlateVisibility K2Node_Select_Default_2, const struct FPresence& CallFunc_GetPresenceForUserId_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerCharacterRow_CM_C">();
	}
	static class UWBP_PlayerCharacterRow_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerCharacterRow_CM_C>();
	}
};
static_assert(alignof(UWBP_PlayerCharacterRow_CM_C) == 0x000008, "Wrong alignment on UWBP_PlayerCharacterRow_CM_C");
static_assert(sizeof(UWBP_PlayerCharacterRow_CM_C) == 0x000488, "Wrong size on UWBP_PlayerCharacterRow_CM_C");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, UberGraphFrame) == 0x0003A0, "Member 'UWBP_PlayerCharacterRow_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, Glyph_PresenceStatus) == 0x0003A8, "Member 'UWBP_PlayerCharacterRow_CM_C::Glyph_PresenceStatus' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, MutedContainer) == 0x0003B0, "Member 'UWBP_PlayerCharacterRow_CM_C::MutedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, NamedSlot_Buttons) == 0x0003B8, "Member 'UWBP_PlayerCharacterRow_CM_C::NamedSlot_Buttons' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, NamedSlot_TopLeft_Icon) == 0x0003C0, "Member 'UWBP_PlayerCharacterRow_CM_C::NamedSlot_TopLeft_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, TextBlock_CharacterTitle) == 0x0003C8, "Member 'UWBP_PlayerCharacterRow_CM_C::TextBlock_CharacterTitle' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, TextBlock_RichPresenceStatus) == 0x0003D0, "Member 'UWBP_PlayerCharacterRow_CM_C::TextBlock_RichPresenceStatus' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, VBox_CharacterInfo) == 0x0003D8, "Member 'UWBP_PlayerCharacterRow_CM_C::VBox_CharacterInfo' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, WBP_PlatformPlayerName) == 0x0003E0, "Member 'UWBP_PlayerCharacterRow_CM_C::WBP_PlatformPlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, WBP_PlayerCharacterProfileImage_CM) == 0x0003E8, "Member 'UWBP_PlayerCharacterRow_CM_C::WBP_PlayerCharacterProfileImage_CM' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, WBP_Social_OpenContextMenuButton_CM) == 0x0003F0, "Member 'UWBP_PlayerCharacterRow_CM_C::WBP_Social_OpenContextMenuButton_CM' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, UserId) == 0x0003F8, "Member 'UWBP_PlayerCharacterRow_CM_C::UserId' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, bUseOfflinePresenceVisualCue) == 0x000428, "Member 'UWBP_PlayerCharacterRow_CM_C::bUseOfflinePresenceVisualCue' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, CharacterName) == 0x000430, "Member 'UWBP_PlayerCharacterRow_CM_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, CharacterNameTooltip) == 0x000440, "Member 'UWBP_PlayerCharacterRow_CM_C::CharacterNameTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, OnCharacterProfileImageClicked) == 0x000450, "Member 'UWBP_PlayerCharacterRow_CM_C::OnCharacterProfileImageClicked' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, bContextMenuAllowed) == 0x000460, "Member 'UWBP_PlayerCharacterRow_CM_C::bContextMenuAllowed' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, CharacterInfo_HAlign) == 0x000461, "Member 'UWBP_PlayerCharacterRow_CM_C::CharacterInfo_HAlign' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, CharacterInfo_VAlign) == 0x000462, "Member 'UWBP_PlayerCharacterRow_CM_C::CharacterInfo_VAlign' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, CharacterInfo_Padding) == 0x000464, "Member 'UWBP_PlayerCharacterRow_CM_C::CharacterInfo_Padding' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, CharacterInfo_Visibility) == 0x000474, "Member 'UWBP_PlayerCharacterRow_CM_C::CharacterInfo_Visibility' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, DebugRandomizePortrait) == 0x000475, "Member 'UWBP_PlayerCharacterRow_CM_C::DebugRandomizePortrait' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterRow_CM_C, OnMarkFocusUI) == 0x000478, "Member 'UWBP_PlayerCharacterRow_CM_C::OnMarkFocusUI' has a wrong offset!");

}

