#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameplaySettings_PF

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Palia_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_Checkbox_AllowCameraShake_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_AllowCameraShake_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_AllowCameraShake_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_AllowCameraShake_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_AllowCameraShake_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_AllowCameraShake_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_AllowCameraShake_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_AllowCameraShake_CM_K2Node_ComponentBoundEvent_11_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableActionBarWrapping_CM_K2Node_ComponentBoundEvent_18_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableActionBarWrapping_CM_K2Node_ComponentBoundEvent_18_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableActionBarWrapping_CM_K2Node_ComponentBoundEvent_18_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableActionBarWrapping_CM_K2Node_ComponentBoundEvent_18_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableActionBarWrapping_CM_K2Node_ComponentBoundEvent_18_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableActionBarWrapping_CM_K2Node_ComponentBoundEvent_18_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableActionBarWrapping_CM_K2Node_ComponentBoundEvent_18_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableActionBarWrapping_CM_K2Node_ComponentBoundEvent_18_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableEatingWhenFull_CM_K2Node_ComponentBoundEvent_17_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableEatingWhenFull_CM_K2Node_ComponentBoundEvent_17_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableEatingWhenFull_CM_K2Node_ComponentBoundEvent_17_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableEatingWhenFull_CM_K2Node_ComponentBoundEvent_17_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableEatingWhenFull_CM_K2Node_ComponentBoundEvent_17_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableEatingWhenFull_CM_K2Node_ComponentBoundEvent_17_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableEatingWhenFull_CM_K2Node_ComponentBoundEvent_17_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableEatingWhenFull_CM_K2Node_ComponentBoundEvent_17_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableReticle_CM_K2Node_ComponentBoundEvent_13_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableReticle_CM_K2Node_ComponentBoundEvent_13_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableReticle_CM_K2Node_ComponentBoundEvent_13_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableReticle_CM_K2Node_ComponentBoundEvent_13_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableReticle_CM_K2Node_ComponentBoundEvent_13_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableReticle_CM_K2Node_ComponentBoundEvent_13_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableReticle_CM_K2Node_ComponentBoundEvent_13_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_EnableReticle_CM_K2Node_ComponentBoundEvent_13_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_Checkbox_HideChatTimestamp_CM_K2Node_ComponentBoundEvent_14_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_HideChatTimestamp_CM_K2Node_ComponentBoundEvent_14_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_HideChatTimestamp_CM_K2Node_ComponentBoundEvent_14_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_HideChatTimestamp_CM_K2Node_ComponentBoundEvent_14_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_HideChatTimestamp_CM_K2Node_ComponentBoundEvent_14_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_HideChatTimestamp_CM_K2Node_ComponentBoundEvent_14_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_HideChatTimestamp_CM_K2Node_ComponentBoundEvent_14_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_HideChatTimestamp_CM_K2Node_ComponentBoundEvent_14_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_Checkbox_ShowServerPing_CM_K2Node_ComponentBoundEvent_19_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_ShowServerPing_CM_K2Node_ComponentBoundEvent_19_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_ShowServerPing_CM_K2Node_ComponentBoundEvent_19_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_ShowServerPing_CM_K2Node_ComponentBoundEvent_19_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_ShowServerPing_CM_K2Node_ComponentBoundEvent_19_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_ShowServerPing_CM_K2Node_ComponentBoundEvent_19_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_ShowServerPing_CM_K2Node_ComponentBoundEvent_19_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_Checkbox_ShowServerPing_CM_K2Node_ComponentBoundEvent_19_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5605[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_12_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_ComboBox_Language_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_Language_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5606[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_Language_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_Language_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_Language_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_Language_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_Language_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_Language_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_Language_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_Language_CM_K2Node_ComponentBoundEvent_15_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5607[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_16_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5608[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_0_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On Tab Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Tab_Selection;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature, Tab_Selection) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_9_On_Tab_Selection_Changed__DelegateSignature::Tab_Selection' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableCinematicCookingCamera_CM_K2Node_ComponentBoundEvent_3_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableCinematicCookingCamera_CM_K2Node_ComponentBoundEvent_3_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableCinematicCookingCamera_CM_K2Node_ComponentBoundEvent_3_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableCinematicCookingCamera_CM_K2Node_ComponentBoundEvent_3_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableCinematicCookingCamera_CM_K2Node_ComponentBoundEvent_3_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableCinematicCookingCamera_CM_K2Node_ComponentBoundEvent_3_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableCinematicCookingCamera_CM_K2Node_ComponentBoundEvent_3_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableCinematicCookingCamera_CM_K2Node_ComponentBoundEvent_3_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableWorldMapGrid_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableWorldMapGrid_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableWorldMapGrid_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableWorldMapGrid_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableWorldMapGrid_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableWorldMapGrid_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableWorldMapGrid_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Checkbox_EnableWorldMapGrid_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_PF_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_21_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_21_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_21_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_21_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_21_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_21_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_21_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_BagRows_CM_K2Node_ComponentBoundEvent_21_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_PF_ComboBox_Language_CM_K2Node_ComponentBoundEvent_23_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_Language_CM_K2Node_ComponentBoundEvent_23_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_Language_CM_K2Node_ComponentBoundEvent_23_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_Language_CM_K2Node_ComponentBoundEvent_23_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_Language_CM_K2Node_ComponentBoundEvent_23_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_Language_CM_K2Node_ComponentBoundEvent_23_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_Language_CM_K2Node_ComponentBoundEvent_23_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_Language_CM_K2Node_ComponentBoundEvent_23_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_PF_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_24_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_24_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_24_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_24_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_24_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_24_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_24_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_SprintSetting_CM_K2Node_ComponentBoundEvent_24_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_PF_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_25_OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_25_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        OpenedDropBox;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_25_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_25_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_25_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_25_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_25_OnMenuOpened__DelegateSignature, OpenedDropBox) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_ComboBox_StreamerMode_CM_K2Node_ComponentBoundEvent_25_OnMenuOpened__DelegateSignature::OpenedDropBox' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_PF_Slider_FishingCastSpeed_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_FishingCastSpeed_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_FishingCastSpeed_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_FishingCastSpeed_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_FishingCastSpeed_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_FishingCastSpeed_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_FishingCastSpeed_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_FishingCastSpeed_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_PF_Slider_Gamma_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_Gamma_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_Gamma_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_Gamma_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_Gamma_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_Gamma_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_Gamma_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_Slider_Gamma_CM_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.BndEvt__WBP_GameplaySettings_PF_WBP_FTUESettings_PF_K2Node_ComponentBoundEvent_4_OnFocusedItemChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_WBP_FTUESettings_PF_K2Node_ComponentBoundEvent_4_OnFocusedItemChanged__DelegateSignature final
{
public:
	bool                                          IsFTUEFlag;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_WBP_FTUESettings_PF_K2Node_ComponentBoundEvent_4_OnFocusedItemChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_WBP_FTUESettings_PF_K2Node_ComponentBoundEvent_4_OnFocusedItemChanged__DelegateSignature");
static_assert(sizeof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_WBP_FTUESettings_PF_K2Node_ComponentBoundEvent_4_OnFocusedItemChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_WBP_FTUESettings_PF_K2Node_ComponentBoundEvent_4_OnFocusedItemChanged__DelegateSignature");
static_assert(offsetof(WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_WBP_FTUESettings_PF_K2Node_ComponentBoundEvent_4_OnFocusedItemChanged__DelegateSignature, IsFTUEFlag) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_BndEvt__WBP_GameplaySettings_PF_WBP_FTUESettings_PF_K2Node_ComponentBoundEvent_4_OnFocusedItemChanged__DelegateSignature::IsFTUEFlag' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.Display GamePad Icon
// 0x0001 (0x0001 - 0x0000)
struct WBP_GameplaySettings_PF_C_Display_GamePad_Icon final
{
public:
	bool                                          IsShowIcon;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameplaySettings_PF_C_Display_GamePad_Icon) == 0x000001, "Wrong alignment on WBP_GameplaySettings_PF_C_Display_GamePad_Icon");
static_assert(sizeof(WBP_GameplaySettings_PF_C_Display_GamePad_Icon) == 0x000001, "Wrong size on WBP_GameplaySettings_PF_C_Display_GamePad_Icon");
static_assert(offsetof(WBP_GameplaySettings_PF_C_Display_GamePad_Icon, IsShowIcon) == 0x000000, "Member 'WBP_GameplaySettings_PF_C_Display_GamePad_Icon::IsShowIcon' has a wrong offset!");

// Function WBP_GameplaySettings_PF.WBP_GameplaySettings_PF_C.ExecuteUbergraph_WBP_GameplaySettings_PF
// 0x0380 (0x0380 - 0x0000)
struct WBP_GameplaySettings_PF_C_ExecuteUbergraph_WBP_GameplaySettings_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5609[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0010(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_560A[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_560B[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_560C[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_2; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_560D[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x00B0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x00D8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_560E[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_3; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_4; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_5; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_6; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_7; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_560F[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0130(0x0010)(ReferenceParm, ContainsInstancedReference)
	double                                        Temp_real_Variable_5;                              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5610[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0150(0x0018)()
	class FText                                   K2Node_CustomEvent_Description;                    // 0x0168(0x0018)()
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_8; // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5611[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   K2Node_DynamicCast_AsWBP_Settings_Item_Parent_Do_Not_Edit; // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5612[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_2;                            // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x01B0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x01D8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5613[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_9; // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Tab_Selection;          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked_7;              // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5614[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index_3;                // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5615[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_3;                 // 0x0210(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked_6;              // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked_5;              // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5616[0x2];                                     // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index_2;                // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5617[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_2;                 // 0x0238(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5618[0x4];                                     // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0258(0x0018)()
	bool                                          CallFunc_SetCurrentCulture_ReturnValue;            // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked_4;              // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked_3;              // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked_2;              // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0278(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5619[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   CallFunc_Get_Focus_Widget_SettingsItem;            // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Parent_DoNotEdit_C*   CallFunc_Get_Focus_Widget_SettingsItem_1;          // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESprintType                                   Temp_byte_Variable;                                // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561A[0x1];                                     // 0x02B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x02B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561B[0x2];                                     // 0x02C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText Name, class FText Description)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESprintType                                   Temp_byte_Variable_1;                              // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561C[0x3];                                     // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561D[0x3];                                     // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESprintType                                   Temp_byte_Variable_2;                              // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561E[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561F[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value_1;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_10; // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox_3;        // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox_2;        // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox_1;        // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropBox;          // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked_1;              // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5620[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_11; // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
