#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerStaminaBar

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerStaminaBar.WBP_PlayerStaminaBar_C
// 0x0058 (0x0318 - 0x02C0)
class UWBP_PlayerStaminaBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Overlay_Stamina;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StaminaBar;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVitalsComponent*                       CachedVitals;                                      // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CONST_HIDE_DURATION;                               // 0x02E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HideStaminaTimer;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMeleeAttackComponent*                  CachedMelee;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UValeriaGASComponent*                   CachedGAS;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynamic;                                           // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<ECharacterState>                       CharacterStatesToHideBar;                          // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CanShowStaminaBar(bool* CanShow, class APawn* OwningPawn, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, bool CallFunc_IsInCinematicMode_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, ECharacterState CallFunc_GetCurrentStateType_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_BooleanNOR_ReturnValue);
	void Construct();
	void ExecuteUbergraph_WBP_PlayerStaminaBar(int32 EntryPoint, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue);
	void HandleCharacterStateChanged(class UCharacterStateMachineComponent* Csm, const struct FCharacterStateChangeParams& Params_0, bool CallFunc_CanShowStaminaBar_CanShow);
	void HideStaminaBar();
	void OnVitalsChanged(class UVitalsComponent* Vitals, class APawn* OwningPawn, int32 StaminaMax, double OldPercent, double NewPercent, float CallFunc_K2_GetScalarParameterValue_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_K2_IsValidTimerHandle_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, int32 CallFunc_GetVitalMax_ReturnValue, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, int32 CallFunc_GetVital_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_FClamp_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue, bool CallFunc_CanShowStaminaBar_CanShow, bool CallFunc_NearlyEqual_FloatFloat_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, float CallFunc_UpdateStaminaBar_Value_ImplicitCast, double K2Node_VariableSet_OldPercent_ImplicitCast, float CallFunc_UpdateStaminaBar_Value_ImplicitCast_1, float CallFunc_K2_SetTimer_Time_ImplicitCast);
	void PlayExhaustedStamina();
	void Setup(class UVitalsComponent* Vitals, class UValeriaGASComponent* GAS, class AValeriaCharacter* ValeriaCharacter, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsValid_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, class AActor* CallFunc_GetOwner_ReturnValue, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsLocallyControlled_ReturnValue, TDelegate<void(class UVitalsComponent* Vitals)> K2Node_CreateDelegate_OutputDelegate_2, TDelegate<void(class UCharacterStateMachineComponent* Csm, const struct FCharacterStateChangeParams& Params)> K2Node_CreateDelegate_OutputDelegate_3, TDelegate<void(class UVitalsComponent* Vitals)> K2Node_CreateDelegate_OutputDelegate_4, bool CallFunc_IsValid_ReturnValue_1);
	void UpdateStaminaBar(float Value, bool CallFunc_IsValid_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerStaminaBar_C">();
	}
	static class UWBP_PlayerStaminaBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerStaminaBar_C>();
	}
};
static_assert(alignof(UWBP_PlayerStaminaBar_C) == 0x000008, "Wrong alignment on UWBP_PlayerStaminaBar_C");
static_assert(sizeof(UWBP_PlayerStaminaBar_C) == 0x000318, "Wrong size on UWBP_PlayerStaminaBar_C");
static_assert(offsetof(UWBP_PlayerStaminaBar_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_PlayerStaminaBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStaminaBar_C, Overlay_Stamina) == 0x0002C8, "Member 'UWBP_PlayerStaminaBar_C::Overlay_Stamina' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStaminaBar_C, StaminaBar) == 0x0002D0, "Member 'UWBP_PlayerStaminaBar_C::StaminaBar' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStaminaBar_C, CachedVitals) == 0x0002D8, "Member 'UWBP_PlayerStaminaBar_C::CachedVitals' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStaminaBar_C, CONST_HIDE_DURATION) == 0x0002E0, "Member 'UWBP_PlayerStaminaBar_C::CONST_HIDE_DURATION' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStaminaBar_C, HideStaminaTimer) == 0x0002E8, "Member 'UWBP_PlayerStaminaBar_C::HideStaminaTimer' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStaminaBar_C, CachedMelee) == 0x0002F0, "Member 'UWBP_PlayerStaminaBar_C::CachedMelee' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStaminaBar_C, CachedGAS) == 0x0002F8, "Member 'UWBP_PlayerStaminaBar_C::CachedGAS' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStaminaBar_C, Dynamic) == 0x000300, "Member 'UWBP_PlayerStaminaBar_C::Dynamic' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerStaminaBar_C, CharacterStatesToHideBar) == 0x000308, "Member 'UWBP_PlayerStaminaBar_C::CharacterStatesToHideBar' has a wrong offset!");

}

