#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialConnectionsPanel_CM

#include "Basic.hpp"

#include "ValeriaDTOs_structs.hpp"
#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_SocialPanelConfig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BindToConnectionRequestEvents
// 0x0080 (0x0080 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents final
{
public:
	TDelegate<void(class UWBP_Social_ConnectionRequestsList_CM_C* Widget, int32 Count)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Social_ConnectionRequestsList_CM_C* Widget, int32 Count)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Social_ConnectionRequestsList_CM_C* Widget, int32 Count)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_5;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Social_ConnectionRequestsList_CM_C* Widget, int32 Count)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_7;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents) == 0x000004, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents) == 0x000080, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_5) == 0x000050, "Member 'WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_6) == 0x000060, "Member 'WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_7) == 0x000070, "Member 'WBP_SocialConnectionsPanel_CM_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BindToSearchResultPanelEvents
// 0x0030 (0x0030 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BindToSearchResultPanelEvents final
{
public:
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BindToSearchResultPanelEvents) == 0x000004, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BindToSearchResultPanelEvents");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BindToSearchResultPanelEvents) == 0x000030, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BindToSearchResultPanelEvents");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BindToSearchResultPanelEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BindToSearchResultPanelEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BindToSearchResultPanelEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_SocialConnectionsPanel_CM_C_BindToSearchResultPanelEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BindToSearchResultPanelEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_SocialConnectionsPanel_CM_C_BindToSearchResultPanelEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature, CategoryWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature::CategoryWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature, CategoryWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature::CategoryWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature, CategoryWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature::CategoryWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature, CategoryWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature::CategoryWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature, CategoryWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature::CategoryWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature final
{
public:
	class UWBP_PlayerCharacterInspectionCard_CM_C* CharacterCardWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature, CharacterCardWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature::CharacterCardWidget' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature final
{
public:
	class UWBP_UserSearchPanel_CM_C*              UserSearchPanel;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature, UserSearchPanel) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature::UserSearchPanel' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature
// 0x07C0 (0x07C0 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4882[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OriginalSearchTerm;                                // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FVALDTOS_MetaCharacterFormat           CharacterInfo;                                     // 0x0048(0x0778)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature) == 0x0007C0, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature, bWasSuccessful) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature, OriginalSearchTerm) == 0x000008, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature::OriginalSearchTerm' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature, UserId) == 0x000018, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature::UserId' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature, CharacterInfo) == 0x000048, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature::CharacterInfo' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.CacheDismissableFriendRequests
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests final
{
public:
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<struct FUniqueNetIdRepl>                 CallFunc_TryGetReciprocalFriendRequests_OutFriendRequests; // 0x0008(0x0050)()
	bool                                          CallFunc_TryGetReciprocalFriendRequests_ReturnValue; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4883[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FUniqueNetIdRepl>                 CallFunc_Set_Union_Result;                         // 0x0060(0x0050)()
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests) == 0x0000B0, "Wrong size on WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests, CallFunc_TryGetReciprocalFriendRequests_OutFriendRequests) == 0x000008, "Member 'WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests::CallFunc_TryGetReciprocalFriendRequests_OutFriendRequests' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests, CallFunc_TryGetReciprocalFriendRequests_ReturnValue) == 0x000058, "Member 'WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests::CallFunc_TryGetReciprocalFriendRequests_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests, CallFunc_Set_Union_Result) == 0x000060, "Member 'WBP_SocialConnectionsPanel_CM_C_CacheDismissableFriendRequests::CallFunc_Set_Union_Result' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_CM.WBP_SocialConnectionsPanel_CM_C.ExecuteUbergraph_WBP_SocialConnectionsPanel_CM
// 0x0DA0 (0x0DA0 - 0x0000)
struct WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ListEntry_FriendSearch_CM_C* Widget, const struct FUniqueNetIdRepl& UserId)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& OtherUserId)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& OtherUserId)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4884[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ListEntry_Social_Following_CM_C* Widget, const struct FUniqueNetIdRepl& UserId)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListEntry_FriendSearch_CM_C*       K2Node_DynamicCast_AsWBP_List_Entry_Friend_Search_CM; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4885[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ListEntry_Social_Following_CM_C*   K2Node_CustomEvent_Widget_3;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_UserId_2;                       // 0x0068(0x0030)(HasGetValueTypeHash)
	TDelegate<void(class UInvitation* Invitation)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInvitation* Invitation)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ListEntry_Social_Following_CM_C* Widget, const struct FUniqueNetIdRepl& UserId)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ListEntry_Social_Follower_CM_C* Widget, const struct FUniqueNetIdRepl& UserId)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInvitation* Invitation)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CharacterName, bool bMuted)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListEntry_Social_Follower_CM_C*    K2Node_CustomEvent_Widget_4;                       // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_UserId_3;                       // 0x0110(0x0030)(HasGetValueTypeHash)
	TDelegate<void(class UWBP_ListEntry_Social_Follower_CM_C* Widget, const struct FUniqueNetIdRepl& UserId)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_Widget_5;                       // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_Widget_6;                       // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListEntry_Social_Following_CM_C*   K2Node_DynamicCast_AsWBP_List_Entry_Social_Following_CM; // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4886[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ListEntry_Social_Follower_CM_C*    K2Node_DynamicCast_AsWBP_List_Entry_Social_Follower_CM; // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4887[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UInvitation* Invitation)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x017C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInvitation* Invitation)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInvitation* Invitation)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x019C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CharacterName, bool bMuted)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x01AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bRegistered, class FName SessionName, TArray<struct FUniqueNetIdRepl>& Players)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x01BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bRegistered, class FName SessionName, TArray<struct FUniqueNetIdRepl>& Players)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x01CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_18;           // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSet<struct FUniqueNetIdRepl>& BlockedUsers)> K2Node_CreateDelegate_OutputDelegate_19;           // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSet<struct FUniqueNetIdRepl>& BlockedUsers)> K2Node_CreateDelegate_OutputDelegate_20;           // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_Widget_2;                       // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ListEntry_Social_Block_CM_C* Widget, const struct FUniqueNetIdRepl& UserId)> K2Node_CreateDelegate_OutputDelegate_21;           // 0x0218(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListEntry_Social_Block_CM_C*       K2Node_DynamicCast_AsWBP_List_Entry_Social_Block_CM; // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4888[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ListEntry_Social_Block_CM_C*       K2Node_CustomEvent_Widget_1;                       // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_UserId_1;                       // 0x0240(0x0030)(HasGetValueTypeHash)
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem, struct FUniqueNetIdRepl& AffectedUserNetId)> K2Node_CreateDelegate_OutputDelegate_22;           // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem, const struct FGuid& PlayerGuildId)> K2Node_CreateDelegate_OutputDelegate_23;           // 0x0280(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem, struct FUniqueNetIdRepl& AffectedUserNetId)> K2Node_CreateDelegate_OutputDelegate_24;           // 0x0290(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem, const struct FGuid& PlayerGuildId)> K2Node_CreateDelegate_OutputDelegate_25;           // 0x02A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_26;           // 0x02B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ListEntry_FriendSearch_CM_C* Widget, const struct FUniqueNetIdRepl& UserId)> K2Node_CreateDelegate_OutputDelegate_27;           // 0x02C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_28;           // 0x02D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_29;           // 0x02F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_30;           // 0x0300(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_31;           // 0x0318(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_32;           // 0x0330(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_33;           // 0x0348(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_5;    // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_34;           // 0x0360(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_SessionManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_6;    // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_35;           // 0x0378(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_SessionManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_7;    // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_36;           // 0x0390(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4889[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_37;           // 0x03B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_488A[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_8;    // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInvitationManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue_9;    // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult_1;   // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_488B[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue_1; // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_38;           // 0x03E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_488C[0x3];                                     // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_39;           // 0x03FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_488D[0x4];                                     // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_10;   // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_40;           // 0x0418(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInvitationManager*                     CallFunc_GetLocalPlayerSubsystem_ReturnValue_11;   // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem)> K2Node_CreateDelegate_OutputDelegate_41;           // 0x0430(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_12;   // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_13;   // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem)> K2Node_CreateDelegate_OutputDelegate_42;           // 0x0450(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_SocialConnectionsCategoryList_CM_C* K2Node_ComponentBoundEvent_CategoryWidget_4;       // 0x0460(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_UserId_5;               // 0x0468(0x0030)(HasGetValueTypeHash)
	class UWBP_SocialConnectionsCategoryList_CM_C* K2Node_ComponentBoundEvent_CategoryWidget_3;       // 0x0498(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_UserId_4;               // 0x04A0(0x0030)(HasGetValueTypeHash)
	class UWBP_SocialConnectionsCategoryList_CM_C* K2Node_ComponentBoundEvent_CategoryWidget_2;       // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_UserId_3;               // 0x04D8(0x0030)(HasGetValueTypeHash)
	class UWBP_SocialConnectionsCategoryList_CM_C* K2Node_ComponentBoundEvent_CategoryWidget_1;       // 0x0508(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_UserId_2;               // 0x0510(0x0030)(HasGetValueTypeHash)
	class UWBP_SocialConnectionsCategoryList_CM_C* K2Node_ComponentBoundEvent_CategoryWidget;         // 0x0540(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_UserId_1;               // 0x0548(0x0030)(HasGetValueTypeHash)
	class UWBP_UserSearchPanel_CM_C*              K2Node_ComponentBoundEvent_UserSearchPanel;        // 0x0578(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bWasSuccessful;         // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_488E[0x7];                                     // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_OriginalSearchTerm;     // 0x0588(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_UserId;                 // 0x0598(0x0030)(ConstParm, HasGetValueTypeHash)
	struct FVALDTOS_MetaCharacterFormat           K2Node_ComponentBoundEvent_CharacterInfo;          // 0x05C8(0x0778)(ConstParm)
	class UWBP_PlayerCharacterInspectionCard_CM_C* K2Node_ComponentBoundEvent_CharacterCardWidget;    // 0x0D40(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListEntry_FriendSearch_CM_C*       K2Node_CustomEvent_Widget;                         // 0x0D48(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_UserId;                         // 0x0D50(0x0030)(HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0D80(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup;               // 0x0D88(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0D90(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM");
static_assert(sizeof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM) == 0x000DA0, "Wrong size on WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, EntryPoint) == 0x000000, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_ComponentBoundEvent_Widget) == 0x000038, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_DynamicCast_AsWBP_List_Entry_Friend_Search_CM) == 0x000050, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_DynamicCast_AsWBP_List_Entry_Friend_Search_CM' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_CustomEvent_Widget_3) == 0x000060, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_CustomEvent_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_CustomEvent_UserId_2) == 0x000068, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_CustomEvent_UserId_2' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x000098, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000A8, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B8, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C8, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000D8, "Member 'WBP_SocialConnectionsPanel_CM_C_ExecuteUbergraph_WBP_SocialConnectionsPanel_CM::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
