#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Popup_CM.WBP_Popup_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Popup_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Popup_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Popup_CM_C_PreConstruct");
static_assert(sizeof(WBP_Popup_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_Popup_CM_C_PreConstruct");
static_assert(offsetof(WBP_Popup_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Popup_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Popup_CM.WBP_Popup_CM_C.ExecuteUbergraph_WBP_Popup_CM
// 0x0040 (0x0040 - 0x0000)
struct WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_448A[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_448B[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM) == 0x000008, "Wrong alignment on WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM");
static_assert(sizeof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM) == 0x000040, "Wrong size on WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, EntryPoint) == 0x000000, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, Temp_bool_Variable) == 0x000004, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, Temp_byte_Variable) == 0x000005, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, K2Node_Event_IsDesignTime) == 0x000007, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, Temp_bool_Variable_1) == 0x000008, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, K2Node_Select_Default) == 0x000009, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000010, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, CallFunc_MakeColor_ReturnValue) == 0x00001C, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, CallFunc_MakeColor_ReturnValue_1) == 0x00002C, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, Temp_byte_Variable_2) == 0x00003C, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, CallFunc_IsValid_ReturnValue_1) == 0x00003D, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, Temp_byte_Variable_3) == 0x00003E, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM, K2Node_Select_Default_1) == 0x00003F, "Member 'WBP_Popup_CM_C_ExecuteUbergraph_WBP_Popup_CM::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Popup_CM.WBP_Popup_CM_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Popup_CM_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Popup_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_Popup_CM_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_Popup_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_Popup_CM_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_Popup_CM_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_Popup_CM_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

}

