#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyRebindingMenu_Gamepad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_CloseKeyRebindMenuType_structs.hpp"
#include "KeyRebinding_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KeyRebindingMenu_Gamepad.WBP_KeyRebindingMenu_Gamepad_C
// 0x00A0 (0x05F8 - 0x0558)
class UWBP_KeyRebindingMenu_Gamepad_C final : public UKeyRebindSettingsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Overlay_1;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class US6UI_CustomNavigationGroup*            S6UI_CustomNavigationGroup_0;                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ScrollBox_Styled*                ScrollBox;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_InputKeyGroup;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyRebindingGuide_C*               WBP_KeyRebindingGuide;                             // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Secondary_01_CM_C* WBP_Template_Button_Secondary_01_CM;               // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           HideTipsTimerHandle;                               // 0x0590(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         TipsDelayTime;                                     // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54F2[0x4];                                     // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ScrollSpeed;                                       // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            WBP_KeyRebidingResult;                             // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                LastFocusedWidget;                                 // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_CloseKeyRebindMenuType                      Excute_Status;                                     // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54F3[0x7];                                     // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnKeyRebindMenuActivated;                          // 0x05C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPopupOpen;                                       // 0x05D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPopupClose;                                      // 0x05E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasButtonCanbeRebind;                              // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_KeyRebindingMenu_Gamepad_WBP_Template_Button_Secondary_01_CM_K2Node_ComponentBoundEvent_2_OnButtonClicked__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BP_OnSubWidgetInitCompleted();
	void ButtonCheckConfirm();
	void Construct();
	void Destruct();
	void ExecutePrePopupAction(E_CloseKeyRebindMenuType PrePopupAction);
	void ExecuteUbergraph_WBP_KeyRebindingMenu_Gamepad(int32 EntryPoint, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_2, float K2Node_EnhancedInputActionEvent_ElapsedTime_2, float K2Node_EnhancedInputActionEvent_TriggeredTime_2, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_2, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_1, class UInputAction* Temp_object_Variable, double Temp_real_Variable, double Temp_real_Variable_0, double Temp_real_Variable_1, bool Temp_bool_Variable, double Temp_real_Variable_1_0, class UWBP_PopupHasButtonNotBound_KeyRebind_PF_C* CallFunc_Create_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class UWBP_PopupResetDefault_KeyRebind_C* CallFunc_Create_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, class UWBP_PopupHasButtonNotBound_KeyRebind_C* CallFunc_Create_ReturnValue_2, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_1, class UWBP_PopupResetDefault_KeyRebind_PF_C* CallFunc_Create_ReturnValue_3, const struct FKeyRebind_DisplayResult& K2Node_Event_KeyRebindResultInfo, E_CloseKeyRebindMenuType K2Node_Event_PrePopupAction_1, int32 Temp_int_Array_Index_Variable_2, float CallFunc_GetPromptDelayTime_ReturnValue, float CallFunc_GetScrollOffsetOfEnd_ReturnValue, float CallFunc_GetScrollOffset_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, float CallFunc_GetScrollOffsetOfEnd_ReturnValue_1, double CallFunc_FClamp_ReturnValue, float CallFunc_GetScrollOffset_ReturnValue_1, double CallFunc_Add_DoubleDouble_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, double CallFunc_FClamp_ReturnValue_1, bool CallFunc_K2_IsValidTimerHandle_ReturnValue, const struct FTimerHandle& CallFunc_K2_InvalidateTimerHandle_ReturnValue, const struct FTimerHandle& CallFunc_K2_InvalidateTimerHandle_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, bool CallFunc_IsVisible_ReturnValue, class UWidget* K2Node_Event_Widget, bool K2Node_Event_bIsRebinding_1, struct FKeyRebind_DisplayResult& K2Node_Event_ResultInfo, bool K2Node_Event_bIsRebinding, class UKeyRebindGroupWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UKeyRebindGroupEntryWidget* CallFunc_Array_Get_Item_1, bool CallFunc_Less_IntInt_ReturnValue, class UWBP_KeyRebindGroupEntry_C* K2Node_DynamicCast_AsWBP_Key_Rebind_Group_Entry, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue_1, TArray<class UWidget*>& K2Node_MakeArray_Array, bool CallFunc_Less_IntInt_ReturnValue_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, bool Temp_bool_Variable_1, double Temp_real_Variable_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_2, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue_2, class UWBP_KeyRebindSelector_C* K2Node_DynamicCast_AsWBP_Key_Rebind_Selector, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue, class UKeyRebindGroupWidget* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_2, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_2, class UWBP_KeyRebindResultTips_Gamepad_C* CallFunc_Create_ReturnValue_4, class FText CallFunc_GetDescriptionofInputAction_ReturnValue, double Temp_real_Variable_3, class UInputAction* Temp_object_Variable_1, TScriptInterface<class IBPI_KeyRebindInterface_C> K2Node_Event_OwnerWidget, E_CloseKeyRebindMenuType K2Node_Event_PrePopupAction, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_3, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue_3, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_1, float K2Node_EnhancedInputActionEvent_ElapsedTime_1, float K2Node_EnhancedInputActionEvent_TriggeredTime_1, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_1, double Temp_real_Variable_3_0, double Temp_real_Variable_2_0, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_2, bool CallFunc_HasAnyKeyNotBound_ReturnValue, bool CallFunc_IsActivated_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_4, bool CallFunc_IsConsolePlatform_ReturnValue, bool CallFunc_Array_IsNotEmpty_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_4, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue_4, bool Temp_bool_Variable_2, double Temp_real_Variable_4, double Temp_real_Variable_5, double Temp_real_Variable_4_0, double Temp_real_Variable_5_0, bool CallFunc_IsConsolePlatform_ReturnValue_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_5, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue_5, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_5, class UInputAction* Temp_object_Variable_2, double CallFunc_FClamp_Max_ImplicitCast, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast, double CallFunc_FClamp_Max_ImplicitCast_1, float CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast, double CallFunc_Add_DoubleDouble_B_ImplicitCast, float CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast_1);
	void HandleKeyRebindTips(struct FKeyRebind_DisplayResult& KeyRebindResultInfo, class FText CallFunc_GetKeyName_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class FText CallFunc_GetKeyName_ReturnValue_1, class FText CallFunc_GetKeyName_ReturnValue_2, TScriptInterface<class IBPI_KeyRebindInterface_C> K2Node_DynamicCast_AsBPI_Key_Rebind_Interface, bool K2Node_DynamicCast_bSuccess);
	void HiddenResultTips();
	void InpActEvt_IA_UI_ResetToDefault_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_ScrollBar_Down_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_ScrollBar_Up_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void IsKeyRebindEmpty(bool* IsEmpty, bool CallFunc_Not_PreBool_ReturnValue);
	void OnButtonCheckPopupClose();
	void OnButtonCheckPopupConfirm(TScriptInterface<class IBPI_KeyRebindInterface_C> OwnerWidget, E_CloseKeyRebindMenuType PrePopupAction);
	void OnInitialized();
	void OnKeyRebindBegin(class UWidget* Widget, bool bIsRebinding);
	void OnKeyRebindEnd(struct FKeyRebind_DisplayResult& ResultInfo, bool bIsRebinding);
	void OnKeyRebindMenuActivated__DelegateSignature(bool bIsActivated);
	void OnPopupClose__DelegateSignature();
	void OnPopupOpen__DelegateSignature();
	void OnResetClose();
	void OnResetConfirm();
	void RefreshKeyRebindTips(const struct FKeyRebind_DisplayResult& KeyRebindResultInfo);
	void ToggleButtonCheckPopup(TScriptInterface<class IBPI_KeyRebindInterface_C> OwnerWidget, E_CloseKeyRebindMenuType PrePopupAction);

	class UWidget* BP_GetDesiredFocusTarget(bool CallFunc_Array_IsNotEmpty_ReturnValue, class UKeyRebindGroupWidget* CallFunc_Array_Get_Item, bool CallFunc_Array_IsNotEmpty_ReturnValue_1, class UKeyRebindGroupEntryWidget* CallFunc_Array_Get_Item_1) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KeyRebindingMenu_Gamepad_C">();
	}
	static class UWBP_KeyRebindingMenu_Gamepad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KeyRebindingMenu_Gamepad_C>();
	}
};
static_assert(alignof(UWBP_KeyRebindingMenu_Gamepad_C) == 0x000008, "Wrong alignment on UWBP_KeyRebindingMenu_Gamepad_C");
static_assert(sizeof(UWBP_KeyRebindingMenu_Gamepad_C) == 0x0005F8, "Wrong size on UWBP_KeyRebindingMenu_Gamepad_C");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, UberGraphFrame) == 0x000558, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, Overlay_1) == 0x000560, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, S6UI_CustomNavigationGroup_0) == 0x000568, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::S6UI_CustomNavigationGroup_0' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, ScrollBox) == 0x000570, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, VB_InputKeyGroup) == 0x000578, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::VB_InputKeyGroup' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, WBP_KeyRebindingGuide) == 0x000580, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::WBP_KeyRebindingGuide' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, WBP_Template_Button_Secondary_01_CM) == 0x000588, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::WBP_Template_Button_Secondary_01_CM' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, HideTipsTimerHandle) == 0x000590, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::HideTipsTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, TipsDelayTime) == 0x000598, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::TipsDelayTime' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, ScrollSpeed) == 0x0005A0, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::ScrollSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, WBP_KeyRebidingResult) == 0x0005A8, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::WBP_KeyRebidingResult' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, LastFocusedWidget) == 0x0005B0, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::LastFocusedWidget' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, Excute_Status) == 0x0005B8, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::Excute_Status' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, OnKeyRebindMenuActivated) == 0x0005C0, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::OnKeyRebindMenuActivated' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, OnPopupOpen) == 0x0005D0, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::OnPopupOpen' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, OnPopupClose) == 0x0005E0, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::OnPopupClose' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindingMenu_Gamepad_C, HasButtonCanbeRebind) == 0x0005F0, "Member 'UWBP_KeyRebindingMenu_Gamepad_C::HasButtonCanbeRebind' has a wrong offset!");

}

