#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PingTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PingTime.WBP_PingTime_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_PingTime_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_Border_Styled*                   PingBorder;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_PingTime;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_PingTime(int32 EntryPoint, TDelegate<void(struct FValeriaGameplaySettings& GameplaySettings)> K2Node_CreateDelegate_OutputDelegate, bool Temp_bool_Variable, bool Temp_bool_Variable_1, const struct FSlateColor& K2Node_MakeStruct_SlateColor, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1, const struct FSlateColor& K2Node_MakeStruct_SlateColor_2, class APlayerController* CallFunc_GetPlayerController_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, uint8 CallFunc_GetCompressedPing_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_Less_ByteByte_ReturnValue, bool CallFunc_Less_ByteByte_ReturnValue_1, int32 CallFunc_Conv_ByteToInt_ReturnValue, const struct FSlateColor& K2Node_Select_Default, int32 CallFunc_Multiply_IntInt_ReturnValue, const struct FSlateColor& K2Node_Select_Default_1, class FText CallFunc_Conv_IntToText_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue, TDelegate<void(struct FValeriaGameplaySettings& GameplaySettings)> K2Node_CreateDelegate_OutputDelegate_2, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue_1);
	void HandleDebugSettingsChanged(struct FValeriaGameplaySettings& GameplaySettings);
	void UpdatePingTime();
	void UpdateVisibility(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, bool CallFunc_AreCheatsEnabled_Result, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, ESlateVisibility K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PingTime_C">();
	}
	static class UWBP_PingTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PingTime_C>();
	}
};
static_assert(alignof(UWBP_PingTime_C) == 0x000008, "Wrong alignment on UWBP_PingTime_C");
static_assert(sizeof(UWBP_PingTime_C) == 0x0002D8, "Wrong size on UWBP_PingTime_C");
static_assert(offsetof(UWBP_PingTime_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_PingTime_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PingTime_C, PingBorder) == 0x0002C8, "Member 'UWBP_PingTime_C::PingBorder' has a wrong offset!");
static_assert(offsetof(UWBP_PingTime_C, TextBlock_PingTime) == 0x0002D0, "Member 'UWBP_PingTime_C::TextBlock_PingTime' has a wrong offset!");

}

