#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Notification_DebugTest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Notification_DebugTest.WBP_Notification_DebugTest_C
// 0x0020 (0x02E0 - 0x02C0)
class UWBP_Notification_DebugTest_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGuid                                  Notification_Id;                                   // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVALUI_NotificationQueue*               Notification_Queue;                                // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Notification_DebugTest(int32 EntryPoint, class UVALUI_NotificationQueue* K2Node_Event_NotificationQueue_1, struct FGuid& K2Node_Event_NotificationId_1, class UVALUI_NotificationQueue* K2Node_Event_NotificationQueue, struct FGuid& K2Node_Event_NotificationId, bool CallFunc_TryDismissNotification_ReturnValue);
	void HandleNotificationDismissed(class UVALUI_NotificationQueue* NotificationQueue, struct FGuid& NotificationId);
	void HandleNotificationShown(class UVALUI_NotificationQueue* NotificationQueue, struct FGuid& NotificationId);
	bool MatchesNotification(class FText& NotificationText, TSoftObjectPtr<class UTexture2D>& NotificationIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Notification_DebugTest_C">();
	}
	static class UWBP_Notification_DebugTest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Notification_DebugTest_C>();
	}
};
static_assert(alignof(UWBP_Notification_DebugTest_C) == 0x000008, "Wrong alignment on UWBP_Notification_DebugTest_C");
static_assert(sizeof(UWBP_Notification_DebugTest_C) == 0x0002E0, "Wrong size on UWBP_Notification_DebugTest_C");
static_assert(offsetof(UWBP_Notification_DebugTest_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Notification_DebugTest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Notification_DebugTest_C, Notification_Id) == 0x0002C8, "Member 'UWBP_Notification_DebugTest_C::Notification_Id' has a wrong offset!");
static_assert(offsetof(UWBP_Notification_DebugTest_C, Notification_Queue) == 0x0002D8, "Member 'UWBP_Notification_DebugTest_C::Notification_Queue' has a wrong offset!");

}

