#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActionBar

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CommonInput_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_ActionBar.WBP_ActionBar_C.BndEvt__MenuAnchor_Popin_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActionBar_C_BndEvt__MenuAnchor_Popin_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActionBar_C_BndEvt__MenuAnchor_Popin_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ActionBar_C_BndEvt__MenuAnchor_Popin_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_ActionBar_C_BndEvt__MenuAnchor_Popin_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_ActionBar_C_BndEvt__MenuAnchor_Popin_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_ActionBar_C_BndEvt__MenuAnchor_Popin_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'WBP_ActionBar_C_BndEvt__MenuAnchor_Popin_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function WBP_ActionBar.WBP_ActionBar_C.CheckNextSlot
// 0x0120 (0x0120 - 0x0000)
struct WBP_ActionBar_C_CheckNextSlot final
{
public:
	int32                                         NextSlot;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FA6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    InvComponent;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OutIndex;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutSlotIndex;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FA7[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FA8[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBagSlotLocation                       CallFunc_GetLocationAtActionBarIndex_ReturnValue;  // 0x0030(0x0008)(NoDestructor)
	struct FValeriaItem                           CallFunc_GetItemAt_ReturnValue;                    // 0x0038(0x0060)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemIsEmpty_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FA9[0x1];                                     // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBagSlotLocation                       CallFunc_GetLocationAtActionBarIndex_ReturnValue_1; // 0x00A8(0x0008)(NoDestructor)
	struct FValeriaItem                           CallFunc_GetItemAt_ReturnValue_1;                  // 0x00B0(0x0060)()
	bool                                          CallFunc_ItemIsEmpty_ReturnValue_1;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FAA[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActionBar_C_CheckNextSlot) == 0x000008, "Wrong alignment on WBP_ActionBar_C_CheckNextSlot");
static_assert(sizeof(WBP_ActionBar_C_CheckNextSlot) == 0x000120, "Wrong size on WBP_ActionBar_C_CheckNextSlot");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, NextSlot) == 0x000000, "Member 'WBP_ActionBar_C_CheckNextSlot::NextSlot' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, InvComponent) == 0x000008, "Member 'WBP_ActionBar_C_CheckNextSlot::InvComponent' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, OutIndex) == 0x000010, "Member 'WBP_ActionBar_C_CheckNextSlot::OutIndex' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, OutSlotIndex) == 0x000014, "Member 'WBP_ActionBar_C_CheckNextSlot::OutSlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, Temp_bool_Variable) == 0x000019, "Member 'WBP_ActionBar_C_CheckNextSlot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001B, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, Temp_int_Variable) == 0x000020, "Member 'WBP_ActionBar_C_CheckNextSlot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, Temp_int_Variable_1) == 0x000028, "Member 'WBP_ActionBar_C_CheckNextSlot::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, Temp_bool_Variable_1) == 0x00002C, "Member 'WBP_ActionBar_C_CheckNextSlot::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_GetLocationAtActionBarIndex_ReturnValue) == 0x000030, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_GetLocationAtActionBarIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_GetItemAt_ReturnValue) == 0x000038, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000098, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_ItemIsEmpty_ReturnValue) == 0x000099, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_ItemIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_Not_PreBool_ReturnValue_1) == 0x00009A, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_Add_IntInt_ReturnValue_1) == 0x00009C, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, Temp_int_Variable_2) == 0x0000A0, "Member 'WBP_ActionBar_C_CheckNextSlot::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, K2Node_Select_Default) == 0x0000A4, "Member 'WBP_ActionBar_C_CheckNextSlot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_GetLocationAtActionBarIndex_ReturnValue_1) == 0x0000A8, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_GetLocationAtActionBarIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_GetItemAt_ReturnValue_1) == 0x0000B0, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_GetItemAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_ItemIsEmpty_ReturnValue_1) == 0x000110, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_ItemIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_Subtract_IntInt_ReturnValue) == 0x000114, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_Not_PreBool_ReturnValue_2) == 0x000118, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000119, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_BooleanAND_ReturnValue) == 0x00011A, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CheckNextSlot, CallFunc_Greater_IntInt_ReturnValue) == 0x00011B, "Member 'WBP_ActionBar_C_CheckNextSlot::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ActionBar.WBP_ActionBar_C.CreateActionBarButtons
// 0x0060 (0x0060 - 0x0000)
struct WBP_ActionBar_C_CreateActionBarButtons final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAdditionalEnsureWidgetsOptions        K2Node_MakeStruct_AdditionalEnsureWidgetsOptions;  // 0x0014(0x0028)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FAB[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ActionBarSlot_C*                   K2Node_DynamicCast_AsWBP_Action_Bar_Slot;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActionBar_C_CreateActionBarButtons) == 0x000008, "Wrong alignment on WBP_ActionBar_C_CreateActionBarButtons");
static_assert(sizeof(WBP_ActionBar_C_CreateActionBarButtons) == 0x000060, "Wrong size on WBP_ActionBar_C_CreateActionBarButtons");
static_assert(offsetof(WBP_ActionBar_C_CreateActionBarButtons, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_ActionBar_C_CreateActionBarButtons::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CreateActionBarButtons, Temp_int_Variable) == 0x000010, "Member 'WBP_ActionBar_C_CreateActionBarButtons::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CreateActionBarButtons, K2Node_MakeStruct_AdditionalEnsureWidgetsOptions) == 0x000014, "Member 'WBP_ActionBar_C_CreateActionBarButtons::K2Node_MakeStruct_AdditionalEnsureWidgetsOptions' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CreateActionBarButtons, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_ActionBar_C_CreateActionBarButtons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CreateActionBarButtons, CallFunc_GetChildrenCount_ReturnValue) == 0x000040, "Member 'WBP_ActionBar_C_CreateActionBarButtons::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CreateActionBarButtons, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'WBP_ActionBar_C_CreateActionBarButtons::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CreateActionBarButtons, CallFunc_GetChildAt_ReturnValue) == 0x000048, "Member 'WBP_ActionBar_C_CreateActionBarButtons::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CreateActionBarButtons, K2Node_DynamicCast_AsWBP_Action_Bar_Slot) == 0x000050, "Member 'WBP_ActionBar_C_CreateActionBarButtons::K2Node_DynamicCast_AsWBP_Action_Bar_Slot' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_CreateActionBarButtons, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_ActionBar_C_CreateActionBarButtons::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ActionBar.WBP_ActionBar_C.Deselect Slot
// 0x0028 (0x0028 - 0x0000)
struct WBP_ActionBar_C_Deselect_Slot final
{
public:
	bool                                          ShouldUpdateEquipped;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FAC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldRemoveHighlight;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FAD[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ActionBarSlot_C*                   K2Node_DynamicCast_AsWBP_Action_Bar_Slot;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActionBar_C_Deselect_Slot) == 0x000008, "Wrong alignment on WBP_ActionBar_C_Deselect_Slot");
static_assert(sizeof(WBP_ActionBar_C_Deselect_Slot) == 0x000028, "Wrong size on WBP_ActionBar_C_Deselect_Slot");
static_assert(offsetof(WBP_ActionBar_C_Deselect_Slot, ShouldUpdateEquipped) == 0x000000, "Member 'WBP_ActionBar_C_Deselect_Slot::ShouldUpdateEquipped' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_Deselect_Slot, Param_Index) == 0x000004, "Member 'WBP_ActionBar_C_Deselect_Slot::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_Deselect_Slot, ShouldRemoveHighlight) == 0x000008, "Member 'WBP_ActionBar_C_Deselect_Slot::ShouldRemoveHighlight' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_Deselect_Slot, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_ActionBar_C_Deselect_Slot::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_Deselect_Slot, K2Node_DynamicCast_AsWBP_Action_Bar_Slot) == 0x000018, "Member 'WBP_ActionBar_C_Deselect_Slot::K2Node_DynamicCast_AsWBP_Action_Bar_Slot' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_Deselect_Slot, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_ActionBar_C_Deselect_Slot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_Deselect_Slot, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_ActionBar_C_Deselect_Slot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_Deselect_Slot, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000022, "Member 'WBP_ActionBar_C_Deselect_Slot::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");

// Function WBP_ActionBar.WBP_ActionBar_C.ExecuteUbergraph_WBP_ActionBar
// 0x0350 (0x0350 - 0x0000)
struct WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FAE[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FAF[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB0[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB1[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    K2Node_CustomEvent_Inventory;                      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ActionBarSlot_C*                   K2Node_DynamicCast_AsWBP_Action_Bar_Slot;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB2[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    K2Node_CustomEvent_Inventory_1;                    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewRowCount;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB3[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopinCalloutWidget_C*              CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FValeriaGameplaySettings               K2Node_CustomEvent_GameplaySettings;               // 0x0078(0x0018)(ConstParm, NoDestructor)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_RegisterInputActionBinding_ReturnValue;   // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_RegisterInputActionBinding_ReturnValue_1; // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UInputAction*>                   K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB4[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB5[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           CallFunc_Array_Get_Item;                           // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_RegisterInputActionBinding_ReturnValue_2; // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_RegisterInputActionBinding_ReturnValue_3; // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB6[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsActionBarActivated)>   K2Node_CreateDelegate_OutputDelegate_12;           // 0x01C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB7[0x3];                                     // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue;                 // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB8[0x3];                                     // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, const struct FEquipmentItem& Item)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x01FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB9[0x3];                                     // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, const struct FEquipmentItem& Item)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x0218(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue_1;               // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FBA[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, bool bHidden)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x0234(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, bool bHidden)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x0244(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText ErrorMessage)>     K2Node_CreateDelegate_OutputDelegate_18;           // 0x0254(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FBB[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_2;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FBC[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_2;        // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FBD[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfActionBarRows_ReturnValue;     // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue_1;    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FBE[0x3];                                     // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, const struct FEquipmentItem& Item)> K2Node_CreateDelegate_OutputDelegate_19;           // 0x02A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_Select_Default;                             // 0x02B0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_RegisterInputActionBinding_ReturnValue_4; // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, const struct FEquipmentItem& Item)> K2Node_CreateDelegate_OutputDelegate_20;           // 0x02D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FValeriaGameplaySettings& GameplaySettings)> K2Node_CreateDelegate_OutputDelegate_21;           // 0x02E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, const struct FEquipmentItem& Item)> K2Node_CreateDelegate_OutputDelegate_22;           // 0x02F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfActionBarRows_ReturnValue_1;   // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FBF[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsActionBarActivated;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC0[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM; // 0x0320(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC1[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FTUEPopin_CM_C*                    CallFunc_Redirect_FTUEPopin_Type_FTUEPopin;        // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC2[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue;                   // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar) == 0x000008, "Wrong alignment on WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar");
static_assert(sizeof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar) == 0x000350, "Wrong size on WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, EntryPoint) == 0x000000, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, Temp_int_Variable) == 0x000004, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CustomEvent_Inventory) == 0x000030, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CustomEvent_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetChildAt_ReturnValue) == 0x000038, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_DynamicCast_AsWBP_Action_Bar_Slot) == 0x000040, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_DynamicCast_AsWBP_Action_Bar_Slot' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CustomEvent_Inventory_1) == 0x000050, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CustomEvent_Inventory_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CustomEvent_NewRowCount) == 0x000058, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CustomEvent_NewRowCount' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_CanStartTutorialForFlag_ReturnValue) == 0x00005C, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_CanStartTutorialForFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_ComponentBoundEvent_bIsOpen) == 0x00005D, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_Create_ReturnValue) == 0x000068, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000070, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CustomEvent_GameplaySettings) == 0x000078, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CustomEvent_GameplaySettings' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_RegisterInputActionBinding_ReturnValue) == 0x0000A0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_RegisterInputActionBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0000C0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_RegisterInputActionBinding_ReturnValue_1) == 0x0000C8, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_RegisterInputActionBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D8, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_MakeArray_Array) == 0x0000E8, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F8, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_4) == 0x00010C, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_Less_IntInt_ReturnValue) == 0x00011C, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_5) == 0x000120, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_6) == 0x000130, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_7) == 0x000140, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_8) == 0x000150, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_9) == 0x000160, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, Temp_int_Array_Index_Variable) == 0x000170, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_Array_Get_Item) == 0x000178, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_10) == 0x000180, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_RegisterInputActionBinding_ReturnValue_2) == 0x000190, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_RegisterInputActionBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_11) == 0x0001A0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_RegisterInputActionBinding_ReturnValue_3) == 0x0001B0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_RegisterInputActionBinding_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_Event_IsDesignTime) == 0x0001C0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_12) == 0x0001C4, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetValeriaCharacter_OutResult) == 0x0001D4, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetValeriaCharacter_ReturnValue) == 0x0001D8, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_13) == 0x0001E0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetEquipment_ReturnValue) == 0x0001F0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_SwitchEnum_CmpSuccess) == 0x0001F8, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_14) == 0x0001FC, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetValeriaCharacter_OutResult_1) == 0x00020C, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetValeriaCharacter_OutResult_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetValeriaCharacter_ReturnValue_1) == 0x000210, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetValeriaCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_15) == 0x000218, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetEquipment_ReturnValue_1) == 0x000228, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_SwitchEnum_CmpSuccess_1) == 0x000230, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_16) == 0x000234, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_17) == 0x000244, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_18) == 0x000254, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000268, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetValeriaCharacter_OutResult_2) == 0x000270, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetValeriaCharacter_OutResult_2' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetValeriaCharacter_ReturnValue_2) == 0x000278, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetValeriaCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetInventory_ReturnValue) == 0x000280, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_SwitchEnum_CmpSuccess_2) == 0x000288, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetNumberOfActionBarRows_ReturnValue) == 0x00028C, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetNumberOfActionBarRows_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x000290, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_CanStartTutorialForFlag_ReturnValue_1) == 0x000298, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_CanStartTutorialForFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, Temp_int_Variable_1) == 0x00029C, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_19) == 0x0002A0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_Select_Default) == 0x0002B0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_RegisterInputActionBinding_ReturnValue_4) == 0x0002C0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_RegisterInputActionBinding_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_20) == 0x0002D0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_21) == 0x0002E0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, K2Node_CreateDelegate_OutputDelegate_22) == 0x0002F0, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::K2Node_CreateDelegate_OutputDelegate_22' has a wrong offset!");
static_assert(offsetof(WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar, CallFunc_GetNumberOfActionBarRows_ReturnValue_1) == 0x000300, "Member 'WBP_ActionBar_C_ExecuteUbergraph_WBP_ActionBar::CallFunc_GetNumberOfActionBarRows_ReturnValue_1' has a wrong offset!");
