#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClockArrow

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ClockArrow.WBP_ClockArrow_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_ClockArrow_C final : public UUserWidget
{
public:
	class UImage*                                 ClockHandle;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Decor;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Decor_1;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ClockArrow_C">();
	}
	static class UWBP_ClockArrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ClockArrow_C>();
	}
};
static_assert(alignof(UWBP_ClockArrow_C) == 0x000008, "Wrong alignment on UWBP_ClockArrow_C");
static_assert(sizeof(UWBP_ClockArrow_C) == 0x0002D8, "Wrong size on UWBP_ClockArrow_C");
static_assert(offsetof(UWBP_ClockArrow_C, ClockHandle) == 0x0002C0, "Member 'UWBP_ClockArrow_C::ClockHandle' has a wrong offset!");
static_assert(offsetof(UWBP_ClockArrow_C, Decor) == 0x0002C8, "Member 'UWBP_ClockArrow_C::Decor' has a wrong offset!");
static_assert(offsetof(UWBP_ClockArrow_C, Decor_1) == 0x0002D0, "Member 'UWBP_ClockArrow_C::Decor_1' has a wrong offset!");

}

