#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_Popup_01_PF

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Template_Popup_01_PF.WBP_Template_Popup_01_PF_C.ExecuteUbergraph_WBP_Template_Popup_01_PF
// 0x001C (0x001C - 0x0000)
struct WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514B[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514C[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF) == 0x000004, "Wrong alignment on WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF");
static_assert(sizeof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF) == 0x00001C, "Wrong size on WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, EntryPoint) == 0x000000, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, Temp_bool_Variable) == 0x000004, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, Temp_byte_Variable) == 0x000005, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, CallFunc_AkEventGlobal_ReturnValue) == 0x00000C, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000014, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, K2Node_Select_Default) == 0x000018, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, CallFunc_BooleanOR_ReturnValue) == 0x000019, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF, K2Node_Select_Default_1) == 0x00001A, "Member 'WBP_Template_Popup_01_PF_C_ExecuteUbergraph_WBP_Template_Popup_01_PF::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Template_Popup_01_PF.WBP_Template_Popup_01_PF_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Template_Popup_01_PF_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Popup_01_PF_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Template_Popup_01_PF_C_PreConstruct");
static_assert(sizeof(WBP_Template_Popup_01_PF_C_PreConstruct) == 0x000001, "Wrong size on WBP_Template_Popup_01_PF_C_PreConstruct");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Template_Popup_01_PF_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Template_Popup_01_PF.WBP_Template_Popup_01_PF_C.Setup Input Action
// 0x0002 (0x0002 - 0x0000)
struct WBP_Template_Popup_01_PF_C_Setup_Input_Action final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Popup_01_PF_C_Setup_Input_Action) == 0x000001, "Wrong alignment on WBP_Template_Popup_01_PF_C_Setup_Input_Action");
static_assert(sizeof(WBP_Template_Popup_01_PF_C_Setup_Input_Action) == 0x000002, "Wrong size on WBP_Template_Popup_01_PF_C_Setup_Input_Action");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_Setup_Input_Action, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_Template_Popup_01_PF_C_Setup_Input_Action::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Popup_01_PF_C_Setup_Input_Action, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'WBP_Template_Popup_01_PF_C_Setup_Input_Action::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

