#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoginFlow_PF

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.BndEvt__WBP_LoginFlow_PF_Button_Help_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Help_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Help_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Help_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Help_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Help_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Help_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Help_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.BndEvt__WBP_LoginFlow_PF_Button_Setting_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Setting_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Setting_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Setting_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Setting_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Setting_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Setting_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Setting_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.BndEvt__WBP_LoginFlow_PF_Button_Start_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Start_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Start_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Start_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Start_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Start_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Start_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_LoginFlow_PF_C_BndEvt__WBP_LoginFlow_PF_Button_Start_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.ExecuteUbergraph_WBP_LoginFlow_PF
// 0x0108 (0x0108 - 0x0000)
struct WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4B[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_5;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_6;    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00A8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x00D0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF");
static_assert(sizeof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF) == 0x000108, "Wrong size on WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, EntryPoint) == 0x000000, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000008, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000028, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000040, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_GetDisplayName_ReturnValue) == 0x000048, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000068, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x000070, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, K2Node_ComponentBoundEvent_Button_2) == 0x000078, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue_4) == 0x000080, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue_5) == 0x000098, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue_6) == 0x0000A0, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_GetText_ReturnValue) == 0x0000A8, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_Conv_TextToString_ReturnValue) == 0x0000C0, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_GetText_ReturnValue_1) == 0x0000D0, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000E8, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, K2Node_ComponentBoundEvent_Button_1) == 0x0000F8, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF, K2Node_ComponentBoundEvent_Button) == 0x000100, "Member 'WBP_LoginFlow_PF_C_ExecuteUbergraph_WBP_LoginFlow_PF::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.GoRetryPanel
// 0x0020 (0x0020 - 0x0000)
struct WBP_LoginFlow_PF_C_GoRetryPanel final
{
public:
	class FText                                   ErrorMsg;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bUseDefaultMsg;                                    // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginFlow_PF_C_GoRetryPanel) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_GoRetryPanel");
static_assert(sizeof(WBP_LoginFlow_PF_C_GoRetryPanel) == 0x000020, "Wrong size on WBP_LoginFlow_PF_C_GoRetryPanel");
static_assert(offsetof(WBP_LoginFlow_PF_C_GoRetryPanel, ErrorMsg) == 0x000000, "Member 'WBP_LoginFlow_PF_C_GoRetryPanel::ErrorMsg' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_GoRetryPanel, bUseDefaultMsg) == 0x000018, "Member 'WBP_LoginFlow_PF_C_GoRetryPanel::bUseDefaultMsg' has a wrong offset!");

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.HandleLinkedFailure
// 0x0058 (0x0058 - 0x0000)
struct WBP_LoginFlow_PF_C_HandleLinkedFailure final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopupLinkSuccess_PF_C*             CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPasswordChangeRequired_IsRequired;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0038(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginFlow_PF_C_HandleLinkedFailure) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_HandleLinkedFailure");
static_assert(sizeof(WBP_LoginFlow_PF_C_HandleLinkedFailure) == 0x000058, "Wrong size on WBP_LoginFlow_PF_C_HandleLinkedFailure");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLinkedFailure, ErrorMessage) == 0x000000, "Member 'WBP_LoginFlow_PF_C_HandleLinkedFailure::ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLinkedFailure, ErrorCode) == 0x000010, "Member 'WBP_LoginFlow_PF_C_HandleLinkedFailure::ErrorCode' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLinkedFailure, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_LoginFlow_PF_C_HandleLinkedFailure::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLinkedFailure, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_LoginFlow_PF_C_HandleLinkedFailure::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLinkedFailure, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000028, "Member 'WBP_LoginFlow_PF_C_HandleLinkedFailure::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLinkedFailure, CallFunc_IsPasswordChangeRequired_IsRequired) == 0x000030, "Member 'WBP_LoginFlow_PF_C_HandleLinkedFailure::CallFunc_IsPasswordChangeRequired_IsRequired' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLinkedFailure, CallFunc_Map_Find_Value) == 0x000038, "Member 'WBP_LoginFlow_PF_C_HandleLinkedFailure::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLinkedFailure, CallFunc_Map_Find_ReturnValue) == 0x000050, "Member 'WBP_LoginFlow_PF_C_HandleLinkedFailure::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLinkedFailure, CallFunc_Not_PreBool_ReturnValue) == 0x000051, "Member 'WBP_LoginFlow_PF_C_HandleLinkedFailure::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.HandleLoggedInFailure
// 0x0050 (0x0050 - 0x0000)
struct WBP_LoginFlow_PF_C_HandleLoggedInFailure final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IncorrectPasswordCode;                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPasswordChangeRequired_IsRequired;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4E[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0020(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4F[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginFlow_PF_C_HandleLoggedInFailure) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_HandleLoggedInFailure");
static_assert(sizeof(WBP_LoginFlow_PF_C_HandleLoggedInFailure) == 0x000050, "Wrong size on WBP_LoginFlow_PF_C_HandleLoggedInFailure");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLoggedInFailure, ErrorMessage) == 0x000000, "Member 'WBP_LoginFlow_PF_C_HandleLoggedInFailure::ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLoggedInFailure, ErrorCode) == 0x000010, "Member 'WBP_LoginFlow_PF_C_HandleLoggedInFailure::ErrorCode' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLoggedInFailure, IncorrectPasswordCode) == 0x000014, "Member 'WBP_LoginFlow_PF_C_HandleLoggedInFailure::IncorrectPasswordCode' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLoggedInFailure, CallFunc_IsPasswordChangeRequired_IsRequired) == 0x000018, "Member 'WBP_LoginFlow_PF_C_HandleLoggedInFailure::CallFunc_IsPasswordChangeRequired_IsRequired' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLoggedInFailure, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'WBP_LoginFlow_PF_C_HandleLoggedInFailure::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLoggedInFailure, CallFunc_Map_Find_Value) == 0x000020, "Member 'WBP_LoginFlow_PF_C_HandleLoggedInFailure::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLoggedInFailure, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'WBP_LoginFlow_PF_C_HandleLoggedInFailure::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLoggedInFailure, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'WBP_LoginFlow_PF_C_HandleLoggedInFailure::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLoggedInFailure, CallFunc_GetActiveWidget_ReturnValue) == 0x000040, "Member 'WBP_LoginFlow_PF_C_HandleLoggedInFailure::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_HandleLoggedInFailure, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'WBP_LoginFlow_PF_C_HandleLoggedInFailure::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.IsPasswordChangeRequired
// 0x0038 (0x0038 - 0x0000)
struct WBP_LoginFlow_PF_C_IsPasswordChangeRequired final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C50[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsRequired;                                        // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C51[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PasswordChangeRequiredMessage;                     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         PasswordChangeRequiredCode;                        // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginFlow_PF_C_IsPasswordChangeRequired) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_IsPasswordChangeRequired");
static_assert(sizeof(WBP_LoginFlow_PF_C_IsPasswordChangeRequired) == 0x000038, "Wrong size on WBP_LoginFlow_PF_C_IsPasswordChangeRequired");
static_assert(offsetof(WBP_LoginFlow_PF_C_IsPasswordChangeRequired, Code) == 0x000000, "Member 'WBP_LoginFlow_PF_C_IsPasswordChangeRequired::Code' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_IsPasswordChangeRequired, Message) == 0x000008, "Member 'WBP_LoginFlow_PF_C_IsPasswordChangeRequired::Message' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_IsPasswordChangeRequired, IsRequired) == 0x000018, "Member 'WBP_LoginFlow_PF_C_IsPasswordChangeRequired::IsRequired' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_IsPasswordChangeRequired, PasswordChangeRequiredMessage) == 0x000020, "Member 'WBP_LoginFlow_PF_C_IsPasswordChangeRequired::PasswordChangeRequiredMessage' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_IsPasswordChangeRequired, PasswordChangeRequiredCode) == 0x000030, "Member 'WBP_LoginFlow_PF_C_IsPasswordChangeRequired::PasswordChangeRequiredCode' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_IsPasswordChangeRequired, CallFunc_Contains_ReturnValue) == 0x000034, "Member 'WBP_LoginFlow_PF_C_IsPasswordChangeRequired::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_IsPasswordChangeRequired, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000035, "Member 'WBP_LoginFlow_PF_C_IsPasswordChangeRequired::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_IsPasswordChangeRequired, CallFunc_BooleanAND_ReturnValue) == 0x000036, "Member 'WBP_LoginFlow_PF_C_IsPasswordChangeRequired::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.OnStartButtonNavigation
// 0x0010 (0x0010 - 0x0000)
struct WBP_LoginFlow_PF_C_OnStartButtonNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C52[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginFlow_PF_C_OnStartButtonNavigation) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_OnStartButtonNavigation");
static_assert(sizeof(WBP_LoginFlow_PF_C_OnStartButtonNavigation) == 0x000010, "Wrong size on WBP_LoginFlow_PF_C_OnStartButtonNavigation");
static_assert(offsetof(WBP_LoginFlow_PF_C_OnStartButtonNavigation, Param_Navigation) == 0x000000, "Member 'WBP_LoginFlow_PF_C_OnStartButtonNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_OnStartButtonNavigation, ReturnValue) == 0x000008, "Member 'WBP_LoginFlow_PF_C_OnStartButtonNavigation::ReturnValue' has a wrong offset!");

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.ToggleOptions
// 0x0018 (0x0018 - 0x0000)
struct WBP_LoginFlow_PF_C_ToggleOptions final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsPanel_PF_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginFlow_PF_C_ToggleOptions) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_ToggleOptions");
static_assert(sizeof(WBP_LoginFlow_PF_C_ToggleOptions) == 0x000018, "Wrong size on WBP_LoginFlow_PF_C_ToggleOptions");
static_assert(offsetof(WBP_LoginFlow_PF_C_ToggleOptions, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_LoginFlow_PF_C_ToggleOptions::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ToggleOptions, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_LoginFlow_PF_C_ToggleOptions::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_ToggleOptions, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'WBP_LoginFlow_PF_C_ToggleOptions::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.UpdateBuildVersion
// 0x0028 (0x0028 - 0x0000)
struct WBP_LoginFlow_PF_C_UpdateBuildVersion final
{
public:
	class FString                                 CallFunc_GetVersionString_ReturnValue;             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_LoginFlow_PF_C_UpdateBuildVersion) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_UpdateBuildVersion");
static_assert(sizeof(WBP_LoginFlow_PF_C_UpdateBuildVersion) == 0x000028, "Wrong size on WBP_LoginFlow_PF_C_UpdateBuildVersion");
static_assert(offsetof(WBP_LoginFlow_PF_C_UpdateBuildVersion, CallFunc_GetVersionString_ReturnValue) == 0x000000, "Member 'WBP_LoginFlow_PF_C_UpdateBuildVersion::CallFunc_GetVersionString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginFlow_PF_C_UpdateBuildVersion, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_LoginFlow_PF_C_UpdateBuildVersion::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_LoginFlow_PF.WBP_LoginFlow_PF_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoginFlow_PF_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginFlow_PF_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_LoginFlow_PF_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_LoginFlow_PF_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_LoginFlow_PF_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_LoginFlow_PF_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_LoginFlow_PF_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

