#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerCharacterProfileImage_CM

#include "Basic.hpp"

#include "ValeriaDTOs_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "S6Core_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_BndEvt__WBP_PlayerCharacterProfileImage_CM_PortraitButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.Can Open Platform Tooltips
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXSXPlatform_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A2[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue;         // 0x0018(0x00B0)()
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips) == 0x0000D0, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, ReturnValue) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, CallFunc_IsXSXPlatform_ReturnValue) == 0x000010, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::CallFunc_IsXSXPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, CallFunc_IsPS5Platform_ReturnValue) == 0x000011, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::CallFunc_IsPS5Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, CallFunc_GetPresenceForUserId_ReturnValue) == 0x000018, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::CallFunc_GetPresenceForUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, CallFunc_GetPlatformType_ReturnValue) == 0x0000C8, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000C9, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000CA, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, CallFunc_BooleanAND_ReturnValue) == 0x0000CB, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, CallFunc_BooleanAND_ReturnValue_1) == 0x0000CC, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips, CallFunc_BooleanAND_ReturnValue_2) == 0x0000CD, "Member 'WBP_PlayerCharacterProfileImage_CM_C_Can_Open_Platform_Tooltips::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM
// 0x03A0 (0x03A0 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVALDTOS_MetaCharacterFormat>   Temp_struct_Variable;                              // 0x0008(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A4[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVALDTOS_MetaCharacterFormat>   K2Node_CustomEvent_CharactersFound;                // 0x0040(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(TArray<struct FVALDTOS_MetaCharacterFormat>& CharactersFound)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_Copy_ReturnValue;                           // 0x0060(0x00D0)()
	struct FSlateBrush                            K2Node_SetFieldsInStruct_StructOut;                // 0x0130(0x00D0)()
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0220(0x0008)(NoDestructor)
	class UVAL_BpAsyncAction_GetMetaCharacterData* CallFunc_GetMetaCharacterData_ReturnValue;         // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A5[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0234(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A6[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0270(0x0078)(ConstParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x02F0(0x0078)(ConstParm)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Open_Platform_Tooltips_ReturnValue;   // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A7[0x6];                                     // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A8[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PlatformPlayerNameToolTip_C*       CallFunc_Create_ReturnValue;                       // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_SetFieldsInStruct_ImageSize_ImplicitCast;   // 0x0390(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM) == 0x000010, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM) == 0x0003A0, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, EntryPoint) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, Temp_struct_Variable) == 0x000008, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_Event_IsDesignTime) == 0x00002D, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_BreakVector2D_X) == 0x000030, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_CustomEvent_CharactersFound) == 0x000040, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_CustomEvent_CharactersFound' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_Copy_ReturnValue) == 0x000060, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_Copy_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_SetFieldsInStruct_StructOut) == 0x000130, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000200, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000204, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000208, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000210, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_ComponentBoundEvent_Button) == 0x000218, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_Event_InFocusEvent) == 0x000220, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_GetMetaCharacterData_ReturnValue) == 0x000228, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_GetMetaCharacterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_IsValid_ReturnValue) == 0x000230, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_Event_MyGeometry) == 0x000234, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_Event_MouseEvent_1) == 0x000270, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_AddChild_ReturnValue) == 0x0002E8, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_Event_MouseEvent) == 0x0002F0, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_IsOpen_ReturnValue) == 0x000368, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_Can_Open_Platform_Tooltips_ReturnValue) == 0x000369, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_Can_Open_Platform_Tooltips_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x000370, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_IsValid_ReturnValue_1) == 0x000378, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_Create_ReturnValue) == 0x000380, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000388, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00038C, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM, K2Node_SetFieldsInStruct_ImageSize_ImplicitCast) == 0x000390, "Member 'WBP_PlayerCharacterProfileImage_CM_C_ExecuteUbergraph_WBP_PlayerCharacterProfileImage_CM::K2Node_SetFieldsInStruct_ImageSize_ImplicitCast' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.HandleCharacterDataReceived
// 0x0780 (0x0780 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived final
{
public:
	struct FVALDTOS_MetaCharacterFormat           Character;                                         // 0x0000(0x0778)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_CharacterCustomizationOptions_EqualEqual_ReturnValue; // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CharacterCreationOptions_EqualEqual_ReturnValue; // 0x0779(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x077A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue;          // 0x077B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x077C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived) == 0x000780, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived, Character) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived::Character' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived, CallFunc_CharacterCustomizationOptions_EqualEqual_ReturnValue) == 0x000778, "Member 'WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived::CallFunc_CharacterCustomizationOptions_EqualEqual_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived, CallFunc_CharacterCreationOptions_EqualEqual_ReturnValue) == 0x000779, "Member 'WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived::CallFunc_CharacterCreationOptions_EqualEqual_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived, CallFunc_BooleanAND_ReturnValue) == 0x00077A, "Member 'WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived, CallFunc_EqualEqual_GuidGuid_ReturnValue) == 0x00077B, "Member 'WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived::CallFunc_EqualEqual_GuidGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived, CallFunc_Not_PreBool_ReturnValue) == 0x00077C, "Member 'WBP_PlayerCharacterProfileImage_CM_C_HandleCharacterDataReceived::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.HandleRenderHeadPreviewComplete
// 0x0028 (0x0028 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete final
{
public:
	class AVAL_CharacterPreviewer*                CharacterPreviewer;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  RequestID;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 PreviewTexture;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete) == 0x000028, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete, CharacterPreviewer) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete::CharacterPreviewer' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete, RequestID) == 0x000008, "Member 'WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete::RequestID' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete, PreviewTexture) == 0x000018, "Member 'WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete::PreviewTexture' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete, CallFunc_EqualEqual_GuidGuid_ReturnValue) == 0x000020, "Member 'WBP_PlayerCharacterProfileImage_CM_C_HandleRenderHeadPreviewComplete::CallFunc_EqualEqual_GuidGuid_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.InitializeMID
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_InitializeMID final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_InitializeMID) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_InitializeMID");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_InitializeMID) == 0x000010, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_InitializeMID");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_InitializeMID, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_InitializeMID::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_InitializeMID, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_PlayerCharacterProfileImage_CM_C_InitializeMID::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_InitializeMID, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'WBP_PlayerCharacterProfileImage_CM_C_InitializeMID::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.On_PlatformNameToolTipsMenuAnchor_GetUserMenuContent
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_On_PlatformNameToolTipsMenuAnchor_GetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_On_PlatformNameToolTipsMenuAnchor_GetUserMenuContent) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_On_PlatformNameToolTipsMenuAnchor_GetUserMenuContent");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_On_PlatformNameToolTipsMenuAnchor_GetUserMenuContent) == 0x000008, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_On_PlatformNameToolTipsMenuAnchor_GetUserMenuContent");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_On_PlatformNameToolTipsMenuAnchor_GetUserMenuContent, ReturnValue) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_On_PlatformNameToolTipsMenuAnchor_GetUserMenuContent::ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_OnFocusLost");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_OnFocusLost");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_PlayerCharacterProfileImage_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_OnMouseEnter");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_OnMouseEnter");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_PlayerCharacterProfileImage_CM_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_OnMouseLeave");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_OnMouseLeave");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.OnProfileImageClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_OnProfileImageClicked__DelegateSignature final
{
public:
	class UWBP_PlayerCharacterProfileImage_CM_C*  PlayerCharacterImageWidget;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_OnProfileImageClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_OnProfileImageClicked__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_OnProfileImageClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_OnProfileImageClicked__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_OnProfileImageClicked__DelegateSignature, PlayerCharacterImageWidget) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_OnProfileImageClicked__DelegateSignature::PlayerCharacterImageWidget' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.OnSuccess_CC988C3F41D6817A67D51D9348CA7AAE
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_OnSuccess_CC988C3F41D6817A67D51D9348CA7AAE final
{
public:
	TArray<struct FVALDTOS_MetaCharacterFormat>   CharactersFound;                                   // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_OnSuccess_CC988C3F41D6817A67D51D9348CA7AAE) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_OnSuccess_CC988C3F41D6817A67D51D9348CA7AAE");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_OnSuccess_CC988C3F41D6817A67D51D9348CA7AAE) == 0x000010, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_OnSuccess_CC988C3F41D6817A67D51D9348CA7AAE");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_OnSuccess_CC988C3F41D6817A67D51D9348CA7AAE, CharactersFound) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_OnSuccess_CC988C3F41D6817A67D51D9348CA7AAE::CharactersFound' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_PreConstruct");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_PreConstruct");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.SetAccount
// 0x0014 (0x0014 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_SetAccount final
{
public:
	struct FGuid                                  Param_AccountId;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_DebugRandomizePortrait;                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_SetAccount) == 0x000004, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_SetAccount");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_SetAccount) == 0x000014, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_SetAccount");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_SetAccount, Param_AccountId) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_SetAccount::Param_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_SetAccount, Param_DebugRandomizePortrait) == 0x000010, "Member 'WBP_PlayerCharacterProfileImage_CM_C_SetAccount::Param_DebugRandomizePortrait' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_SetAccount, CallFunc_EqualEqual_GuidGuid_ReturnValue) == 0x000011, "Member 'WBP_PlayerCharacterProfileImage_CM_C_SetAccount::CallFunc_EqualEqual_GuidGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_SetAccount, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'WBP_PlayerCharacterProfileImage_CM_C_SetAccount::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.SetUser
// 0x0048 (0x0048 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_SetUser final
{
public:
	struct FUniqueNetIdRepl                       Param_UserId;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Param_DebugRandomizePortrait;                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A9[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_SetUser) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_SetUser");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_SetUser) == 0x000048, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_SetUser");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_SetUser, Param_UserId) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_SetUser::Param_UserId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_SetUser, Param_DebugRandomizePortrait) == 0x000030, "Member 'WBP_PlayerCharacterProfileImage_CM_C_SetUser::Param_DebugRandomizePortrait' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_SetUser, CallFunc_GetAccountId_ReturnValue) == 0x000034, "Member 'WBP_PlayerCharacterProfileImage_CM_C_SetUser::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterProfileImage_CM.WBP_PlayerCharacterProfileImage_CM_C.UpdateFromMetaCharacterFormat
// 0x3D60 (0x3D60 - 0x0000)
struct WBP_PlayerCharacterProfileImage_CM_C_UpdateFromMetaCharacterFormat final
{
public:
	struct FVAL_RenderHeadPreviewParameters       RenderHeadParams;                                  // 0x0000(0x0900)(Edit, BlueprintVisible)
	struct FVAL_CharacterCustomizationLoadout     CallFunc_CreateRandomLoadout_ReturnValue;          // 0x0900(0x0900)()
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Volatile CallFunc_LoadoutToPersistenceDTO_Volatile_ReturnValue; // 0x1200(0x0480)()
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Stable CallFunc_LoadoutToPersistenceDTO_Stable_ReturnValue; // 0x1680(0x02B8)()
	struct FVAL_CharacterCustomizationLoadout     CallFunc_PersistenceDTOsToLoadout_ReturnValue;     // 0x1938(0x0900)()
	struct FVAL_RenderHeadPreviewParameters       K2Node_MakeStruct_VAL_RenderHeadPreviewParameters; // 0x2238(0x0900)()
	class AVAL_CharacterPreviewer*                CallFunc_GetCharacterPreviewer_ReturnValue;        // 0x2B38(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_CharacterPreviewer* CharacterPreviewer, const struct FGuid& RequestID, class UTextureRenderTarget2D* PreviewTexture)> K2Node_CreateDelegate_OutputDelegate;              // 0x2B40(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x2B50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55AA[0x7];                                     // 0x2B51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_CharacterPreviewer*                CallFunc_GetCharacterPreviewer_ReturnValue_1;      // 0x2B58(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationLoadout     CallFunc_PersistenceDTOsToLoadout_ReturnValue_1;   // 0x2B60(0x0900)()
	struct FVAL_RenderHeadPreviewParameters       K2Node_MakeStruct_VAL_RenderHeadPreviewParameters_1; // 0x3460(0x0900)()
};
static_assert(alignof(WBP_PlayerCharacterProfileImage_CM_C_UpdateFromMetaCharacterFormat) == 0x000008, "Wrong alignment on WBP_PlayerCharacterProfileImage_CM_C_UpdateFromMetaCharacterFormat");
static_assert(sizeof(WBP_PlayerCharacterProfileImage_CM_C_UpdateFromMetaCharacterFormat) == 0x003D60, "Wrong size on WBP_PlayerCharacterProfileImage_CM_C_UpdateFromMetaCharacterFormat");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_UpdateFromMetaCharacterFormat, RenderHeadParams) == 0x000000, "Member 'WBP_PlayerCharacterProfileImage_CM_C_UpdateFromMetaCharacterFormat::RenderHeadParams' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterProfileImage_CM_C_UpdateFromMetaCharacterFormat, CallFunc_CreateRandomLoadout_ReturnValue) == 0x000900, "Member 'WBP_PlayerCharacterProfileImage_CM_C_UpdateFromMetaCharacterFormat::CallFunc_CreateRandomLoadout_ReturnValue' has a wrong offset!");
