#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CreditsScreen_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CreditsScreen_CM.WBP_CreditsScreen_CM_C
// 0x0058 (0x0318 - 0x02C0)
class UWBP_CreditsScreen_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_RichTextBlock_Styled*            CreditsTextBlock;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ScrollBox_Styled*                ScrollBox;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Icon_CM_C*                  WBP_Button_Icon_CM;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnThankYouClicked;                                 // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        ScrollOffset;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CreditScrollSpeed;                                 // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CreditsFileName;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_CreditsScreen_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WBP_CreditsScreen_CM(int32 EntryPoint, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, const class FString& CallFunc_GetProjectContentDirectory_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, class FText CallFunc_LoadFileToText_OutputText, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, float CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast);
	void OnThankYouClicked__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CreditsScreen_CM_C">();
	}
	static class UWBP_CreditsScreen_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CreditsScreen_CM_C>();
	}
};
static_assert(alignof(UWBP_CreditsScreen_CM_C) == 0x000008, "Wrong alignment on UWBP_CreditsScreen_CM_C");
static_assert(sizeof(UWBP_CreditsScreen_CM_C) == 0x000318, "Wrong size on UWBP_CreditsScreen_CM_C");
static_assert(offsetof(UWBP_CreditsScreen_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_CreditsScreen_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_CM_C, Background) == 0x0002C8, "Member 'UWBP_CreditsScreen_CM_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_CM_C, CreditsTextBlock) == 0x0002D0, "Member 'UWBP_CreditsScreen_CM_C::CreditsTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_CM_C, ScrollBox) == 0x0002D8, "Member 'UWBP_CreditsScreen_CM_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_CM_C, WBP_Button_Icon_CM) == 0x0002E0, "Member 'UWBP_CreditsScreen_CM_C::WBP_Button_Icon_CM' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_CM_C, OnThankYouClicked) == 0x0002E8, "Member 'UWBP_CreditsScreen_CM_C::OnThankYouClicked' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_CM_C, ScrollOffset) == 0x0002F8, "Member 'UWBP_CreditsScreen_CM_C::ScrollOffset' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_CM_C, CreditScrollSpeed) == 0x000300, "Member 'UWBP_CreditsScreen_CM_C::CreditScrollSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_CM_C, CreditsFileName) == 0x000308, "Member 'UWBP_CreditsScreen_CM_C::CreditsFileName' has a wrong offset!");

}

