#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_PopupSecondary_02_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Template_PopupSecondary_02_CM.WBP_Template_PopupSecondary_02_CM_C
// 0x0100 (0x03C0 - 0x02C0)
class UWBP_Template_PopupSecondary_02_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Primary_Confirm_CM;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Secondary_01_CM_C* Button_Secondary_Cancel_CM;                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Buttons;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Body;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopBacker_02_C*                    WBP_TopBacker_Popup;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Cancel;                                            // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Confirm;                                           // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Primary_Button_Text;                               // 0x0310(0x0018)(Edit, BlueprintVisible)
	class FText                                   SecondaryButtonText;                               // 0x0328(0x0018)(Edit, BlueprintVisible)
	class FText                                   HeaderText;                                        // 0x0340(0x0018)(Edit, BlueprintVisible)
	bool                                          OnlyConfirm;                                       // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoButtons;                                         // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47D6[0x2];                                     // 0x035A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                ContentPadding;                                    // 0x035C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47D7[0x4];                                     // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ButtonConfirmStyleOverride;                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ButtonCancelStyleOverride;                         // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  TextStyle_ButtonPrimary;                           // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  TextStyle_ButtonPrimaryPressed;                    // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Button_Confirm_Click_Override;                  // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Button_Cancel_Click_Override;                   // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Button_Cancel_Hover_Override;                   // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Button_Confirm_Hover_Override;                  // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Popup_Construct;                                // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkButton_Confirm_Unhover;                          // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Template_PopupSecondary_02_CM_Button_Primary_Confirm_K2Node_ComponentBoundEvent_7_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_Template_PopupSecondary_02_CM_Button_Primary_Confirm_K2Node_ComponentBoundEvent_8_ButtonHovered__DelegateSignature();
	void BndEvt__WBP_Template_PopupSecondary_02_CM_Button_Primary_Confirm_K2Node_ComponentBoundEvent_9_ButtonUnhovered__DelegateSignature();
	void BndEvt__WBP_Template_PopupSecondary_02_CM_Button_Secondary_Cancel_K2Node_ComponentBoundEvent_5_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_Template_PopupSecondary_02_CM_Button_Secondary_Cancel_K2Node_ComponentBoundEvent_6_OnButtonHovered__DelegateSignature();
	void Cancel__DelegateSignature();
	void Confirm__DelegateSignature();
	void ExecuteUbergraph_WBP_Template_PopupSecondary_02_CM(int32 EntryPoint, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, bool K2Node_Event_IsDesignTime, ESlateVisibility K2Node_Select_Default, class UVerticalBoxSlot* CallFunc_SlotAsVerticalBoxSlot_ReturnValue, bool CallFunc_IsValid_ReturnValue_4, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool Temp_bool_Variable_1, ESlateVisibility K2Node_Select_Default_1);
	void PreConstruct(bool IsDesignTime);
	void SetConfirmEnabled(bool bEnable);
	void SetHeaderText(class FText Param_HeaderText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Template_PopupSecondary_02_CM_C">();
	}
	static class UWBP_Template_PopupSecondary_02_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Template_PopupSecondary_02_CM_C>();
	}
};
static_assert(alignof(UWBP_Template_PopupSecondary_02_CM_C) == 0x000008, "Wrong alignment on UWBP_Template_PopupSecondary_02_CM_C");
static_assert(sizeof(UWBP_Template_PopupSecondary_02_CM_C) == 0x0003C0, "Wrong size on UWBP_Template_PopupSecondary_02_CM_C");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Template_PopupSecondary_02_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, Button_Primary_Confirm_CM) == 0x0002C8, "Member 'UWBP_Template_PopupSecondary_02_CM_C::Button_Primary_Confirm_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, Button_Secondary_Cancel_CM) == 0x0002D0, "Member 'UWBP_Template_PopupSecondary_02_CM_C::Button_Secondary_Cancel_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, Buttons) == 0x0002D8, "Member 'UWBP_Template_PopupSecondary_02_CM_C::Buttons' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, NamedSlot_Body) == 0x0002E0, "Member 'UWBP_Template_PopupSecondary_02_CM_C::NamedSlot_Body' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, WBP_TopBacker_Popup) == 0x0002E8, "Member 'UWBP_Template_PopupSecondary_02_CM_C::WBP_TopBacker_Popup' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, Cancel) == 0x0002F0, "Member 'UWBP_Template_PopupSecondary_02_CM_C::Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, Confirm) == 0x000300, "Member 'UWBP_Template_PopupSecondary_02_CM_C::Confirm' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, Primary_Button_Text) == 0x000310, "Member 'UWBP_Template_PopupSecondary_02_CM_C::Primary_Button_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, SecondaryButtonText) == 0x000328, "Member 'UWBP_Template_PopupSecondary_02_CM_C::SecondaryButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, HeaderText) == 0x000340, "Member 'UWBP_Template_PopupSecondary_02_CM_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, OnlyConfirm) == 0x000358, "Member 'UWBP_Template_PopupSecondary_02_CM_C::OnlyConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, NoButtons) == 0x000359, "Member 'UWBP_Template_PopupSecondary_02_CM_C::NoButtons' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, ContentPadding) == 0x00035C, "Member 'UWBP_Template_PopupSecondary_02_CM_C::ContentPadding' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, ButtonConfirmStyleOverride) == 0x000370, "Member 'UWBP_Template_PopupSecondary_02_CM_C::ButtonConfirmStyleOverride' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, ButtonCancelStyleOverride) == 0x000378, "Member 'UWBP_Template_PopupSecondary_02_CM_C::ButtonCancelStyleOverride' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, TextStyle_ButtonPrimary) == 0x000380, "Member 'UWBP_Template_PopupSecondary_02_CM_C::TextStyle_ButtonPrimary' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, TextStyle_ButtonPrimaryPressed) == 0x000388, "Member 'UWBP_Template_PopupSecondary_02_CM_C::TextStyle_ButtonPrimaryPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, Ak_Button_Confirm_Click_Override) == 0x000390, "Member 'UWBP_Template_PopupSecondary_02_CM_C::Ak_Button_Confirm_Click_Override' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, Ak_Button_Cancel_Click_Override) == 0x000398, "Member 'UWBP_Template_PopupSecondary_02_CM_C::Ak_Button_Cancel_Click_Override' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, Ak_Button_Cancel_Hover_Override) == 0x0003A0, "Member 'UWBP_Template_PopupSecondary_02_CM_C::Ak_Button_Cancel_Hover_Override' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, Ak_Button_Confirm_Hover_Override) == 0x0003A8, "Member 'UWBP_Template_PopupSecondary_02_CM_C::Ak_Button_Confirm_Hover_Override' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, Ak_Popup_Construct) == 0x0003B0, "Member 'UWBP_Template_PopupSecondary_02_CM_C::Ak_Popup_Construct' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_CM_C, AkButton_Confirm_Unhover) == 0x0003B8, "Member 'UWBP_Template_PopupSecondary_02_CM_C::AkButton_Confirm_Unhover' has a wrong offset!");

}

