#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuHub_Console

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MenuHubListEntryStruct_structs.hpp"
#include "MenuHubOtherMenuType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.Allow Cheats
// 0x0018 (0x0018 - 0x0000)
struct WBP_MenuHub_Console_C_Allow_Cheats final
{
public:
	bool                                          Allowed;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BuildIsShipping_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C6[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreCheatsEnabled_Result;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_Allow_Cheats) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_Allow_Cheats");
static_assert(sizeof(WBP_MenuHub_Console_C_Allow_Cheats) == 0x000018, "Wrong size on WBP_MenuHub_Console_C_Allow_Cheats");
static_assert(offsetof(WBP_MenuHub_Console_C_Allow_Cheats, Allowed) == 0x000000, "Member 'WBP_MenuHub_Console_C_Allow_Cheats::Allowed' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Allow_Cheats, CallFunc_BuildIsShipping_ReturnValue) == 0x000001, "Member 'WBP_MenuHub_Console_C_Allow_Cheats::CallFunc_BuildIsShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Allow_Cheats, CallFunc_GetValeriaCharacter_OutResult) == 0x000002, "Member 'WBP_MenuHub_Console_C_Allow_Cheats::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Allow_Cheats, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_MenuHub_Console_C_Allow_Cheats::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Allow_Cheats, CallFunc_AreCheatsEnabled_Result) == 0x000010, "Member 'WBP_MenuHub_Console_C_Allow_Cheats::CallFunc_AreCheatsEnabled_Result' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Allow_Cheats, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WBP_MenuHub_Console_C_Allow_Cheats::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Allow_Cheats, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'WBP_MenuHub_Console_C_Allow_Cheats::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Allow_Cheats, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'WBP_MenuHub_Console_C_Allow_Cheats::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_HousingMenusTileGroup_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_10_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_10_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_10_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_10_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_10_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_10_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_10_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_10_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_10_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_10_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_9_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_9_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_9_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_9_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_9_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_9_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_9_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_9_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_9_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_OtherMenusTileGroup_K2Node_ComponentBoundEvent_9_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_PlayerMenusTileGroup_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_SocialMenusTileGroup_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.BndEvt__WBP_MenuHub_Console_StoreMenusTileGroup_K2Node_ComponentBoundEvent_7_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_StoreMenusTileGroup_K2Node_ComponentBoundEvent_7_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_StoreMenusTileGroup_K2Node_ComponentBoundEvent_7_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_StoreMenusTileGroup_K2Node_ComponentBoundEvent_7_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_StoreMenusTileGroup_K2Node_ComponentBoundEvent_7_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_StoreMenusTileGroup_K2Node_ComponentBoundEvent_7_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_StoreMenusTileGroup_K2Node_ComponentBoundEvent_7_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_StoreMenusTileGroup_K2Node_ComponentBoundEvent_7_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_StoreMenusTileGroup_K2Node_ComponentBoundEvent_7_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_MenuHub_Console_C_BndEvt__WBP_MenuHub_Console_StoreMenusTileGroup_K2Node_ComponentBoundEvent_7_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_MenuHub_Console_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_MenuHub_Console_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_MenuHub_Console_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_MenuHub_Console_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_MenuHub_Console_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_MenuHub_Console_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.CheckEventAvailability
// 0x0178 (0x0178 - 0x0000)
struct WBP_MenuHub_Console_C_CheckEventAvailability final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C7[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C8[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C9[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULimitedEventSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyEventActive_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44CA[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuHubListEntryStruct                CallFunc_Array_Get_Item;                           // 0x0028(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44CB[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuHubListEntryStruct                K2Node_MakeStruct_MenuHubListEntryStruct;          // 0x0098(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44CC[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuHubListEntryStruct                K2Node_SetFieldsInStruct_StructOut;                // 0x0108(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_CheckEventAvailability) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_CheckEventAvailability");
static_assert(sizeof(WBP_MenuHub_Console_C_CheckEventAvailability) == 0x000178, "Wrong size on WBP_MenuHub_Console_C_CheckEventAvailability");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000018, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, CallFunc_IsAnyEventActive_ReturnValue) == 0x000020, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::CallFunc_IsAnyEventActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, CallFunc_Not_PreBool_ReturnValue_1) == 0x000090, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, K2Node_MakeStruct_MenuHubListEntryStruct) == 0x000098, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::K2Node_MakeStruct_MenuHubListEntryStruct' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000100, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, K2Node_SetFieldsInStruct_StructOut) == 0x000108, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, CallFunc_Array_Length_ReturnValue) == 0x000170, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, CallFunc_Less_IntInt_ReturnValue) == 0x000174, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CheckEventAvailability, CallFunc_BooleanAND_ReturnValue) == 0x000175, "Member 'WBP_MenuHub_Console_C_CheckEventAvailability::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.Close Self
// 0x0040 (0x0040 - 0x0000)
struct WBP_MenuHub_Console_C_Close_Self final
{
public:
	TArray<EVAL_CharacterRenderStudioState>       K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharacterCustomManager*                CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_CharacterRenderStudio*             CallFunc_GetCharacterRenderStudio_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EVAL_CharacterRenderStudioState               CallFunc_GetRenderStudioState_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_Close_Self) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_Close_Self");
static_assert(sizeof(WBP_MenuHub_Console_C_Close_Self) == 0x000040, "Wrong size on WBP_MenuHub_Console_C_Close_Self");
static_assert(offsetof(WBP_MenuHub_Console_C_Close_Self, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_MenuHub_Console_C_Close_Self::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Close_Self, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_MenuHub_Console_C_Close_Self::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Close_Self, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000018, "Member 'WBP_MenuHub_Console_C_Close_Self::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Close_Self, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_MenuHub_Console_C_Close_Self::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Close_Self, CallFunc_GetCharacterRenderStudio_ReturnValue) == 0x000028, "Member 'WBP_MenuHub_Console_C_Close_Self::CallFunc_GetCharacterRenderStudio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Close_Self, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000030, "Member 'WBP_MenuHub_Console_C_Close_Self::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Close_Self, CallFunc_GetRenderStudioState_ReturnValue) == 0x000038, "Member 'WBP_MenuHub_Console_C_Close_Self::CallFunc_GetRenderStudioState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_Close_Self, CallFunc_Array_Contains_ReturnValue) == 0x000039, "Member 'WBP_MenuHub_Console_C_Close_Self::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.CreateHousingMenus
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_MenuHub_Console_C_CreateHousingMenus final
{
public:
	TArray<class UBP_ListEntry_MenuHub_C*>        ListEntries;                                       // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_on_Occupied_Housing_Plot_ReturnValue;  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44CD[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ListEntry_MenuHub_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuHubListEntryStruct                CallFunc_Array_Get_Item;                           // 0x0028(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsMenuHidden_Hidden;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44CE[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44CF[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_CreateHousingMenus) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_CreateHousingMenus");
static_assert(sizeof(WBP_MenuHub_Console_C_CreateHousingMenus) == 0x0000A0, "Wrong size on WBP_MenuHub_Console_C_CreateHousingMenus");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateHousingMenus, ListEntries) == 0x000000, "Member 'WBP_MenuHub_Console_C_CreateHousingMenus::ListEntries' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateHousingMenus, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_MenuHub_Console_C_CreateHousingMenus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateHousingMenus, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_MenuHub_Console_C_CreateHousingMenus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateHousingMenus, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_MenuHub_Console_C_CreateHousingMenus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateHousingMenus, CallFunc_Is_on_Occupied_Housing_Plot_ReturnValue) == 0x00001C, "Member 'WBP_MenuHub_Console_C_CreateHousingMenus::CallFunc_Is_on_Occupied_Housing_Plot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateHousingMenus, CallFunc_SpawnObject_ReturnValue) == 0x000020, "Member 'WBP_MenuHub_Console_C_CreateHousingMenus::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateHousingMenus, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MenuHub_Console_C_CreateHousingMenus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateHousingMenus, CallFunc_IsMenuHidden_Hidden) == 0x000090, "Member 'WBP_MenuHub_Console_C_CreateHousingMenus::CallFunc_IsMenuHidden_Hidden' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateHousingMenus, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'WBP_MenuHub_Console_C_CreateHousingMenus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateHousingMenus, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'WBP_MenuHub_Console_C_CreateHousingMenus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateHousingMenus, CallFunc_Array_Add_ReturnValue) == 0x00009C, "Member 'WBP_MenuHub_Console_C_CreateHousingMenus::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.CreatePlayerMenus
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_MenuHub_Console_C_CreatePlayerMenus final
{
public:
	TArray<class UBP_ListEntry_MenuHub_C*>        ListEntries;                                       // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D0[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ListEntry_MenuHub_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMenuHubListEntryStruct                CallFunc_Array_Get_Item;                           // 0x0030(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerMenuAllowed_Allowed;              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMenuHidden_Hidden;                      // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_CreatePlayerMenus) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_CreatePlayerMenus");
static_assert(sizeof(WBP_MenuHub_Console_C_CreatePlayerMenus) == 0x0000A0, "Wrong size on WBP_MenuHub_Console_C_CreatePlayerMenus");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, ListEntries) == 0x000000, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::ListEntries' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, CallFunc_SpawnObject_ReturnValue) == 0x000020, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, CallFunc_IsPlayerMenuAllowed_Allowed) == 0x000099, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::CallFunc_IsPlayerMenuAllowed_Allowed' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, CallFunc_IsMenuHidden_Hidden) == 0x00009A, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::CallFunc_IsMenuHidden_Hidden' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, CallFunc_Not_PreBool_ReturnValue) == 0x00009B, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreatePlayerMenus, CallFunc_BooleanAND_ReturnValue) == 0x00009C, "Member 'WBP_MenuHub_Console_C_CreatePlayerMenus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.CreateStandardMenus
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_MenuHub_Console_C_CreateStandardMenus final
{
public:
	TArray<struct FMenuHubListEntryStruct>        Data;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UCommonTileView*                        TileGroup;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_ListEntry_MenuHub_C*>        ListEntries;                                       // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D1[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuHubListEntryStruct                CallFunc_Array_Get_Item;                           // 0x0038(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsMenuHidden_Hidden;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D2[0x1];                                     // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ListEntry_MenuHub_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_CreateStandardMenus) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_CreateStandardMenus");
static_assert(sizeof(WBP_MenuHub_Console_C_CreateStandardMenus) == 0x0000B8, "Wrong size on WBP_MenuHub_Console_C_CreateStandardMenus");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, Data) == 0x000000, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::Data' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, TileGroup) == 0x000010, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::TileGroup' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, ListEntries) == 0x000018, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::ListEntries' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, CallFunc_IsMenuHidden_Hidden) == 0x0000A0, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::CallFunc_IsMenuHidden_Hidden' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, CallFunc_Less_IntInt_ReturnValue) == 0x0000A1, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, CallFunc_Not_PreBool_ReturnValue) == 0x0000A2, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, CallFunc_SpawnObject_ReturnValue) == 0x0000A8, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_CreateStandardMenus, CallFunc_Array_Add_ReturnValue) == 0x0000B0, "Member 'WBP_MenuHub_Console_C_CreateStandardMenus::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.DoCustomNavigation
// 0x0018 (0x0018 - 0x0000)
struct WBP_MenuHub_Console_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuHub_Console_C_DoCustomNavigation) == 0x000008, "Wrong alignment on WBP_MenuHub_Console_C_DoCustomNavigation");
static_assert(sizeof(WBP_MenuHub_Console_C_DoCustomNavigation) == 0x000018, "Wrong size on WBP_MenuHub_Console_C_DoCustomNavigation");
static_assert(offsetof(WBP_MenuHub_Console_C_DoCustomNavigation, Param_Navigation) == 0x000000, "Member 'WBP_MenuHub_Console_C_DoCustomNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_DoCustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_MenuHub_Console_C_DoCustomNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuHub_Console_C_DoCustomNavigation, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_MenuHub_Console_C_DoCustomNavigation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_MenuHub_Console.WBP_MenuHub_Console_C.ExecuteUbergraph_WBP_MenuHub_Console
// 0x0310 (0x0310 - 0x0000)
struct WBP_MenuHub_Console_C_ExecuteUbergraph_WBP_MenuHub_Console final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D5[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UXIntentSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6GenericAssetRegistrySubsystem*       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UXIntentSubsystem* UXIntentSubsystem, TSoftClassPtr<class UClass>& UXIntentType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6GenericAssetRegistryInstance*        CallFunc_GetRegistryInstance_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D6[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UObject>>         CallFunc_Set_ToArray_Result;                       // 0x0048(0x0010)(ReferenceParm)
	TSoftObjectPtr<class UObject>                 CallFunc_Array_Get_Item;                           // 0x0058(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D7[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MenuHubSocialWindowTileDataAsset_C* K2Node_DynamicCast_AsBP_Menu_Hub_Social_Window_Tile_Data_Asset; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D8[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_8;                 // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_4;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMenuHubListEntryStruct                K2Node_MakeStruct_MenuHubListEntryStruct;          // 0x00B8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	class UWBP_MenuHubItem_Console_C*             K2Node_DynamicCast_AsWBP_Menu_Hub_Item_Console;    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
