#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListEntry_DebugPresence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_ListEntry_DebugPresence.WBP_ListEntry_DebugPresence_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_DebugPresence_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_DebugPresence_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_DebugPresence_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_ListEntry_DebugPresence_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_ListEntry_DebugPresence_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_ListEntry_DebugPresence_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_ListEntry_DebugPresence.WBP_ListEntry_DebugPresence_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_DebugPresence_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_DebugPresence_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_DebugPresence_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_ListEntry_DebugPresence_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_ListEntry_DebugPresence_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ListEntry_DebugPresence_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ListEntry_DebugPresence.WBP_ListEntry_DebugPresence_C.ExecuteUbergraph_WBP_ListEntry_DebugPresence
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_PresenceStatus                           Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5091[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x0008(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_CharacterId_1;                  // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x0038(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_CharacterId;                    // 0x0048(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_CharacterNameAndId             K2Node_CustomEvent_Name;                           // 0x0058(0x0030)(ConstParm)
	TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId, struct FOSSVAL_CharacterNameAndId& Name)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_CharacterNameAndId             Temp_struct_Variable;                              // 0x0098(0x0030)()
	struct FGuid                                  Temp_struct_Variable_1;                            // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Temp_struct_Variable_2;                            // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E8(0x0018)()
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5092[0x6];                                     // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ListObject_DebugPresence_C*         K2Node_DynamicCast_AsBP_List_Object_Debug_Presence; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5093[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0120(0x0018)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0148(0x0018)()
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNameByAccountIdAndCharacterIdProxy* CallFunc_GetCharacterNameByAccountIdAndCharacterId_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0178(0x0014)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5094[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0190(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x01A4(0x0014)()
};
static_assert(alignof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence) == 0x000008, "Wrong alignment on WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence");
static_assert(sizeof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence) == 0x0001B8, "Wrong size on WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, EntryPoint) == 0x000000, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, Temp_byte_Variable) == 0x000004, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_CustomEvent_AccountId_1) == 0x000008, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_CustomEvent_CharacterId_1) == 0x000018, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_CustomEvent_CharacterId_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_CustomEvent_AccountId) == 0x000038, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_CustomEvent_CharacterId) == 0x000048, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_CustomEvent_CharacterId' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_CustomEvent_Name) == 0x000058, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, Temp_struct_Variable) == 0x000098, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, Temp_struct_Variable_1) == 0x0000C8, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, Temp_struct_Variable_2) == 0x0000D8, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, CallFunc_Conv_StringToText_ReturnValue) == 0x0000E8, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_Event_bIsExpanded) == 0x000100, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_Event_bIsSelected) == 0x000101, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_Event_ListItemObject) == 0x000108, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_DynamicCast_AsBP_List_Object_Debug_Presence) == 0x000110, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_DynamicCast_AsBP_List_Object_Debug_Presence' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000120, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000138, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000148, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, CallFunc_GetAccountId_ReturnValue) == 0x000160, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, CallFunc_GetCharacterNameByAccountIdAndCharacterId_ReturnValue) == 0x000170, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::CallFunc_GetCharacterNameByAccountIdAndCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_MakeStruct_SlateColor) == 0x000178, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, CallFunc_IsValid_ReturnValue) == 0x00018C, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_MakeStruct_SlateColor_1) == 0x000190, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence, K2Node_Select_Default) == 0x0001A4, "Member 'WBP_ListEntry_DebugPresence_C_ExecuteUbergraph_WBP_ListEntry_DebugPresence::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ListEntry_DebugPresence.WBP_ListEntry_DebugPresence_C.OnFailure_C7D73FBC4F468EBB895B5EABB9D5F126
// 0x0020 (0x0020 - 0x0000)
struct WBP_ListEntry_DebugPresence_C_OnFailure_C7D73FBC4F468EBB895B5EABB9D5F126 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CharacterId;                                       // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_DebugPresence_C_OnFailure_C7D73FBC4F468EBB895B5EABB9D5F126) == 0x000004, "Wrong alignment on WBP_ListEntry_DebugPresence_C_OnFailure_C7D73FBC4F468EBB895B5EABB9D5F126");
static_assert(sizeof(WBP_ListEntry_DebugPresence_C_OnFailure_C7D73FBC4F468EBB895B5EABB9D5F126) == 0x000020, "Wrong size on WBP_ListEntry_DebugPresence_C_OnFailure_C7D73FBC4F468EBB895B5EABB9D5F126");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_OnFailure_C7D73FBC4F468EBB895B5EABB9D5F126, AccountId) == 0x000000, "Member 'WBP_ListEntry_DebugPresence_C_OnFailure_C7D73FBC4F468EBB895B5EABB9D5F126::AccountId' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_OnFailure_C7D73FBC4F468EBB895B5EABB9D5F126, CharacterId) == 0x000010, "Member 'WBP_ListEntry_DebugPresence_C_OnFailure_C7D73FBC4F468EBB895B5EABB9D5F126::CharacterId' has a wrong offset!");

// Function WBP_ListEntry_DebugPresence.WBP_ListEntry_DebugPresence_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_DebugPresence_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_DebugPresence_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ListEntry_DebugPresence_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ListEntry_DebugPresence_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ListEntry_DebugPresence_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ListEntry_DebugPresence_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ListEntry_DebugPresence.WBP_ListEntry_DebugPresence_C.OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126
// 0x0050 (0x0050 - 0x0000)
struct WBP_ListEntry_DebugPresence_C_OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CharacterId;                                       // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_CharacterNameAndId             Param_Name;                                        // 0x0020(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ListEntry_DebugPresence_C_OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126) == 0x000008, "Wrong alignment on WBP_ListEntry_DebugPresence_C_OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126");
static_assert(sizeof(WBP_ListEntry_DebugPresence_C_OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126) == 0x000050, "Wrong size on WBP_ListEntry_DebugPresence_C_OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126, AccountId) == 0x000000, "Member 'WBP_ListEntry_DebugPresence_C_OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126::AccountId' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126, CharacterId) == 0x000010, "Member 'WBP_ListEntry_DebugPresence_C_OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126::CharacterId' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_DebugPresence_C_OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126, Param_Name) == 0x000020, "Member 'WBP_ListEntry_DebugPresence_C_OnSuccess_C7D73FBC4F468EBB895B5EABB9D5F126::Param_Name' has a wrong offset!");

}

