#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ComboBox_02_CM

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_0_OnMenuContentCreated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_0_OnMenuContentCreated__DelegateSignature final
{
public:
	class UUserWidget*                            MenuContent;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_0_OnMenuContentCreated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_0_OnMenuContentCreated__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_0_OnMenuContentCreated__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_0_OnMenuContentCreated__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_0_OnMenuContentCreated__DelegateSignature, MenuContent) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_0_OnMenuContentCreated__DelegateSignature::MenuContent' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_3_OnMenuClose__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_3_OnMenuClose__DelegateSignature final
{
public:
	bool                                          bClosedByLostFocus;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_3_OnMenuClose__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_3_OnMenuClose__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_3_OnMenuClose__DelegateSignature) == 0x000001, "Wrong size on WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_3_OnMenuClose__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_3_OnMenuClose__DelegateSignature, bClosedByLostFocus) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_BndEvt__WBP_ComboBox_02_CM_WBP_Template_ContextMenuAnchor_CM_K2Node_ComponentBoundEvent_3_OnMenuClose__DelegateSignature::bClosedByLostFocus' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.ExecuteUbergraph_WBP_ComboBox_02_CM
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0008(0x0018)()
	class UUserWidget*                            CallFunc_GetSelfMenu_SelfMenu;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ComboBox_Menu_02_CM_Locale_Specific_C* K2Node_DynamicCast_AsWBP_Combo_Box_Menu_02_CM_Locale_Specific; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_537C[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_537D[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0048(0x0018)()
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0068(0x0018)()
	TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_537E[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_1; // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_537F[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_2; // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5380[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsOpen)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsOpen;                        // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5381[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_MenuContent;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_3; // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bClosedByLostFocus;     // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0104(0x0008)(NoDestructor)
	uint8                                         Pad_5382[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue_1;     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_4; // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5383[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_5; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5384[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_6; // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5385[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_7; // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5386[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBP_ComboBox_02_CM_Menu_Interface_C> K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_8; // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5387[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Template_Button_CM_C*              CallFunc_GetButtonSelection_Button_Selection;      // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5388[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index, class FText Text)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x019C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5389[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetSelfMenu_SelfMenu_1;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ComboBox_Menu_02_CM_C*             K2Node_DynamicCast_AsWBP_Combo_Box_Menu_02_CM;     // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM) == 0x000008, "Wrong alignment on WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM");
static_assert(sizeof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM) == 0x0001C8, "Wrong size on WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, EntryPoint) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_CustomEvent_Index) == 0x000004, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_CustomEvent_Text) == 0x000008, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_GetSelfMenu_SelfMenu) == 0x000020, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_GetSelfMenu_SelfMenu' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_AsWBP_Combo_Box_Menu_02_CM_Locale_Specific) == 0x000028, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_AsWBP_Combo_Box_Menu_02_CM_Locale_Specific' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000031, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000034, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000038, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x00003C, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_Event_IsDesignTime) == 0x000040, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_GetText_ReturnValue) == 0x000048, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000060, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_GetText_ReturnValue_1) == 0x000068, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface) == 0x000080, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_1) == 0x000098, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_2) == 0x0000B0, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_2' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_CreateDelegate_OutputDelegate) == 0x0000C4, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_CustomEvent_bIsOpen) == 0x0000D4, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_CustomEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_ComponentBoundEvent_Button_1) == 0x0000D8, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_ComponentBoundEvent_Button) == 0x0000E0, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_ComponentBoundEvent_MenuContent) == 0x0000E8, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_ComponentBoundEvent_MenuContent' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_3) == 0x0000F0, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_3' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_bSuccess_4) == 0x000100, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_IsValid_ReturnValue) == 0x000101, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_IsOpen_ReturnValue) == 0x000102, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_ComponentBoundEvent_bClosedByLostFocus) == 0x000103, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_ComponentBoundEvent_bClosedByLostFocus' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_Event_InFocusEvent) == 0x000104, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_Conv_InterfaceToObject_ReturnValue_1) == 0x000110, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_Conv_InterfaceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_4) == 0x000118, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_4' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_bSuccess_5) == 0x000128, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_5) == 0x000130, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_5' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_bSuccess_6) == 0x000140, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_6) == 0x000148, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_6' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_bSuccess_7) == 0x000158, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_7) == 0x000160, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_7' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_bSuccess_8) == 0x000170, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_8) == 0x000178, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_AsWBP_Combo_Box_02_CM_Menu_Interface_8' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_bSuccess_9) == 0x000188, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_GetButtonSelection_Button_Selection) == 0x000190, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_GetButtonSelection_Button_Selection' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000198, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x00019C, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_GetSelfMenu_SelfMenu_1) == 0x0001B0, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_GetSelfMenu_SelfMenu_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_AsWBP_Combo_Box_Menu_02_CM) == 0x0001B8, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_AsWBP_Combo_Box_Menu_02_CM' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, K2Node_DynamicCast_bSuccess_10) == 0x0001C0, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x0001C1, "Member 'WBP_ComboBox_02_CM_C_ExecuteUbergraph_WBP_ComboBox_02_CM::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.GetCurrentSelectedItem
// 0x0020 (0x0020 - 0x0000)
struct WBP_ComboBox_02_CM_C_GetCurrentSelectedItem final
{
public:
	class FText                                   Selected_Text;                                     // 0x0000(0x0018)(Parm, OutParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_GetCurrentSelectedItem) == 0x000008, "Wrong alignment on WBP_ComboBox_02_CM_C_GetCurrentSelectedItem");
static_assert(sizeof(WBP_ComboBox_02_CM_C_GetCurrentSelectedItem) == 0x000020, "Wrong size on WBP_ComboBox_02_CM_C_GetCurrentSelectedItem");
static_assert(offsetof(WBP_ComboBox_02_CM_C_GetCurrentSelectedItem, Selected_Text) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_GetCurrentSelectedItem::Selected_Text' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_GetCurrentSelectedItem, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'WBP_ComboBox_02_CM_C_GetCurrentSelectedItem::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.HandleOnOptionSelected
// 0x0020 (0x0020 - 0x0000)
struct WBP_ComboBox_02_CM_C_HandleOnOptionSelected final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_538A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_HandleOnOptionSelected) == 0x000008, "Wrong alignment on WBP_ComboBox_02_CM_C_HandleOnOptionSelected");
static_assert(sizeof(WBP_ComboBox_02_CM_C_HandleOnOptionSelected) == 0x000020, "Wrong size on WBP_ComboBox_02_CM_C_HandleOnOptionSelected");
static_assert(offsetof(WBP_ComboBox_02_CM_C_HandleOnOptionSelected, Param_Index) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_HandleOnOptionSelected::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_HandleOnOptionSelected, Text) == 0x000008, "Member 'WBP_ComboBox_02_CM_C_HandleOnOptionSelected::Text' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_02_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_ComboBox_02_CM_C_OnFocusLost");
static_assert(sizeof(WBP_ComboBox_02_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_ComboBox_02_CM_C_OnFocusLost");
static_assert(offsetof(WBP_ComboBox_02_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.OnMenuOpenChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ComboBox_02_CM_C_OnMenuOpenChanged final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_OnMenuOpenChanged) == 0x000001, "Wrong alignment on WBP_ComboBox_02_CM_C_OnMenuOpenChanged");
static_assert(sizeof(WBP_ComboBox_02_CM_C_OnMenuOpenChanged) == 0x000001, "Wrong size on WBP_ComboBox_02_CM_C_OnMenuOpenChanged");
static_assert(offsetof(WBP_ComboBox_02_CM_C_OnMenuOpenChanged, bIsOpen) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_OnMenuOpenChanged::bIsOpen' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_ComboBox_02_CM_C_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_538B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_02_CM_C_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_02_CM_C_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_ComboBox_02_CM_C_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_02_CM_C_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_ComboBox_02_CM_C_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ComboBox_02_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ComboBox_02_CM_C_PreConstruct");
static_assert(sizeof(WBP_ComboBox_02_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_ComboBox_02_CM_C_PreConstruct");
static_assert(offsetof(WBP_ComboBox_02_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.SetCurrentOptionToIndex
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_02_CM_C_SetCurrentOptionToIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_SetCurrentOptionToIndex) == 0x000004, "Wrong alignment on WBP_ComboBox_02_CM_C_SetCurrentOptionToIndex");
static_assert(sizeof(WBP_ComboBox_02_CM_C_SetCurrentOptionToIndex) == 0x000008, "Wrong size on WBP_ComboBox_02_CM_C_SetCurrentOptionToIndex");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetCurrentOptionToIndex, Param_Index) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_SetCurrentOptionToIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetCurrentOptionToIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000004, "Member 'WBP_ComboBox_02_CM_C_SetCurrentOptionToIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.SetNavigation
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_ComboBox_02_CM_C_SetNavigation final
{
public:
	class UUserWidget*                            ComboBoxMenuWidget;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              ButtonSelection;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_ComboBox_Menu_Option_02_CM_C*> OptionWidgets;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_538C[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ComboBox_Menu_Option_02_CM_C*      CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_538D[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ComboBox_Menu_Option_02_CM_C*      CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_538E[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_538F[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ComboBox_Menu_Option_02_CM_C*      CallFunc_Array_Get_Item_2;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5390[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5391[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ComboBox_Menu_Option_02_CM_C*      CallFunc_Array_Get_Item_3;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetSelfMenu_SelfMenu;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              CallFunc_GetButtonSelection_Button_Selection;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_ComboBox_Menu_Option_02_CM_C*> CallFunc_GetOptionWidgets_OptionWidgets;           // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5392[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_SetNavigation) == 0x000008, "Wrong alignment on WBP_ComboBox_02_CM_C_SetNavigation");
static_assert(sizeof(WBP_ComboBox_02_CM_C_SetNavigation) == 0x0000A8, "Wrong size on WBP_ComboBox_02_CM_C_SetNavigation");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, ComboBoxMenuWidget) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::ComboBoxMenuWidget' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, ButtonSelection) == 0x000008, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::ButtonSelection' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, OptionWidgets) == 0x000010, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::OptionWidgets' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Array_Length_ReturnValue_1) == 0x000024, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Array_Length_ReturnValue_2) == 0x000038, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_IsValid_ReturnValue_2) == 0x00004A, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000050, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Array_Get_Item_2) == 0x000058, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_BooleanAND_ReturnValue) == 0x000060, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_BooleanAND_ReturnValue_1) == 0x000068, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Array_Get_Item_3) == 0x000070, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_GetSelfMenu_SelfMenu) == 0x000078, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_GetSelfMenu_SelfMenu' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_GetButtonSelection_Button_Selection) == 0x000080, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_GetButtonSelection_Button_Selection' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_GetOptionWidgets_OptionWidgets) == 0x000088, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_GetOptionWidgets_OptionWidgets' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Less_IntInt_ReturnValue_1) == 0x00009C, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetNavigation, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'WBP_ComboBox_02_CM_C_SetNavigation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_ComboBox_02_CM.WBP_ComboBox_02_CM_C.SetTextOptions
// 0x0018 (0x0018 - 0x0000)
struct WBP_ComboBox_02_CM_C_SetTextOptions final
{
public:
	TArray<class FText>                           Text_Options;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Selected_Option;                                   // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_02_CM_C_SetTextOptions) == 0x000008, "Wrong alignment on WBP_ComboBox_02_CM_C_SetTextOptions");
static_assert(sizeof(WBP_ComboBox_02_CM_C_SetTextOptions) == 0x000018, "Wrong size on WBP_ComboBox_02_CM_C_SetTextOptions");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetTextOptions, Text_Options) == 0x000000, "Member 'WBP_ComboBox_02_CM_C_SetTextOptions::Text_Options' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetTextOptions, Selected_Option) == 0x000010, "Member 'WBP_ComboBox_02_CM_C_SetTextOptions::Selected_Option' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_02_CM_C_SetTextOptions, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000014, "Member 'WBP_ComboBox_02_CM_C_SetTextOptions::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

}

