#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerCharacterRow_Button_Guild_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "F_CommonUIButtonPrompt_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerCharacterRow_Button_Guild_CM.WBP_PlayerCharacterRow_Button_Guild_CM_C.BndEvt__WBP_PlayerCharacterRow_Button_Guild_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Guild_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Guild_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Guild_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Guild_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Guild_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Guild_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Guild_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Guild_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_Button_Guild_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Guild_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Guild_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Guild_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Guild_CM.WBP_PlayerCharacterRow_Button_Guild_CM_C.ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55AF[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem, const struct FGuid& PlayerGuildId)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem, const struct FGuid& PlayerGuildId)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B0[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ErrorMessage;                   // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00A0(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM) == 0x0000A8, "Wrong size on WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, EntryPoint) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000048, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x000050, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000060, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000068, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, K2Node_CreateDelegate_OutputDelegate_5) == 0x000070, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, CallFunc_IsValid_Guid_ReturnValue) == 0x000080, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, CallFunc_BooleanAND_ReturnValue) == 0x000081, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, K2Node_CustomEvent_ErrorMessage) == 0x000088, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::K2Node_CustomEvent_ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, K2Node_ComponentBoundEvent_Button) == 0x000098, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM, K2Node_Event_InFocusEvent) == 0x0000A0, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Guild_CM::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Guild_CM.WBP_PlayerCharacterRow_Button_Guild_CM_C.Handle On Player Guild Changed
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Player_Guild_Changed final
{
public:
	class UVAL_PlayerGuildSubsystem*              PlayerGuildManager;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Param_PlayerGuildId;                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Player_Guild_Changed) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Player_Guild_Changed");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Player_Guild_Changed) == 0x000018, "Wrong size on WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Player_Guild_Changed");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Player_Guild_Changed, PlayerGuildManager) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Player_Guild_Changed::PlayerGuildManager' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Player_Guild_Changed, Param_PlayerGuildId) == 0x000008, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Player_Guild_Changed::Param_PlayerGuildId' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Guild_CM.WBP_PlayerCharacterRow_Button_Guild_CM_C.Handle On Query Player Guild Membership Success
// 0x0120 (0x0120 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Query_Player_Guild_Membership_Success final
{
public:
	bool                                          bHasMembership;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PlayerGuild                       PlayerGuild;                                       // 0x0008(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Query_Player_Guild_Membership_Success) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Query_Player_Guild_Membership_Success");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Query_Player_Guild_Membership_Success) == 0x000120, "Wrong size on WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Query_Player_Guild_Membership_Success");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Query_Player_Guild_Membership_Success, bHasMembership) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Query_Player_Guild_Membership_Success::bHasMembership' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Query_Player_Guild_Membership_Success, PlayerGuild) == 0x000008, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_Handle_On_Query_Player_Guild_Membership_Success::PlayerGuild' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Guild_CM.WBP_PlayerCharacterRow_Button_Guild_CM_C.HandleOnInviteSentFail
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnInviteSentFail final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnInviteSentFail) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnInviteSentFail");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnInviteSentFail) == 0x000010, "Wrong size on WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnInviteSentFail");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnInviteSentFail, ErrorMessage) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnInviteSentFail::ErrorMessage' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Guild_CM.WBP_PlayerCharacterRow_Button_Guild_CM_C.HandleOnOutboundInvitesChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnOutboundInvitesChanged final
{
public:
	class UVAL_PlayerGuildSubsystem*              PlayerGuildManager;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnOutboundInvitesChanged) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnOutboundInvitesChanged");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnOutboundInvitesChanged) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnOutboundInvitesChanged");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnOutboundInvitesChanged, PlayerGuildManager) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_HandleOnOutboundInvitesChanged::PlayerGuildManager' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Guild_CM.WBP_PlayerCharacterRow_Button_Guild_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusLost");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusLost");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Guild_CM.WBP_PlayerCharacterRow_Button_Guild_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Guild_CM.WBP_PlayerCharacterRow_Button_Guild_CM_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Guild_CM_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Guild_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_PlayerCharacterRow_Button_Guild_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Guild_CM.WBP_PlayerCharacterRow_Button_Guild_CM_C.SetParameters
// 0x0198 (0x0198 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters final
{
public:
	struct FUniqueNetIdRepl                       Param_UserId;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x0040(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_TryGetUserMembership_bOutHasMembership;   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B2[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PlayerGuild                       CallFunc_TryGetUserMembership_PlayerGuild;         // 0x0078(0x0118)()
	bool                                          CallFunc_TryGetUserMembership_ReturnValue;         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters) == 0x000198, "Wrong size on WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters, Param_UserId) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters::Param_UserId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000030, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000038, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters, CallFunc_GetNetId_ReturnValue) == 0x000040, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters::CallFunc_GetNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters, CallFunc_TryGetUserMembership_bOutHasMembership) == 0x000070, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters::CallFunc_TryGetUserMembership_bOutHasMembership' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters, CallFunc_TryGetUserMembership_PlayerGuild) == 0x000078, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters::CallFunc_TryGetUserMembership_PlayerGuild' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters, CallFunc_TryGetUserMembership_ReturnValue) == 0x000190, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_SetParameters::CallFunc_TryGetUserMembership_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Guild_CM.WBP_PlayerCharacterRow_Button_Guild_CM_C.UpdateState
// 0x03E0 (0x03E0 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Guild_CM_C_UpdateState final
{
public:
	bool                                          IsInvitedAlready;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMember;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B3[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B4[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B5[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt;          // 0x0018(0x0040)(HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt_1;        // 0x0068(0x0040)(HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt_2;        // 0x00A8(0x0040)(HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ReferenceParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B6[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0100(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0118(0x0018)()
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B7[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x0150(0x0030)(HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue_1;                   // 0x0188(0x0030)(HasGetValueTypeHash)
	struct FVAL_PlayerGuild                       CallFunc_TryGetPlayerGuild_OutPlayerGuildInfo;     // 0x01B8(0x0118)()
	bool                                          CallFunc_TryGetPlayerGuild_ReturnValue;            // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B8[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVAL_PlayerGuildMemberRole                    CallFunc_TryGetRoleForUserId_OutRole;              // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetRoleForUserId_ReturnValue;          // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B9[0x6];                                     // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PlayerGuildRosterEntry            CallFunc_Array_Get_Item;                           // 0x02E8(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x032E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanRoleSendInvites_ReturnValue;           // 0x032F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55BA[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_PlayerGuildInvitationList         CallFunc_TryGetOutboundInvitations_OutInvitations; // 0x0340(0x0010)()
	bool                                          CallFunc_TryGetOutboundInvitations_ReturnValue;    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue_1;                 // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55BB[0x6];                                     // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PlayerGuildInvitation             CallFunc_Array_Get_Item_1;                         // 0x0358(0x0078)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue_2;                 // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55BC[0x1];                                     // 0x03D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Guild_CM_C_UpdateState) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Guild_CM_C_UpdateState");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Guild_CM_C_UpdateState) == 0x0003E0, "Wrong size on WBP_PlayerCharacterRow_Button_Guild_CM_C_UpdateState");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_UpdateState, IsInvitedAlready) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_UpdateState::IsInvitedAlready' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Guild_CM_C_UpdateState, IsMember) == 0x000001, "Member 'WBP_PlayerCharacterRow_Button_Guild_CM_C_UpdateState::IsMember' has a wrong offset!");
