#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PetImage

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_PetImage.WBP_PetImage_C.Completed_0917B935427A43D1084B4EACCBAF2C67
// 0x0050 (0x0050 - 0x0000)
struct WBP_PetImage_C_Completed_0917B935427A43D1084B4EACCBAF2C67 final
{
public:
	TSet<class UVAL_CharacterCustomizationItemBase*> LoadedItems;                                       // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PetImage_C_Completed_0917B935427A43D1084B4EACCBAF2C67) == 0x000008, "Wrong alignment on WBP_PetImage_C_Completed_0917B935427A43D1084B4EACCBAF2C67");
static_assert(sizeof(WBP_PetImage_C_Completed_0917B935427A43D1084B4EACCBAF2C67) == 0x000050, "Wrong size on WBP_PetImage_C_Completed_0917B935427A43D1084B4EACCBAF2C67");
static_assert(offsetof(WBP_PetImage_C_Completed_0917B935427A43D1084B4EACCBAF2C67, LoadedItems) == 0x000000, "Member 'WBP_PetImage_C_Completed_0917B935427A43D1084B4EACCBAF2C67::LoadedItems' has a wrong offset!");

// Function WBP_PetImage.WBP_PetImage_C.ExecuteUbergraph_WBP_PetImage
// 0x0188 (0x0188 - 0x0000)
struct WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42B8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UVAL_CharacterCustomizationItemBase*> K2Node_CustomEvent_LoadedItems;                    // 0x0008(0x0050)()
	TSet<class UVAL_CharacterCustomizationItemBase*> Temp_object_Variable;                              // 0x0058(0x0050)()
	EVAL_CharacterBodyType                        Temp_byte_Variable;                                // 0x00A8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42B9[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVAL_CharacterCustomizationItemBase*> CallFunc_Set_ToArray_Result;                       // 0x00B0(0x0010)(ReferenceParm)
	class UVAL_CharacterCustomizationItemBase*    CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TSet<class UVAL_CharacterCustomizationItemBase*>& LoadedItems)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationItem_Pet*    K2Node_DynamicCast_AsVAL_Character_Customization_Item_Pet; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42BA[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TSoftObjectPtr<class UVAL_CharacterCustomizationItemBase>> K2Node_MakeSet_Set;                                // 0x00E8(0x0050)(ConstParm)
	class UVAL_AsyncAction_LoadCharacterCustomizationItems* CallFunc_LoadCharacterCustomizationItems_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42BB[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_TryGetPetUIDisplayIcon_ReturnValue;       // 0x0148(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage) == 0x000008, "Wrong alignment on WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage");
static_assert(sizeof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage) == 0x000188, "Wrong size on WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, EntryPoint) == 0x000000, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, K2Node_CustomEvent_LoadedItems) == 0x000008, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::K2Node_CustomEvent_LoadedItems' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, Temp_object_Variable) == 0x000058, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, Temp_byte_Variable) == 0x0000A8, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, CallFunc_Set_ToArray_Result) == 0x0000B0, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, K2Node_DynamicCast_AsVAL_Character_Customization_Item_Pet) == 0x0000D8, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::K2Node_DynamicCast_AsVAL_Character_Customization_Item_Pet' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, K2Node_MakeSet_Set) == 0x0000E8, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::K2Node_MakeSet_Set' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, CallFunc_LoadCharacterCustomizationItems_ReturnValue) == 0x000138, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::CallFunc_LoadCharacterCustomizationItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, CallFunc_TryGetPetUIDisplayIcon_ReturnValue) == 0x000148, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::CallFunc_TryGetPetUIDisplayIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000170, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, K2Node_DynamicCast_AsTexture_2D) == 0x000178, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage, K2Node_Event_IsDesignTime) == 0x000181, "Member 'WBP_PetImage_C_ExecuteUbergraph_WBP_PetImage::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_PetImage.WBP_PetImage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PetImage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PetImage_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PetImage_C_PreConstruct");
static_assert(sizeof(WBP_PetImage_C_PreConstruct) == 0x000001, "Wrong size on WBP_PetImage_C_PreConstruct");
static_assert(offsetof(WBP_PetImage_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PetImage_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

