#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventorySlot_CM

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "S6Core_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.OnLeftClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_OnLeftClicked__DelegateSignature final
{
public:
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_OnLeftClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_OnLeftClicked__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_OnLeftClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_OnLeftClicked__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_OnLeftClicked__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_OnLeftClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.OnRightClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_OnRightClicked__DelegateSignature final
{
public:
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_OnRightClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_OnRightClicked__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_OnRightClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_OnRightClicked__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_OnRightClicked__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_OnRightClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.OnGamepadSelect__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_OnGamepadSelect__DelegateSignature final
{
public:
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_OnGamepadSelect__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_OnGamepadSelect__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_OnGamepadSelect__DelegateSignature) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_OnGamepadSelect__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_OnGamepadSelect__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_OnGamepadSelect__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.OnGamepadCancel__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_OnGamepadCancel__DelegateSignature final
{
public:
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_OnGamepadCancel__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_OnGamepadCancel__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_OnGamepadCancel__DelegateSignature) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_OnGamepadCancel__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_OnGamepadCancel__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_OnGamepadCancel__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.OnOpenActionMenu__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_OnOpenActionMenu__DelegateSignature final
{
public:
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_OnOpenActionMenu__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_OnOpenActionMenu__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_OnOpenActionMenu__DelegateSignature) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_OnOpenActionMenu__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_OnOpenActionMenu__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_OnOpenActionMenu__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.OnSlotFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_OnSlotFocused__DelegateSignature final
{
public:
	class UWidget*                                Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_OnSlotFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_OnSlotFocused__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_OnSlotFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_OnSlotFocused__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_OnSlotFocused__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_OnSlotFocused__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_11_OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_11_OnUnhovered__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_11_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_11_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_11_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_11_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_11_OnUnhovered__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_11_OnUnhovered__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_1_OnItemDropped__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_1_OnItemDropped__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_ItemDragDrop*                    Operation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_1_OnItemDropped__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_1_OnItemDropped__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_1_OnItemDropped__DelegateSignature) == 0x000010, "Wrong size on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_1_OnItemDropped__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_1_OnItemDropped__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_1_OnItemDropped__DelegateSignature::Param_Slot' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_1_OnItemDropped__DelegateSignature, Operation) == 0x000008, "Member 'WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_1_OnItemDropped__DelegateSignature::Operation' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_3_OnLeftClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_3_OnLeftClicked__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_3_OnLeftClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_3_OnLeftClicked__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_3_OnLeftClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_3_OnLeftClicked__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_3_OnLeftClicked__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_3_OnLeftClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_7_OnRightClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_7_OnRightClicked__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_7_OnRightClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_7_OnRightClicked__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_7_OnRightClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_7_OnRightClicked__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_7_OnRightClicked__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_7_OnRightClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_8_OnDragged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_8_OnDragged__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_8_OnDragged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_8_OnDragged__DelegateSignature");
static_assert(sizeof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_8_OnDragged__DelegateSignature) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_8_OnDragged__DelegateSignature");
static_assert(offsetof(WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_8_OnDragged__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_BndEvt__WBP_InventorySlot_CM_WBP_ItemSlot_CM_K2Node_ComponentBoundEvent_8_OnDragged__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.CanOpenTooltip
// 0x0070 (0x0070 - 0x0000)
struct WBP_InventorySlot_CM_C_CanOpenTooltip final
{
public:
	bool                                          CanOpen;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58E7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           CallFunc_GetItem_Item;                             // 0x0008(0x0060)()
	bool                                          CallFunc_ItemIsEmpty_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_CanOpenTooltip) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_CanOpenTooltip");
static_assert(sizeof(WBP_InventorySlot_CM_C_CanOpenTooltip) == 0x000070, "Wrong size on WBP_InventorySlot_CM_C_CanOpenTooltip");
static_assert(offsetof(WBP_InventorySlot_CM_C_CanOpenTooltip, CanOpen) == 0x000000, "Member 'WBP_InventorySlot_CM_C_CanOpenTooltip::CanOpen' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_CanOpenTooltip, CallFunc_GetItem_Item) == 0x000008, "Member 'WBP_InventorySlot_CM_C_CanOpenTooltip::CallFunc_GetItem_Item' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_CanOpenTooltip, CallFunc_ItemIsEmpty_ReturnValue) == 0x000068, "Member 'WBP_InventorySlot_CM_C_CanOpenTooltip::CallFunc_ItemIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_CanOpenTooltip, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'WBP_InventorySlot_CM_C_CanOpenTooltip::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.CustomEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventorySlot_CM_C_CustomEvent final
{
public:
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_CustomEvent) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_CustomEvent");
static_assert(sizeof(WBP_InventorySlot_CM_C_CustomEvent) == 0x000008, "Wrong size on WBP_InventorySlot_CM_C_CustomEvent");
static_assert(offsetof(WBP_InventorySlot_CM_C_CustomEvent, Param_Slot) == 0x000000, "Member 'WBP_InventorySlot_CM_C_CustomEvent::Param_Slot' has a wrong offset!");

// Function WBP_InventorySlot_CM.WBP_InventorySlot_CM_C.ExecuteUbergraph_WBP_InventorySlot_CM
// 0x0480 (0x0480 - 0x0000)
struct WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58E8[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_BorderStyle*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_BorderStyle*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58E9[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_InventorySlot_CM_C* Slot)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonUserWidget* Widget, bool bIsVisible)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShiftDown__Result;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58EA[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           CallFunc_GetItem_Item;                             // 0x0070(0x0060)()
	bool                                          CallFunc_ItemIsEmpty_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58EB[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetBagType_ReturnValue;                   // 0x00D4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58EC[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_BorderStyle*                     K2Node_Select_Default;                             // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FValeriaGameplaySettings               K2Node_CustomEvent_GameplaySettings;               // 0x00F0(0x0018)(ConstParm, NoDestructor)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           CallFunc_GetItem_Item_1;                           // 0x0110(0x0060)()
	bool                                          CallFunc_ItemIsEmpty_ReturnValue_1;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58ED[0x6];                                     // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DraggedItem_CM_C*                  CallFunc_Create_ReturnValue;                       // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58EE[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           CallFunc_GetItem_Item_2;                           // 0x0188(0x0060)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x01E8(0x0018)()
	bool                                          CallFunc_ItemIsEmpty_ReturnValue_2;                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58EF[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FValeriaGameplaySettings& GameplaySettings)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0204(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowDestroyWarning_bShow;           // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F0[0x2];                                     // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F1[0x6];                                     // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           CallFunc_GetItem_Item_3;                           // 0x0230(0x0060)()
	class UBP_ItemDrag_Inventory_C*               CallFunc_CreateDragDropOperation_ReturnValue;      // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemIsEmpty_ReturnValue_3;                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F2[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F3[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStorageComponent*                      CallFunc_GetStorage_ReturnValue;                   // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStorageComponent*                      CallFunc_GetStorage_ReturnValue_1;                 // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F4[0x2];                                     // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x02CC(0x0008)(NoDestructor)
	uint8                                         Pad_58F5[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_GameUISubsystem*                   CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           CallFunc_GetItem_Item_4;                           // 0x02E8(0x0060)()
	bool                                          CallFunc_ItemIsEmpty_ReturnValue_4;                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_bSelected;                     // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_bSelected_1;                   // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F6[0x5];                                     // 0x034B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_bSelected_2;                   // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F7[0x6];                                     // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ItemSlot_CM_C*                     K2Node_ComponentBoundEvent_Slot_5;                 // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_ItemDragDrop*                    K2Node_ComponentBoundEvent_Operation;              // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleDrop_ReturnValue;                   // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F8[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ItemSlot_CM_C*                     K2Node_ComponentBoundEvent_Slot_4;                 // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemSlot_CM_C*                     K2Node_ComponentBoundEvent_Slot_3;                 // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemSlot_CM_C*                     K2Node_ComponentBoundEvent_Slot_2;                 // 0x0388(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemSlot_CM_C*                     K2Node_ComponentBoundEvent_Slot_1;                 // 0x0390(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemSlot_CM_C*                     K2Node_ComponentBoundEvent_Slot;                   // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowHotkeyText_ShouldShow;          // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F9[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventorySlot_CM_C*                K2Node_CustomEvent_Slot;                           // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           CallFunc_GetItem_Item_5;                           // 0x03B0(0x0060)()
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FA[0x3];                                     // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_bEmpty;                           // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FB[0x7];                                     // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    K2Node_CustomEvent_Inventory;                      // 0x0420(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsShow;                              // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUpdateSlotFromEvent_UpdateNow;      // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FC[0x6];                                     // 0x042A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonUserWidget*                      K2Node_CustomEvent_Widget;                         // 0x0440(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsVisible;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FD[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_UIManagerWidgetBase*             K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base;  // 0x0450(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FE[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x0468(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_UIManagerWidgetBase*             K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base_1; // 0x0470(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChildOf_StandaloneInventory_FoundStandaloneInventory; // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x047B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM) == 0x000008, "Wrong alignment on WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM");
static_assert(sizeof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM) == 0x000480, "Wrong size on WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, EntryPoint) == 0x000000, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_byte_Variable) == 0x000004, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_bool_Variable) == 0x000006, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_object_Variable) == 0x000008, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_object_Variable_1) == 0x000010, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_byte_Variable_2) == 0x000019, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_byte_Variable_3) == 0x00001A, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_bool_Variable_2) == 0x00001B, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_byte_Variable_4) == 0x00001C, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_byte_Variable_5) == 0x00001D, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x000050, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_IsShiftDown__Result) == 0x000068, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_IsShiftDown__Result' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_MakeLiteralByte_ReturnValue) == 0x000069, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetItem_Item) == 0x000070, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetItem_Item' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_ItemIsEmpty_ReturnValue) == 0x0000D0, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_ItemIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetBagType_ReturnValue) == 0x0000D4, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetBagType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000DC, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x0000E0, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_Select_Default) == 0x0000E8, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_CustomEvent_GameplaySettings) == 0x0000F0, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_CustomEvent_GameplaySettings' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue_1) == 0x000108, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetItem_Item_1) == 0x000110, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetItem_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_ItemIsEmpty_ReturnValue_1) == 0x000170, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_ItemIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, Temp_bool_Variable_3) == 0x000171, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_Create_ReturnValue) == 0x000178, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_Add_IntInt_ReturnValue) == 0x000180, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetItem_Item_2) == 0x000188, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetItem_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_Conv_IntToText_ReturnValue) == 0x0001E8, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_ItemIsEmpty_ReturnValue_2) == 0x000200, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_ItemIsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x000204, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_ShouldShowDestroyWarning_bShow) == 0x000214, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_ShouldShowDestroyWarning_bShow' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_Select_Default_1) == 0x000215, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_PlayAnimationForward_ReturnValue) == 0x000218, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000220, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_Not_PreBool_ReturnValue) == 0x000228, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_Not_PreBool_ReturnValue_1) == 0x000229, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetItem_Item_3) == 0x000230, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetItem_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_CreateDragDropOperation_ReturnValue) == 0x000290, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_ItemIsEmpty_ReturnValue_3) == 0x000298, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_ItemIsEmpty_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_Not_PreBool_ReturnValue_2) == 0x000299, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_BooleanAND_ReturnValue) == 0x00029A, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_Select_Default_2) == 0x00029B, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetValeriaCharacter_OutResult) == 0x00029C, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetValeriaCharacter_ReturnValue) == 0x0002A0, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetValeriaCharacter_OutResult_1) == 0x0002A8, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetValeriaCharacter_OutResult_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetValeriaCharacter_ReturnValue_1) == 0x0002B0, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetValeriaCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetStorage_ReturnValue) == 0x0002B8, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetStorage_ReturnValue_1) == 0x0002C0, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetStorage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_SwitchEnum_CmpSuccess) == 0x0002C8, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_SwitchEnum_CmpSuccess_1) == 0x0002C9, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_Event_InFocusEvent) == 0x0002CC, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetPlayerController_ReturnValue) == 0x0002D8, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x0002E0, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_GetItem_Item_4) == 0x0002E8, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_GetItem_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_ItemIsEmpty_ReturnValue_4) == 0x000348, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_ItemIsEmpty_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_IsSelected_bSelected) == 0x000349, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_IsSelected_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_IsSelected_bSelected_1) == 0x00034A, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_IsSelected_bSelected_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000350, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_IsSelected_bSelected_2) == 0x000358, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_IsSelected_bSelected_2' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_Event_IsDesignTime) == 0x000359, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_ComponentBoundEvent_Slot_5) == 0x000360, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_ComponentBoundEvent_Slot_5' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_ComponentBoundEvent_Operation) == 0x000368, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_ComponentBoundEvent_Operation' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_HandleDrop_ReturnValue) == 0x000370, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_HandleDrop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_ComponentBoundEvent_Slot_4) == 0x000378, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_ComponentBoundEvent_Slot_4' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_ComponentBoundEvent_Slot_3) == 0x000380, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_ComponentBoundEvent_Slot_3' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_ComponentBoundEvent_Slot_2) == 0x000388, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_ComponentBoundEvent_Slot_2' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_ComponentBoundEvent_Slot_1) == 0x000390, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_ComponentBoundEvent_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_ComponentBoundEvent_Slot) == 0x000398, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_ComponentBoundEvent_Slot' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, CallFunc_ShouldShowHotkeyText_ShouldShow) == 0x0003A0, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::CallFunc_ShouldShowHotkeyText_ShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM, K2Node_CustomEvent_Slot) == 0x0003A8, "Member 'WBP_InventorySlot_CM_C_ExecuteUbergraph_WBP_InventorySlot_CM::K2Node_CustomEvent_Slot' has a wrong offset!");
