#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCustomization_TileView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterCustomization_TileView.WBP_CharacterCustomization_TileView_C
// 0x0060 (0x0470 - 0x0410)
class UWBP_CharacterCustomization_TileView_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TileView_Styled*                 CharacterCustomizationTiles;                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESelectInfo                                   Select_Type;                                       // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CA3[0x7];                                     // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             HandleItemSelectionChanged;                        // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_TileEntry_CosmeticThumbnail_CM_C*  SelectedTile;                                      // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Tile_Height;                                       // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tile_Width;                                        // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UUserWidget>                Widget_Class;                                      // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_CharacterCustomizationPanel_CM_C*  Owner;                                             // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSelectedItemIndex;                             // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CA4[0x4];                                     // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnTileEntryItemFocused;                            // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_CharacterCustomization_TileView_CharacterCustomizationTiles_K2Node_ComponentBoundEvent_0_OnListItemSelectionChangedWithInputTypeDynamic__DelegateSignature(class UObject* Item, bool bIsSelected, ESelectInfo SelectType);
	void BndEvt__WBP_CharacterCustomization_TileView_CharacterCustomizationTiles_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WBP_CharacterCustomization_TileView_CharacterCustomizationTiles_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void BndEvt__WBP_CharacterCustomization_TileView_CharacterCustomizationTiles_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void ExecuteUbergraph_WBP_CharacterCustomization_TileView(int32 EntryPoint, TDelegate<void(class UWBP_TileEntry_CosmeticThumbnail_CM_C* Widget)> K2Node_CreateDelegate_OutputDelegate, class UObject* K2Node_ComponentBoundEvent_Item_2, class UVAL_CharacterCustomizationItemBase* K2Node_DynamicCast_AsVAL_Character_Customization_Item_Base, bool K2Node_DynamicCast_bSuccess, bool K2Node_SwitchEnum_CmpSuccess, TSoftObjectPtr<class UVAL_CharacterCustomizationItemBase> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue, bool CallFunc_CheckHasItemEntitlementByItem_HasEntitlement, class UObject* K2Node_ComponentBoundEvent_Item_1, bool K2Node_ComponentBoundEvent_bIsSelected, bool K2Node_Event_IsDesignTime, class UObject* K2Node_ComponentBoundEvent_Item, class UUserWidget* K2Node_ComponentBoundEvent_Widget, class UWBP_TileEntry_CosmeticThumbnail_CM_C* K2Node_DynamicCast_AsWBP_Tile_Entry_Cosmetic_Thumbnail_CM, bool K2Node_DynamicCast_bSuccess_1, class UWBP_TileEntry_CosmeticThumbnail_CM_C* K2Node_DynamicCast_AsWBP_Tile_Entry_Cosmetic_Thumbnail_CM_1, bool K2Node_DynamicCast_bSuccess_2, int32 CallFunc_GetIndexForItem_ReturnValue, class UObject* K2Node_ComponentBoundEvent_Item_3, bool K2Node_ComponentBoundEvent_bIsSelected_1, ESelectInfo K2Node_ComponentBoundEvent_SelectType, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	void GetTileView(class UVALUI_TileView_Styled** Tile_View);
	void HandleItemSelectionChanged__DelegateSignature(class UObject* Item, bool Is_Selected);
	void HandleOnItemFocused(class UWBP_TileEntry_CosmeticThumbnail_CM_C* Widget);
	void HandleOnItemSelectionChanged(class UObject* Item, bool IsSelected);
	class UWidget* Navigate_to_Picker(EUINavigation Param_Navigation, bool CallFunc_IsValid_ReturnValue, TArray<class UUserWidget*>& CallFunc_GetDisplayedEntryWidgets_ReturnValue, class UUserWidget* CallFunc_Array_Get_Item);
	void OnTileEntryItemFocused__DelegateSignature(class UWBP_TileEntry_CosmeticThumbnail_CM_C* Widget);
	void PreConstruct(bool IsDesignTime);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterCustomization_TileView_C">();
	}
	static class UWBP_CharacterCustomization_TileView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterCustomization_TileView_C>();
	}
};
static_assert(alignof(UWBP_CharacterCustomization_TileView_C) == 0x000008, "Wrong alignment on UWBP_CharacterCustomization_TileView_C");
static_assert(sizeof(UWBP_CharacterCustomization_TileView_C) == 0x000470, "Wrong size on UWBP_CharacterCustomization_TileView_C");
static_assert(offsetof(UWBP_CharacterCustomization_TileView_C, UberGraphFrame) == 0x000410, "Member 'UWBP_CharacterCustomization_TileView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TileView_C, CharacterCustomizationTiles) == 0x000418, "Member 'UWBP_CharacterCustomization_TileView_C::CharacterCustomizationTiles' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TileView_C, Select_Type) == 0x000420, "Member 'UWBP_CharacterCustomization_TileView_C::Select_Type' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TileView_C, HandleItemSelectionChanged) == 0x000428, "Member 'UWBP_CharacterCustomization_TileView_C::HandleItemSelectionChanged' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TileView_C, SelectedTile) == 0x000438, "Member 'UWBP_CharacterCustomization_TileView_C::SelectedTile' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TileView_C, Tile_Height) == 0x000440, "Member 'UWBP_CharacterCustomization_TileView_C::Tile_Height' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TileView_C, Tile_Width) == 0x000444, "Member 'UWBP_CharacterCustomization_TileView_C::Tile_Width' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TileView_C, Widget_Class) == 0x000448, "Member 'UWBP_CharacterCustomization_TileView_C::Widget_Class' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TileView_C, Owner) == 0x000450, "Member 'UWBP_CharacterCustomization_TileView_C::Owner' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TileView_C, LastSelectedItemIndex) == 0x000458, "Member 'UWBP_CharacterCustomization_TileView_C::LastSelectedItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TileView_C, OnTileEntryItemFocused) == 0x000460, "Member 'UWBP_CharacterCustomization_TileView_C::OnTileEntryItemFocused' has a wrong offset!");

}

