#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_Notification_Minor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Template_Notification_Minor.WBP_Template_Notification_Minor_C
// 0x0038 (0x02F8 - 0x02C0)
class UWBP_Template_Notification_Minor_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimateIn;                                         // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backer;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Text;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlotIcon;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Notification_Start;                             // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Notification_Dismiss;                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Template_Notification_Minor(int32 EntryPoint, bool Temp_bool_Variable, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool CallFunc_HasAnyChildren_ReturnValue, ESlateVisibility K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Template_Notification_Minor_C">();
	}
	static class UWBP_Template_Notification_Minor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Template_Notification_Minor_C>();
	}
};
static_assert(alignof(UWBP_Template_Notification_Minor_C) == 0x000008, "Wrong alignment on UWBP_Template_Notification_Minor_C");
static_assert(sizeof(UWBP_Template_Notification_Minor_C) == 0x0002F8, "Wrong size on UWBP_Template_Notification_Minor_C");
static_assert(offsetof(UWBP_Template_Notification_Minor_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Template_Notification_Minor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Notification_Minor_C, AnimateIn) == 0x0002C8, "Member 'UWBP_Template_Notification_Minor_C::AnimateIn' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Notification_Minor_C, Backer) == 0x0002D0, "Member 'UWBP_Template_Notification_Minor_C::Backer' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Notification_Minor_C, NamedSlot_Text) == 0x0002D8, "Member 'UWBP_Template_Notification_Minor_C::NamedSlot_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Notification_Minor_C, NamedSlotIcon) == 0x0002E0, "Member 'UWBP_Template_Notification_Minor_C::NamedSlotIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Notification_Minor_C, Ak_Notification_Start) == 0x0002E8, "Member 'UWBP_Template_Notification_Minor_C::Ak_Notification_Start' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Notification_Minor_C, Ak_Notification_Dismiss) == 0x0002F0, "Member 'UWBP_Template_Notification_Minor_C::Ak_Notification_Dismiss' has a wrong offset!");

}

