#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrafterRecipeStep_Base

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CrafterRecipeStep_Base.WBP_CrafterRecipeStep_Base_C.EnactCrafterSlotUpdate
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_CrafterRecipeStep_Base_C_EnactCrafterSlotUpdate final
{
public:
	struct FRecipeStepConfig                      CachedRequestStep;                                 // 0x0000(0x0058)(Edit, BlueprintVisible)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6193[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRecipeStepConfig                      CallFunc_GetRecipeStepConfig_ReturnValue;          // 0x0060(0x0058)()
};
static_assert(alignof(WBP_CrafterRecipeStep_Base_C_EnactCrafterSlotUpdate) == 0x000008, "Wrong alignment on WBP_CrafterRecipeStep_Base_C_EnactCrafterSlotUpdate");
static_assert(sizeof(WBP_CrafterRecipeStep_Base_C_EnactCrafterSlotUpdate) == 0x0000B8, "Wrong size on WBP_CrafterRecipeStep_Base_C_EnactCrafterSlotUpdate");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_EnactCrafterSlotUpdate, CachedRequestStep) == 0x000000, "Member 'WBP_CrafterRecipeStep_Base_C_EnactCrafterSlotUpdate::CachedRequestStep' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_EnactCrafterSlotUpdate, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'WBP_CrafterRecipeStep_Base_C_EnactCrafterSlotUpdate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_EnactCrafterSlotUpdate, CallFunc_GetRecipeStepConfig_ReturnValue) == 0x000060, "Member 'WBP_CrafterRecipeStep_Base_C_EnactCrafterSlotUpdate::CallFunc_GetRecipeStepConfig_ReturnValue' has a wrong offset!");

// Function WBP_CrafterRecipeStep_Base.WBP_CrafterRecipeStep_Base_C.ExecuteUbergraph_WBP_CrafterRecipeStep_Base
// 0x0058 (0x0058 - 0x0000)
struct WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCrafterComponent*                      K2Node_CustomEvent_Crafter;                        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SlotIndex;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6194[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base) == 0x000008, "Wrong alignment on WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base");
static_assert(sizeof(WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base) == 0x000058, "Wrong size on WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base, EntryPoint) == 0x000000, "Member 'WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base, K2Node_CustomEvent_Crafter) == 0x000040, "Member 'WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base::K2Node_CustomEvent_Crafter' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base, K2Node_CustomEvent_SlotIndex) == 0x000048, "Member 'WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base::K2Node_CustomEvent_SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00004C, "Member 'WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base, K2Node_Event_IsDesignTime) == 0x00004D, "Member 'WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base, CallFunc_Delay_Duration_ImplicitCast) == 0x000050, "Member 'WBP_CrafterRecipeStep_Base_C_ExecuteUbergraph_WBP_CrafterRecipeStep_Base::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function WBP_CrafterRecipeStep_Base.WBP_CrafterRecipeStep_Base_C.OnCrafterSlotUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_CrafterRecipeStep_Base_C_OnCrafterSlotUpdated final
{
public:
	class UCrafterComponent*                      Crafter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipeStep_Base_C_OnCrafterSlotUpdated) == 0x000008, "Wrong alignment on WBP_CrafterRecipeStep_Base_C_OnCrafterSlotUpdated");
static_assert(sizeof(WBP_CrafterRecipeStep_Base_C_OnCrafterSlotUpdated) == 0x000010, "Wrong size on WBP_CrafterRecipeStep_Base_C_OnCrafterSlotUpdated");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_OnCrafterSlotUpdated, Crafter) == 0x000000, "Member 'WBP_CrafterRecipeStep_Base_C_OnCrafterSlotUpdated::Crafter' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_OnCrafterSlotUpdated, SlotIndex) == 0x000008, "Member 'WBP_CrafterRecipeStep_Base_C_OnCrafterSlotUpdated::SlotIndex' has a wrong offset!");

// Function WBP_CrafterRecipeStep_Base.WBP_CrafterRecipeStep_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CrafterRecipeStep_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipeStep_Base_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CrafterRecipeStep_Base_C_PreConstruct");
static_assert(sizeof(WBP_CrafterRecipeStep_Base_C_PreConstruct) == 0x000001, "Wrong size on WBP_CrafterRecipeStep_Base_C_PreConstruct");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CrafterRecipeStep_Base_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CrafterRecipeStep_Base.WBP_CrafterRecipeStep_Base_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CrafterRecipeStep_Base_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipeStep_Base_C_Tick) == 0x000004, "Wrong alignment on WBP_CrafterRecipeStep_Base_C_Tick");
static_assert(sizeof(WBP_CrafterRecipeStep_Base_C_Tick) == 0x00003C, "Wrong size on WBP_CrafterRecipeStep_Base_C_Tick");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CrafterRecipeStep_Base_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CrafterRecipeStep_Base_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_CrafterRecipeStep_Base.WBP_CrafterRecipeStep_Base_C.Update Completion State Icon
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon final
{
public:
	bool                                          CallFunc_WasRequestStepStarted_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6195[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0040(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0054(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0068(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x007C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x0090(0x0014)()
	bool                                          CallFunc_IsRequestStepExpired_ReturnValue;         // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRequestStepDone_ReturnValue;            // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRequestStepActive_ReturnValue;          // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon) == 0x000004, "Wrong alignment on WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon");
static_assert(sizeof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon) == 0x0000A8, "Wrong size on WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, CallFunc_WasRequestStepStarted_ReturnValue) == 0x000000, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::CallFunc_WasRequestStepStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, K2Node_MakeStruct_SlateColor_2) == 0x00002C, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, K2Node_MakeStruct_SlateColor_3) == 0x000040, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, K2Node_MakeStruct_SlateColor_4) == 0x000054, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, K2Node_MakeStruct_SlateColor_5) == 0x000068, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, K2Node_MakeStruct_SlateColor_6) == 0x00007C, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, K2Node_MakeStruct_SlateColor_7) == 0x000090, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, CallFunc_IsRequestStepExpired_ReturnValue) == 0x0000A4, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::CallFunc_IsRequestStepExpired_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, CallFunc_IsRequestStepDone_ReturnValue) == 0x0000A5, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::CallFunc_IsRequestStepDone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon, CallFunc_IsRequestStepActive_ReturnValue) == 0x0000A6, "Member 'WBP_CrafterRecipeStep_Base_C_Update_Completion_State_Icon::CallFunc_IsRequestStepActive_ReturnValue' has a wrong offset!");

// Function WBP_CrafterRecipeStep_Base.WBP_CrafterRecipeStep_Base_C.UpdateExpirationTimer
// 0x0060 (0x0060 - 0x0000)
struct WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer final
{
public:
	double                                        ForceAlpha;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RemainingAlpha;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6196[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6197[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x003C(0x0014)()
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6198[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRequestRemainingNormalized_ReturnValue; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_RemainingAlpha_ImplicitCast;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer) == 0x000008, "Wrong alignment on WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer");
static_assert(sizeof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer) == 0x000060, "Wrong size on WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, ForceAlpha) == 0x000000, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::ForceAlpha' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, RemainingAlpha) == 0x000008, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::RemainingAlpha' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, Temp_bool_Variable) == 0x000010, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, Temp_byte_Variable) == 0x000011, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000013, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000014, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x000015, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, CallFunc_SelectColor_ReturnValue) == 0x000018, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, CallFunc_SelectColor_ReturnValue_1) == 0x000028, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, K2Node_MakeStruct_SlateColor) == 0x00003C, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, K2Node_Select_Default) == 0x000051, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, CallFunc_GetRequestRemainingNormalized_ReturnValue) == 0x000054, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::CallFunc_GetRequestRemainingNormalized_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer, K2Node_VariableSet_RemainingAlpha_ImplicitCast) == 0x000058, "Member 'WBP_CrafterRecipeStep_Base_C_UpdateExpirationTimer::K2Node_VariableSet_RemainingAlpha_ImplicitCast' has a wrong offset!");

}

