#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrafterInWorld

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.BP_OnCrafterChanged
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_CrafterInWorld_C_BP_OnCrafterChanged final
{
public:
	class UCrafterComponent*                      Crafter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxColumnsInteractions;                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxColumnsIngredients;                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxVisibleColumnsInteractions;                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxVisibleColumnsIngredients;                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxColumns;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C3[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C4[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C5[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C6[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C7[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C8[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C9[0x1];                                     // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue_2;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61CA[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateIngredients_AmountVisible;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrafterState                                 CallFunc_GetCrafterState_ReturnValue;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61CB[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateInteractions_AmountVisible;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_3;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61CC[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetColumnFill_Coefficient_ImplicitCast;   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetColumnFill_Coefficient_ImplicitCast_1; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_C_BP_OnCrafterChanged) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_BP_OnCrafterChanged");
static_assert(sizeof(WBP_CrafterInWorld_C_BP_OnCrafterChanged) == 0x0000A0, "Wrong size on WBP_CrafterInWorld_C_BP_OnCrafterChanged");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, Crafter) == 0x000000, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::Crafter' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, MaxColumnsInteractions) == 0x000008, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::MaxColumnsInteractions' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, MaxColumnsIngredients) == 0x00000C, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::MaxColumnsIngredients' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, MaxVisibleColumnsInteractions) == 0x000010, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::MaxVisibleColumnsInteractions' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, MaxVisibleColumnsIngredients) == 0x000014, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::MaxVisibleColumnsIngredients' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, MaxColumns) == 0x000018, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::MaxColumns' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, Temp_int_Variable) == 0x000020, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, Temp_byte_Variable) == 0x000028, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, Temp_byte_Variable_1) == 0x000029, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, Temp_bool_Variable) == 0x00002A, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000030, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Max_ReturnValue) == 0x000034, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000040, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000049, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_SelectInt_ReturnValue) == 0x00004C, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000050, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000054, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Max_ReturnValue_1) == 0x000058, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000060, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, Temp_int_Variable_1) == 0x000068, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_SelectInt_ReturnValue_1) == 0x00006C, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000070, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000078, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000079, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, K2Node_Select_Default) == 0x00007A, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Max_ReturnValue_2) == 0x00007C, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Max_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_IsVisible_ReturnValue) == 0x000080, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_UpdateIngredients_AmountVisible) == 0x000084, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_UpdateIngredients_AmountVisible' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_GetCrafterState_ReturnValue) == 0x000088, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_GetCrafterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_UpdateInteractions_AmountVisible) == 0x00008C, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_UpdateInteractions_AmountVisible' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_Max_ReturnValue_3) == 0x000090, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_Max_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000094, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000095, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_SetColumnFill_Coefficient_ImplicitCast) == 0x000098, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_SetColumnFill_Coefficient_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_BP_OnCrafterChanged, CallFunc_SetColumnFill_Coefficient_ImplicitCast_1) == 0x00009C, "Member 'WBP_CrafterInWorld_C_BP_OnCrafterChanged::CallFunc_SetColumnFill_Coefficient_ImplicitCast_1' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.CalculateNumberOfColumns
// 0x0018 (0x0018 - 0x0000)
struct WBP_CrafterInWorld_C_CalculateNumberOfColumns final
{
public:
	int32                                         NumElements;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumColumns;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61CD[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_C_CalculateNumberOfColumns) == 0x000004, "Wrong alignment on WBP_CrafterInWorld_C_CalculateNumberOfColumns");
static_assert(sizeof(WBP_CrafterInWorld_C_CalculateNumberOfColumns) == 0x000018, "Wrong size on WBP_CrafterInWorld_C_CalculateNumberOfColumns");
static_assert(offsetof(WBP_CrafterInWorld_C_CalculateNumberOfColumns, NumElements) == 0x000000, "Member 'WBP_CrafterInWorld_C_CalculateNumberOfColumns::NumElements' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_CalculateNumberOfColumns, NumColumns) == 0x000004, "Member 'WBP_CrafterInWorld_C_CalculateNumberOfColumns::NumColumns' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_CalculateNumberOfColumns, Temp_bool_Variable) == 0x000008, "Member 'WBP_CrafterInWorld_C_CalculateNumberOfColumns::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_CalculateNumberOfColumns, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000009, "Member 'WBP_CrafterInWorld_C_CalculateNumberOfColumns::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_CalculateNumberOfColumns, Temp_int_Variable) == 0x00000C, "Member 'WBP_CrafterInWorld_C_CalculateNumberOfColumns::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_CalculateNumberOfColumns, Temp_int_Variable_1) == 0x000010, "Member 'WBP_CrafterInWorld_C_CalculateNumberOfColumns::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_CalculateNumberOfColumns, K2Node_Select_Default) == 0x000014, "Member 'WBP_CrafterInWorld_C_CalculateNumberOfColumns::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.ConsiderDisablingCueMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_CrafterInWorld_C_ConsiderDisablingCueMode final
{
public:
	bool                                          CallFunc_ShouldBlockEnablingCueMode_ReturnValue;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_C_ConsiderDisablingCueMode) == 0x000001, "Wrong alignment on WBP_CrafterInWorld_C_ConsiderDisablingCueMode");
static_assert(sizeof(WBP_CrafterInWorld_C_ConsiderDisablingCueMode) == 0x000001, "Wrong size on WBP_CrafterInWorld_C_ConsiderDisablingCueMode");
static_assert(offsetof(WBP_CrafterInWorld_C_ConsiderDisablingCueMode, CallFunc_ShouldBlockEnablingCueMode_ReturnValue) == 0x000000, "Member 'WBP_CrafterInWorld_C_ConsiderDisablingCueMode::CallFunc_ShouldBlockEnablingCueMode_ReturnValue' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.CrafterHandleComplexRecipeFinished
// 0x0018 (0x0018 - 0x0000)
struct WBP_CrafterInWorld_C_CrafterHandleComplexRecipeFinished final
{
public:
	struct FComplexRecipeCrafter                  CrafterRecord;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_CrafterInWorld_C_CrafterHandleComplexRecipeFinished) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_CrafterHandleComplexRecipeFinished");
static_assert(sizeof(WBP_CrafterInWorld_C_CrafterHandleComplexRecipeFinished) == 0x000018, "Wrong size on WBP_CrafterInWorld_C_CrafterHandleComplexRecipeFinished");
static_assert(offsetof(WBP_CrafterInWorld_C_CrafterHandleComplexRecipeFinished, CrafterRecord) == 0x000000, "Member 'WBP_CrafterInWorld_C_CrafterHandleComplexRecipeFinished::CrafterRecord' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.CrafterHandleComplexRecipeStarted
// 0x0018 (0x0018 - 0x0000)
struct WBP_CrafterInWorld_C_CrafterHandleComplexRecipeStarted final
{
public:
	struct FComplexRecipeCrafter                  CrafterRecord;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_CrafterInWorld_C_CrafterHandleComplexRecipeStarted) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_CrafterHandleComplexRecipeStarted");
static_assert(sizeof(WBP_CrafterInWorld_C_CrafterHandleComplexRecipeStarted) == 0x000018, "Wrong size on WBP_CrafterInWorld_C_CrafterHandleComplexRecipeStarted");
static_assert(offsetof(WBP_CrafterInWorld_C_CrafterHandleComplexRecipeStarted, CrafterRecord) == 0x000000, "Member 'WBP_CrafterInWorld_C_CrafterHandleComplexRecipeStarted::CrafterRecord' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.EnactRecipeSlots
// 0x0088 (0x0088 - 0x0000)
struct WBP_CrafterInWorld_C_EnactRecipeSlots final
{
public:
	class UPanelWidget*                           ParentPanel;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Indices;                                           // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TSubclassOf<class UUserWidget>                WidgetToCreate;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CharReachable;                                     // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61CE[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumColumns;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61CF[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D0[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D1[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D2[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CrafterRecipeStep_Base_C*          K2Node_DynamicCast_AsWBP_Crafter_Recipe_Step_Base; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D3[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D4[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_C_EnactRecipeSlots) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_EnactRecipeSlots");
static_assert(sizeof(WBP_CrafterInWorld_C_EnactRecipeSlots) == 0x000088, "Wrong size on WBP_CrafterInWorld_C_EnactRecipeSlots");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, ParentPanel) == 0x000000, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::ParentPanel' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, Indices) == 0x000008, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::Indices' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, WidgetToCreate) == 0x000018, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::WidgetToCreate' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CharReachable) == 0x000020, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CharReachable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, NumColumns) == 0x000024, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::NumColumns' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, Temp_bool_True_if_break_was_hit_Variable) == 0x000028, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CallFunc_GetValeriaCharacter_OutResult) == 0x000038, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000040, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CallFunc_GetChildAt_ReturnValue) == 0x000050, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, K2Node_DynamicCast_AsWBP_Crafter_Recipe_Step_Base) == 0x000058, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::K2Node_DynamicCast_AsWBP_Crafter_Recipe_Step_Base' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CallFunc_Array_Get_Item) == 0x000064, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000068, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_EnactRecipeSlots, CallFunc_BooleanAND_ReturnValue) == 0x000080, "Member 'WBP_CrafterInWorld_C_EnactRecipeSlots::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.ExecuteUbergraph_WBP_CrafterInWorld
// 0x03B8 (0x03B8 - 0x0000)
struct WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrafterComponent*                      K2Node_Event_Crafter;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FCrafterConfig& MainCrafterConfig, struct FComplexRecipeRecord& RecipeRecord)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCrafterComponent*                      CallFunc_Set_Current_Crafter_OutCrafter;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FComplexRecipeRecord& RecipeRecord)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FComplexRecipeRecord& RecipeRecord)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCrafterConfig                         K2Node_CustomEvent_mainCrafterConfig;              // 0x0048(0x00E0)(ConstParm, HasGetValueTypeHash)
	struct FComplexRecipeRecord                   K2Node_CustomEvent_recipeRecord_2;                 // 0x0128(0x0070)(ConstParm, ContainsInstancedReference)
	struct FComplexRecipeRecord                   K2Node_CustomEvent_recipeRecord_1;                 // 0x0198(0x0070)(ConstParm, ContainsInstancedReference)
	struct FComplexRecipeRecord                   K2Node_CustomEvent_recipeRecord;                   // 0x0208(0x0070)(ConstParm, ContainsInstancedReference)
	class UCrafterComponent*                      K2Node_CustomEvent_Crafter;                        // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCrafterComponent* Crafter)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0280(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECrafterState                                 CallFunc_GetCrafterState_ReturnValue;              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D6[0x3];                                     // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCrafterComponent* Crafter)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0294(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D7[0x1];                                     // 0x02A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x02A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FComplexRecipeRecord& ComplexState, struct FComplexRecipeCrafter& CrafterState, int32 RecipeIndex)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x02B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FComplexRecipeRecord                   K2Node_CustomEvent_complexState;                   // 0x02C8(0x0070)(ConstParm, ContainsInstancedReference)
	struct FComplexRecipeCrafter                  K2Node_CustomEvent_CrafterState;                   // 0x0338(0x0018)(ConstParm, ContainsInstancedReference)
	int32                                         K2Node_CustomEvent_recipeIndex;                    // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D8[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComplexRecipeCrafter                  K2Node_CustomEvent_crafterRecord;                  // 0x0358(0x0018)(ConstParm, ContainsInstancedReference)
	struct FComplexRecipeCrafter                  K2Node_CustomEvent_crafterRecord_1;                // 0x0370(0x0018)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D9[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCookingSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0398(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x03A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld");
static_assert(sizeof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld) == 0x0003B8, "Wrong size on WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, EntryPoint) == 0x000000, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_Event_Crafter) == 0x000008, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_Event_Crafter' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, CallFunc_Set_Current_Crafter_OutCrafter) == 0x000020, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::CallFunc_Set_Current_Crafter_OutCrafter' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CustomEvent_mainCrafterConfig) == 0x000048, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CustomEvent_mainCrafterConfig' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CustomEvent_recipeRecord_2) == 0x000128, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CustomEvent_recipeRecord_2' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CustomEvent_recipeRecord_1) == 0x000198, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CustomEvent_recipeRecord_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CustomEvent_recipeRecord) == 0x000208, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CustomEvent_recipeRecord' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CustomEvent_Crafter) == 0x000278, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CustomEvent_Crafter' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CreateDelegate_OutputDelegate_3) == 0x000280, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, CallFunc_GetCrafterState_ReturnValue) == 0x000290, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::CallFunc_GetCrafterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CreateDelegate_OutputDelegate_4) == 0x000294, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_SwitchEnum_CmpSuccess) == 0x0002A4, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, CallFunc_IsValid_ReturnValue) == 0x0002A5, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, CallFunc_IsValid_ReturnValue_1) == 0x0002A6, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002A8, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002B8, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CustomEvent_complexState) == 0x0002C8, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CustomEvent_complexState' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CustomEvent_CrafterState) == 0x000338, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CustomEvent_CrafterState' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CustomEvent_recipeIndex) == 0x000350, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CustomEvent_recipeIndex' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CustomEvent_crafterRecord) == 0x000358, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CustomEvent_crafterRecord' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CustomEvent_crafterRecord_1) == 0x000370, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CustomEvent_crafterRecord_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000388, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000390, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CreateDelegate_OutputDelegate_7) == 0x000398, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld, K2Node_CreateDelegate_OutputDelegate_8) == 0x0003A8, "Member 'WBP_CrafterInWorld_C_ExecuteUbergraph_WBP_CrafterInWorld::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.GetRecipeItem
// 0x0340 (0x0340 - 0x0000)
struct WBP_CrafterInWorld_C_GetRecipeItem final
{
public:
	int32                                         RecipeConfigId;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61DA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           Item;                                              // 0x0008(0x0060)(Parm, OutParm)
	EValeriaFuncResult                            CallFunc_FindRecipeConfigById_OutResult;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61DB[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRecipeConfig                          CallFunc_FindRecipeConfigById_ReturnValue;         // 0x0070(0x0240)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61DC[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x02B8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FValeriaItem                           K2Node_MakeStruct_ValeriaItem;                     // 0x02E0(0x0060)()
};
static_assert(alignof(WBP_CrafterInWorld_C_GetRecipeItem) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_GetRecipeItem");
static_assert(sizeof(WBP_CrafterInWorld_C_GetRecipeItem) == 0x000340, "Wrong size on WBP_CrafterInWorld_C_GetRecipeItem");
static_assert(offsetof(WBP_CrafterInWorld_C_GetRecipeItem, RecipeConfigId) == 0x000000, "Member 'WBP_CrafterInWorld_C_GetRecipeItem::RecipeConfigId' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_GetRecipeItem, Item) == 0x000008, "Member 'WBP_CrafterInWorld_C_GetRecipeItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_GetRecipeItem, CallFunc_FindRecipeConfigById_OutResult) == 0x000068, "Member 'WBP_CrafterInWorld_C_GetRecipeItem::CallFunc_FindRecipeConfigById_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_GetRecipeItem, CallFunc_FindRecipeConfigById_ReturnValue) == 0x000070, "Member 'WBP_CrafterInWorld_C_GetRecipeItem::CallFunc_FindRecipeConfigById_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_GetRecipeItem, K2Node_SwitchEnum_CmpSuccess) == 0x0002B0, "Member 'WBP_CrafterInWorld_C_GetRecipeItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_GetRecipeItem, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0002B8, "Member 'WBP_CrafterInWorld_C_GetRecipeItem::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_GetRecipeItem, K2Node_MakeStruct_ValeriaItem) == 0x0002E0, "Member 'WBP_CrafterInWorld_C_GetRecipeItem::K2Node_MakeStruct_ValeriaItem' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.HandleComplexRecipeExited
// 0x0070 (0x0070 - 0x0000)
struct WBP_CrafterInWorld_C_HandleComplexRecipeExited final
{
public:
	struct FComplexRecipeRecord                   RecipeRecord;                                      // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_CrafterInWorld_C_HandleComplexRecipeExited) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_HandleComplexRecipeExited");
static_assert(sizeof(WBP_CrafterInWorld_C_HandleComplexRecipeExited) == 0x000070, "Wrong size on WBP_CrafterInWorld_C_HandleComplexRecipeExited");
static_assert(offsetof(WBP_CrafterInWorld_C_HandleComplexRecipeExited, RecipeRecord) == 0x000000, "Member 'WBP_CrafterInWorld_C_HandleComplexRecipeExited::RecipeRecord' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.HandleComplexRecipeFinishing
// 0x0070 (0x0070 - 0x0000)
struct WBP_CrafterInWorld_C_HandleComplexRecipeFinishing final
{
public:
	struct FComplexRecipeRecord                   RecipeRecord;                                      // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_CrafterInWorld_C_HandleComplexRecipeFinishing) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_HandleComplexRecipeFinishing");
static_assert(sizeof(WBP_CrafterInWorld_C_HandleComplexRecipeFinishing) == 0x000070, "Wrong size on WBP_CrafterInWorld_C_HandleComplexRecipeFinishing");
static_assert(offsetof(WBP_CrafterInWorld_C_HandleComplexRecipeFinishing, RecipeRecord) == 0x000000, "Member 'WBP_CrafterInWorld_C_HandleComplexRecipeFinishing::RecipeRecord' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.HandleComplexRecipeJoin
// 0x0150 (0x0150 - 0x0000)
struct WBP_CrafterInWorld_C_HandleComplexRecipeJoin final
{
public:
	struct FCrafterConfig                         MainCrafterConfig;                                 // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FComplexRecipeRecord                   RecipeRecord;                                      // 0x00E0(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_CrafterInWorld_C_HandleComplexRecipeJoin) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_HandleComplexRecipeJoin");
static_assert(sizeof(WBP_CrafterInWorld_C_HandleComplexRecipeJoin) == 0x000150, "Wrong size on WBP_CrafterInWorld_C_HandleComplexRecipeJoin");
static_assert(offsetof(WBP_CrafterInWorld_C_HandleComplexRecipeJoin, MainCrafterConfig) == 0x000000, "Member 'WBP_CrafterInWorld_C_HandleComplexRecipeJoin::MainCrafterConfig' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_HandleComplexRecipeJoin, RecipeRecord) == 0x0000E0, "Member 'WBP_CrafterInWorld_C_HandleComplexRecipeJoin::RecipeRecord' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.HandleCrafterChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CrafterInWorld_C_HandleCrafterChanged__DelegateSignature final
{
public:
	class UObject*                                Crafter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_C_HandleCrafterChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_HandleCrafterChanged__DelegateSignature");
static_assert(sizeof(WBP_CrafterInWorld_C_HandleCrafterChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_CrafterInWorld_C_HandleCrafterChanged__DelegateSignature");
static_assert(offsetof(WBP_CrafterInWorld_C_HandleCrafterChanged__DelegateSignature, Crafter) == 0x000000, "Member 'WBP_CrafterInWorld_C_HandleCrafterChanged__DelegateSignature::Crafter' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.HandleOnRecipeBrowse
// 0x0090 (0x0090 - 0x0000)
struct WBP_CrafterInWorld_C_HandleOnRecipeBrowse final
{
public:
	struct FComplexRecipeRecord                   ComplexState;                                      // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FComplexRecipeCrafter                  CrafterState;                                      // 0x0070(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         RecipeIndex;                                       // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_C_HandleOnRecipeBrowse) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_HandleOnRecipeBrowse");
static_assert(sizeof(WBP_CrafterInWorld_C_HandleOnRecipeBrowse) == 0x000090, "Wrong size on WBP_CrafterInWorld_C_HandleOnRecipeBrowse");
static_assert(offsetof(WBP_CrafterInWorld_C_HandleOnRecipeBrowse, ComplexState) == 0x000000, "Member 'WBP_CrafterInWorld_C_HandleOnRecipeBrowse::ComplexState' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_HandleOnRecipeBrowse, CrafterState) == 0x000070, "Member 'WBP_CrafterInWorld_C_HandleOnRecipeBrowse::CrafterState' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_C_HandleOnRecipeBrowse, RecipeIndex) == 0x000088, "Member 'WBP_CrafterInWorld_C_HandleOnRecipeBrowse::RecipeIndex' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.LinkOrUnlinkCrafter
// 0x0008 (0x0008 - 0x0000)
struct WBP_CrafterInWorld_C_LinkOrUnlinkCrafter final
{
public:
	class UCrafterComponent*                      Crafter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_C_LinkOrUnlinkCrafter) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_LinkOrUnlinkCrafter");
static_assert(sizeof(WBP_CrafterInWorld_C_LinkOrUnlinkCrafter) == 0x000008, "Wrong size on WBP_CrafterInWorld_C_LinkOrUnlinkCrafter");
static_assert(offsetof(WBP_CrafterInWorld_C_LinkOrUnlinkCrafter, Crafter) == 0x000000, "Member 'WBP_CrafterInWorld_C_LinkOrUnlinkCrafter::Crafter' has a wrong offset!");

// Function WBP_CrafterInWorld.WBP_CrafterInWorld_C.OnComplexCrafterStateChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_CrafterInWorld_C_OnComplexCrafterStateChanged final
{
public:
	class UCrafterComponent*                      Crafter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_C_OnComplexCrafterStateChanged) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_C_OnComplexCrafterStateChanged");
static_assert(sizeof(WBP_CrafterInWorld_C_OnComplexCrafterStateChanged) == 0x000008, "Wrong size on WBP_CrafterInWorld_C_OnComplexCrafterStateChanged");
static_assert(offsetof(WBP_CrafterInWorld_C_OnComplexCrafterStateChanged, Crafter) == 0x000000, "Member 'WBP_CrafterInWorld_C_OnComplexCrafterStateChanged::Crafter' has a wrong offset!");

