#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NotificationCountBadge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NotificationCountBadge.WBP_NotificationCountBadge_C
// 0x0030 (0x02F0 - 0x02C0)
class UWBP_NotificationCountBadge_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_Border_Styled*                   Border_Styled;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Badge;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CountThreshold;                                    // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C85[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_BorderStyle*                     NotificationBorderStyle;                           // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bShouldUpdateVisibilityAutomatically;              // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_NotificationCountBadge(int32 EntryPoint, bool K2Node_Event_IsDesignTime);
	void PreConstruct(bool IsDesignTime);
	void UpdateCount(int32 Count, class FText CallFunc_Conv_IntToText_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NotificationCountBadge_C">();
	}
	static class UWBP_NotificationCountBadge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NotificationCountBadge_C>();
	}
};
static_assert(alignof(UWBP_NotificationCountBadge_C) == 0x000008, "Wrong alignment on UWBP_NotificationCountBadge_C");
static_assert(sizeof(UWBP_NotificationCountBadge_C) == 0x0002F0, "Wrong size on UWBP_NotificationCountBadge_C");
static_assert(offsetof(UWBP_NotificationCountBadge_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_NotificationCountBadge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationCountBadge_C, Border_Styled) == 0x0002C8, "Member 'UWBP_NotificationCountBadge_C::Border_Styled' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationCountBadge_C, TextBlock_Badge) == 0x0002D0, "Member 'UWBP_NotificationCountBadge_C::TextBlock_Badge' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationCountBadge_C, CountThreshold) == 0x0002D8, "Member 'UWBP_NotificationCountBadge_C::CountThreshold' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationCountBadge_C, NotificationBorderStyle) == 0x0002E0, "Member 'UWBP_NotificationCountBadge_C::NotificationBorderStyle' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationCountBadge_C, bShouldUpdateVisibilityAutomatically) == 0x0002E8, "Member 'UWBP_NotificationCountBadge_C::bShouldUpdateVisibilityAutomatically' has a wrong offset!");

}

