#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ComboBox_Menu_Option_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ComboBox_Menu_Option_CM.WBP_ComboBox_Menu_Option_CM_C.BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_OnButtonPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_OnButtonPressed__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_OnButtonPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_OnButtonPressed__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_OnButtonPressed__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_OnButtonPressed__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_OnButtonPressed__DelegateSignature, Button) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_OnButtonPressed__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_CM.WBP_ComboBox_Menu_Option_CM_C.BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_CM_C_BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_CM.WBP_ComboBox_Menu_Option_CM_C.ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM
// 0x0038 (0x0038 - 0x0000)
struct WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsShow;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5356[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0018(0x0018)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM");
static_assert(sizeof(WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM) == 0x000038, "Wrong size on WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM, EntryPoint) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM, K2Node_Event_bIsShow) == 0x000004, "Member 'WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM::K2Node_Event_bIsShow' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000008, "Member 'WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x00000C, "Member 'WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000010, "Member 'WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM, CallFunc_GetText_ReturnValue) == 0x000018, "Member 'WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'WBP_ComboBox_Menu_Option_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_CM.WBP_ComboBox_Menu_Option_CM_C.OnFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_Menu_Option_CM_C_OnFocused__DelegateSignature final
{
public:
	class UWidget*                                FocusWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_CM_C_OnFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_CM_C_OnFocused__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_Menu_Option_CM_C_OnFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_Menu_Option_CM_C_OnFocused__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_OnFocused__DelegateSignature, FocusWidget) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_CM_C_OnFocused__DelegateSignature::FocusWidget' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_CM.WBP_ComboBox_Menu_Option_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_ComboBox_Menu_Option_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_CM.WBP_ComboBox_Menu_Option_CM_C.OnOptionSelected__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_ComboBox_Menu_Option_CM_C_OnOptionSelected__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5357[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_CM_C_OnOptionSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_CM_C_OnOptionSelected__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_Menu_Option_CM_C_OnOptionSelected__DelegateSignature) == 0x000020, "Wrong size on WBP_ComboBox_Menu_Option_CM_C_OnOptionSelected__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_OnOptionSelected__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_CM_C_OnOptionSelected__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_OnOptionSelected__DelegateSignature, Text) == 0x000008, "Member 'WBP_ComboBox_Menu_Option_CM_C_OnOptionSelected__DelegateSignature::Text' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_CM.WBP_ComboBox_Menu_Option_CM_C.ShowFocusTip
// 0x0001 (0x0001 - 0x0000)
struct WBP_ComboBox_Menu_Option_CM_C_ShowFocusTip final
{
public:
	bool                                          bIsShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_CM_C_ShowFocusTip) == 0x000001, "Wrong alignment on WBP_ComboBox_Menu_Option_CM_C_ShowFocusTip");
static_assert(sizeof(WBP_ComboBox_Menu_Option_CM_C_ShowFocusTip) == 0x000001, "Wrong size on WBP_ComboBox_Menu_Option_CM_C_ShowFocusTip");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_ShowFocusTip, bIsShow) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_CM_C_ShowFocusTip::bIsShow' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_CM.WBP_ComboBox_Menu_Option_CM_C.IsEmpty
// 0x0001 (0x0001 - 0x0000)
struct WBP_ComboBox_Menu_Option_CM_C_IsEmpty final
{
public:
	bool                                          bIsEmpty;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_CM_C_IsEmpty) == 0x000001, "Wrong alignment on WBP_ComboBox_Menu_Option_CM_C_IsEmpty");
static_assert(sizeof(WBP_ComboBox_Menu_Option_CM_C_IsEmpty) == 0x000001, "Wrong size on WBP_ComboBox_Menu_Option_CM_C_IsEmpty");
static_assert(offsetof(WBP_ComboBox_Menu_Option_CM_C_IsEmpty, bIsEmpty) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_CM_C_IsEmpty::bIsEmpty' has a wrong offset!");

}

