#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadialMenuWheel_Circular

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_RadialMenuWheel_Circular.WBP_RadialMenuWheel_Circular_C.ConvertToRadialCoord
// 0x0140 (0x0140 - 0x0000)
struct WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord final
{
public:
	struct FGeometry                              Geometry;                                          // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	double                                        Angle;                                             // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x00B8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ToDirectionAndLength2D_OutDir;            // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ToDirectionAndLength2D_OutLength;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAtan2_ReturnValue;                     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord) == 0x000008, "Wrong alignment on WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord");
static_assert(sizeof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord) == 0x000140, "Wrong size on WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, Geometry) == 0x000000, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::Geometry' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, PointerEvent) == 0x000038, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, Angle) == 0x0000B0, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::Angle' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, Distance) == 0x0000B8, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::Distance' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, CallFunc_GetLocalSize_ReturnValue) == 0x0000C0, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue) == 0x0000D0, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x0000E0, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, CallFunc_AbsoluteToLocal_ReturnValue) == 0x0000F0, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000100, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, CallFunc_ToDirectionAndLength2D_OutDir) == 0x000110, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::CallFunc_ToDirectionAndLength2D_OutDir' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, CallFunc_ToDirectionAndLength2D_OutLength) == 0x000120, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::CallFunc_ToDirectionAndLength2D_OutLength' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, CallFunc_BreakVector2D_X) == 0x000128, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, CallFunc_BreakVector2D_Y) == 0x000130, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord, CallFunc_DegAtan2_ReturnValue) == 0x000138, "Member 'WBP_RadialMenuWheel_Circular_C_ConvertToRadialCoord::CallFunc_DegAtan2_ReturnValue' has a wrong offset!");

// Function WBP_RadialMenuWheel_Circular.WBP_RadialMenuWheel_Circular_C.ExecuteUbergraph_WBP_RadialMenuWheel_Circular
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E15[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E16[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SlotIndexToAngle_Angle;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegCos_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E17[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E18[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNamedSlot*                             CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E19[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1A[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRadialSelectionEnabled;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1B[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameInstance*                   K2Node_DynamicCast_AsValeria_Game_Instance;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1C[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1D[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class UNamedSlot*>                     K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular) == 0x000008, "Wrong alignment on WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular");
static_assert(sizeof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular) == 0x0000E0, "Wrong size on WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, EntryPoint) == 0x000000, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, Temp_bool_Variable) == 0x000004, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, Temp_byte_Variable) == 0x000005, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_SlotIndexToAngle_Angle) == 0x000020, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_SlotIndexToAngle_Angle' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_DegSin_ReturnValue) == 0x000028, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_DegCos_ReturnValue) == 0x000030, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000058, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000060, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000070, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000078, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, K2Node_MakeStruct_Margin) == 0x000080, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, K2Node_Select_Default) == 0x000090, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, K2Node_CustomEvent_bRadialSelectionEnabled) == 0x000091, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::K2Node_CustomEvent_bRadialSelectionEnabled' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_GetGameInstance_ReturnValue) == 0x000098, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, K2Node_DynamicCast_AsValeria_Game_Instance) == 0x0000A0, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::K2Node_DynamicCast_AsValeria_Game_Instance' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, Temp_int_Loop_Counter_Variable) == 0x0000AC, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000B4, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B8, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, K2Node_MakeArray_Array) == 0x0000C0, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x0000D0, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x0000D4, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, K2Node_MakeStruct_Top_ImplicitCast) == 0x0000D8, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular, K2Node_MakeStruct_Left_ImplicitCast) == 0x0000DC, "Member 'WBP_RadialMenuWheel_Circular_C_ExecuteUbergraph_WBP_RadialMenuWheel_Circular::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");

// Function WBP_RadialMenuWheel_Circular.WBP_RadialMenuWheel_Circular_C.Find Slot At Angle On Console
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console final
{
public:
	double                                        Angle;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             Param_Slot;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        RangeOfValidity;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             MinDistanceSlot;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UNamedSlot*>                     SameDirectionSlots;                                // 0x0020(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SlotIndexToAngle_Angle;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1E[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_1;                // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_2;                // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1F[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E20[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_3;                // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize2D_ReturnValue;                      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E21[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_DegCos_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E22[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue_1;                   // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DotProduct2D_ReturnValue;                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E23[0x6];                                     // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNamedSlot*                             CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E24[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNamedSlot*                             CallFunc_Array_Get_Item_1;                         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_4;                // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E25[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_2;  // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E26[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize2D_ReturnValue_1;                    // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E27[0x2];                                     // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E28[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_MathExpression_ReturnValue;                 // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E29[0x2];                                     // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             CallFunc_Array_Get_Item_2;                         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2A[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console) == 0x000008, "Wrong alignment on WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console");
static_assert(sizeof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console) == 0x0001C8, "Wrong size on WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, Angle) == 0x000000, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::Angle' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, Param_Slot) == 0x000008, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::Param_Slot' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, RangeOfValidity) == 0x000010, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::RangeOfValidity' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, MinDistanceSlot) == 0x000018, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::MinDistanceSlot' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, SameDirectionSlots) == 0x000020, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::SameDirectionSlots' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_SlotIndexToAngle_Angle) == 0x000038, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_SlotIndexToAngle_Angle' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000040, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_GetPosition_ReturnValue) == 0x000048, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000058, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000060, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000068, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_GetPosition_ReturnValue_1) == 0x000070, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_GetPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_GetPosition_ReturnValue_2) == 0x000080, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_GetPosition_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000090, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Normal2D_ReturnValue) == 0x0000A8, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x0000C0, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_GetPosition_ReturnValue_3) == 0x0000C8, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_GetPosition_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x0000D8, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_VSize2D_ReturnValue) == 0x0000E8, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, Temp_int_Loop_Counter_Variable_1) == 0x0000F0, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_DegCos_ReturnValue) == 0x0000F8, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_DegSin_ReturnValue) == 0x000100, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Add_IntInt_ReturnValue_1) == 0x000108, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_MakeVector2D_ReturnValue) == 0x000110, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Normal2D_ReturnValue_1) == 0x000120, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Normal2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_DotProduct2D_ReturnValue) == 0x000130, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_DotProduct2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000138, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_IsValid_ReturnValue) == 0x000139, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Array_Get_Item) == 0x000140, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Array_IsEmpty_ReturnValue) == 0x000148, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Not_PreBool_ReturnValue) == 0x000149, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Array_Get_Item_1) == 0x000150, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000158, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_GetPosition_ReturnValue_4) == 0x000160, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_GetPosition_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Array_Length_ReturnValue) == 0x000170, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Subtract_Vector2DVector2D_ReturnValue_2) == 0x000178, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Subtract_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Less_IntInt_ReturnValue) == 0x000188, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_VSize2D_ReturnValue_1) == 0x000190, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_VSize2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000198, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, Temp_bool_Variable) == 0x000199, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Array_Add_ReturnValue) == 0x00019C, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, Temp_bool_Variable_1) == 0x0001A0, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, K2Node_MathExpression_ReturnValue) == 0x0001A8, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, K2Node_Select_Default) == 0x0001B0, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0001B1, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Array_Length_ReturnValue_1) == 0x0001B4, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Array_Get_Item_2) == 0x0001B8, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C0, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console, CallFunc_Array_Add_ReturnValue_1) == 0x0001C4, "Member 'WBP_RadialMenuWheel_Circular_C_Find_Slot_At_Angle_On_Console::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function WBP_RadialMenuWheel_Circular.WBP_RadialMenuWheel_Circular_C.FindSlotAtAngle
// 0x0060 (0x0060 - 0x0000)
struct WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle final
{
public:
	double                                        Angle;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             Param_Slot;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SlotIndexToAngle_Angle;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2B[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_MathExpression_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2C[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2D[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle) == 0x000008, "Wrong alignment on WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle");
static_assert(sizeof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle) == 0x000060, "Wrong size on WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, Angle) == 0x000000, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::Angle' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, Distance) == 0x000008, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::Distance' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, Param_Slot) == 0x000010, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::Param_Slot' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, CallFunc_SlotIndexToAngle_Angle) == 0x000020, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::CallFunc_SlotIndexToAngle_Angle' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, K2Node_MathExpression_ReturnValue) == 0x000030, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000050, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'WBP_RadialMenuWheel_Circular_C_FindSlotAtAngle::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function WBP_RadialMenuWheel_Circular.WBP_RadialMenuWheel_Circular_C.FinishSelecting
// 0x0040 (0x0040 - 0x0000)
struct WBP_RadialMenuWheel_Circular_C_FinishSelecting final
{
public:
	class UWidget*                                SelectedWidget;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          SelectionCancelled;                                // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2E[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Result;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetContent_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetContent_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
