#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FTUESettings_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FTUESettings_CM.WBP_FTUESettings_CM_C
// 0x0040 (0x0550 - 0x0510)
class UWBP_FTUESettings_CM_C final : public UCommonActivatableWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_SetAllFlags_CM;                             // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsItem_Checkbox_CM_C*        Checkbox_EnableTips_CM;                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ListView_Styled*                 ListView_FTUEFlags_01;                             // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ListView_Styled*                 ListView_FTUEFlags_02;                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ScrollBox_Styled*                VALUI_ScrollBox_Styled_1;                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Secondary_01_CM_C* WBP_Template_Button_Secondary_01_CM;               // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ScrollMoveSpeed;                                   // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_FTUESettings_CM_Button_SetAllFlags_CM_K2Node_ComponentBoundEvent_4_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_FTUESettings_CM_Checkbox_EnableTips_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature(bool Checked);
	void BndEvt__WBP_FTUESettings_CM_WBP_Template_Button_Secondary_01_CM_K2Node_ComponentBoundEvent_3_OnButtonClicked__DelegateSignature();
	void BP_OnActivated();
	void Construct();
	void ExecuteUbergraph_WBP_FTUESettings_CM(int32 EntryPoint, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, bool K2Node_ComponentBoundEvent_Checked);
	void Get_Scroll_Offset(float* Offset, float* Offset_of_End, float CallFunc_GetScrollOffset_ReturnValue, float CallFunc_GetScrollOffsetOfEnd_ReturnValue);
	void HandleFTUEFlagsChanged(class UVAL_TutorialFlagsManager* FTUEFlagsManager);
	void OnInitialized();
	void PopulateFTUEFlagsList(const TArray<class UObject*>& HalfFTUEFlagsArray_02, const TArray<class UObject*>& HalfFTUEFlagsArray_01, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_Variable, bool CallFunc_Not_PreBool_ReturnValue, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, const TSet<TSoftObjectPtr<class UVAL_TutorialFlagDefinition>>& CallFunc_GetAllPossibleFlags_ReturnValue, TArray<TSoftObjectPtr<class UVAL_TutorialFlagDefinition>>& CallFunc_Set_ToArray_Result, TSoftObjectPtr<class UVAL_TutorialFlagDefinition> CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UObject* CallFunc_LoadAsset_Blocking_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1);
	void Set_Scroll_Offset(float Offset);
	void SynchronizeState(int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, TArray<class UUserWidget*>& CallFunc_GetDisplayedEntryWidgets_ReturnValue, class UUserWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UWBP_FTUEFlagListEntry_C* K2Node_DynamicCast_AsWBP_FTUEFlag_List_Entry, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, TArray<class UUserWidget*>& CallFunc_GetDisplayedEntryWidgets_ReturnValue_1, bool CallFunc_IsTutorialEnabled_ReturnValue, class UUserWidget* CallFunc_Array_Get_Item_1, class UWBP_FTUEFlagListEntry_C* K2Node_DynamicCast_AsWBP_FTUEFlag_List_Entry_1, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FTUESettings_CM_C">();
	}
	static class UWBP_FTUESettings_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FTUESettings_CM_C>();
	}
};
static_assert(alignof(UWBP_FTUESettings_CM_C) == 0x000008, "Wrong alignment on UWBP_FTUESettings_CM_C");
static_assert(sizeof(UWBP_FTUESettings_CM_C) == 0x000550, "Wrong size on UWBP_FTUESettings_CM_C");
static_assert(offsetof(UWBP_FTUESettings_CM_C, UberGraphFrame) == 0x000510, "Member 'UWBP_FTUESettings_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FTUESettings_CM_C, Button_SetAllFlags_CM) == 0x000518, "Member 'UWBP_FTUESettings_CM_C::Button_SetAllFlags_CM' has a wrong offset!");
static_assert(offsetof(UWBP_FTUESettings_CM_C, Checkbox_EnableTips_CM) == 0x000520, "Member 'UWBP_FTUESettings_CM_C::Checkbox_EnableTips_CM' has a wrong offset!");
static_assert(offsetof(UWBP_FTUESettings_CM_C, ListView_FTUEFlags_01) == 0x000528, "Member 'UWBP_FTUESettings_CM_C::ListView_FTUEFlags_01' has a wrong offset!");
static_assert(offsetof(UWBP_FTUESettings_CM_C, ListView_FTUEFlags_02) == 0x000530, "Member 'UWBP_FTUESettings_CM_C::ListView_FTUEFlags_02' has a wrong offset!");
static_assert(offsetof(UWBP_FTUESettings_CM_C, VALUI_ScrollBox_Styled_1) == 0x000538, "Member 'UWBP_FTUESettings_CM_C::VALUI_ScrollBox_Styled_1' has a wrong offset!");
static_assert(offsetof(UWBP_FTUESettings_CM_C, WBP_Template_Button_Secondary_01_CM) == 0x000540, "Member 'UWBP_FTUESettings_CM_C::WBP_Template_Button_Secondary_01_CM' has a wrong offset!");
static_assert(offsetof(UWBP_FTUESettings_CM_C, ScrollMoveSpeed) == 0x000548, "Member 'UWBP_FTUESettings_CM_C::ScrollMoveSpeed' has a wrong offset!");

}

