#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CircularToolWheel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "S6Core_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CircularToolWheel.WBP_CircularToolWheel_C.BndEvt__WBP_CircularToolWheel_CM_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_2_OnChoiceHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_CM_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_2_OnChoiceHovered__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_CM_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_2_OnChoiceHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_CM_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_2_OnChoiceHovered__DelegateSignature");
static_assert(sizeof(WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_CM_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_2_OnChoiceHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_CM_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_2_OnChoiceHovered__DelegateSignature");
static_assert(offsetof(WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_CM_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_2_OnChoiceHovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_CM_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_2_OnChoiceHovered__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_CircularToolWheel.WBP_CircularToolWheel_C.BndEvt__WBP_CircularToolWheel_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_0_OnChoiceUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_0_OnChoiceUnhovered__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_0_OnChoiceUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_0_OnChoiceUnhovered__DelegateSignature");
static_assert(sizeof(WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_0_OnChoiceUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_0_OnChoiceUnhovered__DelegateSignature");
static_assert(offsetof(WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_0_OnChoiceUnhovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_CircularToolWheel_C_BndEvt__WBP_CircularToolWheel_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_0_OnChoiceUnhovered__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_CircularToolWheel.WBP_CircularToolWheel_C.Clear Gamepad Dragged Item
// 0x0001 (0x0001 - 0x0000)
struct WBP_CircularToolWheel_C_Clear_Gamepad_Dragged_Item final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CircularToolWheel_C_Clear_Gamepad_Dragged_Item) == 0x000001, "Wrong alignment on WBP_CircularToolWheel_C_Clear_Gamepad_Dragged_Item");
static_assert(sizeof(WBP_CircularToolWheel_C_Clear_Gamepad_Dragged_Item) == 0x000001, "Wrong size on WBP_CircularToolWheel_C_Clear_Gamepad_Dragged_Item");
static_assert(offsetof(WBP_CircularToolWheel_C_Clear_Gamepad_Dragged_Item, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_CircularToolWheel_C_Clear_Gamepad_Dragged_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_CircularToolWheel.WBP_CircularToolWheel_C.DeadzoneCheck
// 0x0028 (0x0028 - 0x0000)
struct WBP_CircularToolWheel_C_DeadzoneCheck final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5970[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5971[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CircularToolWheel_C_DeadzoneCheck) == 0x000008, "Wrong alignment on WBP_CircularToolWheel_C_DeadzoneCheck");
static_assert(sizeof(WBP_CircularToolWheel_C_DeadzoneCheck) == 0x000028, "Wrong size on WBP_CircularToolWheel_C_DeadzoneCheck");
static_assert(offsetof(WBP_CircularToolWheel_C_DeadzoneCheck, ReturnValue) == 0x000000, "Member 'WBP_CircularToolWheel_C_DeadzoneCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_DeadzoneCheck, CallFunc_GetPlatformType_ReturnValue) == 0x000001, "Member 'WBP_CircularToolWheel_C_DeadzoneCheck::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_DeadzoneCheck, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_CircularToolWheel_C_DeadzoneCheck::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_DeadzoneCheck, CallFunc_Abs_ReturnValue) == 0x000008, "Member 'WBP_CircularToolWheel_C_DeadzoneCheck::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_DeadzoneCheck, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_CircularToolWheel_C_DeadzoneCheck::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_DeadzoneCheck, CallFunc_Abs_ReturnValue_1) == 0x000018, "Member 'WBP_CircularToolWheel_C_DeadzoneCheck::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_DeadzoneCheck, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'WBP_CircularToolWheel_C_DeadzoneCheck::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_DeadzoneCheck, CallFunc_BooleanOR_ReturnValue) == 0x000021, "Member 'WBP_CircularToolWheel_C_DeadzoneCheck::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_CircularToolWheel.WBP_CircularToolWheel_C.Deselect All Tools
// 0x0048 (0x0048 - 0x0000)
struct WBP_CircularToolWheel_C_Deselect_All_Tools final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5972[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllSlotWidgets_Widgets;                // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5973[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5974[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ToolTile_CM_C*                     K2Node_DynamicCast_AsWBP_Tool_Tile_CM;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CircularToolWheel_C_Deselect_All_Tools) == 0x000008, "Wrong alignment on WBP_CircularToolWheel_C_Deselect_All_Tools");
static_assert(sizeof(WBP_CircularToolWheel_C_Deselect_All_Tools) == 0x000048, "Wrong size on WBP_CircularToolWheel_C_Deselect_All_Tools");
static_assert(offsetof(WBP_CircularToolWheel_C_Deselect_All_Tools, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_CircularToolWheel_C_Deselect_All_Tools::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_Deselect_All_Tools, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_CircularToolWheel_C_Deselect_All_Tools::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_Deselect_All_Tools, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CircularToolWheel_C_Deselect_All_Tools::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_Deselect_All_Tools, CallFunc_GetAllSlotWidgets_Widgets) == 0x000010, "Member 'WBP_CircularToolWheel_C_Deselect_All_Tools::CallFunc_GetAllSlotWidgets_Widgets' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_Deselect_All_Tools, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_CircularToolWheel_C_Deselect_All_Tools::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_Deselect_All_Tools, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_CircularToolWheel_C_Deselect_All_Tools::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_Deselect_All_Tools, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_CircularToolWheel_C_Deselect_All_Tools::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_Deselect_All_Tools, K2Node_DynamicCast_AsWBP_Tool_Tile_CM) == 0x000038, "Member 'WBP_CircularToolWheel_C_Deselect_All_Tools::K2Node_DynamicCast_AsWBP_Tool_Tile_CM' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_Deselect_All_Tools, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_CircularToolWheel_C_Deselect_All_Tools::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_CircularToolWheel.WBP_CircularToolWheel_C.EquipTool
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_CircularToolWheel_C_EquipTool final
{
public:
	struct FBagSlotLocation                       BagSlot;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          CallFunc_K2_IsTimerPausedHandle_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5975[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5976[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InteractablePlateWidgetComponent_C* CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Client_TryEquipItemFromInventory_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Client_TryUnequip_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5977[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipmentItem                         CallFunc_GetEquippedItem_ReturnValue;              // 0x0040(0x0050)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CircularToolWheel_C_EquipTool) == 0x000008, "Wrong alignment on WBP_CircularToolWheel_C_EquipTool");
static_assert(sizeof(WBP_CircularToolWheel_C_EquipTool) == 0x0000C0, "Wrong size on WBP_CircularToolWheel_C_EquipTool");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, BagSlot) == 0x000000, "Member 'WBP_CircularToolWheel_C_EquipTool::BagSlot' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_K2_IsTimerPausedHandle_ReturnValue) == 0x000008, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_K2_IsTimerPausedHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000009, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x00000A, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x00000B, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_GetValeriaCharacter_OutResult) == 0x00000D, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_CircularToolWheel_C_EquipTool::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_GetEquipment_ReturnValue) == 0x000028, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000030, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_Client_TryEquipItemFromInventory_ReturnValue) == 0x000038, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_Client_TryEquipItemFromInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_Client_TryUnequip_ReturnValue) == 0x000039, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_Client_TryUnequip_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_GetEquippedItem_ReturnValue) == 0x000040, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_GetEquippedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'WBP_CircularToolWheel_C_EquipTool::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000A0, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000A8, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, K2Node_DynamicCast_AsItem_Type_Definition) == 0x0000B0, "Member 'WBP_CircularToolWheel_C_EquipTool::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'WBP_CircularToolWheel_C_EquipTool::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000B9, "Member 'WBP_CircularToolWheel_C_EquipTool::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_EquipTool, CallFunc_HasTag_ReturnValue) == 0x0000BA, "Member 'WBP_CircularToolWheel_C_EquipTool::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function WBP_CircularToolWheel.WBP_CircularToolWheel_C.ExecuteUbergraph_WBP_CircularToolWheel
// 0x0550 (0x0550 - 0x0000)
struct WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5978[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBagSlotLocation                       CallFunc_GetBagSlotLocation_BagSlotLocation;       // 0x0008(0x0008)(NoDestructor)
	bool                                          CallFunc_HasItem_bHasItem;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5979[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597A[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0028(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0050(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597B[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597C[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_ToolTile_CM_C* ToolTile)> K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, const struct FEquipmentItem& Item)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_CustomEvent_My_Geometry;                    // 0x00D0(0x0038)(IsPlainOldData, NoDestructor)
	struct FValeriaItem                           K2Node_CustomEvent_Valeria_Item;                   // 0x0108(0x0060)()
	struct FBagSlotLocation                       K2Node_CustomEvent_Bag_Slot_Location;              // 0x0168(0x0008)(NoDestructor)
	struct FValeriaItem                           K2Node_CustomEvent_Item_1;                         // 0x0170(0x0060)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597D[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597E[0x3];                                     // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597F[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5980[0x6];                                     // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ToolTile_CM_C*                     K2Node_CustomEvent_ToolTile_1;                     // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5981[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, bool bIsUsingEquipped)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue;                 // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5982[0x3];                                     // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWidget* FocusItem)>     K2Node_CreateDelegate_OutputDelegate_6;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0268(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ToolTile_CM_C* ToolTile)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5983[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5984[0x5];                                     // 0x02CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_FinishSelecting_SelectedWidget;           // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSelecting_SelectionCancelled;       // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5985[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllSlotWidgets_Widgets;                // 0x02E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5986[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ToolTile_CM_C*                     K2Node_DynamicCast_AsWBP_Tool_Tile_CM;             // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5987[0x6];                                     // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_1;               // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ToolWheelUtilityButton_C*          K2Node_DynamicCast_AsWBP_Tool_Wheel_Utility_Button; // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5988[0x6];                                     // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ToolTile_CM_C*                     K2Node_DynamicCast_AsWBP_Tool_Tile_CM_1;           // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5989[0x6];                                     // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_598A[0x2];                                     // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FValeriaItem& Item)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0354(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_598B[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0380(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x03A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ToolWheelUtilityButton_C*          K2Node_DynamicCast_AsWBP_Tool_Wheel_Utility_Button_1; // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_598C[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0400(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0428(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1; // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_598D[0x5];                                     // 0x044B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue_1;               // 0x0458(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasEquippedItem_ReturnValue;              // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0462(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0463(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_598E[0x4];                                     // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_8;                              // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0480(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x04A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9_0;                            // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8_0;                            // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_598F[0x3];                                     // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGeometry& My_Geometry, const struct FValeriaItem& Valeria_Item, const struct FBagSlotLocation& Bag_Slot_Location)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x04C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeadzoneCheck_ReturnValue;                // 0x04D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5990[0x2];                                     // 0x04D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ToolTile_CM_C*                     K2Node_CustomEvent_ToolTile;                       // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    K2Node_CustomEvent_EquipmentComponent;             // 0x04E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         K2Node_CustomEvent_Item;                           // 0x04E8(0x0050)()
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5991[0x7];                                     // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    K2Node_CustomEvent_Inventory;                      // 0x0540(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel) == 0x000008, "Wrong alignment on WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel");
static_assert(sizeof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel) == 0x000550, "Wrong size on WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, EntryPoint) == 0x000000, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, CallFunc_GetBagSlotLocation_BagSlotLocation) == 0x000008, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::CallFunc_GetBagSlotLocation_BagSlotLocation' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, CallFunc_HasItem_bHasItem) == 0x000010, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::CallFunc_HasItem_bHasItem' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, CallFunc_IsValid_ReturnValue_2) == 0x000011, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, Temp_bool_Variable) == 0x000012, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, Temp_byte_Variable) == 0x000013, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, Temp_byte_Variable_1) == 0x000014, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, CallFunc_GetCurrentInputType_ReturnValue) == 0x000020, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, CallFunc_IsValid_ReturnValue_3) == 0x000021, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000022, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000028, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000048, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00004C, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000050, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, Temp_object_Variable) == 0x000058, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000060, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, Temp_real_Variable) == 0x000068, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, Temp_real_Variable_1) == 0x000070, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, Temp_real_Variable_0) == 0x000078, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, Temp_real_Variable_1_0) == 0x000080, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, Temp_bool_Variable_1) == 0x000088, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000BC, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, CallFunc_AkEventGlobal_ReturnValue) == 0x0000CC, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_CustomEvent_My_Geometry) == 0x0000D0, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_CustomEvent_My_Geometry' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_CustomEvent_Valeria_Item) == 0x000108, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_CustomEvent_Valeria_Item' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_CustomEvent_Bag_Slot_Location) == 0x000168, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_CustomEvent_Bag_Slot_Location' has a wrong offset!");
static_assert(offsetof(WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel, K2Node_CustomEvent_Item_1) == 0x000170, "Member 'WBP_CircularToolWheel_C_ExecuteUbergraph_WBP_CircularToolWheel::K2Node_CustomEvent_Item_1' has a wrong offset!");
