#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyRebindGroup

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_KeyRebindGroup.WBP_KeyRebindGroup_C.ExecuteUbergraph_WBP_KeyRebindGroup
// 0x0050 (0x0050 - 0x0000)
struct WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54F0[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeyRebindGroupEntryWidget*             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UKeyRebindGroupEntryWidget*             CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54F1[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup) == 0x000008, "Wrong alignment on WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup");
static_assert(sizeof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup) == 0x000050, "Wrong size on WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, EntryPoint) == 0x000000, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000028, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000030, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, CallFunc_Array_Length_ReturnValue_1) == 0x00003C, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000045, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'WBP_KeyRebindGroup_C_ExecuteUbergraph_WBP_KeyRebindGroup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_KeyRebindGroup.WBP_KeyRebindGroup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_KeyRebindGroup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebindGroup_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_KeyRebindGroup_C_PreConstruct");
static_assert(sizeof(WBP_KeyRebindGroup_C_PreConstruct) == 0x000001, "Wrong size on WBP_KeyRebindGroup_C_PreConstruct");
static_assert(offsetof(WBP_KeyRebindGroup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_KeyRebindGroup_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

