#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerCharacterRow_Button_Message_CM

#include "Basic.hpp"

#include "F_CommonUIButtonPrompt_structs.hpp"
#include "UMG_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.BindToManagerEvents
// 0x0068 (0x0068 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents final
{
public:
	bool                                          Bind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_557E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_557F[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents) == 0x000068, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents, Bind) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents::Bind' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000038, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000040, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000058, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x000060, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.BndEvt__WBP_PlayerCharacterRow_Button_Message_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Message_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Message_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Message_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Message_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Message_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Message_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_BndEvt__WBP_PlayerCharacterRow_Button_Message_CM_WBP_Button_Icon_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM
// 0x0110 (0x0110 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5580[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names;                          // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable;                              // 0x0038(0x0010)(ReferenceParm)
	struct FGuid                                  Temp_struct_Variable_1;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x0058(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_NewUserId;                      // 0x0068(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5581[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5582[0x1];                                     // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMessageTarget                         CallFunc_MakeMessageTarget_DirectMessage_ReturnValue; // 0x00D0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5583[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0108(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM) == 0x000110, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, EntryPoint) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, K2Node_CustomEvent_AccountId) == 0x000004, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, K2Node_CustomEvent_Names) == 0x000018, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::K2Node_CustomEvent_Names' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, Temp_struct_Variable) == 0x000038, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, Temp_struct_Variable_1) == 0x000048, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, K2Node_CustomEvent_AccountId_1) == 0x000058, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, K2Node_CustomEvent_NewUserId) == 0x000068, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::K2Node_CustomEvent_NewUserId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, CallFunc_EqualEqual_ReturnValue) == 0x0000AC, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::CallFunc_EqualEqual_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, CallFunc_Not_PreBool_ReturnValue) == 0x0000AD, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, CallFunc_IsValid_ReturnValue_1) == 0x0000AE, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000B0, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, CallFunc_GetAccountId_ReturnValue) == 0x0000B8, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, CallFunc_GetCharacterNamesByAccountId_ReturnValue) == 0x0000C8, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::CallFunc_GetCharacterNamesByAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, CallFunc_MakeMessageTarget_DirectMessage_ReturnValue) == 0x0000D0, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::CallFunc_MakeMessageTarget_DirectMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, CallFunc_IsValid_ReturnValue_2) == 0x0000F8, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, K2Node_ComponentBoundEvent_Button) == 0x000100, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM, K2Node_Event_InFocusEvent) == 0x000108, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_Button_Message_CM::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.HandleFriendRelationshipsChanged
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_HandleFriendRelationshipsChanged final
{
public:
	TSet<struct FUniqueNetIdRepl>                 PlayerCharacterIds;                                // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_HandleFriendRelationshipsChanged) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_HandleFriendRelationshipsChanged");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_HandleFriendRelationshipsChanged) == 0x000050, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_HandleFriendRelationshipsChanged");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_HandleFriendRelationshipsChanged, PlayerCharacterIds) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_HandleFriendRelationshipsChanged::PlayerCharacterIds' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.HandleOnPresenceChange
// 0x0160 (0x0160 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_HandleOnPresenceChange final
{
public:
	struct FPresence                              OldPresence;                                       // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPresence                              NewPresence;                                       // 0x00B0(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_HandleOnPresenceChange) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_HandleOnPresenceChange");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_HandleOnPresenceChange) == 0x000160, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_HandleOnPresenceChange");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_HandleOnPresenceChange, OldPresence) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_HandleOnPresenceChange::OldPresence' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_HandleOnPresenceChange, NewPresence) == 0x0000B0, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_HandleOnPresenceChange::NewPresence' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.OnFailure_7654FC5540BAEB6D780028B2C3844F34
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_OnFailure_7654FC5540BAEB6D780028B2C3844F34 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFailure_7654FC5540BAEB6D780028B2C3844F34) == 0x000004, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_OnFailure_7654FC5540BAEB6D780028B2C3844F34");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFailure_7654FC5540BAEB6D780028B2C3844F34) == 0x000010, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_OnFailure_7654FC5540BAEB6D780028B2C3844F34");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFailure_7654FC5540BAEB6D780028B2C3844F34, AccountId) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnFailure_7654FC5540BAEB6D780028B2C3844F34::AccountId' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusLost");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusLost");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.OnFocusReceived
// 0x0240 (0x0240 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt;          // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt_1;        // 0x0138(0x0040)(HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0188(0x00B8)()
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived) == 0x000240, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived, K2Node_MakeStruct_F_CommonUIButtonPrompt) == 0x0000F8, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived::K2Node_MakeStruct_F_CommonUIButtonPrompt' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived, K2Node_MakeStruct_F_CommonUIButtonPrompt_1) == 0x000138, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived::K2Node_MakeStruct_F_CommonUIButtonPrompt_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived, K2Node_MakeArray_Array) == 0x000178, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000188, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.OnSuccess_7654FC5540BAEB6D780028B2C3844F34
// 0x0020 (0x0020 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_OnSuccess_7654FC5540BAEB6D780028B2C3844F34 final
{
public:
	struct FGuid                                  AccountId;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Names;                                             // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnSuccess_7654FC5540BAEB6D780028B2C3844F34) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_OnSuccess_7654FC5540BAEB6D780028B2C3844F34");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnSuccess_7654FC5540BAEB6D780028B2C3844F34) == 0x000020, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_OnSuccess_7654FC5540BAEB6D780028B2C3844F34");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnSuccess_7654FC5540BAEB6D780028B2C3844F34, AccountId) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnSuccess_7654FC5540BAEB6D780028B2C3844F34::AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_OnSuccess_7654FC5540BAEB6D780028B2C3844F34, Names) == 0x000010, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_OnSuccess_7654FC5540BAEB6D780028B2C3844F34::Names' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.SetUser
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_SetUser final
{
public:
	struct FUniqueNetIdRepl                       NewUserId;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_SetUser) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_SetUser");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_SetUser) == 0x000030, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_SetUser");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_SetUser, NewUserId) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_SetUser::NewUserId' has a wrong offset!");

// Function WBP_PlayerCharacterRow_Button_Message_CM.WBP_PlayerCharacterRow_Button_Message_CM_C.UpdateFromUser
// 0x0108 (0x0108 - 0x0000)
struct WBP_PlayerCharacterRow_Button_Message_CM_C_UpdateFromUser final
{
public:
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x0008(0x0030)(HasGetValueTypeHash)
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue;         // 0x0040(0x00B0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5584[0x2];                                     // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFriend_ReturnValue;                     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_Button_Message_CM_C_UpdateFromUser) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_Button_Message_CM_C_UpdateFromUser");
static_assert(sizeof(WBP_PlayerCharacterRow_Button_Message_CM_C_UpdateFromUser) == 0x000108, "Wrong size on WBP_PlayerCharacterRow_Button_Message_CM_C_UpdateFromUser");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_UpdateFromUser, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_UpdateFromUser::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_Button_Message_CM_C_UpdateFromUser, CallFunc_GetNetId_ReturnValue) == 0x000008, "Member 'WBP_PlayerCharacterRow_Button_Message_CM_C_UpdateFromUser::CallFunc_GetNetId_ReturnValue' has a wrong offset!");
