#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PMenuTabButton_Icon

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PMenuTabButton_Icon.WBP_PMenuTabButton_Icon_C.ExecuteUbergraph_WBP_PMenuTabButton_Icon
// 0x0010 (0x0010 - 0x0000)
struct WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DE0[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon) == 0x000004, "Wrong alignment on WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon");
static_assert(sizeof(WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon) == 0x000010, "Wrong size on WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon");
static_assert(offsetof(WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon, EntryPoint) == 0x000000, "Member 'WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000008, "Member 'WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00000C, "Member 'WBP_PMenuTabButton_Icon_C_ExecuteUbergraph_WBP_PMenuTabButton_Icon::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WBP_PMenuTabButton_Icon.WBP_PMenuTabButton_Icon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PMenuTabButton_Icon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PMenuTabButton_Icon_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PMenuTabButton_Icon_C_PreConstruct");
static_assert(sizeof(WBP_PMenuTabButton_Icon_C_PreConstruct) == 0x000001, "Wrong size on WBP_PMenuTabButton_Icon_C_PreConstruct");
static_assert(offsetof(WBP_PMenuTabButton_Icon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PMenuTabButton_Icon_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

