#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Harvesting_FTUEPopin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Harvesting_FTUEPopin.WBP_Harvesting_FTUEPopin_C
// 0x0038 (0x02F8 - 0x02C0)
class UWBP_Harvesting_FTUEPopin_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_65;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   VALUI_Button_Styled_53;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                VALUI_TextBlock_Styled_78;                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                VALUI_TextBlock_Styled_121;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ButtonClicked;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Relationships_FTUEPopin_Part1_VALUI_Button_Styled_53_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ButtonClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Harvesting_FTUEPopin(int32 EntryPoint, int32 CallFunc_AkEventGlobal_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM, bool K2Node_DynamicCast_bSuccess, class FText CallFunc_RedirectType_Title, class FText CallFunc_RedirectType_Content, bool CallFunc_RedirectType_EnableFound);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Harvesting_FTUEPopin_C">();
	}
	static class UWBP_Harvesting_FTUEPopin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Harvesting_FTUEPopin_C>();
	}
};
static_assert(alignof(UWBP_Harvesting_FTUEPopin_C) == 0x000008, "Wrong alignment on UWBP_Harvesting_FTUEPopin_C");
static_assert(sizeof(UWBP_Harvesting_FTUEPopin_C) == 0x0002F8, "Wrong size on UWBP_Harvesting_FTUEPopin_C");
static_assert(offsetof(UWBP_Harvesting_FTUEPopin_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Harvesting_FTUEPopin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Harvesting_FTUEPopin_C, Image_65) == 0x0002C8, "Member 'UWBP_Harvesting_FTUEPopin_C::Image_65' has a wrong offset!");
static_assert(offsetof(UWBP_Harvesting_FTUEPopin_C, VALUI_Button_Styled_53) == 0x0002D0, "Member 'UWBP_Harvesting_FTUEPopin_C::VALUI_Button_Styled_53' has a wrong offset!");
static_assert(offsetof(UWBP_Harvesting_FTUEPopin_C, VALUI_TextBlock_Styled_78) == 0x0002D8, "Member 'UWBP_Harvesting_FTUEPopin_C::VALUI_TextBlock_Styled_78' has a wrong offset!");
static_assert(offsetof(UWBP_Harvesting_FTUEPopin_C, VALUI_TextBlock_Styled_121) == 0x0002E0, "Member 'UWBP_Harvesting_FTUEPopin_C::VALUI_TextBlock_Styled_121' has a wrong offset!");
static_assert(offsetof(UWBP_Harvesting_FTUEPopin_C, ButtonClicked) == 0x0002E8, "Member 'UWBP_Harvesting_FTUEPopin_C::ButtonClicked' has a wrong offset!");

}

