#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_ConnectionRequestsList_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C
// 0x0078 (0x0338 - 0x02C0)
class UWBP_Social_ConnectionRequestsList_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class US6UI_CustomNavigationGroup*            CustomNavigationGroup;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ListView_Styled*                 ListView;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Count;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Header;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderDisplayName;                                 // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSubclassOf<class UUserWidget>                RequestWidgetEntryClass;                           // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnRequestsCountChanged;                            // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWidget*>                        TempArray;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             OnChildWidgetChanged;                              // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature(class US6UI_CustomNavigationGroup* NavGroup);
	void BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature(class US6UI_CustomNavigationGroup* NavGroup);
	void BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_0_OnListItemsChanged__DelegateSignature(TArray<class UObject*>& AddedItems, TArray<class UObject*>& RemovedItems);
	void BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature(class UUserWidget* Widget);
	void Construct();
	void ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM(int32 EntryPoint, bool K2Node_Event_IsDesignTime, TArray<class UObject*>& K2Node_MakeArray_Array, class UUserWidget* K2Node_ComponentBoundEvent_Widget_1, class UUserWidget* K2Node_ComponentBoundEvent_Widget, class US6UI_CustomNavigationGroup* K2Node_ComponentBoundEvent_NavGroup_1, class US6UI_CustomNavigationGroup* K2Node_ComponentBoundEvent_NavGroup, TArray<class UWidget*>& K2Node_MakeArray_Array_1, TArray<class UObject*>& K2Node_ComponentBoundEvent_AddedItems, TArray<class UObject*>& K2Node_ComponentBoundEvent_RemovedItems);
	void GetFocusedItem(class UUserWidget** FocusedWidget, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable, bool CallFunc_Not_PreBool_ReturnValue, int32 Temp_int_Loop_Counter_Variable, TArray<class UUserWidget*>& CallFunc_GetDisplayedEntryWidgets_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UUserWidget* CallFunc_Array_Get_Item, bool CallFunc_HasAnyUserFocus_ReturnValue, bool CallFunc_HasFocusedDescendants_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_HasFocusedDescendants_ReturnValue_1, bool CallFunc_HasAnyUserFocus_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_1);
	void OnChildWidgetChanged__DelegateSignature();
	void OnRequestsCountChanged__DelegateSignature(class UWBP_Social_ConnectionRequestsList_CM_C* Widget, int32 Count);
	void PreConstruct(bool IsDesignTime);
	void RefreshListView(TArray<class UUserWidget*>& CallFunc_GetDisplayedEntryWidgets_ReturnValue, int32 CallFunc_GetNumItems_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue);
	void SetItems(TArray<class UObject*>& Items, ESlateVisibility Temp_byte_Variable, int32 CallFunc_Array_Length_ReturnValue, int64 CallFunc_Conv_IntToInt64_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, ESlateVisibility Temp_byte_Variable_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, bool Temp_bool_Variable, ESlateVisibility K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Social_ConnectionRequestsList_CM_C">();
	}
	static class UWBP_Social_ConnectionRequestsList_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Social_ConnectionRequestsList_CM_C>();
	}
};
static_assert(alignof(UWBP_Social_ConnectionRequestsList_CM_C) == 0x000008, "Wrong alignment on UWBP_Social_ConnectionRequestsList_CM_C");
static_assert(sizeof(UWBP_Social_ConnectionRequestsList_CM_C) == 0x000338, "Wrong size on UWBP_Social_ConnectionRequestsList_CM_C");
static_assert(offsetof(UWBP_Social_ConnectionRequestsList_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Social_ConnectionRequestsList_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Social_ConnectionRequestsList_CM_C, CustomNavigationGroup) == 0x0002C8, "Member 'UWBP_Social_ConnectionRequestsList_CM_C::CustomNavigationGroup' has a wrong offset!");
static_assert(offsetof(UWBP_Social_ConnectionRequestsList_CM_C, ListView) == 0x0002D0, "Member 'UWBP_Social_ConnectionRequestsList_CM_C::ListView' has a wrong offset!");
static_assert(offsetof(UWBP_Social_ConnectionRequestsList_CM_C, TextBlock_Count) == 0x0002D8, "Member 'UWBP_Social_ConnectionRequestsList_CM_C::TextBlock_Count' has a wrong offset!");
static_assert(offsetof(UWBP_Social_ConnectionRequestsList_CM_C, TextBlock_Header) == 0x0002E0, "Member 'UWBP_Social_ConnectionRequestsList_CM_C::TextBlock_Header' has a wrong offset!");
static_assert(offsetof(UWBP_Social_ConnectionRequestsList_CM_C, HeaderDisplayName) == 0x0002E8, "Member 'UWBP_Social_ConnectionRequestsList_CM_C::HeaderDisplayName' has a wrong offset!");
static_assert(offsetof(UWBP_Social_ConnectionRequestsList_CM_C, RequestWidgetEntryClass) == 0x000300, "Member 'UWBP_Social_ConnectionRequestsList_CM_C::RequestWidgetEntryClass' has a wrong offset!");
static_assert(offsetof(UWBP_Social_ConnectionRequestsList_CM_C, OnRequestsCountChanged) == 0x000308, "Member 'UWBP_Social_ConnectionRequestsList_CM_C::OnRequestsCountChanged' has a wrong offset!");
static_assert(offsetof(UWBP_Social_ConnectionRequestsList_CM_C, TempArray) == 0x000318, "Member 'UWBP_Social_ConnectionRequestsList_CM_C::TempArray' has a wrong offset!");
static_assert(offsetof(UWBP_Social_ConnectionRequestsList_CM_C, OnChildWidgetChanged) == 0x000328, "Member 'UWBP_Social_ConnectionRequestsList_CM_C::OnChildWidgetChanged' has a wrong offset!");

}

