#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialWindow_Console

#include "Basic.hpp"

#include "ValeriaUI_structs.hpp"
#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "F_CommonUIButtonPrompt_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.BndEvt__TabButtonHost_K2Node_ComponentBoundEvent_3_OnDifferentActiveTabSet__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialWindow_Console_C_BndEvt__TabButtonHost_K2Node_ComponentBoundEvent_3_OnDifferentActiveTabSet__DelegateSignature final
{
public:
	class UVALUI_TabButtonHostBase*               Param_TabButtonHost;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_BndEvt__TabButtonHost_K2Node_ComponentBoundEvent_3_OnDifferentActiveTabSet__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_BndEvt__TabButtonHost_K2Node_ComponentBoundEvent_3_OnDifferentActiveTabSet__DelegateSignature");
static_assert(sizeof(WBP_SocialWindow_Console_C_BndEvt__TabButtonHost_K2Node_ComponentBoundEvent_3_OnDifferentActiveTabSet__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialWindow_Console_C_BndEvt__TabButtonHost_K2Node_ComponentBoundEvent_3_OnDifferentActiveTabSet__DelegateSignature");
static_assert(offsetof(WBP_SocialWindow_Console_C_BndEvt__TabButtonHost_K2Node_ComponentBoundEvent_3_OnDifferentActiveTabSet__DelegateSignature, Param_TabButtonHost) == 0x000000, "Member 'WBP_SocialWindow_Console_C_BndEvt__TabButtonHost_K2Node_ComponentBoundEvent_3_OnDifferentActiveTabSet__DelegateSignature::Param_TabButtonHost' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.BndEvt__WBP_SocialWindow_CM_WBP_SocialWindow_PartyRow_CM_K2Node_ComponentBoundEvent_4_OnInspectPlayerCharacter__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_CM_WBP_SocialWindow_PartyRow_CM_K2Node_ComponentBoundEvent_4_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_CM_WBP_SocialWindow_PartyRow_CM_K2Node_ComponentBoundEvent_4_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_CM_WBP_SocialWindow_PartyRow_CM_K2Node_ComponentBoundEvent_4_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_CM_WBP_SocialWindow_PartyRow_CM_K2Node_ComponentBoundEvent_4_OnInspectPlayerCharacter__DelegateSignature) == 0x000030, "Wrong size on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_CM_WBP_SocialWindow_PartyRow_CM_K2Node_ComponentBoundEvent_4_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_CM_WBP_SocialWindow_PartyRow_CM_K2Node_ComponentBoundEvent_4_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000000, "Member 'WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_CM_WBP_SocialWindow_PartyRow_CM_K2Node_ComponentBoundEvent_4_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.BndEvt__WBP_SocialWindow_Console_WBP_IconButton_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_IconButton_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_IconButton_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_IconButton_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_IconButton_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_IconButton_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_IconButton_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_IconButton_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.BndEvt__WBP_SocialWindow_Console_WBP_RequestsPanel_Console_K2Node_ComponentBoundEvent_14_OnUpdateButtonPrompt__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_RequestsPanel_Console_K2Node_ComponentBoundEvent_14_OnUpdateButtonPrompt__DelegateSignature final
{
public:
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_RequestsPanel_Console_K2Node_ComponentBoundEvent_14_OnUpdateButtonPrompt__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_RequestsPanel_Console_K2Node_ComponentBoundEvent_14_OnUpdateButtonPrompt__DelegateSignature");
static_assert(sizeof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_RequestsPanel_Console_K2Node_ComponentBoundEvent_14_OnUpdateButtonPrompt__DelegateSignature) == 0x000010, "Wrong size on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_RequestsPanel_Console_K2Node_ComponentBoundEvent_14_OnUpdateButtonPrompt__DelegateSignature");
static_assert(offsetof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_RequestsPanel_Console_K2Node_ComponentBoundEvent_14_OnUpdateButtonPrompt__DelegateSignature, UIPrompt) == 0x000000, "Member 'WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_RequestsPanel_Console_K2Node_ComponentBoundEvent_14_OnUpdateButtonPrompt__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_11_OnMarkFocusUI__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_11_OnMarkFocusUI__DelegateSignature final
{
public:
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_11_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_11_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_11_OnMarkFocusUI__DelegateSignature) == 0x000010, "Wrong size on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_11_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_11_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000000, "Member 'WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_11_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_12_OnHandleIA__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_12_OnHandleIA__DelegateSignature final
{
public:
	class UInputAction*                           IA;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_12_OnHandleIA__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_12_OnHandleIA__DelegateSignature");
static_assert(sizeof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_12_OnHandleIA__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_12_OnHandleIA__DelegateSignature");
static_assert(offsetof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_12_OnHandleIA__DelegateSignature, IA) == 0x000000, "Member 'WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_12_OnHandleIA__DelegateSignature::IA' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_1_OnInspectPlayerCharacter__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_1_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_1_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_1_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_1_OnInspectPlayerCharacter__DelegateSignature) == 0x000030, "Wrong size on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_1_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_1_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000000, "Member 'WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_1_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_5_OnCharacterCardBackButtonClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_5_OnCharacterCardBackButtonClicked__DelegateSignature final
{
public:
	class UWBP_PlayerCharacterInspectionCard_CM_C* CharacterCardWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SocialConnectionsPanel_Console_C*  SocialConnectionsPanelWidget;                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_5_OnCharacterCardBackButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_5_OnCharacterCardBackButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_5_OnCharacterCardBackButtonClicked__DelegateSignature) == 0x000010, "Wrong size on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_5_OnCharacterCardBackButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_5_OnCharacterCardBackButtonClicked__DelegateSignature, CharacterCardWidget) == 0x000000, "Member 'WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_5_OnCharacterCardBackButtonClicked__DelegateSignature::CharacterCardWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_5_OnCharacterCardBackButtonClicked__DelegateSignature, SocialConnectionsPanelWidget) == 0x000008, "Member 'WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_5_OnCharacterCardBackButtonClicked__DelegateSignature::SocialConnectionsPanelWidget' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_6_OnSocialConnectionRequestsCountChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_6_OnSocialConnectionRequestsCountChanged__DelegateSignature final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_6_OnSocialConnectionRequestsCountChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_6_OnSocialConnectionRequestsCountChanged__DelegateSignature");
static_assert(sizeof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_6_OnSocialConnectionRequestsCountChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_6_OnSocialConnectionRequestsCountChanged__DelegateSignature");
static_assert(offsetof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_6_OnSocialConnectionRequestsCountChanged__DelegateSignature, Count) == 0x000000, "Member 'WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_6_OnSocialConnectionRequestsCountChanged__DelegateSignature::Count' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_7_OnSocialConnectionOnlineFriendsChange__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_7_OnSocialConnectionOnlineFriendsChange__DelegateSignature final
{
public:
	int32                                         NumOnline;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_7_OnSocialConnectionOnlineFriendsChange__DelegateSignature) == 0x000004, "Wrong alignment on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_7_OnSocialConnectionOnlineFriendsChange__DelegateSignature");
static_assert(sizeof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_7_OnSocialConnectionOnlineFriendsChange__DelegateSignature) == 0x000004, "Wrong size on WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_7_OnSocialConnectionOnlineFriendsChange__DelegateSignature");
static_assert(offsetof(WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_7_OnSocialConnectionOnlineFriendsChange__DelegateSignature, NumOnline) == 0x000000, "Member 'WBP_SocialWindow_Console_C_BndEvt__WBP_SocialWindow_Console_WBP_SocialConnectionsPanel_Console_K2Node_ComponentBoundEvent_7_OnSocialConnectionOnlineFriendsChange__DelegateSignature::NumOnline' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.CheckRefreshShoulderButton
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialWindow_Console_C_CheckRefreshShoulderButton final
{
public:
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisibleTabButtonNum_num;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5865[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5866[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_CheckRefreshShoulderButton) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_CheckRefreshShoulderButton");
static_assert(sizeof(WBP_SocialWindow_Console_C_CheckRefreshShoulderButton) == 0x000038, "Wrong size on WBP_SocialWindow_Console_C_CheckRefreshShoulderButton");
static_assert(offsetof(WBP_SocialWindow_Console_C_CheckRefreshShoulderButton, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000000, "Member 'WBP_SocialWindow_Console_C_CheckRefreshShoulderButton::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CheckRefreshShoulderButton, CallFunc_GetVisibleTabButtonNum_num) == 0x000008, "Member 'WBP_SocialWindow_Console_C_CheckRefreshShoulderButton::CallFunc_GetVisibleTabButtonNum_num' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CheckRefreshShoulderButton, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_SocialWindow_Console_C_CheckRefreshShoulderButton::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CheckRefreshShoulderButton, CallFunc_Multiply_IntInt_ReturnValue) == 0x000010, "Member 'WBP_SocialWindow_Console_C_CheckRefreshShoulderButton::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CheckRefreshShoulderButton, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'WBP_SocialWindow_Console_C_CheckRefreshShoulderButton::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CheckRefreshShoulderButton, K2Node_MakeStruct_Margin) == 0x000020, "Member 'WBP_SocialWindow_Console_C_CheckRefreshShoulderButton::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CheckRefreshShoulderButton, K2Node_MakeStruct_Left_ImplicitCast) == 0x000030, "Member 'WBP_SocialWindow_Console_C_CheckRefreshShoulderButton::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.Close
// 0x0088 (0x0088 - 0x0000)
struct WBP_SocialWindow_Console_C_Close final
{
public:
	class FName                                   CallFunc_GetActiveTabName_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_InstantiatedTabButtonInfo       CallFunc_TryGetTabInfo_OutInfo;                    // 0x0008(0x0068)(ContainsInstancedReference)
	bool                                          CallFunc_TryGetTabInfo_ReturnValue;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5867[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidgetInputExtended*  K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_Close) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_Close");
static_assert(sizeof(WBP_SocialWindow_Console_C_Close) == 0x000088, "Wrong size on WBP_SocialWindow_Console_C_Close");
static_assert(offsetof(WBP_SocialWindow_Console_C_Close, CallFunc_GetActiveTabName_ReturnValue) == 0x000000, "Member 'WBP_SocialWindow_Console_C_Close::CallFunc_GetActiveTabName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_Close, CallFunc_TryGetTabInfo_OutInfo) == 0x000008, "Member 'WBP_SocialWindow_Console_C_Close::CallFunc_TryGetTabInfo_OutInfo' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_Close, CallFunc_TryGetTabInfo_ReturnValue) == 0x000070, "Member 'WBP_SocialWindow_Console_C_Close::CallFunc_TryGetTabInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_Close, CallFunc_AkEventGlobal_ReturnValue) == 0x000074, "Member 'WBP_SocialWindow_Console_C_Close::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_Close, K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended) == 0x000078, "Member 'WBP_SocialWindow_Console_C_Close::K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_Close, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_SocialWindow_Console_C_Close::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.CreateAndRegisterAllSocialWindowTabs
// 0x0080 (0x0080 - 0x0000)
struct WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5868[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class US6GenericAssetRegistrySubsystem*       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6GenericAssetRegistryInstance*        CallFunc_GetRegistryInstance_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UObject>>         CallFunc_Set_ToArray_Result;                       // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5869[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_Array_Get_Item;                           // 0x0038(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586A[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SocialWindowTabDataAsset_C*         K2Node_DynamicCast_AsBP_Social_Window_Tab_Data_Asset; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs");
static_assert(sizeof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs) == 0x000080, "Wrong size on WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, CallFunc_GetRegistryInstance_ReturnValue) == 0x000018, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::CallFunc_GetRegistryInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, CallFunc_Set_ToArray_Result) == 0x000020, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000068, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, K2Node_DynamicCast_AsBP_Social_Window_Tab_Data_Asset) == 0x000070, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::K2Node_DynamicCast_AsBP_Social_Window_Tab_Data_Asset' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterAllSocialWindowTabs::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.CreateAndRegisterSocialWindowTab
// 0x0058 (0x0058 - 0x0000)
struct WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab final
{
public:
	class UBP_SocialWindowTabDataAsset_C*         SocialWindowTabSpec;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UButton_Tab_NoIcon_C*                   Button;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            AssociatedContent;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586B[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterForConstructingNativeWidget_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UButton_Tab_NoIcon_C*                   CallFunc_SpawnObject_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab");
static_assert(sizeof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab) == 0x000058, "Wrong size on WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab, SocialWindowTabSpec) == 0x000000, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab::SocialWindowTabSpec' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab, Button) == 0x000008, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab::Button' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab, AssociatedContent) == 0x000010, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab::AssociatedContent' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000018, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab, K2Node_ClassDynamicCast_AsUser_Widget) == 0x000020, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab::K2Node_ClassDynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab, K2Node_ClassDynamicCast_bSuccess) == 0x000028, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab, CallFunc_GetOuterForConstructingNativeWidget_ReturnValue) == 0x000038, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab::CallFunc_GetOuterForConstructingNativeWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab, CallFunc_Create_ReturnValue) == 0x000040, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab, CallFunc_SpawnObject_ReturnValue) == 0x000048, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'WBP_SocialWindow_Console_C_CreateAndRegisterSocialWindowTab::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.DestroyRegisteredSocialWindowTabs
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs final
{
public:
	TSet<class FName>                             DesiredSocialTabNames;                             // 0x0000(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586C[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Set_ToArray_Result;                       // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586D[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALUI_InstantiatedTabButtonInfo       CallFunc_TryGetTabInfo_OutInfo;                    // 0x0080(0x0068)(ContainsInstancedReference)
	bool                                          CallFunc_TryGetTabInfo_ReturnValue;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs) == 0x000008, "Wrong alignment on WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs");
static_assert(sizeof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs) == 0x0000F0, "Wrong size on WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs");
static_assert(offsetof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs, DesiredSocialTabNames) == 0x000000, "Member 'WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs::DesiredSocialTabNames' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs, CallFunc_Set_ToArray_Result) == 0x000060, "Member 'WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs, CallFunc_Array_Get_Item) == 0x000074, "Member 'WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs, CallFunc_TryGetTabInfo_OutInfo) == 0x000080, "Member 'WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs::CallFunc_TryGetTabInfo_OutInfo' has a wrong offset!");
static_assert(offsetof(WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs, CallFunc_TryGetTabInfo_ReturnValue) == 0x0000E8, "Member 'WBP_SocialWindow_Console_C_DestroyRegisteredSocialWindowTabs::CallFunc_TryGetTabInfo_ReturnValue' has a wrong offset!");

// Function WBP_SocialWindow_Console.WBP_SocialWindow_Console_C.ExecuteUbergraph_WBP_SocialWindow_Console
// 0x04B0 (0x04B0 - 0x0000)
struct WBP_SocialWindow_Console_C_ExecuteUbergraph_WBP_SocialWindow_Console final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0020(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5870[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5871[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0088(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5872[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5873[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5_0;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5874[0x5];                                     // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UXIntentSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UXIntentSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UXIntent_PhotographyMode_C*         CallFunc_SpawnObject_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryStartUXActivity_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5875[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class US6UXIntentSubsystem* UXIntentSubsystem, TSoftClassPtr<class UClass>& UXIntentType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5876[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class US6GenericAssetRegistrySubsystem*       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6GenericAssetRegistryInstance*        CallFunc_GetRegistryInstance_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0140(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0168(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5877[0x6];                                     // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<ESlateVisibility>                        K2Node_MakeSet_Set;                                // 0x0188(0x0050)(ConstParm)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5878[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5879[0x3];                                     // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6;                              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrySetActiveTabName_ReturnValue;          // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_587A[0x3];                                     // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bDisplay)>                K2Node_CreateDelegate_OutputDelegate_3;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_587B[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_7;                              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0238(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x0260(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_587C[0x3];                                     // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_UserId_1;               // 0x0280(0x0030)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_UserId;                 // 0x02B0(0x0030)(HasGetValueTypeHash)
	class UWBP_PlayerCharacterInspectionCard_CM_C* K2Node_ComponentBoundEvent_CharacterCardWidget;    // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SocialConnectionsPanel_Console_C*  K2Node_ComponentBoundEvent_SocialConnectionsPanelWidget; // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Count;                  // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NumOnline;              // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_ComponentBoundEvent_uiprompt_1;             // 0x0300(0x0010)(ReferenceParm)
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_587D[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TabButtonHostBase*               K2Node_ComponentBoundEvent_TabButtonHost;          // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTabName_ReturnValue;             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
