#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LinkSteamAccountFlow_CM

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_LinkSteamAccountFlow_CM.WBP_LinkSteamAccountFlow_CM_C.OnLinkedFailurePropagate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_LinkSteamAccountFlow_CM_C_OnLinkedFailurePropagate__DelegateSignature final
{
public:
	class FText                                   ErrorMessage;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_LinkSteamAccountFlow_CM_C_OnLinkedFailurePropagate__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LinkSteamAccountFlow_CM_C_OnLinkedFailurePropagate__DelegateSignature");
static_assert(sizeof(WBP_LinkSteamAccountFlow_CM_C_OnLinkedFailurePropagate__DelegateSignature) == 0x000018, "Wrong size on WBP_LinkSteamAccountFlow_CM_C_OnLinkedFailurePropagate__DelegateSignature");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_OnLinkedFailurePropagate__DelegateSignature, ErrorMessage) == 0x000000, "Member 'WBP_LinkSteamAccountFlow_CM_C_OnLinkedFailurePropagate__DelegateSignature::ErrorMessage' has a wrong offset!");

// Function WBP_LinkSteamAccountFlow_CM.WBP_LinkSteamAccountFlow_CM_C.ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM
// 0x0068 (0x0068 - 0x0000)
struct WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E49[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_ErrorMessage_1;                       // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ErrorCode_1;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4A[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_ErrorMessage;                         // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ErrorCode;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM) == 0x000008, "Wrong alignment on WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM");
static_assert(sizeof(WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM) == 0x000068, "Wrong size on WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM, EntryPoint) == 0x000000, "Member 'WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000020, "Member 'WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM, K2Node_Event_ErrorMessage_1) == 0x000038, "Member 'WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM::K2Node_Event_ErrorMessage_1' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM, K2Node_Event_ErrorCode_1) == 0x000048, "Member 'WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM::K2Node_Event_ErrorCode_1' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM, K2Node_Event_ErrorMessage) == 0x000050, "Member 'WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM::K2Node_Event_ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM, K2Node_Event_ErrorCode) == 0x000060, "Member 'WBP_LinkSteamAccountFlow_CM_C_ExecuteUbergraph_WBP_LinkSteamAccountFlow_CM::K2Node_Event_ErrorCode' has a wrong offset!");

// Function WBP_LinkSteamAccountFlow_CM.WBP_LinkSteamAccountFlow_CM_C.HandleLinkFailure
// 0x0040 (0x0040 - 0x0000)
struct WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetErrorMessageFromResponse_ReturnValue;  // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_LinkErrorMessage_ReturnValue;             // 0x0028(0x0018)()
};
static_assert(alignof(WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure) == 0x000008, "Wrong alignment on WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure");
static_assert(sizeof(WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure) == 0x000040, "Wrong size on WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure, Code) == 0x000000, "Member 'WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure::Code' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure, Msg) == 0x000008, "Member 'WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure::Msg' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure, CallFunc_GetErrorMessageFromResponse_ReturnValue) == 0x000018, "Member 'WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure::CallFunc_GetErrorMessageFromResponse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure, CallFunc_LinkErrorMessage_ReturnValue) == 0x000028, "Member 'WBP_LinkSteamAccountFlow_CM_C_HandleLinkFailure::CallFunc_LinkErrorMessage_ReturnValue' has a wrong offset!");

// Function WBP_LinkSteamAccountFlow_CM.WBP_LinkSteamAccountFlow_CM_C.OnPlatformLinkFailure
// 0x0018 (0x0018 - 0x0000)
struct WBP_LinkSteamAccountFlow_CM_C_OnPlatformLinkFailure final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinkSteamAccountFlow_CM_C_OnPlatformLinkFailure) == 0x000008, "Wrong alignment on WBP_LinkSteamAccountFlow_CM_C_OnPlatformLinkFailure");
static_assert(sizeof(WBP_LinkSteamAccountFlow_CM_C_OnPlatformLinkFailure) == 0x000018, "Wrong size on WBP_LinkSteamAccountFlow_CM_C_OnPlatformLinkFailure");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_OnPlatformLinkFailure, ErrorMessage) == 0x000000, "Member 'WBP_LinkSteamAccountFlow_CM_C_OnPlatformLinkFailure::ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_OnPlatformLinkFailure, ErrorCode) == 0x000010, "Member 'WBP_LinkSteamAccountFlow_CM_C_OnPlatformLinkFailure::ErrorCode' has a wrong offset!");

// Function WBP_LinkSteamAccountFlow_CM.WBP_LinkSteamAccountFlow_CM_C.OnPlatformLoggedInFailure
// 0x0018 (0x0018 - 0x0000)
struct WBP_LinkSteamAccountFlow_CM_C_OnPlatformLoggedInFailure final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ErrorCode;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinkSteamAccountFlow_CM_C_OnPlatformLoggedInFailure) == 0x000008, "Wrong alignment on WBP_LinkSteamAccountFlow_CM_C_OnPlatformLoggedInFailure");
static_assert(sizeof(WBP_LinkSteamAccountFlow_CM_C_OnPlatformLoggedInFailure) == 0x000018, "Wrong size on WBP_LinkSteamAccountFlow_CM_C_OnPlatformLoggedInFailure");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_OnPlatformLoggedInFailure, ErrorMessage) == 0x000000, "Member 'WBP_LinkSteamAccountFlow_CM_C_OnPlatformLoggedInFailure::ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_OnPlatformLoggedInFailure, ErrorCode) == 0x000010, "Member 'WBP_LinkSteamAccountFlow_CM_C_OnPlatformLoggedInFailure::ErrorCode' has a wrong offset!");

// Function WBP_LinkSteamAccountFlow_CM.WBP_LinkSteamAccountFlow_CM_C.SetPage
// 0x0010 (0x0010 - 0x0000)
struct WBP_LinkSteamAccountFlow_CM_C_SetPage final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ActivePage;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LinkSteamAccountFlow_CM_C_SetPage) == 0x000008, "Wrong alignment on WBP_LinkSteamAccountFlow_CM_C_SetPage");
static_assert(sizeof(WBP_LinkSteamAccountFlow_CM_C_SetPage) == 0x000010, "Wrong size on WBP_LinkSteamAccountFlow_CM_C_SetPage");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_SetPage, Widget) == 0x000000, "Member 'WBP_LinkSteamAccountFlow_CM_C_SetPage::Widget' has a wrong offset!");
static_assert(offsetof(WBP_LinkSteamAccountFlow_CM_C_SetPage, ActivePage) == 0x000008, "Member 'WBP_LinkSteamAccountFlow_CM_C_SetPage::ActivePage' has a wrong offset!");

}

