#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HotBarRowTick_PF

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HotBarRowTick_PF.WBP_HotBarRowTick_PF_C.BndEvt__WBP_HotBarRowTick_PF_CarouselDot_SmallButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HotBarRowTick_PF_C_BndEvt__WBP_HotBarRowTick_PF_CarouselDot_SmallButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBarRowTick_PF_C_BndEvt__WBP_HotBarRowTick_PF_CarouselDot_SmallButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HotBarRowTick_PF_C_BndEvt__WBP_HotBarRowTick_PF_CarouselDot_SmallButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_HotBarRowTick_PF_C_BndEvt__WBP_HotBarRowTick_PF_CarouselDot_SmallButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_HotBarRowTick_PF_C_BndEvt__WBP_HotBarRowTick_PF_CarouselDot_SmallButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_HotBarRowTick_PF_C_BndEvt__WBP_HotBarRowTick_PF_CarouselDot_SmallButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_HotBarRowTick_PF_C_BndEvt__WBP_HotBarRowTick_PF_CarouselDot_SmallButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_HotBarRowTick_PF.WBP_HotBarRowTick_PF_C.ExecuteUbergraph_WBP_HotBarRowTick_PF
// 0x0010 (0x0010 - 0x0000)
struct WBP_HotBarRowTick_PF_C_ExecuteUbergraph_WBP_HotBarRowTick_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E86[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBarRowTick_PF_C_ExecuteUbergraph_WBP_HotBarRowTick_PF) == 0x000008, "Wrong alignment on WBP_HotBarRowTick_PF_C_ExecuteUbergraph_WBP_HotBarRowTick_PF");
static_assert(sizeof(WBP_HotBarRowTick_PF_C_ExecuteUbergraph_WBP_HotBarRowTick_PF) == 0x000010, "Wrong size on WBP_HotBarRowTick_PF_C_ExecuteUbergraph_WBP_HotBarRowTick_PF");
static_assert(offsetof(WBP_HotBarRowTick_PF_C_ExecuteUbergraph_WBP_HotBarRowTick_PF, EntryPoint) == 0x000000, "Member 'WBP_HotBarRowTick_PF_C_ExecuteUbergraph_WBP_HotBarRowTick_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HotBarRowTick_PF_C_ExecuteUbergraph_WBP_HotBarRowTick_PF, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_HotBarRowTick_PF_C_ExecuteUbergraph_WBP_HotBarRowTick_PF::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_HotBarRowTick_PF.WBP_HotBarRowTick_PF_C.OnRowTickTouched__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_HotBarRowTick_PF_C_OnRowTickTouched__DelegateSignature final
{
public:
	int32                                         Param_RowTickNumber;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E87[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HotBarRowTick_PF_C*                RowTick;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBarRowTick_PF_C_OnRowTickTouched__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HotBarRowTick_PF_C_OnRowTickTouched__DelegateSignature");
static_assert(sizeof(WBP_HotBarRowTick_PF_C_OnRowTickTouched__DelegateSignature) == 0x000010, "Wrong size on WBP_HotBarRowTick_PF_C_OnRowTickTouched__DelegateSignature");
static_assert(offsetof(WBP_HotBarRowTick_PF_C_OnRowTickTouched__DelegateSignature, Param_RowTickNumber) == 0x000000, "Member 'WBP_HotBarRowTick_PF_C_OnRowTickTouched__DelegateSignature::Param_RowTickNumber' has a wrong offset!");
static_assert(offsetof(WBP_HotBarRowTick_PF_C_OnRowTickTouched__DelegateSignature, RowTick) == 0x000008, "Member 'WBP_HotBarRowTick_PF_C_OnRowTickTouched__DelegateSignature::RowTick' has a wrong offset!");

// Function WBP_HotBarRowTick_PF.WBP_HotBarRowTick_PF_C.SetRowTickNumber
// 0x0004 (0x0004 - 0x0000)
struct WBP_HotBarRowTick_PF_C_SetRowTickNumber final
{
public:
	int32                                         SlotNumber;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBarRowTick_PF_C_SetRowTickNumber) == 0x000004, "Wrong alignment on WBP_HotBarRowTick_PF_C_SetRowTickNumber");
static_assert(sizeof(WBP_HotBarRowTick_PF_C_SetRowTickNumber) == 0x000004, "Wrong size on WBP_HotBarRowTick_PF_C_SetRowTickNumber");
static_assert(offsetof(WBP_HotBarRowTick_PF_C_SetRowTickNumber, SlotNumber) == 0x000000, "Member 'WBP_HotBarRowTick_PF_C_SetRowTickNumber::SlotNumber' has a wrong offset!");

// Function WBP_HotBarRowTick_PF.WBP_HotBarRowTick_PF_C.Toggle
// 0x0001 (0x0001 - 0x0000)
struct WBP_HotBarRowTick_PF_C_Toggle final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotBarRowTick_PF_C_Toggle) == 0x000001, "Wrong alignment on WBP_HotBarRowTick_PF_C_Toggle");
static_assert(sizeof(WBP_HotBarRowTick_PF_C_Toggle) == 0x000001, "Wrong size on WBP_HotBarRowTick_PF_C_Toggle");
static_assert(offsetof(WBP_HotBarRowTick_PF_C_Toggle, IsOn) == 0x000000, "Member 'WBP_HotBarRowTick_PF_C_Toggle::IsOn' has a wrong offset!");

}

