#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlacementMode

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Palia_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlacementMode.WBP_PlacementMode_C.ExecuteUbergraph_WBP_PlacementMode
// 0x0118 (0x0118 - 0x0000)
struct WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50B8[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPlacementComponent* PC)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlacementComponent*                    CallFunc_GetPlacement_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50B9[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaCharacter* Character, bool Flag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50BA[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* Character, bool Flag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlacementComponent*                    CallFunc_GetPlacement_ReturnValue_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50BB[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPlacementComponent* PC)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50BC[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaCharacter* Character, bool Flag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* Character, bool Flag)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50BD[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_2;          // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50BE[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_2;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlacementComponent*                    CallFunc_GetPlacement_ReturnValue_2;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlacementMoveModifierActive_ReturnValue; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50BF[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> CallFunc_GetItemTypeToPlace_ReturnValue;           // 0x00D8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlacementPickupModeActive_ReturnValue;  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C0[0x6];                                     // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Item_Definition_Displays;             // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode) == 0x000008, "Wrong alignment on WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode");
static_assert(sizeof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode) == 0x000118, "Wrong size on WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, EntryPoint) == 0x000000, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, Temp_byte_Variable) == 0x000004, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetValeriaCharacter_OutResult) == 0x000006, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetPlacement_ReturnValue) == 0x000020, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetPlacement_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetValeriaCharacter_OutResult_1) == 0x00003C, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetValeriaCharacter_OutResult_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetValeriaCharacter_ReturnValue_1) == 0x000040, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetValeriaCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetPlacement_ReturnValue_1) == 0x000058, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetPlacement_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_SwitchEnum_CmpSuccess_1) == 0x000060, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_CreateDelegate_OutputDelegate_3) == 0x000064, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, Temp_bool_Variable) == 0x000074, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_CreateDelegate_OutputDelegate_4) == 0x000078, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_CreateDelegate_OutputDelegate_5) == 0x000088, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_CreateDelegate_OutputDelegate_6) == 0x000098, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_CustomEvent_InVisibility) == 0x0000A8, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000A9, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000AC, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetValeriaCharacter_OutResult_2) == 0x0000BC, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetValeriaCharacter_OutResult_2' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetValeriaCharacter_ReturnValue_2) == 0x0000C0, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetValeriaCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetPlacement_ReturnValue_2) == 0x0000C8, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetPlacement_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_IsPlacementMoveModifierActive_ReturnValue) == 0x0000D0, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_IsPlacementMoveModifierActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetItemTypeToPlace_ReturnValue) == 0x0000D8, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetItemTypeToPlace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_IsPlacementPickupModeActive_ReturnValue) == 0x000100, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_IsPlacementPickupModeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_SwitchEnum_CmpSuccess_3) == 0x000101, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000108, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_GetVisibility_ReturnValue) == 0x000110, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_CustomEvent_bNewInputType) == 0x000111, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_SwitchEnum_CmpSuccess_4) == 0x000112, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, CallFunc_Set_Item_Definition_Displays) == 0x000113, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::CallFunc_Set_Item_Definition_Displays' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode, K2Node_Select_Default) == 0x000114, "Member 'WBP_PlacementMode_C_ExecuteUbergraph_WBP_PlacementMode::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PlacementMode.WBP_PlacementMode_C.On Visibility Changed
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlacementMode_C_On_Visibility_Changed final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementMode_C_On_Visibility_Changed) == 0x000001, "Wrong alignment on WBP_PlacementMode_C_On_Visibility_Changed");
static_assert(sizeof(WBP_PlacementMode_C_On_Visibility_Changed) == 0x000001, "Wrong size on WBP_PlacementMode_C_On_Visibility_Changed");
static_assert(offsetof(WBP_PlacementMode_C_On_Visibility_Changed, InVisibility) == 0x000000, "Member 'WBP_PlacementMode_C_On_Visibility_Changed::InVisibility' has a wrong offset!");

// Function WBP_PlacementMode.WBP_PlacementMode_C.OnInputMethodChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlacementMode_C_OnInputMethodChanged_Event final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementMode_C_OnInputMethodChanged_Event) == 0x000001, "Wrong alignment on WBP_PlacementMode_C_OnInputMethodChanged_Event");
static_assert(sizeof(WBP_PlacementMode_C_OnInputMethodChanged_Event) == 0x000001, "Wrong size on WBP_PlacementMode_C_OnInputMethodChanged_Event");
static_assert(offsetof(WBP_PlacementMode_C_OnInputMethodChanged_Event, bNewInputType) == 0x000000, "Member 'WBP_PlacementMode_C_OnInputMethodChanged_Event::bNewInputType' has a wrong offset!");

// Function WBP_PlacementMode.WBP_PlacementMode_C.UpdateFreePlacementIcon
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlacementMode_C_UpdateFreePlacementIcon final
{
public:
	class UPlacementComponent*                    PlacementComponent;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFreePlacementModeActive_ReturnValue;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C1[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementMode_C_UpdateFreePlacementIcon) == 0x000008, "Wrong alignment on WBP_PlacementMode_C_UpdateFreePlacementIcon");
static_assert(sizeof(WBP_PlacementMode_C_UpdateFreePlacementIcon) == 0x000018, "Wrong size on WBP_PlacementMode_C_UpdateFreePlacementIcon");
static_assert(offsetof(WBP_PlacementMode_C_UpdateFreePlacementIcon, PlacementComponent) == 0x000000, "Member 'WBP_PlacementMode_C_UpdateFreePlacementIcon::PlacementComponent' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdateFreePlacementIcon, Temp_bool_Variable) == 0x000008, "Member 'WBP_PlacementMode_C_UpdateFreePlacementIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdateFreePlacementIcon, CallFunc_IsFreePlacementModeActive_ReturnValue) == 0x000009, "Member 'WBP_PlacementMode_C_UpdateFreePlacementIcon::CallFunc_IsFreePlacementModeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdateFreePlacementIcon, Temp_int_Variable) == 0x00000C, "Member 'WBP_PlacementMode_C_UpdateFreePlacementIcon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdateFreePlacementIcon, Temp_int_Variable_1) == 0x000010, "Member 'WBP_PlacementMode_C_UpdateFreePlacementIcon::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdateFreePlacementIcon, K2Node_Select_Default) == 0x000014, "Member 'WBP_PlacementMode_C_UpdateFreePlacementIcon::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PlacementMode.WBP_PlacementMode_C.UpdateGridLockIcon
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlacementMode_C_UpdateGridLockIcon final
{
public:
	class AValeriaCharacter*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Flag;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C2[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementMode_C_UpdateGridLockIcon) == 0x000008, "Wrong alignment on WBP_PlacementMode_C_UpdateGridLockIcon");
static_assert(sizeof(WBP_PlacementMode_C_UpdateGridLockIcon) == 0x000018, "Wrong size on WBP_PlacementMode_C_UpdateGridLockIcon");
static_assert(offsetof(WBP_PlacementMode_C_UpdateGridLockIcon, Character) == 0x000000, "Member 'WBP_PlacementMode_C_UpdateGridLockIcon::Character' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdateGridLockIcon, Flag) == 0x000008, "Member 'WBP_PlacementMode_C_UpdateGridLockIcon::Flag' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdateGridLockIcon, Temp_bool_Variable) == 0x000009, "Member 'WBP_PlacementMode_C_UpdateGridLockIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdateGridLockIcon, Temp_int_Variable) == 0x00000C, "Member 'WBP_PlacementMode_C_UpdateGridLockIcon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdateGridLockIcon, Temp_int_Variable_1) == 0x000010, "Member 'WBP_PlacementMode_C_UpdateGridLockIcon::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdateGridLockIcon, K2Node_Select_Default) == 0x000014, "Member 'WBP_PlacementMode_C_UpdateGridLockIcon::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PlacementMode.WBP_PlacementMode_C.UpdatePlacementModeIcon
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlacementMode_C_UpdatePlacementModeIcon final
{
public:
	class AValeriaCharacter*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Flag;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C3[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C4[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C5[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementMode_C_UpdatePlacementModeIcon) == 0x000008, "Wrong alignment on WBP_PlacementMode_C_UpdatePlacementModeIcon");
static_assert(sizeof(WBP_PlacementMode_C_UpdatePlacementModeIcon) == 0x000030, "Wrong size on WBP_PlacementMode_C_UpdatePlacementModeIcon");
static_assert(offsetof(WBP_PlacementMode_C_UpdatePlacementModeIcon, Character) == 0x000000, "Member 'WBP_PlacementMode_C_UpdatePlacementModeIcon::Character' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdatePlacementModeIcon, Flag) == 0x000008, "Member 'WBP_PlacementMode_C_UpdatePlacementModeIcon::Flag' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdatePlacementModeIcon, Temp_int_Variable) == 0x00000C, "Member 'WBP_PlacementMode_C_UpdatePlacementModeIcon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdatePlacementModeIcon, Temp_int_Variable_1) == 0x000010, "Member 'WBP_PlacementMode_C_UpdatePlacementModeIcon::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdatePlacementModeIcon, Temp_bool_Variable) == 0x000014, "Member 'WBP_PlacementMode_C_UpdatePlacementModeIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdatePlacementModeIcon, Temp_int_Variable_2) == 0x000018, "Member 'WBP_PlacementMode_C_UpdatePlacementModeIcon::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdatePlacementModeIcon, Temp_int_Variable_3) == 0x00001C, "Member 'WBP_PlacementMode_C_UpdatePlacementModeIcon::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdatePlacementModeIcon, Temp_bool_Variable_1) == 0x000020, "Member 'WBP_PlacementMode_C_UpdatePlacementModeIcon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdatePlacementModeIcon, K2Node_Select_Default) == 0x000024, "Member 'WBP_PlacementMode_C_UpdatePlacementModeIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PlacementMode_C_UpdatePlacementModeIcon, K2Node_Select_Default_1) == 0x000028, "Member 'WBP_PlacementMode_C_UpdatePlacementModeIcon::K2Node_Select_Default_1' has a wrong offset!");

}

