#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCustomization_VariantPickerPanel_CM

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Param_Item;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Param_Item) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Param_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_BndEvt__WBP_CharacterCustomization_VariantPickerPanel_CM_VALUI_TileView_Variants_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.CheckIfItemHasSameClassAndVariantChannelNames
// 0x0108 (0x0108 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames final
{
public:
	class UVAL_CharacterCustomizationItemBase*    PreviousItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UVAL_CharacterCustomizationItemBase* NewItem;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVAL_CharacterBodyType                        NewBodyType;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasSameVariantChannelNamesAndItemClass;            // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Same;                                              // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56B1[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56B2[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             CallFunc_TryGetAllVariantChannelNames_OutVariantChannelNames; // 0x0030(0x0050)()
	bool                                          CallFunc_TryGetAllVariantChannelNames_ReturnValue; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56B3[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Set_ToArray_Result;                       // 0x0088(0x0010)(ReferenceParm)
	TSet<class FName>                             CallFunc_TryGetAllVariantChannelNames_OutVariantChannelNames_1; // 0x0098(0x0050)()
	bool                                          CallFunc_TryGetAllVariantChannelNames_ReturnValue_1; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56B4[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Set_ToArray_Result_1;                     // 0x00F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Identical_ReturnValue;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames) == 0x000108, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, PreviousItem) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::PreviousItem' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, NewItem) == 0x000008, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::NewItem' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, NewBodyType) == 0x000010, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::NewBodyType' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, HasSameVariantChannelNamesAndItemClass) == 0x000011, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::HasSameVariantChannelNamesAndItemClass' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, Same) == 0x000012, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::Same' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_IsValid_ReturnValue) == 0x000013, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_GetObjectClass_ReturnValue_1) == 0x000020, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000028, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_TryGetAllVariantChannelNames_OutVariantChannelNames) == 0x000030, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_TryGetAllVariantChannelNames_OutVariantChannelNames' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_TryGetAllVariantChannelNames_ReturnValue) == 0x000080, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_TryGetAllVariantChannelNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_Set_ToArray_Result) == 0x000088, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_TryGetAllVariantChannelNames_OutVariantChannelNames_1) == 0x000098, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_TryGetAllVariantChannelNames_OutVariantChannelNames_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_TryGetAllVariantChannelNames_ReturnValue_1) == 0x0000E8, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_TryGetAllVariantChannelNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_Set_ToArray_Result_1) == 0x0000F0, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_Set_ToArray_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames, CallFunc_Array_Identical_ReturnValue) == 0x000100, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CheckIfItemHasSameClassAndVariantChannelNames::CallFunc_Array_Identical_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.CreateVariantChannels
// 0x0058 (0x0058 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels final
{
public:
	TArray<class FName>                           Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56B5[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CharacterCustomization_VariantChannel_CM_C* VariantChannelWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56B6[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomization_VariantChannel_CM_C* CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56B7[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels) == 0x000058, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels, Array) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels::Array' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels, CallFunc_Array_Get_Item) == 0x00001C, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels, CallFunc_Create_ReturnValue) == 0x000040, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000050, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_CreateVariantChannels::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.DisplayVariantChannel
// 0x0058 (0x0058 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel final
{
public:
	class FName                                   ChannelName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CharacterCustomization_VariantChannel_CM_C* CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_TryGetVariantSelectionInLoadout_OutVariantOptionId; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetVariantSelectionInLoadout_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56B8[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UListEntry_CharacterCustomization_VariantOption_C*> CallFunc_GenerateVariantOptions_Options;           // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_GenerateVariantOptions_SelectId;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56B9[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel) == 0x000058, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, ChannelName) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::ChannelName' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_TryGetVariantSelectionInLoadout_OutVariantOptionId) == 0x000018, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_TryGetVariantSelectionInLoadout_OutVariantOptionId' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_TryGetVariantSelectionInLoadout_ReturnValue) == 0x000028, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_TryGetVariantSelectionInLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_GenerateVariantOptions_Options) == 0x000030, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_GenerateVariantOptions_Options' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_GenerateVariantOptions_SelectId) == 0x000040, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_GenerateVariantOptions_SelectId' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000045, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000046, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_Not_PreBool_ReturnValue) == 0x000047, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_DisplayVariantChannel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM
// 0x0098 (0x0098 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56BA[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C* K2Node_CustomEvent_VariantOptionWidget;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_Widget;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C* K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56BB[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C* VariantOptionWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56BC[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56BD[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C* K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM_1; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56BE[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C* K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM_2; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM) == 0x000098, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, EntryPoint) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_CustomEvent_VariantOptionWidget) == 0x000018, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_CustomEvent_VariantOptionWidget' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_CustomEvent_Widget) == 0x000030, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM) == 0x000038, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_ComponentBoundEvent_Widget_1) == 0x000058, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, CallFunc_GetIndexForItem_ReturnValue) == 0x000060, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM_1) == 0x000068, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_ComponentBoundEvent_Item) == 0x000078, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_ComponentBoundEvent_Widget) == 0x000080, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM_2) == 0x000088, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantPickerPanel_CM::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.Get First Focus Widget
// 0x0030 (0x0030 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget final
{
public:
	class UWidget*                                First_Navigation_Widget;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0008(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C* K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56BF[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget) == 0x000030, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget, First_Navigation_Widget) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget::First_Navigation_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000008, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget, K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM) == 0x000020, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget::K2Node_DynamicCast_AsWBP_List_Entry_Character_Customization_Variant_Option_CM' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget, CallFunc_GetIndexForItem_ReturnValue) == 0x00002C, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_Get_First_Focus_Widget::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.HandleOnTileViewEntryGenerated
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnTileViewEntryGenerated final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnTileViewEntryGenerated) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnTileViewEntryGenerated");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnTileViewEntryGenerated) == 0x000008, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnTileViewEntryGenerated");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnTileViewEntryGenerated, Widget) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnTileViewEntryGenerated::Widget' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.HandleOnVariantChannelButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantChannelButtonClicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantChannelButtonClicked) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantChannelButtonClicked");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantChannelButtonClicked) == 0x000008, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantChannelButtonClicked");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantChannelButtonClicked, Button) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantChannelButtonClicked::Button' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.HandleOnVariantOptionSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantOptionSelected final
{
public:
	class UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C* VariantOptionWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantOptionSelected) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantOptionSelected");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantOptionSelected) == 0x000008, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantOptionSelected");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantOptionSelected, VariantOptionWidget) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_HandleOnVariantOptionSelected::VariantOptionWidget' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.OnFetchLoadoutForPanel__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnFetchLoadoutForPanel__DelegateSignature final
{
public:
	class UWBP_CharacterCustomization_VariantPickerPanel_CM_C* VariantPickerPanel;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnFetchLoadoutForPanel__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnFetchLoadoutForPanel__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnFetchLoadoutForPanel__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnFetchLoadoutForPanel__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnFetchLoadoutForPanel__DelegateSignature, VariantPickerPanel) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnFetchLoadoutForPanel__DelegateSignature::VariantPickerPanel' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.OnVariantOptionSelected__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature final
{
public:
	class UVAL_CharacterCustomizationItemBase*    Param_Item;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   LoadoutSlotName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   VariantChannelName;                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  VariantOptionId;                                   // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature) == 0x000028, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature, Param_Item) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature::Param_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature, LoadoutSlotName) == 0x000008, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature::LoadoutSlotName' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature, VariantChannelName) == 0x000010, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature::VariantChannelName' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature, VariantOptionId) == 0x000018, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_OnVariantOptionSelected__DelegateSignature::VariantOptionId' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantPickerPanel_CM.WBP_CharacterCustomization_VariantPickerPanel_CM_C.UpdatePanelFromItem
// 0x09B8 (0x09B8 - 0x0000)
struct WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem final
{
public:
	class UVAL_CharacterCustomizationItemBase*    ItemToDisplay;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationLoadout     Param_Loadout;                                     // 0x0008(0x0900)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   LoadoutSlotName;                                   // 0x0908(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasAnyVariantChannelsToShow;                       // 0x0910(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C0[0x7];                                     // 0x0911(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           VariantChannels;                                   // 0x0918(0x0010)(Edit, BlueprintVisible)
	bool                                          HasSameVariantChannelNamesAndItemClass;            // 0x0928(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasVariantsToShow;                                 // 0x0929(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C1[0x2];                                     // 0x092A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x092C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C2[0x3];                                     // 0x0931(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0934(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C3[0x7];                                     // 0x0939(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             CallFunc_TryGetAllVariantChannelNames_OutVariantChannelNames; // 0x0940(0x0050)()
	bool                                          CallFunc_TryGetAllVariantChannelNames_ReturnValue; // 0x0990(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C4[0x7];                                     // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Set_ToArray_Result;                       // 0x0998(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfItemHasSameClassAndVariantChannelNames_HasSameVariantChannelNamesAndItemClass; // 0x09A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x09AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C5[0x1];                                     // 0x09AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x09AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem");
static_assert(sizeof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem) == 0x0009B8, "Wrong size on WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem, ItemToDisplay) == 0x000000, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem::ItemToDisplay' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem, Param_Loadout) == 0x000008, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem::Param_Loadout' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem, LoadoutSlotName) == 0x000908, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem::LoadoutSlotName' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem, HasAnyVariantChannelsToShow) == 0x000910, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem::HasAnyVariantChannelsToShow' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem, VariantChannels) == 0x000918, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem::VariantChannels' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem, HasSameVariantChannelNamesAndItemClass) == 0x000928, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem::HasSameVariantChannelNamesAndItemClass' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem, HasVariantsToShow) == 0x000929, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem::HasVariantsToShow' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem, CallFunc_Array_Length_ReturnValue) == 0x00092C, "Member 'WBP_CharacterCustomization_VariantPickerPanel_CM_C_UpdatePanelFromItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
