#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CarouselPageButton_CM

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CarouselPageButton_CM.WBP_CarouselPageButton_CM_C.ExecuteUbergraph_WBP_CarouselPageButton_CM
// 0x000C (0x000C - 0x0000)
struct WBP_CarouselPageButton_CM_C_ExecuteUbergraph_WBP_CarouselPageButton_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarouselPageButton_CM_C_ExecuteUbergraph_WBP_CarouselPageButton_CM) == 0x000004, "Wrong alignment on WBP_CarouselPageButton_CM_C_ExecuteUbergraph_WBP_CarouselPageButton_CM");
static_assert(sizeof(WBP_CarouselPageButton_CM_C_ExecuteUbergraph_WBP_CarouselPageButton_CM) == 0x00000C, "Wrong size on WBP_CarouselPageButton_CM_C_ExecuteUbergraph_WBP_CarouselPageButton_CM");
static_assert(offsetof(WBP_CarouselPageButton_CM_C_ExecuteUbergraph_WBP_CarouselPageButton_CM, EntryPoint) == 0x000000, "Member 'WBP_CarouselPageButton_CM_C_ExecuteUbergraph_WBP_CarouselPageButton_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPageButton_CM_C_ExecuteUbergraph_WBP_CarouselPageButton_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_CarouselPageButton_CM_C_ExecuteUbergraph_WBP_CarouselPageButton_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPageButton_CM_C_ExecuteUbergraph_WBP_CarouselPageButton_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000008, "Member 'WBP_CarouselPageButton_CM_C_ExecuteUbergraph_WBP_CarouselPageButton_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");

// Function WBP_CarouselPageButton_CM.WBP_CarouselPageButton_CM_C.OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CarouselPageButton_CM_C_OnClicked__DelegateSignature final
{
public:
	class UWBP_CarouselPageButton_CM_C*           TutorialPageButton;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarouselPageButton_CM_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CarouselPageButton_CM_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_CarouselPageButton_CM_C_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CarouselPageButton_CM_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_CarouselPageButton_CM_C_OnClicked__DelegateSignature, TutorialPageButton) == 0x000000, "Member 'WBP_CarouselPageButton_CM_C_OnClicked__DelegateSignature::TutorialPageButton' has a wrong offset!");

// Function WBP_CarouselPageButton_CM.WBP_CarouselPageButton_CM_C.SetIsSeclected
// 0x0010 (0x0010 - 0x0000)
struct WBP_CarouselPageButton_CM_C_SetIsSeclected final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61B8[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarouselPageButton_CM_C_SetIsSeclected) == 0x000008, "Wrong alignment on WBP_CarouselPageButton_CM_C_SetIsSeclected");
static_assert(sizeof(WBP_CarouselPageButton_CM_C_SetIsSeclected) == 0x000010, "Wrong size on WBP_CarouselPageButton_CM_C_SetIsSeclected");
static_assert(offsetof(WBP_CarouselPageButton_CM_C_SetIsSeclected, Value) == 0x000000, "Member 'WBP_CarouselPageButton_CM_C_SetIsSeclected::Value' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPageButton_CM_C_SetIsSeclected, Temp_bool_Variable) == 0x000001, "Member 'WBP_CarouselPageButton_CM_C_SetIsSeclected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPageButton_CM_C_SetIsSeclected, K2Node_Select_Default) == 0x000008, "Member 'WBP_CarouselPageButton_CM_C_SetIsSeclected::K2Node_Select_Default' has a wrong offset!");

}

