#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cooking_Minigame_RollingPin_GoalPost

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Cooking_Minigame_RollingPin_GoalPost.WBP_Cooking_Minigame_RollingPin_GoalPost_C.ExecuteUbergraph_WBP_Cooking_Minigame_RollingPin_GoalPost
// 0x0004 (0x0004 - 0x0000)
struct WBP_Cooking_Minigame_RollingPin_GoalPost_C_ExecuteUbergraph_WBP_Cooking_Minigame_RollingPin_GoalPost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_RollingPin_GoalPost_C_ExecuteUbergraph_WBP_Cooking_Minigame_RollingPin_GoalPost) == 0x000004, "Wrong alignment on WBP_Cooking_Minigame_RollingPin_GoalPost_C_ExecuteUbergraph_WBP_Cooking_Minigame_RollingPin_GoalPost");
static_assert(sizeof(WBP_Cooking_Minigame_RollingPin_GoalPost_C_ExecuteUbergraph_WBP_Cooking_Minigame_RollingPin_GoalPost) == 0x000004, "Wrong size on WBP_Cooking_Minigame_RollingPin_GoalPost_C_ExecuteUbergraph_WBP_Cooking_Minigame_RollingPin_GoalPost");
static_assert(offsetof(WBP_Cooking_Minigame_RollingPin_GoalPost_C_ExecuteUbergraph_WBP_Cooking_Minigame_RollingPin_GoalPost, EntryPoint) == 0x000000, "Member 'WBP_Cooking_Minigame_RollingPin_GoalPost_C_ExecuteUbergraph_WBP_Cooking_Minigame_RollingPin_GoalPost::EntryPoint' has a wrong offset!");

// Function WBP_Cooking_Minigame_RollingPin_GoalPost.WBP_Cooking_Minigame_RollingPin_GoalPost_C.Play Error Animation
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Error_Animation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Error_Animation) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Error_Animation");
static_assert(sizeof(WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Error_Animation) == 0x000008, "Wrong size on WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Error_Animation");
static_assert(offsetof(WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Error_Animation, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Error_Animation::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_Cooking_Minigame_RollingPin_GoalPost.WBP_Cooking_Minigame_RollingPin_GoalPost_C.Play Success Animation
// 0x0010 (0x0010 - 0x0000)
struct WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Success_Animation final
{
public:
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B96[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Success_Animation) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Success_Animation");
static_assert(sizeof(WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Success_Animation) == 0x000010, "Wrong size on WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Success_Animation");
static_assert(offsetof(WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Success_Animation, CallFunc_AkEventGlobal_ReturnValue) == 0x000000, "Member 'WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Success_Animation::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Success_Animation, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_Cooking_Minigame_RollingPin_GoalPost_C_Play_Success_Animation::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

