#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialConnectionsCategoryList_CM

#include "Basic.hpp"

#include "F_CommonUIButtonPrompt_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Palia_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_0_OnCustomNavigationGroupInitialized__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_0_OnCustomNavigationGroupInitialized__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_0_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_0_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_0_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_0_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_0_OnCustomNavigationGroupInitialized__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_0_OnCustomNavigationGroupInitialized__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_3_OnNavigated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_3_OnNavigated__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_3_OnNavigated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_3_OnNavigated__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_3_OnNavigated__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_3_OnNavigated__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_3_OnNavigated__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_3_OnNavigated__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_2_OnAreaExpanded__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_2_OnAreaExpanded__DelegateSignature final
{
public:
	class UWBP_ExpandableArea_CM_C*               ExpandableAreaWidget;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Expanded;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_2_OnAreaExpanded__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_2_OnAreaExpanded__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_2_OnAreaExpanded__DelegateSignature) == 0x000010, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_2_OnAreaExpanded__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_2_OnAreaExpanded__DelegateSignature, ExpandableAreaWidget) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_2_OnAreaExpanded__DelegateSignature::ExpandableAreaWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_2_OnAreaExpanded__DelegateSignature, Expanded) == 0x000008, "Member 'WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_2_OnAreaExpanded__DelegateSignature::Expanded' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_5_OnExpandableAreaFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_5_OnExpandableAreaFocused__DelegateSignature final
{
public:
	class UWBP_ExpandableArea_CM_C*               Expandable_Area;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_5_OnExpandableAreaFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_5_OnExpandableAreaFocused__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_5_OnExpandableAreaFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_5_OnExpandableAreaFocused__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_5_OnExpandableAreaFocused__DelegateSignature, Expandable_Area) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_CM_WBP_ExpandableArea_CM_K2Node_ComponentBoundEvent_5_OnExpandableAreaFocused__DelegateSignature::Expandable_Area' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.BndEvt__WBP_SocialConnectionsCategoryList_VALUI_ListView_Styled_164_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_VALUI_ListView_Styled_164_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_VALUI_ListView_Styled_164_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_VALUI_ListView_Styled_164_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_VALUI_ListView_Styled_164_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_VALUI_ListView_Styled_164_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_VALUI_ListView_Styled_164_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_BndEvt__WBP_SocialConnectionsCategoryList_VALUI_ListView_Styled_164_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.DoCustomNavigation
// 0x0018 (0x0018 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation) == 0x000018, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation, Param_Navigation) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.DoCustomNavigation_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0 final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E6[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0) == 0x000030, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0, Param_Navigation) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0, ReturnValue) == 0x000008, "Member 'WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000018, "Member 'WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_SocialConnectionsCategoryList_CM_C_DoCustomNavigation_0::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM
// 0x0150 (0x0150 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListEntry_SocialConnection_CM_C*   K2Node_DynamicCast_AsWBP_List_Entry_Social_Connection_CM; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E8[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ExpandableArea_CM_C*               K2Node_ComponentBoundEvent_ExpandableAreaWidget;   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Expanded;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E9[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup_1;             // 0x0038(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* Widget, TArray<struct FF_CommonUIButtonPrompt>& UIPrompt)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UWBP_ExpandableArea_CM_C*               K2Node_ComponentBoundEvent_Expandable_Area;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EA[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt;          // 0x0080(0x0040)(HasGetValueTypeHash)
	TDelegate<void(class UWBP_ListEntry_SocialConnection_CM_C* Widget, const struct FUniqueNetIdRepl& UserId)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt_1;        // 0x00D0(0x0040)(HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_MakeArray_Array_1;                          // 0x0110(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_1;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EB[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EC[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup;               // 0x0138(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57ED[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0148(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM) == 0x000150, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, EntryPoint) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, Temp_bool_Variable) == 0x000004, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, Temp_int_Variable) == 0x000008, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, Temp_int_Variable_1) == 0x00000C, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_ComponentBoundEvent_Widget) == 0x000010, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_DynamicCast_AsWBP_List_Entry_Social_Connection_CM) == 0x000018, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_DynamicCast_AsWBP_List_Entry_Social_Connection_CM' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_ComponentBoundEvent_ExpandableAreaWidget) == 0x000028, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_ComponentBoundEvent_ExpandableAreaWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_ComponentBoundEvent_Expanded) == 0x000030, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_ComponentBoundEvent_Expanded' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_ComponentBoundEvent_NavGroup_1) == 0x000038, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_ComponentBoundEvent_NavGroup_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_ComponentBoundEvent_Expandable_Area) == 0x000060, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_ComponentBoundEvent_Expandable_Area' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, Temp_object_Variable) == 0x000068, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, CallFunc_IsVisible_ReturnValue) == 0x000070, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, Temp_object_Variable_1) == 0x000078, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_MakeStruct_F_CommonUIButtonPrompt) == 0x000080, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_MakeStruct_F_CommonUIButtonPrompt' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C0, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_MakeStruct_F_CommonUIButtonPrompt_1) == 0x0000D0, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_MakeStruct_F_CommonUIButtonPrompt_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_MakeArray_Array_1) == 0x000110, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, Temp_bool_Variable_1) == 0x000120, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_Select_Default) == 0x000128, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000130, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_Event_IsDesignTime) == 0x000134, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_ComponentBoundEvent_NavGroup) == 0x000138, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_ComponentBoundEvent_NavGroup' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, CallFunc_GetNumItems_ReturnValue) == 0x000140, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, CallFunc_Greater_IntInt_ReturnValue) == 0x000144, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM, K2Node_Select_Default_1) == 0x000148, "Member 'WBP_SocialConnectionsCategoryList_CM_C_ExecuteUbergraph_WBP_SocialConnectionsCategoryList_CM::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.HandleInspectPlayerCharacter
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_HandleInspectPlayerCharacter final
{
public:
	class UWBP_ListEntry_SocialConnection_CM_C*   Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_HandleInspectPlayerCharacter) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_HandleInspectPlayerCharacter");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_HandleInspectPlayerCharacter) == 0x000038, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_HandleInspectPlayerCharacter");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleInspectPlayerCharacter, Widget) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleInspectPlayerCharacter::Widget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleInspectPlayerCharacter, UserId) == 0x000008, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleInspectPlayerCharacter::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.HandleOnMarkFocusUI
// 0x0018 (0x0018 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_HandleOnMarkFocusUI final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_HandleOnMarkFocusUI) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_HandleOnMarkFocusUI");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_HandleOnMarkFocusUI) == 0x000018, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_HandleOnMarkFocusUI");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleOnMarkFocusUI, Widget) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleOnMarkFocusUI::Widget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleOnMarkFocusUI, UIPrompt) == 0x000008, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleOnMarkFocusUI::UIPrompt' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.HandleSortSocialConnection
// 0x03A8 (0x03A8 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection final
{
public:
	class UObject*                                A;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                B;                                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EE[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPresence                              B_Presence;                                        // 0x0018(0x00B0)(Edit, BlueprintVisible)
	struct FPresence                              A_Presence;                                        // 0x00C8(0x00B0)(Edit, BlueprintVisible)
	struct FUniqueNetIdRepl                       B_UserId;                                          // 0x0178(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       A_UserId;                                          // 0x01A8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UListItem_SocialConnection_C*           K2Node_DynamicCast_AsList_Item_Social_Connection;  // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EF[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListItem_SocialConnection_C*           K2Node_DynamicCast_AsList_Item_Social_Connection_1; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F0[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue;         // 0x0208(0x00B0)()
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue_1;       // 0x02B8(0x00B0)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0368(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0380(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F1[0x3];                                     // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CompareText_ReturnValue;                  // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x03A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection) == 0x0003A8, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, A) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::A' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, B) == 0x000008, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::B' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, ReturnValue) == 0x000010, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, B_Presence) == 0x000018, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::B_Presence' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, A_Presence) == 0x0000C8, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::A_Presence' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, B_UserId) == 0x000178, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::B_UserId' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, A_UserId) == 0x0001A8, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::A_UserId' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, K2Node_DynamicCast_AsList_Item_Social_Connection) == 0x0001D8, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::K2Node_DynamicCast_AsList_Item_Social_Connection' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, K2Node_DynamicCast_AsList_Item_Social_Connection_1) == 0x0001E8, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::K2Node_DynamicCast_AsList_Item_Social_Connection_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0001F8, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000200, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_GetPresenceForUserId_ReturnValue) == 0x000208, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_GetPresenceForUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_GetPresenceForUserId_ReturnValue_1) == 0x0002B8, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_GetPresenceForUserId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_Conv_StringToText_ReturnValue) == 0x000368, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000380, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000398, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_CompareText_ReturnValue) == 0x00039C, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_CompareText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_Not_PreBool_ReturnValue) == 0x0003A0, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_Less_IntInt_ReturnValue) == 0x0003A1, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_NotEqual_TextText_ReturnValue) == 0x0003A2, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0003A3, "Member 'WBP_SocialConnectionsCategoryList_CM_C_HandleSortSocialConnection::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.OnFocusReceived
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_OnFocusReceived) == 0x0000F8, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_SocialConnectionsCategoryList_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_SocialConnectionsCategoryList_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_OnInspectPlayerCharacter__DelegateSignature, CategoryWidget) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_OnInspectPlayerCharacter__DelegateSignature::CategoryWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_SocialConnectionsCategoryList_CM_C_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_SocialConnectionsCategoryList_CM_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_PreConstruct");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_PreConstruct");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.SetHeaderToolTipText
// 0x0018 (0x0018 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_SetHeaderToolTipText final
{
public:
	class FText                                   InToolTipText;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SocialConnectionsCategoryList_CM_C_SetHeaderToolTipText) == 0x000008, "Wrong alignment on WBP_SocialConnectionsCategoryList_CM_C_SetHeaderToolTipText");
static_assert(sizeof(WBP_SocialConnectionsCategoryList_CM_C_SetHeaderToolTipText) == 0x000018, "Wrong size on WBP_SocialConnectionsCategoryList_CM_C_SetHeaderToolTipText");
static_assert(offsetof(WBP_SocialConnectionsCategoryList_CM_C_SetHeaderToolTipText, InToolTipText) == 0x000000, "Member 'WBP_SocialConnectionsCategoryList_CM_C_SetHeaderToolTipText::InToolTipText' has a wrong offset!");

// Function WBP_SocialConnectionsCategoryList_CM.WBP_SocialConnectionsCategoryList_CM_C.SetListItems
// 0x0218 (0x0218 - 0x0000)
struct WBP_SocialConnectionsCategoryList_CM_C_SetListItems final
{
public:
	TArray<class UListItem_SocialConnection_C*>   Connections;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         MaximumSize;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F2[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UListItem_SocialConnection_C*>   ItemsToAdd;                                        // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class UListItem_SocialConnection_C*>   ItemsToRemove;                                     // 0x0028(0x0010)(Edit, BlueprintVisible)
	TMap<struct FUniqueNetIdRepl, class UListItem_SocialConnection_C*> NewListItems;                                      // 0x0038(0x0050)(Edit, BlueprintVisible)
	TMap<struct FUniqueNetIdRepl, class UListItem_SocialConnection_C*> OldListItems;                                      // 0x0088(0x0050)(Edit, BlueprintVisible)
	TArray<class UListItem_SocialConnection_C*>   InConnections;                                     // 0x00D8(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F3[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0110(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UListItem_SocialConnection_C*           CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F4[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUniqueNetIdRepl>               CallFunc_Map_Keys_Keys;                            // 0x0140(0x0010)(ReferenceParm)
	struct FUniqueNetIdRepl                       CallFunc_Array_Get_Item_1;                         // 0x0150(0x0030)(HasGetValueTypeHash)
	class UListItem_SocialConnection_C*           CallFunc_Array_Get_Item_2;                         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListItem_SocialConnection_C*           CallFunc_Map_Find_Value;                           // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F5[0x2];                                     // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F6[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F7[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue_1;               // 0x01A8(0x0010)(ConstParm, ReferenceParm)
