#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WaterProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WaterProgress.WBP_WaterProgress_C
// 0x0028 (0x02E8 - 0x02C0)
class UWBP_WaterProgress_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 WaterProgressBackgroundImage;                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WaterProgressBar;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynamic;                                           // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentProgress;                                   // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_WaterProgress(int32 EntryPoint, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, float CallFunc_SetScalarParameterValue_Value_ImplicitCast);
	void Set_Water_Droplet_Progress(double Progress, bool CallFunc_IsValid_ReturnValue, float CallFunc_SetScalarParameterValue_Value_ImplicitCast);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WaterProgress_C">();
	}
	static class UWBP_WaterProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WaterProgress_C>();
	}
};
static_assert(alignof(UWBP_WaterProgress_C) == 0x000008, "Wrong alignment on UWBP_WaterProgress_C");
static_assert(sizeof(UWBP_WaterProgress_C) == 0x0002E8, "Wrong size on UWBP_WaterProgress_C");
static_assert(offsetof(UWBP_WaterProgress_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_WaterProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WaterProgress_C, WaterProgressBackgroundImage) == 0x0002C8, "Member 'UWBP_WaterProgress_C::WaterProgressBackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_WaterProgress_C, WaterProgressBar) == 0x0002D0, "Member 'UWBP_WaterProgress_C::WaterProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_WaterProgress_C, Dynamic) == 0x0002D8, "Member 'UWBP_WaterProgress_C::Dynamic' has a wrong offset!");
static_assert(offsetof(UWBP_WaterProgress_C, CurrentProgress) == 0x0002E0, "Member 'UWBP_WaterProgress_C::CurrentProgress' has a wrong offset!");

}

