#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Slider_Settings_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FSettingsItemSlider_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Slider_Settings_CM.WBP_Slider_Settings_CM_C
// 0x00A0 (0x0360 - 0x02C0)
class UWBP_Slider_Settings_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnalogSlider*                          AnalogSlider_DefaultNotch;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_SliderValue;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Slider_CM_C*                       WBP_Slider_CM;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFSettingsItemSlider                   SliderSettings;                                    // 0x02E0(0x0028)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSliderValueChanged;                              // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMouseCaptureBegin;                               // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnMouseCaptureEnd;                                 // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnControllerCaptureBegin;                          // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnControllerCaptureEnd;                            // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        DisplayedValueModifier;                            // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Slider_Settings_CM_WBP_Slider_CM_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature(double Value);
	void BndEvt__WBP_Slider_Settings_CM_WBP_Slider_CM_K2Node_ComponentBoundEvent_6_OnMouseCaptureBegin__DelegateSignature();
	void BndEvt__WBP_Slider_Settings_CM_WBP_Slider_CM_K2Node_ComponentBoundEvent_7_OnMouseCaptureEnd__DelegateSignature();
	void BndEvt__WBP_Slider_Settings_CM_WBP_Slider_CM_K2Node_ComponentBoundEvent_8_OnControllerCaptureBegin__DelegateSignature();
	void BndEvt__WBP_Slider_Settings_CM_WBP_Slider_CM_K2Node_ComponentBoundEvent_9_OnControllerCaptureEnd__DelegateSignature();
	void ExecuteUbergraph_WBP_Slider_Settings_CM(int32 EntryPoint, bool K2Node_Event_IsDesignTime, double K2Node_ComponentBoundEvent_Value, double CallFunc_Multiply_DoubleDouble_ReturnValue, class FText CallFunc_Conv_DoubleToText_ReturnValue);
	void OnControllerCaptureBegin__DelegateSignature();
	void OnControllerCaptureEnd__DelegateSignature();
	void OnMouseCaptureBegin__DelegateSignature();
	void OnMouseCaptureEnd__DelegateSignature();
	void OnSliderValueChanged__DelegateSignature(double Value);
	void PreConstruct(bool IsDesignTime);
	void SetDefaultNotchValue(float InValue);
	void SetMinMaxValues(double InMinValue, double InMaxValue, float CallFunc_SetMinValue_InValue_ImplicitCast, float CallFunc_SetMinValue_InValue_ImplicitCast_1, float CallFunc_SetMaxValue_InValue_ImplicitCast, float CallFunc_SetMaxValue_InValue_ImplicitCast_1);
	void SetSliderSettings(const struct FFSettingsItemSlider& Param_SliderSettings, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility K2Node_Select_Default, float CallFunc_SetDefaultNotchValue_InValue_ImplicitCast);
	void SetValue(double InValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, class FText CallFunc_Conv_DoubleToText_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Slider_Settings_CM_C">();
	}
	static class UWBP_Slider_Settings_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Slider_Settings_CM_C>();
	}
};
static_assert(alignof(UWBP_Slider_Settings_CM_C) == 0x000008, "Wrong alignment on UWBP_Slider_Settings_CM_C");
static_assert(sizeof(UWBP_Slider_Settings_CM_C) == 0x000360, "Wrong size on UWBP_Slider_Settings_CM_C");
static_assert(offsetof(UWBP_Slider_Settings_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Slider_Settings_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_Settings_CM_C, AnalogSlider_DefaultNotch) == 0x0002C8, "Member 'UWBP_Slider_Settings_CM_C::AnalogSlider_DefaultNotch' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_Settings_CM_C, TextBlock_SliderValue) == 0x0002D0, "Member 'UWBP_Slider_Settings_CM_C::TextBlock_SliderValue' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_Settings_CM_C, WBP_Slider_CM) == 0x0002D8, "Member 'UWBP_Slider_Settings_CM_C::WBP_Slider_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_Settings_CM_C, SliderSettings) == 0x0002E0, "Member 'UWBP_Slider_Settings_CM_C::SliderSettings' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_Settings_CM_C, OnSliderValueChanged) == 0x000308, "Member 'UWBP_Slider_Settings_CM_C::OnSliderValueChanged' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_Settings_CM_C, OnMouseCaptureBegin) == 0x000318, "Member 'UWBP_Slider_Settings_CM_C::OnMouseCaptureBegin' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_Settings_CM_C, OnMouseCaptureEnd) == 0x000328, "Member 'UWBP_Slider_Settings_CM_C::OnMouseCaptureEnd' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_Settings_CM_C, OnControllerCaptureBegin) == 0x000338, "Member 'UWBP_Slider_Settings_CM_C::OnControllerCaptureBegin' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_Settings_CM_C, OnControllerCaptureEnd) == 0x000348, "Member 'UWBP_Slider_Settings_CM_C::OnControllerCaptureEnd' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_Settings_CM_C, DisplayedValueModifier) == 0x000358, "Member 'UWBP_Slider_Settings_CM_C::DisplayedValueModifier' has a wrong offset!");

}

