#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cooking_Minigames_PF

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_Cooking_Minigames_PF.WBP_Cooking_Minigames_PF_C.CloseMiniGames
// 0x0001 (0x0001 - 0x0000)
struct WBP_Cooking_Minigames_PF_C_CloseMiniGames final
{
public:
	bool                                          WasSuccess;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigames_PF_C_CloseMiniGames) == 0x000001, "Wrong alignment on WBP_Cooking_Minigames_PF_C_CloseMiniGames");
static_assert(sizeof(WBP_Cooking_Minigames_PF_C_CloseMiniGames) == 0x000001, "Wrong size on WBP_Cooking_Minigames_PF_C_CloseMiniGames");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_CloseMiniGames, WasSuccess) == 0x000000, "Member 'WBP_Cooking_Minigames_PF_C_CloseMiniGames::WasSuccess' has a wrong offset!");

// Function WBP_Cooking_Minigames_PF.WBP_Cooking_Minigames_PF_C.ExecuteUbergraph_WBP_Cooking_Minigames_PF
// 0x02B0 (0x02B0 - 0x0000)
struct WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x0018(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x0048(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4D[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0080(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x00A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4E[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_1;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_2;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4F[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0108(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0130(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A50[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0140(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0168(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0170(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0198(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_4; // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_5; // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A51[0x6];                                     // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_1;                            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_2;                            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A52[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_1;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_2;                            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A53[0x6];                                     // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A54[0x6];                                     // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MinigameQTE_Base_C*                K2Node_DynamicCast_AsWBP_Minigame_QTE_Base;        // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A55[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_WasSuccess;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A56[0x5];                                     // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A57[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A58[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_2;          // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A59[0x5];                                     // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_2;        // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_3;          // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A5A[0x6];                                     // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_3;        // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A5B[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowCookingCamera_ReturnValue;         // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF) == 0x000008, "Wrong alignment on WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF");
static_assert(sizeof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF) == 0x0002B0, "Wrong size on WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, EntryPoint) == 0x000000, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ActionValue_5) == 0x000018, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ActionValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ElapsedTime_5) == 0x000038, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ElapsedTime_5' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_TriggeredTime_5) == 0x00003C, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_TriggeredTime_5' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_SourceAction_5) == 0x000040, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_SourceAction_5' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ActionValue_4) == 0x000048, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ActionValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ElapsedTime_4) == 0x000068, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ElapsedTime_4' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_TriggeredTime_4) == 0x00006C, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_TriggeredTime_4' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_SourceAction_4) == 0x000070, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_SourceAction_4' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000078, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000079, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ActionValue_3) == 0x000080, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ActionValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ElapsedTime_3) == 0x0000A0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ElapsedTime_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_TriggeredTime_3) == 0x0000A4, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_TriggeredTime_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_SourceAction_3) == 0x0000A8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_SourceAction_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_object_Variable) == 0x0000B0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue_2) == 0x0000B8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable) == 0x0000C0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_1) == 0x0000C8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_0) == 0x0000D0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_1_0) == 0x0000D8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_1_1) == 0x0000E0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_1_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_1_2) == 0x0000E8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_1_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_1) == 0x0000F0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_2) == 0x0000F8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_bool_Variable) == 0x000100, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000108, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000128, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x00012C, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x000130, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue_3) == 0x000138, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000140, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000160, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000164, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000168, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000170, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000190, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000194, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000198, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue_4) == 0x0001A0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue_5) == 0x0001A1, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_object_Variable_1) == 0x0001A8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_2) == 0x0001B0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_2_0) == 0x0001B8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_2_1) == 0x0001C0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_2_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_2_2) == 0x0001C8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_2_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_3) == 0x0001D0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_bool_Variable_1) == 0x0001D8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_3_0) == 0x0001E0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_3_1) == 0x0001E8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_3_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_real_Variable_3_2) == 0x0001F0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_real_Variable_3_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_IsServer_ReturnValue) == 0x0001F8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_Not_PreBool_ReturnValue) == 0x0001F9, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_PlayAnimationForward_ReturnValue) == 0x000200, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000208, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_Not_PreBool_ReturnValue_1) == 0x000209, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetActiveWidget_ReturnValue) == 0x000210, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_DynamicCast_AsWBP_Minigame_QTE_Base) == 0x000218, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_DynamicCast_AsWBP_Minigame_QTE_Base' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetOwningPlayer_ReturnValue) == 0x000228, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000230, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_CustomEvent_WasSuccess) == 0x000238, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_CustomEvent_WasSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, Temp_bool_Variable_2) == 0x000239, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetValeriaCharacter_OutResult) == 0x00023A, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000240, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_Select_Default) == 0x000248, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_SwitchEnum_CmpSuccess) == 0x000250, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000258, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000260, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetValeriaCharacter_OutResult_1) == 0x000268, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetValeriaCharacter_OutResult_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetValeriaCharacter_ReturnValue_1) == 0x000270, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetValeriaCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_SwitchEnum_CmpSuccess_1) == 0x000278, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_IsValid_ReturnValue) == 0x000279, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetValeriaCharacter_OutResult_2) == 0x00027A, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetValeriaCharacter_OutResult_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetValeriaCharacter_ReturnValue_2) == 0x000280, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetValeriaCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_SwitchEnum_CmpSuccess_2) == 0x000288, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetValeriaCharacter_OutResult_3) == 0x000289, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetValeriaCharacter_OutResult_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetValeriaCharacter_ReturnValue_3) == 0x000290, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetValeriaCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, K2Node_SwitchEnum_CmpSuccess_3) == 0x000298, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x0002A0, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF, CallFunc_GetShowCookingCamera_ReturnValue) == 0x0002A8, "Member 'WBP_Cooking_Minigames_PF_C_ExecuteUbergraph_WBP_Cooking_Minigames_PF::CallFunc_GetShowCookingCamera_ReturnValue' has a wrong offset!");

// Function WBP_Cooking_Minigames_PF.WBP_Cooking_Minigames_PF_C.InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3
// 0x0030 (0x0030 - 0x0000)
struct WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3) == 0x000008, "Wrong alignment on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3");
static_assert(sizeof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3) == 0x000030, "Wrong size on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3, ActionValue) == 0x000000, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3, ElapsedTime) == 0x000020, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3, TriggeredTime) == 0x000024, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3, SourceAction) == 0x000028, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_3::SourceAction' has a wrong offset!");

// Function WBP_Cooking_Minigames_PF.WBP_Cooking_Minigames_PF_C.InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4
// 0x0030 (0x0030 - 0x0000)
struct WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4) == 0x000008, "Wrong alignment on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4");
static_assert(sizeof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4) == 0x000030, "Wrong size on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4, ActionValue) == 0x000000, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4, ElapsedTime) == 0x000020, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4, TriggeredTime) == 0x000024, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4, SourceAction) == 0x000028, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_4::SourceAction' has a wrong offset!");

// Function WBP_Cooking_Minigames_PF.WBP_Cooking_Minigames_PF_C.InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5
// 0x0030 (0x0030 - 0x0000)
struct WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5) == 0x000008, "Wrong alignment on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5");
static_assert(sizeof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5) == 0x000030, "Wrong size on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5, ActionValue) == 0x000000, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5, ElapsedTime) == 0x000020, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5, TriggeredTime) == 0x000024, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5, SourceAction) == 0x000028, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_Disengage_K2Node_EnhancedInputActionEvent_5::SourceAction' has a wrong offset!");

// Function WBP_Cooking_Minigames_PF.WBP_Cooking_Minigames_PF_C.InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_Cooking_Minigames_PF.WBP_Cooking_Minigames_PF_C.InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_Cooking_Minigames_PF.WBP_Cooking_Minigames_PF_C.InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2
// 0x0030 (0x0030 - 0x0000)
struct WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2) == 0x000008, "Wrong alignment on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2");
static_assert(sizeof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2) == 0x000030, "Wrong size on WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2, ActionValue) == 0x000000, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2, ElapsedTime) == 0x000020, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2, TriggeredTime) == 0x000024, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2, SourceAction) == 0x000028, "Member 'WBP_Cooking_Minigames_PF_C_InpActEvt_IA_Cooking_MinigameAction_K2Node_EnhancedInputActionEvent_2::SourceAction' has a wrong offset!");

// Function WBP_Cooking_Minigames_PF.WBP_Cooking_Minigames_PF_C.SelectMinigameOnPlayingAndShow
// 0x0001 (0x0001 - 0x0000)
struct WBP_Cooking_Minigames_PF_C_SelectMinigameOnPlayingAndShow final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigames_PF_C_SelectMinigameOnPlayingAndShow) == 0x000001, "Wrong alignment on WBP_Cooking_Minigames_PF_C_SelectMinigameOnPlayingAndShow");
static_assert(sizeof(WBP_Cooking_Minigames_PF_C_SelectMinigameOnPlayingAndShow) == 0x000001, "Wrong size on WBP_Cooking_Minigames_PF_C_SelectMinigameOnPlayingAndShow");
static_assert(offsetof(WBP_Cooking_Minigames_PF_C_SelectMinigameOnPlayingAndShow, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_Cooking_Minigames_PF_C_SelectMinigameOnPlayingAndShow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Cooking_Minigames_PF.WBP_Cooking_Minigames_PF_C.SelectWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_Cooking_Minigames_PF_C_SelectWidget final
{
public:
