#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyRebind_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KeyRebind_Button.WBP_KeyRebind_Button_C
// 0x0088 (0x0348 - 0x02C0)
class UWBP_KeyRebind_Button_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ChordKeyIcon;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyIcon;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_91;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              WBP_Template_Button_CM;                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnLeftMouseClicked;                                // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnRightMouseClicked;                               // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHovered;                                         // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnFocused;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnLostFocus;                                       // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FKey>                           UnBoundKeys;                                       // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WBP_KeyRebind_Button_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_OnFocused__DelegateSignature();
	void BndEvt__WBP_KeyRebind_Button_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_OnUnfocused__DelegateSignature();
	void BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_KeyRebind_Button(int32 EntryPoint, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, const struct FFocusEvent& K2Node_Event_InFocusEvent);
	void Initialize(TArray<struct FKey>& InUnBoundKeys);
	void OnFocused__DelegateSignature(class UWidget* Widget);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnHovered__DelegateSignature();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent, const struct FKey& CallFunc_GetKey_ReturnValue, const struct FEventReply& CallFunc_Unhandled_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, bool CallFunc_IsHovered_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnLeftMouseClicked__DelegateSignature();
	void OnLostFocus__DelegateSignature(class UWidget* Widget);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FKey& CallFunc_PointerEvent_GetEffectingButton_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, const struct FEventReply& CallFunc_Unhandled_ReturnValue, bool CallFunc_IsHovered_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnRightMouseClicked__DelegateSignature();
	void Refresh_Image(struct FSlateBrush& SourceIconBrush, struct FSlateBrush& ChordIconBrush, class UObject* CallFunc_GetBrushResource_ReturnValue, class UObject* CallFunc_GetBrushResource_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, class UObject* CallFunc_GetBrushResource_ReturnValue_2, class UObject* CallFunc_GetBrushResource_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KeyRebind_Button_C">();
	}
	static class UWBP_KeyRebind_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KeyRebind_Button_C>();
	}
};
static_assert(alignof(UWBP_KeyRebind_Button_C) == 0x000008, "Wrong alignment on UWBP_KeyRebind_Button_C");
static_assert(sizeof(UWBP_KeyRebind_Button_C) == 0x000348, "Wrong size on UWBP_KeyRebind_Button_C");
static_assert(offsetof(UWBP_KeyRebind_Button_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_KeyRebind_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebind_Button_C, ChordKeyIcon) == 0x0002C8, "Member 'UWBP_KeyRebind_Button_C::ChordKeyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebind_Button_C, KeyIcon) == 0x0002D0, "Member 'UWBP_KeyRebind_Button_C::KeyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebind_Button_C, Spacer_91) == 0x0002D8, "Member 'UWBP_KeyRebind_Button_C::Spacer_91' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebind_Button_C, WBP_Template_Button_CM) == 0x0002E0, "Member 'UWBP_KeyRebind_Button_C::WBP_Template_Button_CM' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebind_Button_C, OnLeftMouseClicked) == 0x0002E8, "Member 'UWBP_KeyRebind_Button_C::OnLeftMouseClicked' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebind_Button_C, OnRightMouseClicked) == 0x0002F8, "Member 'UWBP_KeyRebind_Button_C::OnRightMouseClicked' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebind_Button_C, OnHovered) == 0x000308, "Member 'UWBP_KeyRebind_Button_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebind_Button_C, OnFocused) == 0x000318, "Member 'UWBP_KeyRebind_Button_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebind_Button_C, OnLostFocus) == 0x000328, "Member 'UWBP_KeyRebind_Button_C::OnLostFocus' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebind_Button_C, UnBoundKeys) == 0x000338, "Member 'UWBP_KeyRebind_Button_C::UnBoundKeys' has a wrong offset!");

}

