#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ComboBox_Menu_Option_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ComboBox_Menu_Option_CM.WBP_ComboBox_Menu_Option_CM_C
// 0x0040 (0x0300 - 0x02C0)
class UWBP_ComboBox_Menu_Option_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                TextBlock_Option;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              WBP_Template_Button_CM;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_WBP_ComboBox_Menu_Option_CM_C;               // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5355[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnOptionSelected;                                  // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnFocused;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_OnButtonPressed__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ComboBox_Menu_Option_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_ComboBox_Menu_Option_CM(int32 EntryPoint, bool K2Node_Event_bIsShow, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class FText CallFunc_GetText_ReturnValue, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button);
	void HandleAccept();
	void OnFocused__DelegateSignature(class UWidget* FocusWidget);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnOptionSelected__DelegateSignature(int32 Param_Index, class FText Text);
	void ShowFocusTip(bool bIsShow);

	void IsEmpty(bool* bIsEmpty) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ComboBox_Menu_Option_CM_C">();
	}
	static class UWBP_ComboBox_Menu_Option_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ComboBox_Menu_Option_CM_C>();
	}
};
static_assert(alignof(UWBP_ComboBox_Menu_Option_CM_C) == 0x000008, "Wrong alignment on UWBP_ComboBox_Menu_Option_CM_C");
static_assert(sizeof(UWBP_ComboBox_Menu_Option_CM_C) == 0x000300, "Wrong size on UWBP_ComboBox_Menu_Option_CM_C");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ComboBox_Menu_Option_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_CM_C, TextBlock_Option) == 0x0002C8, "Member 'UWBP_ComboBox_Menu_Option_CM_C::TextBlock_Option' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_CM_C, WBP_Template_Button_CM) == 0x0002D0, "Member 'UWBP_ComboBox_Menu_Option_CM_C::WBP_Template_Button_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_CM_C, Index_WBP_ComboBox_Menu_Option_CM_C) == 0x0002D8, "Member 'UWBP_ComboBox_Menu_Option_CM_C::Index_WBP_ComboBox_Menu_Option_CM_C' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_CM_C, OnOptionSelected) == 0x0002E0, "Member 'UWBP_ComboBox_Menu_Option_CM_C::OnOptionSelected' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_CM_C, OnFocused) == 0x0002F0, "Member 'UWBP_ComboBox_Menu_Option_CM_C::OnFocused' has a wrong offset!");

}

