#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialConnectionsPanel_Console

#include "Basic.hpp"

#include "F_CommonUIButtonPrompt_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ValeriaDTOs_structs.hpp"
#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_SocialPanelConfig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BindEventOnMarkFocusUI
// 0x0010 (0x0010 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BindEventOnMarkFocusUI final
{
public:
	TDelegate<void(class UWidget* Widget, TArray<struct FF_CommonUIButtonPrompt>& UIPrompt)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BindEventOnMarkFocusUI) == 0x000004, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BindEventOnMarkFocusUI");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BindEventOnMarkFocusUI) == 0x000010, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BindEventOnMarkFocusUI");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindEventOnMarkFocusUI, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BindEventOnMarkFocusUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BindToConnectionRequestEvents
// 0x0080 (0x0080 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents final
{
public:
	TDelegate<void(class UWBP_Social_ConnectionRequestsList_CM_C* Widget, int32 Count)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Social_ConnectionRequestsList_CM_C* Widget, int32 Count)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Social_ConnectionRequestsList_CM_C* Widget, int32 Count)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_5;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Social_ConnectionRequestsList_CM_C* Widget, int32 Count)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_7;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents) == 0x000004, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents) == 0x000080, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_5) == 0x000050, "Member 'WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_6) == 0x000060, "Member 'WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents, K2Node_CreateDelegate_OutputDelegate_7) == 0x000070, "Member 'WBP_SocialConnectionsPanel_Console_C_BindToConnectionRequestEvents::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BindToSearchResultPanelEvents
// 0x0030 (0x0030 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BindToSearchResultPanelEvents final
{
public:
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BindToSearchResultPanelEvents) == 0x000004, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BindToSearchResultPanelEvents");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BindToSearchResultPanelEvents) == 0x000030, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BindToSearchResultPanelEvents");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindToSearchResultPanelEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BindToSearchResultPanelEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindToSearchResultPanelEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_SocialConnectionsPanel_Console_C_BindToSearchResultPanelEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BindToSearchResultPanelEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_SocialConnectionsPanel_Console_C_BindToSearchResultPanelEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature, CategoryWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature::CategoryWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Friends_CM_K2Node_ComponentBoundEvent_6_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature, CategoryWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature::CategoryWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Neighbors_CM_K2Node_ComponentBoundEvent_11_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature, CategoryWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature::CategoryWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_OfflineFriendsCM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature, CategoryWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature::CategoryWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Server_CM_K2Node_ComponentBoundEvent_13_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature final
{
public:
	class UWBP_SocialConnectionsCategoryList_CM_C* CategoryWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature) == 0x000038, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature, CategoryWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature::CategoryWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature, UserId) == 0x000008, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_SocialConnectionsCategoryList_Visitors_CM_K2Node_ComponentBoundEvent_15_OnInspectPlayerCharacter__DelegateSignature::UserId' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature final
{
public:
	class UWBP_PlayerCharacterInspectionCard_CM_C* CharacterCardWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature, CharacterCardWidget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_PlayerCharacterInspectionCard_CM_K2Node_ComponentBoundEvent_0_OnBackButtonClicked__DelegateSignature::CharacterCardWidget' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature final
{
public:
	class UWBP_UserSearchPanel_CM_C*              UserSearchPanel;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature, UserSearchPanel) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_16_OnBackButtonClicked__DelegateSignature::UserSearchPanel' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature
// 0x07C0 (0x07C0 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57FF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OriginalSearchTerm;                                // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FVALDTOS_MetaCharacterFormat           CharacterInfo;                                     // 0x0048(0x0778)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature) == 0x0007C0, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature, bWasSuccessful) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature, OriginalSearchTerm) == 0x000008, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature::OriginalSearchTerm' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature, UserId) == 0x000018, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature::UserId' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature, CharacterInfo) == 0x000048, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_CM_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_17_OnSearchResultsRetrieved__DelegateSignature::CharacterInfo' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_CustomNavigationGroup_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_3_OnSearchGroupSwitched__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_3_OnSearchGroupSwitched__DelegateSignature final
{
public:
	int32                                         GroupIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_3_OnSearchGroupSwitched__DelegateSignature) == 0x000004, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_3_OnSearchGroupSwitched__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_3_OnSearchGroupSwitched__DelegateSignature) == 0x000004, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_3_OnSearchGroupSwitched__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_3_OnSearchGroupSwitched__DelegateSignature, GroupIndex) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_3_OnSearchGroupSwitched__DelegateSignature::GroupIndex' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_8_OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_8_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_8_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_8_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_8_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_8_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_8_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_8_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_8_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_Console_WBP_UserSearchPanel_CM_K2Node_ComponentBoundEvent_8_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_BndEvt__WBP_SocialConnectionsPanel_ListView_Search_K2Node_ComponentBoundEvent_5_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.CacheDismissableFriendRequests
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests final
{
public:
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<struct FUniqueNetIdRepl>                 CallFunc_TryGetReciprocalFriendRequests_OutFriendRequests; // 0x0008(0x0050)()
	bool                                          CallFunc_TryGetReciprocalFriendRequests_ReturnValue; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5800[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FUniqueNetIdRepl>                 CallFunc_Set_Union_Result;                         // 0x0060(0x0050)()
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests) == 0x0000B0, "Wrong size on WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests, CallFunc_TryGetReciprocalFriendRequests_OutFriendRequests) == 0x000008, "Member 'WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests::CallFunc_TryGetReciprocalFriendRequests_OutFriendRequests' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests, CallFunc_TryGetReciprocalFriendRequests_ReturnValue) == 0x000058, "Member 'WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests::CallFunc_TryGetReciprocalFriendRequests_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests, CallFunc_Set_Union_Result) == 0x000060, "Member 'WBP_SocialConnectionsPanel_Console_C_CacheDismissableFriendRequests::CallFunc_Set_Union_Result' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.CheckHandleEnhanceInputAction
// 0x0010 (0x0010 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction final
{
public:
	class UInputAction*                           IA;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHandled;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHandleEnhanceInputBackCancel_isHandled; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHandleEnhanceInputAction_Request_isHandled; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction) == 0x000010, "Wrong size on WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction, IA) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction::IA' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction, IsHandled) == 0x000008, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction::IsHandled' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction, CallFunc_CheckHandleEnhanceInputBackCancel_isHandled) == 0x000009, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction::CallFunc_CheckHandleEnhanceInputBackCancel_isHandled' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction, CallFunc_CheckHandleEnhanceInputAction_Request_isHandled) == 0x00000A, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction::CallFunc_CheckHandleEnhanceInputAction_Request_isHandled' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.CheckHandleEnhanceInputAction_Request
// 0x0078 (0x0078 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request final
{
public:
	class UInputAction*                           IA;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHandled;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5801[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetFocusedItem_focusedWidget;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetFocusedItem_focusedWidget_1;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListEntry_ServerSyncRequest_CM_C*  K2Node_DynamicCast_AsWBP_List_Entry_Server_Sync_Request_CM; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5802[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ListEntry_CommunityRequest_CM_C*   K2Node_DynamicCast_AsWBP_List_Entry_Community_Request_CM; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleEnhancedInputAction_isHandled;      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleEnhancedInputAction_isHandled_1;    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5803[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetFocusedItem_focusedWidget_2;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListEntry_PartyRequest_CM_C*       K2Node_DynamicCast_AsWBP_List_Entry_Party_Request_CM; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleEnhancedInputAction_isHandled_2;    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5804[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetFocusedItem_focusedWidget_3;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5805[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ListEntry_FriendRequest_CM_C*      K2Node_DynamicCast_AsWBP_List_Entry_Friend_Request_CM; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleEnhancedInputAction_isHandled_3;    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request) == 0x000008, "Wrong alignment on WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request");
static_assert(sizeof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request) == 0x000078, "Wrong size on WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, IA) == 0x000000, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::IA' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, IsHandled) == 0x000008, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::IsHandled' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_GetFocusedItem_focusedWidget) == 0x000010, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_GetFocusedItem_focusedWidget' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_GetFocusedItem_focusedWidget_1) == 0x000018, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_GetFocusedItem_focusedWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, K2Node_DynamicCast_AsWBP_List_Entry_Server_Sync_Request_CM) == 0x000020, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::K2Node_DynamicCast_AsWBP_List_Entry_Server_Sync_Request_CM' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, K2Node_DynamicCast_AsWBP_List_Entry_Community_Request_CM) == 0x000030, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::K2Node_DynamicCast_AsWBP_List_Entry_Community_Request_CM' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_IsValid_ReturnValue_1) == 0x00003A, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_HandleEnhancedInputAction_isHandled) == 0x00003B, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_HandleEnhancedInputAction_isHandled' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_HandleEnhancedInputAction_isHandled_1) == 0x00003C, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_HandleEnhancedInputAction_isHandled_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_GetFocusedItem_focusedWidget_2) == 0x000040, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_GetFocusedItem_focusedWidget_2' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, K2Node_DynamicCast_AsWBP_List_Entry_Party_Request_CM) == 0x000048, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::K2Node_DynamicCast_AsWBP_List_Entry_Party_Request_CM' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_IsValid_ReturnValue_2) == 0x000051, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_HandleEnhancedInputAction_isHandled_2) == 0x000052, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_HandleEnhancedInputAction_isHandled_2' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_GetFocusedItem_focusedWidget_3) == 0x000058, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_GetFocusedItem_focusedWidget_3' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_IsValid_ReturnValue_3) == 0x000060, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, K2Node_DynamicCast_AsWBP_List_Entry_Friend_Request_CM) == 0x000068, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::K2Node_DynamicCast_AsWBP_List_Entry_Friend_Request_CM' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request, CallFunc_HandleEnhancedInputAction_isHandled_3) == 0x000071, "Member 'WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputAction_Request::CallFunc_HandleEnhancedInputAction_isHandled_3' has a wrong offset!");

// Function WBP_SocialConnectionsPanel_Console.WBP_SocialConnectionsPanel_Console_C.CheckHandleEnhanceInputBackCancel
// 0x0020 (0x0020 - 0x0000)
struct WBP_SocialConnectionsPanel_Console_C_CheckHandleEnhanceInputBackCancel final
{
public:
	class UInputAction*                           IA;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHandled;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5806[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
