#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PinnedQuestGoal

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_PinnedQuestGoal.WBP_PinnedQuestGoal_C.ExecuteUbergraph_WBP_PinnedQuestGoal
// 0x0008 (0x0008 - 0x0000)
struct WBP_PinnedQuestGoal_C_ExecuteUbergraph_WBP_PinnedQuestGoal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PinnedQuestGoal_C_ExecuteUbergraph_WBP_PinnedQuestGoal) == 0x000004, "Wrong alignment on WBP_PinnedQuestGoal_C_ExecuteUbergraph_WBP_PinnedQuestGoal");
static_assert(sizeof(WBP_PinnedQuestGoal_C_ExecuteUbergraph_WBP_PinnedQuestGoal) == 0x000008, "Wrong size on WBP_PinnedQuestGoal_C_ExecuteUbergraph_WBP_PinnedQuestGoal");
static_assert(offsetof(WBP_PinnedQuestGoal_C_ExecuteUbergraph_WBP_PinnedQuestGoal, EntryPoint) == 0x000000, "Member 'WBP_PinnedQuestGoal_C_ExecuteUbergraph_WBP_PinnedQuestGoal::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_ExecuteUbergraph_WBP_PinnedQuestGoal, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_PinnedQuestGoal_C_ExecuteUbergraph_WBP_PinnedQuestGoal::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_ExecuteUbergraph_WBP_PinnedQuestGoal, CallFunc_IsConsole_ReturnValue) == 0x000005, "Member 'WBP_PinnedQuestGoal_C_ExecuteUbergraph_WBP_PinnedQuestGoal::CallFunc_IsConsole_ReturnValue' has a wrong offset!");

// Function WBP_PinnedQuestGoal.WBP_PinnedQuestGoal_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PinnedQuestGoal_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PinnedQuestGoal_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PinnedQuestGoal_C_PreConstruct");
static_assert(sizeof(WBP_PinnedQuestGoal_C_PreConstruct) == 0x000001, "Wrong size on WBP_PinnedQuestGoal_C_PreConstruct");
static_assert(offsetof(WBP_PinnedQuestGoal_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PinnedQuestGoal_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PinnedQuestGoal.WBP_PinnedQuestGoal_C.SetFromDescriptionText
// 0x0018 (0x0018 - 0x0000)
struct WBP_PinnedQuestGoal_C_SetFromDescriptionText final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PinnedQuestGoal_C_SetFromDescriptionText) == 0x000008, "Wrong alignment on WBP_PinnedQuestGoal_C_SetFromDescriptionText");
static_assert(sizeof(WBP_PinnedQuestGoal_C_SetFromDescriptionText) == 0x000018, "Wrong size on WBP_PinnedQuestGoal_C_SetFromDescriptionText");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromDescriptionText, Description) == 0x000000, "Member 'WBP_PinnedQuestGoal_C_SetFromDescriptionText::Description' has a wrong offset!");

// Function WBP_PinnedQuestGoal.WBP_PinnedQuestGoal_C.SetFromQuestGoalState
// 0x0130 (0x0130 - 0x0000)
struct WBP_PinnedQuestGoal_C_SetFromQuestGoalState final
{
public:
	struct FVAL_QuestGoalState                    QuestGoalState;                                    // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVAL_QuestGoalDef                      QuestGoalDef;                                      // 0x0068(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          IsBranchingGoal;                                   // 0x00B8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_QuestBranchingGoalChoiceStatus           ChoiceStatus;                                      // 0x00B9(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5030[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetQuestGoalDescription_ReturnValue;      // 0x00C8(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5031[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_PerformTextSubstitutionsForCharacter_ReturnValue; // 0x00E8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState) == 0x000008, "Wrong alignment on WBP_PinnedQuestGoal_C_SetFromQuestGoalState");
static_assert(sizeof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState) == 0x000130, "Wrong size on WBP_PinnedQuestGoal_C_SetFromQuestGoalState");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, QuestGoalState) == 0x000000, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::QuestGoalState' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, QuestGoalDef) == 0x000068, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::QuestGoalDef' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, IsBranchingGoal) == 0x0000B8, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::IsBranchingGoal' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, ChoiceStatus) == 0x0000B9, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::ChoiceStatus' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000BA, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, CallFunc_BooleanAND_ReturnValue) == 0x0000BB, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, CallFunc_GetValeriaCharacter_OutResult) == 0x0000BC, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, CallFunc_GetValeriaCharacter_ReturnValue) == 0x0000C0, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, CallFunc_GetQuestGoalDescription_ReturnValue) == 0x0000C8, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::CallFunc_GetQuestGoalDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, K2Node_SwitchEnum_CmpSuccess) == 0x0000E0, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, CallFunc_PerformTextSubstitutionsForCharacter_ReturnValue) == 0x0000E8, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::CallFunc_PerformTextSubstitutionsForCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, K2Node_MakeArray_Array) == 0x000100, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, CallFunc_Format_ReturnValue) == 0x000110, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, Temp_byte_Variable) == 0x000128, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, Temp_byte_Variable_1) == 0x000129, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, Temp_bool_Variable) == 0x00012A, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PinnedQuestGoal_C_SetFromQuestGoalState, K2Node_Select_Default) == 0x00012B, "Member 'WBP_PinnedQuestGoal_C_SetFromQuestGoalState::K2Node_Select_Default' has a wrong offset!");

}

