#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cooking_ShelvedIngredient

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Cooking_ShelvedIngredient.WBP_Cooking_ShelvedIngredient_C
// 0x0020 (0x02E0 - 0x02C0)
class UWBP_Cooking_ShelvedIngredient_C final : public UUserWidget
{
public:
	class UImage*                                 BackgroundImage;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FoodImage;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Dynamic2DDropShadow_C*             Image_QualityStar;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                ItemCountText;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateShelvedIngredientState(class UTexture2D* NewFoodIcon, int32 Count, bool StarQuality, ESlateVisibility Temp_byte_Variable, class FText CallFunc_Conv_IntToText_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Cooking_ShelvedIngredient_C">();
	}
	static class UWBP_Cooking_ShelvedIngredient_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Cooking_ShelvedIngredient_C>();
	}
};
static_assert(alignof(UWBP_Cooking_ShelvedIngredient_C) == 0x000008, "Wrong alignment on UWBP_Cooking_ShelvedIngredient_C");
static_assert(sizeof(UWBP_Cooking_ShelvedIngredient_C) == 0x0002E0, "Wrong size on UWBP_Cooking_ShelvedIngredient_C");
static_assert(offsetof(UWBP_Cooking_ShelvedIngredient_C, BackgroundImage) == 0x0002C0, "Member 'UWBP_Cooking_ShelvedIngredient_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_Cooking_ShelvedIngredient_C, FoodImage) == 0x0002C8, "Member 'UWBP_Cooking_ShelvedIngredient_C::FoodImage' has a wrong offset!");
static_assert(offsetof(UWBP_Cooking_ShelvedIngredient_C, Image_QualityStar) == 0x0002D0, "Member 'UWBP_Cooking_ShelvedIngredient_C::Image_QualityStar' has a wrong offset!");
static_assert(offsetof(UWBP_Cooking_ShelvedIngredient_C, ItemCountText) == 0x0002D8, "Member 'UWBP_Cooking_ShelvedIngredient_C::ItemCountText' has a wrong offset!");

}

