#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UserSearchPanel_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaDTOs_structs.hpp"
#include "Palia_structs.hpp"
#include "SlateCore_structs.hpp"
#include "F_CommonUIButtonPrompt_structs.hpp"


namespace SDK::Params
{

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_Button_BackFromSearch_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.BndEvt__WBP_UserSearchPanel_CM_EBox_Input_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_EBox_Input_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_EBox_Input_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_EBox_Input_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_EBox_Input_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_EBox_Input_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_EBox_Input_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_CM_EBox_Input_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.BndEvt__WBP_UserSearchPanel_VALUI_EditableText_Styled_56_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_VALUI_EditableText_Styled_56_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_VALUI_EditableText_Styled_56_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_VALUI_EditableText_Styled_56_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_VALUI_EditableText_Styled_56_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_VALUI_EditableText_Styled_56_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_VALUI_EditableText_Styled_56_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_VALUI_EditableText_Styled_56_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_VALUI_EditableText_Styled_56_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_UserSearchPanel_CM_C_BndEvt__WBP_UserSearchPanel_VALUI_EditableText_Styled_56_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.CheckAllowedToSearch
// 0x03C8 (0x03C8 - 0x0000)
struct WBP_UserSearchPanel_CM_C_CheckAllowedToSearch final
{
public:
	class FString                                 SearchString;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bAllowed;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C5[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ErrorText;                                         // 0x0018(0x0018)(Parm, OutParm)
	class FText                                   ErrorMsg;                                          // 0x0030(0x0018)(Edit, BlueprintVisible)
	bool                                          IsAllowed;                                         // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C6[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterName_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0050)(HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	TSet<struct FUniqueNetIdRepl>                 CallFunc_TryGetOutgoingFriendRequests_OutFriendRequests; // 0x00F0(0x0050)()
	bool                                          CallFunc_TryGetOutgoingFriendRequests_ReturnValue; // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C7[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0018)()
	TArray<struct FUniqueNetIdRepl>               CallFunc_Set_ToArray_Result;                       // 0x0160(0x0010)(ReferenceParm)
	struct FUniqueNetIdRepl                       CallFunc_Array_Get_Item;                           // 0x0170(0x0030)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C8[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01C0(0x0050)(HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0218(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsLocalPlayerInPlayerGuildWith_ReturnValue; // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C9[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0230(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0248(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0260(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x02C0(0x0018)()
	bool                                          CallFunc_HasFriendWithCharacterName_ReturnValue;   // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55CA[0x3];                                     // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55CB[0x3];                                     // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55CC[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x02F0(0x0018)()
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue;         // 0x0310(0x00B0)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch) == 0x000008, "Wrong alignment on WBP_UserSearchPanel_CM_C_CheckAllowedToSearch");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch) == 0x0003C8, "Wrong size on WBP_UserSearchPanel_CM_C_CheckAllowedToSearch");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, SearchString) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::SearchString' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, bAllowed) == 0x000010, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::bAllowed' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, ErrorText) == 0x000018, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::ErrorText' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, ErrorMsg) == 0x000030, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::ErrorMsg' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, IsAllowed) == 0x000048, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::IsAllowed' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, Temp_bool_True_if_break_was_hit_Variable) == 0x000049, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000050, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_GetCharacterName_ReturnValue) == 0x000058, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_GetCharacterName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000068, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x0000D8, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_TryGetOutgoingFriendRequests_OutFriendRequests) == 0x0000F0, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_TryGetOutgoingFriendRequests_OutFriendRequests' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_TryGetOutgoingFriendRequests_ReturnValue) == 0x000140, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_TryGetOutgoingFriendRequests_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Format_ReturnValue) == 0x000148, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Set_ToArray_Result) == 0x000160, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Array_Get_Item) == 0x000170, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Array_Length_ReturnValue) == 0x0001A0, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001A8, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001C0, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x000210, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, K2Node_MakeArray_Array_1) == 0x000218, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_IsLocalPlayerInPlayerGuildWith_ReturnValue) == 0x000228, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_IsLocalPlayerInPlayerGuildWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Format_ReturnValue_1) == 0x000230, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000248, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, K2Node_MakeStruct_FormatArgumentData_2) == 0x000260, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, K2Node_MakeArray_Array_2) == 0x0002B0, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Format_ReturnValue_2) == 0x0002C0, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_HasFriendWithCharacterName_ReturnValue) == 0x0002D8, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_HasFriendWithCharacterName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, Temp_int_Loop_Counter_Variable) == 0x0002DC, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Less_IntInt_ReturnValue) == 0x0002E0, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_Add_IntInt_ReturnValue) == 0x0002E4, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_BooleanAND_ReturnValue) == 0x0002E8, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_MakeLiteralText_ReturnValue) == 0x0002F0, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_GetLocalPlayerSubsystem_ReturnValue_4) == 0x000308, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_GetLocalPlayerSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_GetPresenceForUserId_ReturnValue) == 0x000310, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_GetPresenceForUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0003C0, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_CheckAllowedToSearch, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0003C1, "Member 'WBP_UserSearchPanel_CM_C_CheckAllowedToSearch::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.ExecuteUbergraph_WBP_UserSearchPanel_CM
// 0x0138 (0x0138 - 0x0000)
struct WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasSuccessful, const class FString& OriginalSearchTerm, struct FUniqueNetIdRepl& OutUserId, struct FVALDTOS_MetaCharacterFormat& OutCharacterInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55CD[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0018(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55CE[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0058(0x0018)(ConstParm)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55CF[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	bool                                          CallFunc_CheckAllowedToSearch_bAllowed;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55D0[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CheckAllowedToSearch_ErrorText;           // 0x0108(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55D1[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrySearchForCharacter_ReturnValue;        // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM) == 0x000008, "Wrong alignment on WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM) == 0x000138, "Wrong size on WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, EntryPoint) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, K2Node_ComponentBoundEvent_Text_1) == 0x000018, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, K2Node_ComponentBoundEvent_CommitMethod) == 0x000030, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000040, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000044, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000048, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, K2Node_ComponentBoundEvent_Button) == 0x000050, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, K2Node_ComponentBoundEvent_Text) == 0x000058, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_IsConsole_ReturnValue) == 0x000070, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, K2Node_MakeArray_Array) == 0x0000C8, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D8, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_CheckAllowedToSearch_bAllowed) == 0x000100, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_CheckAllowedToSearch_bAllowed' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_CheckAllowedToSearch_ErrorText) == 0x000108, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_CheckAllowedToSearch_ErrorText' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_TextIsEmpty_ReturnValue) == 0x000120, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000128, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_Not_PreBool_ReturnValue) == 0x000130, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM, CallFunc_TrySearchForCharacter_ReturnValue) == 0x000131, "Member 'WBP_UserSearchPanel_CM_C_ExecuteUbergraph_WBP_UserSearchPanel_CM::CallFunc_TrySearchForCharacter_ReturnValue' has a wrong offset!");

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.HandleSearchForCharacterResult
// 0x08E0 (0x08E0 - 0x0000)
struct WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55D2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OriginalSearchTerm;                                // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FVALDTOS_MetaCharacterFormat           CharacterInfo;                                     // 0x0048(0x0778)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x07C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x07D8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0828(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0840(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0850(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x08A0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x08B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x08C8(0x0018)()
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult) == 0x000008, "Wrong alignment on WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult) == 0x0008E0, "Wrong size on WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, bWasSuccessful) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, OriginalSearchTerm) == 0x000008, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::OriginalSearchTerm' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, UserId) == 0x000018, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::UserId' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, CharacterInfo) == 0x000048, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::CharacterInfo' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, CallFunc_Conv_StringToText_ReturnValue) == 0x0007C0, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, K2Node_MakeStruct_FormatArgumentData) == 0x0007D8, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000828, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, K2Node_MakeArray_Array) == 0x000840, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, K2Node_MakeStruct_FormatArgumentData_1) == 0x000850, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, CallFunc_Format_ReturnValue) == 0x0008A0, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, K2Node_MakeArray_Array_1) == 0x0008B8, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult, CallFunc_Format_ReturnValue_1) == 0x0008C8, "Member 'WBP_UserSearchPanel_CM_C_HandleSearchForCharacterResult::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.OnBackButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UserSearchPanel_CM_C_OnBackButtonClicked__DelegateSignature final
{
public:
	class UWBP_UserSearchPanel_CM_C*              UserSearchPanel;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_OnBackButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UserSearchPanel_CM_C_OnBackButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_OnBackButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_UserSearchPanel_CM_C_OnBackButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_OnBackButtonClicked__DelegateSignature, UserSearchPanel) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_OnBackButtonClicked__DelegateSignature::UserSearchPanel' has a wrong offset!");

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_UserSearchPanel_CM_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UserSearchPanel_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_UserSearchPanel_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_UserSearchPanel_CM_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.OnSearchGroupSwitched__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_UserSearchPanel_CM_C_OnSearchGroupSwitched__DelegateSignature final
{
public:
	int32                                         GroupIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_OnSearchGroupSwitched__DelegateSignature) == 0x000004, "Wrong alignment on WBP_UserSearchPanel_CM_C_OnSearchGroupSwitched__DelegateSignature");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_OnSearchGroupSwitched__DelegateSignature) == 0x000004, "Wrong size on WBP_UserSearchPanel_CM_C_OnSearchGroupSwitched__DelegateSignature");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_OnSearchGroupSwitched__DelegateSignature, GroupIndex) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_OnSearchGroupSwitched__DelegateSignature::GroupIndex' has a wrong offset!");

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.OnSearchResultsRetrieved__DelegateSignature
// 0x07C0 (0x07C0 - 0x0000)
struct WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55D3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OriginalSearchTerm;                                // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FVALDTOS_MetaCharacterFormat           CharacterInfo;                                     // 0x0048(0x0778)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature) == 0x0007C0, "Wrong size on WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature, bWasSuccessful) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature, OriginalSearchTerm) == 0x000008, "Member 'WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature::OriginalSearchTerm' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature, UserId) == 0x000018, "Member 'WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature::UserId' has a wrong offset!");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature, CharacterInfo) == 0x000048, "Member 'WBP_UserSearchPanel_CM_C_OnSearchResultsRetrieved__DelegateSignature::CharacterInfo' has a wrong offset!");

// Function WBP_UserSearchPanel_CM.WBP_UserSearchPanel_CM_C.Reset
// 0x0018 (0x0018 - 0x0000)
struct WBP_UserSearchPanel_CM_C_Reset final
{
public:
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0000(0x0018)()
};
static_assert(alignof(WBP_UserSearchPanel_CM_C_Reset) == 0x000008, "Wrong alignment on WBP_UserSearchPanel_CM_C_Reset");
static_assert(sizeof(WBP_UserSearchPanel_CM_C_Reset) == 0x000018, "Wrong size on WBP_UserSearchPanel_CM_C_Reset");
static_assert(offsetof(WBP_UserSearchPanel_CM_C_Reset, CallFunc_GetEmptyText_ReturnValue) == 0x000000, "Member 'WBP_UserSearchPanel_CM_C_Reset::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");

}

