#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUDSlot

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUDSlot.WBP_HUDSlot_C.ExecuteUbergraph_WBP_HUDSlot
// 0x0128 (0x0128 - 0x0000)
struct WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    K2Node_CustomEvent_Inventory;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A5[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           CallFunc_GetEquippedItem_ReturnValue;              // 0x0020(0x0060)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A6[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A7[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, const struct FEquipmentItem& Item)> K2Node_CreateDelegate_OutputDelegate;              // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A8[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentComponent*                    K2Node_CustomEvent_EquipmentComponent;             // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         K2Node_CustomEvent_Item;                           // 0x00C0(0x0050)()
	bool                                          CallFunc_ItemEquals_ReturnValue;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A9[0x2];                                     // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot) == 0x000008, "Wrong alignment on WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot");
static_assert(sizeof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot) == 0x000128, "Wrong size on WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, EntryPoint) == 0x000000, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, K2Node_CustomEvent_Inventory) == 0x000008, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::K2Node_CustomEvent_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, CallFunc_GetValeriaCharacter_OutResult) == 0x000010, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000018, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, CallFunc_GetEquippedItem_ReturnValue) == 0x000020, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::CallFunc_GetEquippedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, CallFunc_GetValeriaCharacter_OutResult_1) == 0x000081, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::CallFunc_GetValeriaCharacter_OutResult_1' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, CallFunc_GetValeriaCharacter_ReturnValue_1) == 0x000088, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::CallFunc_GetValeriaCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, CallFunc_GetEquipment_ReturnValue) == 0x000090, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, CallFunc_GetInventory_ReturnValue) == 0x000098, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000A0, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, K2Node_CustomEvent_EquipmentComponent) == 0x0000B8, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::K2Node_CustomEvent_EquipmentComponent' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, K2Node_CustomEvent_Item) == 0x0000C0, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, CallFunc_ItemEquals_ReturnValue) == 0x000110, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::CallFunc_ItemEquals_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000111, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000114, "Member 'WBP_HUDSlot_C_ExecuteUbergraph_WBP_HUDSlot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_HUDSlot.WBP_HUDSlot_C.HandleEquipmentChanged
// 0x0058 (0x0058 - 0x0000)
struct WBP_HUDSlot_C_HandleEquipmentChanged final
{
public:
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEquipmentItem                         Item;                                              // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_HUDSlot_C_HandleEquipmentChanged) == 0x000008, "Wrong alignment on WBP_HUDSlot_C_HandleEquipmentChanged");
static_assert(sizeof(WBP_HUDSlot_C_HandleEquipmentChanged) == 0x000058, "Wrong size on WBP_HUDSlot_C_HandleEquipmentChanged");
static_assert(offsetof(WBP_HUDSlot_C_HandleEquipmentChanged, EquipmentComponent) == 0x000000, "Member 'WBP_HUDSlot_C_HandleEquipmentChanged::EquipmentComponent' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_HandleEquipmentChanged, Item) == 0x000008, "Member 'WBP_HUDSlot_C_HandleEquipmentChanged::Item' has a wrong offset!");

// Function WBP_HUDSlot.WBP_HUDSlot_C.HandleEquippedItemUpdate
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUDSlot_C_HandleEquippedItemUpdate final
{
public:
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetTool_IsVisible;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AA[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDSlot_C_HandleEquippedItemUpdate) == 0x000008, "Wrong alignment on WBP_HUDSlot_C_HandleEquippedItemUpdate");
static_assert(sizeof(WBP_HUDSlot_C_HandleEquippedItemUpdate) == 0x000020, "Wrong size on WBP_HUDSlot_C_HandleEquippedItemUpdate");
static_assert(offsetof(WBP_HUDSlot_C_HandleEquippedItemUpdate, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000000, "Member 'WBP_HUDSlot_C_HandleEquippedItemUpdate::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_HandleEquippedItemUpdate, CallFunc_SetTool_IsVisible) == 0x000008, "Member 'WBP_HUDSlot_C_HandleEquippedItemUpdate::CallFunc_SetTool_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_HandleEquippedItemUpdate, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000010, "Member 'WBP_HUDSlot_C_HandleEquippedItemUpdate::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_HandleEquippedItemUpdate, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_HUDSlot_C_HandleEquippedItemUpdate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_HandleEquippedItemUpdate, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_HUDSlot_C_HandleEquippedItemUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_HandleEquippedItemUpdate, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'WBP_HUDSlot_C_HandleEquippedItemUpdate::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_HUDSlot.WBP_HUDSlot_C.HandleOnChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUDSlot_C_HandleOnChanged final
{
public:
	class UInventoryComponent*                    Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDSlot_C_HandleOnChanged) == 0x000008, "Wrong alignment on WBP_HUDSlot_C_HandleOnChanged");
static_assert(sizeof(WBP_HUDSlot_C_HandleOnChanged) == 0x000008, "Wrong size on WBP_HUDSlot_C_HandleOnChanged");
static_assert(offsetof(WBP_HUDSlot_C_HandleOnChanged, Inventory) == 0x000000, "Member 'WBP_HUDSlot_C_HandleOnChanged::Inventory' has a wrong offset!");

// Function WBP_HUDSlot.WBP_HUDSlot_C.UpdateCurrentEquipped
// 0x0090 (0x0090 - 0x0000)
struct WBP_HUDSlot_C_UpdateCurrentEquipped final
{
public:
	struct FBagSlotLocation                       InventorySlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AB[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AC[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           CallFunc_GetItemAt_ReturnValue;                    // 0x0028(0x0060)()
	bool                                          CallFunc_ItemEquals_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUDSlot_C_UpdateCurrentEquipped) == 0x000008, "Wrong alignment on WBP_HUDSlot_C_UpdateCurrentEquipped");
static_assert(sizeof(WBP_HUDSlot_C_UpdateCurrentEquipped) == 0x000090, "Wrong size on WBP_HUDSlot_C_UpdateCurrentEquipped");
static_assert(offsetof(WBP_HUDSlot_C_UpdateCurrentEquipped, InventorySlot) == 0x000000, "Member 'WBP_HUDSlot_C_UpdateCurrentEquipped::InventorySlot' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_UpdateCurrentEquipped, CallFunc_GetValeriaCharacter_OutResult) == 0x000008, "Member 'WBP_HUDSlot_C_UpdateCurrentEquipped::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_UpdateCurrentEquipped, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_HUDSlot_C_UpdateCurrentEquipped::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_UpdateCurrentEquipped, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_HUDSlot_C_UpdateCurrentEquipped::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_UpdateCurrentEquipped, CallFunc_GetInventory_ReturnValue) == 0x000020, "Member 'WBP_HUDSlot_C_UpdateCurrentEquipped::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_UpdateCurrentEquipped, CallFunc_GetItemAt_ReturnValue) == 0x000028, "Member 'WBP_HUDSlot_C_UpdateCurrentEquipped::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUDSlot_C_UpdateCurrentEquipped, CallFunc_ItemEquals_ReturnValue) == 0x000088, "Member 'WBP_HUDSlot_C_UpdateCurrentEquipped::CallFunc_ItemEquals_ReturnValue' has a wrong offset!");

}

