#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_Notification_Basic_Error

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Template_Notification_Basic_Error.WBP_Template_Notification_Basic_Error_C.ExecuteUbergraph_WBP_Template_Notification_Basic_Error
// 0x0030 (0x0030 - 0x0000)
struct WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DF4[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error) == 0x000008, "Wrong alignment on WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error");
static_assert(sizeof(WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error) == 0x000030, "Wrong size on WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error");
static_assert(offsetof(WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error, EntryPoint) == 0x000000, "Member 'WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000018, "Member 'WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000020, "Member 'WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error, CallFunc_AkEventGlobal_ReturnValue) == 0x000028, "Member 'WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'WBP_Template_Notification_Basic_Error_C_ExecuteUbergraph_WBP_Template_Notification_Basic_Error::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

