#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListEntry_CharacterCustomization_VariantOption_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Param_Button;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Param_Button) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Param_Button' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Param_Button;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Param_Button) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Param_Button' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM
// 0x0048 (0x0048 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A9[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListEntry_CharacterCustomization_VariantOption_C* K2Node_DynamicCast_AsList_Entry_Character_Customization_Variant_Option; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56AA[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56AB[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56AC[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x003C(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM) == 0x000008, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM) == 0x000048, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, EntryPoint) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, K2Node_Event_bIsExpanded) == 0x000004, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, K2Node_Event_bIsSelected) == 0x000005, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, K2Node_DynamicCast_AsList_Entry_Character_Customization_Variant_Option) == 0x000010, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::K2Node_DynamicCast_AsList_Entry_Character_Customization_Variant_Option' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x00001C, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000020, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000028, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM, K2Node_Event_InFocusEvent) == 0x00003C, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusLost");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusLost");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.OnVariantOptionSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnVariantOptionSelected__DelegateSignature final
{
public:
	class UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C* VariantOptionWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnVariantOptionSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnVariantOptionSelected__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnVariantOptionSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnVariantOptionSelected__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnVariantOptionSelected__DelegateSignature, VariantOptionWidget) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_OnVariantOptionSelected__DelegateSignature::VariantOptionWidget' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_PreConstruct");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_PreConstruct");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.SetColors
// 0x0020 (0x0020 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetColors final
{
public:
	struct FLinearColor                           Color1;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color2;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetColors) == 0x000004, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetColors");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetColors) == 0x000020, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetColors");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetColors, Color1) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetColors::Color1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetColors, Color2) == 0x000010, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetColors::Color2' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetSelected final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetSelected) == 0x000001, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetSelected");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetSelected) == 0x000001, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetSelected");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetSelected, IsSelected) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_SetSelected::IsSelected' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.UpdateFromUISettings
// 0x0078 (0x0078 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56AD[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_GetMaterialInstanceFromVariantForDynamicUIColor_ReturnValue; // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56AE[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   CallFunc_GetDynamicUIColorsFromMaterial_ReturnValue; // 0x0048(0x0010)(ReferenceParm)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item_1;                         // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings) == 0x000008, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings) == 0x000078, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings, CallFunc_GetMaterialInstanceFromVariantForDynamicUIColor_ReturnValue) == 0x000008, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings::CallFunc_GetMaterialInstanceFromVariantForDynamicUIColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000030, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings, K2Node_DynamicCast_AsMaterial_Interface) == 0x000038, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings, K2Node_SwitchEnum_CmpSuccess) == 0x000041, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings, CallFunc_GetDynamicUIColorsFromMaterial_ReturnValue) == 0x000048, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings::CallFunc_GetDynamicUIColorsFromMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateFromUISettings::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.UpdateIcon
// 0x0058 (0x0058 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UTexture2D*                             Param_SecondaryColorDefaultIcon;                   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_PrimaryColorDefaultIcon;                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56AF[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon) == 0x000008, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon) == 0x000058, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon, Icon) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon::Icon' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon, Param_SecondaryColorDefaultIcon) == 0x000028, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon::Param_SecondaryColorDefaultIcon' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon, Param_PrimaryColorDefaultIcon) == 0x000030, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon::Param_PrimaryColorDefaultIcon' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000038, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000040, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon, K2Node_DynamicCast_AsTexture_2D) == 0x000048, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C.UpdateSelectedStyle
// 0x0004 (0x0004 - 0x0000)
struct WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateSelectedStyle final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateSelectedStyle) == 0x000001, "Wrong alignment on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateSelectedStyle");
static_assert(sizeof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateSelectedStyle) == 0x000004, "Wrong size on WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateSelectedStyle");
static_assert(offsetof(WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateSelectedStyle, Temp_bool_Variable) == 0x000000, "Member 'WBP_ListEntry_CharacterCustomization_VariantOption_CM_C_UpdateSelectedStyle::Temp_bool_Variable' has a wrong offset!");
