#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TextButton_CM_0

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TextButton_CM.WBP_TextButton_CM_C.ExecuteUbergraph_WBP_TextButton_CM
// 0x0008 (0x0008 - 0x0000)
struct WBP_TextButton_CM_C_ExecuteUbergraph_WBP_TextButton_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextButton_CM_C_ExecuteUbergraph_WBP_TextButton_CM) == 0x000004, "Wrong alignment on WBP_TextButton_CM_C_ExecuteUbergraph_WBP_TextButton_CM");
static_assert(sizeof(WBP_TextButton_CM_C_ExecuteUbergraph_WBP_TextButton_CM) == 0x000008, "Wrong size on WBP_TextButton_CM_C_ExecuteUbergraph_WBP_TextButton_CM");
static_assert(offsetof(WBP_TextButton_CM_C_ExecuteUbergraph_WBP_TextButton_CM, EntryPoint) == 0x000000, "Member 'WBP_TextButton_CM_C_ExecuteUbergraph_WBP_TextButton_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TextButton_CM_C_ExecuteUbergraph_WBP_TextButton_CM, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_TextButton_CM_C_ExecuteUbergraph_WBP_TextButton_CM::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_TextButton_CM.WBP_TextButton_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TextButton_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextButton_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TextButton_CM_C_PreConstruct");
static_assert(sizeof(WBP_TextButton_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_TextButton_CM_C_PreConstruct");
static_assert(offsetof(WBP_TextButton_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TextButton_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TextButton_CM.WBP_TextButton_CM_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_TextButton_CM_C_SetText final
{
public:
	class FText                                   New_Text;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_TextButton_CM_C_SetText) == 0x000008, "Wrong alignment on WBP_TextButton_CM_C_SetText");
static_assert(sizeof(WBP_TextButton_CM_C_SetText) == 0x000018, "Wrong size on WBP_TextButton_CM_C_SetText");
static_assert(offsetof(WBP_TextButton_CM_C_SetText, New_Text) == 0x000000, "Member 'WBP_TextButton_CM_C_SetText::New_Text' has a wrong offset!");

}

