#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListEntry_CharacterCustomization_VariantOption_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ListEntry_CharacterCustomization_VariantOption_CM.WBP_ListEntry_CharacterCustomization_VariantOption_CM_C
// 0x0140 (0x0428 - 0x02E8)
class UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_CM_C*              Button;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PrimaryColor;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SecondaryColor;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FocusTip_CM_C*                     WBP_FocusTip_CM;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   VariantChannelName;                                // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A7[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationItemBase*    Item;                                              // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EVAL_CharacterBodyType                        Body_Type;                                         // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A8[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnVariantOptionSelected;                           // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVAL_CharacterCustomizationVariantOptionBase VariantOptionBase;                                 // 0x0348(0x0098)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UListEntry_CharacterCustomization_VariantOption_C* _List_Entry_Character_Customization_Variant_Option; // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PrimaryColor;                                      // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           SecondaryColor;                                    // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             PrimaryColorDefaultIcon;                           // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             SecondaryColorDefaultIcon;                         // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnVariantOptionFocused;                            // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_ListEntry_CharacterCustomization_VariantOption_CM_Button_K2Node_ComponentBoundEvent_0_OnFocused__DelegateSignature();
	void BndEvt__WBP_ListEntry_CharacterCustomization_VariantOption_CM_Button_K2Node_ComponentBoundEvent_1_OnUnfocused__DelegateSignature();
	void BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Param_Button);
	void BndEvt__WBP_Template_Button_ColorPicker_01_CM_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Param_Button);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Destruct();
	void ExecuteUbergraph_WBP_ListEntry_CharacterCustomization_VariantOption_CM(int32 EntryPoint, bool K2Node_Event_bIsExpanded, bool K2Node_Event_bIsSelected, class UObject* K2Node_Event_ListItemObject, class UListEntry_CharacterCustomization_VariantOption_C* K2Node_DynamicCast_AsList_Entry_Character_Customization_Variant_Option, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, bool K2Node_Event_IsDesignTime, const struct FFocusEvent& K2Node_Event_InFocusEvent);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnVariantOptionFocused__DelegateSignature();
	void OnVariantOptionSelected__DelegateSignature(class UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C* VariantOptionWidget);
	void PreConstruct(bool IsDesignTime);
	void SetColors(const struct FLinearColor& Color1, const struct FLinearColor& Color2);
	void SetSelected(bool IsSelected);
	void UpdateFromUISettings(bool CallFunc_IsValid_ReturnValue, TSoftObjectPtr<class UMaterialInterface> CallFunc_GetMaterialInstanceFromVariantForDynamicUIColor_ReturnValue, class UObject* CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue, class UMaterialInterface* K2Node_DynamicCast_AsMaterial_Interface, bool K2Node_DynamicCast_bSuccess, bool K2Node_SwitchEnum_CmpSuccess, TArray<struct FLinearColor>& CallFunc_GetDynamicUIColorsFromMaterial_ReturnValue, const struct FLinearColor& CallFunc_Array_Get_Item, const struct FLinearColor& CallFunc_Array_Get_Item_1);
	void UpdateIcon(TSoftObjectPtr<class UTexture2D> Icon, class UTexture2D* Param_SecondaryColorDefaultIcon, class UTexture2D* Param_PrimaryColorDefaultIcon, class UObject* CallFunc_LoadAsset_Blocking_ReturnValue, bool CallFunc_IsValidSoftObjectReference_ReturnValue, class UTexture2D* K2Node_DynamicCast_AsTexture_2D, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue);
	void UpdateSelectedStyle(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ListEntry_CharacterCustomization_VariantOption_CM_C">();
	}
	static class UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C>();
	}
};
static_assert(alignof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C) == 0x000008, "Wrong alignment on UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C");
static_assert(sizeof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C) == 0x000428, "Wrong size on UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, Button) == 0x0002F0, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, Image_PrimaryColor) == 0x0002F8, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::Image_PrimaryColor' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, Image_SecondaryColor) == 0x000300, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::Image_SecondaryColor' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, Image_Selected) == 0x000308, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, WBP_FocusTip_CM) == 0x000310, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::WBP_FocusTip_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, VariantChannelName) == 0x000318, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::VariantChannelName' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, Selected) == 0x000320, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, Item) == 0x000328, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::Item' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, Body_Type) == 0x000330, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::Body_Type' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, OnVariantOptionSelected) == 0x000338, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::OnVariantOptionSelected' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, VariantOptionBase) == 0x000348, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::VariantOptionBase' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, _List_Entry_Character_Customization_Variant_Option) == 0x0003E0, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::_List_Entry_Character_Customization_Variant_Option' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, PrimaryColor) == 0x0003E8, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::PrimaryColor' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, SecondaryColor) == 0x0003F8, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::SecondaryColor' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, PrimaryColorDefaultIcon) == 0x000408, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::PrimaryColorDefaultIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, SecondaryColorDefaultIcon) == 0x000410, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::SecondaryColorDefaultIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C, OnVariantOptionFocused) == 0x000418, "Member 'UWBP_ListEntry_CharacterCustomization_VariantOption_CM_C::OnVariantOptionFocused' has a wrong offset!");

}

