#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerCharacterRow_PartyButton_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Palia_structs.hpp"
#include "F_CommonUIButtonPrompt_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.BindToManagerEvents
// 0x0150 (0x0150 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents final
{
public:
	bool                                          Bind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5587[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPresence& OldPresence, const struct FPresence& NewPresence)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyInvite& Invite)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5588[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_18;           // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents) == 0x000150, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, Bind) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::Bind' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_5) == 0x000054, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_6) == 0x000064, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_7) == 0x000074, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_8) == 0x000084, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_9) == 0x000094, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000A4, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_11) == 0x0000B4, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_12) == 0x0000C4, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_13) == 0x0000D4, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_14) == 0x0000E4, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_15) == 0x0000F4, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_16) == 0x000104, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_17) == 0x000114, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000128, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000130, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_18) == 0x000138, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000148, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Invite_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Invite_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Invite_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Invite_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Invite_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Invite_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Invite_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Invite_1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Kick_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Kick_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Kick_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Kick_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Kick_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Kick_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Kick_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_Kick_1_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_RescindInvite_1_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_RescindInvite_1_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_RescindInvite_1_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_RescindInvite_1_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_RescindInvite_1_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_RescindInvite_1_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_RescindInvite_1_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_BndEvt__WBP_PlayerCharacterRow_PartyButton_CM_Button_RescindInvite_1_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM
// 0x0218 (0x0218 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x0014(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5589[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names;                          // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable;                              // 0x0048(0x0010)(ReferenceParm)
	struct FGuid                                  Temp_struct_Variable_1;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_UserId;                         // 0x0080(0x0030)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_PartiesAllowed;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_558A[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_558B[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_558C[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PartyMember                       CallFunc_CreatePartyMember_ReturnValue;            // 0x00D8(0x0050)(HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_PartyInvite                       CallFunc_HasSentInviteTo_OutInvite;                // 0x0138(0x00B8)(HasGetValueTypeHash)
	bool                                          CallFunc_HasSentInviteTo_ReturnValue;              // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_558D[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0210(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM) == 0x000218, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, EntryPoint) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, K2Node_CustomEvent_AccountId_1) == 0x000004, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, K2Node_CustomEvent_AccountId) == 0x000014, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, K2Node_CustomEvent_Names) == 0x000028, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::K2Node_CustomEvent_Names' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, Temp_struct_Variable) == 0x000048, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, Temp_struct_Variable_1) == 0x000058, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000068, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000070, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000078, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, K2Node_CustomEvent_UserId) == 0x000080, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::K2Node_CustomEvent_UserId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, K2Node_CustomEvent_PartiesAllowed) == 0x0000B0, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::K2Node_CustomEvent_PartiesAllowed' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, CallFunc_GetAccountId_ReturnValue) == 0x0000B4, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, CallFunc_GetCharacterNamesByAccountId_ReturnValue) == 0x0000C8, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::CallFunc_GetCharacterNamesByAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, CallFunc_CreatePartyMember_ReturnValue) == 0x0000D8, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::CallFunc_CreatePartyMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, CallFunc_HasSentInviteTo_OutInvite) == 0x000138, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::CallFunc_HasSentInviteTo_OutInvite' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, CallFunc_HasSentInviteTo_ReturnValue) == 0x0001F0, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::CallFunc_HasSentInviteTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, K2Node_ComponentBoundEvent_Button_2) == 0x0001F8, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000200, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, K2Node_ComponentBoundEvent_Button) == 0x000208, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM, K2Node_Event_InFocusEvent) == 0x000210, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ExecuteUbergraph_WBP_PlayerCharacterRow_PartyButton_CM::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.HandleOnPartyInviteReceived
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteReceived final
{
public:
	struct FVAL_PartyInvite                       Invite;                                            // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteReceived) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteReceived");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteReceived) == 0x0000B8, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteReceived");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteReceived, Invite) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteReceived::Invite' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.HandleOnPartyInviteRejected
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRejected final
{
public:
	struct FVAL_PartyInvite                       Invite;                                            // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRejected) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRejected");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRejected) == 0x0000B8, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRejected");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRejected, Invite) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRejected::Invite' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.HandleOnPartyInviteRescinded
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRescinded final
{
public:
	struct FVAL_PartyInvite                       Invite;                                            // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRescinded) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRescinded");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRescinded) == 0x0000B8, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRescinded");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRescinded, Invite) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteRescinded::Invite' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.HandleOnPartyInviteSent
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteSent final
{
public:
	struct FVAL_PartyInvite                       Invite;                                            // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteSent) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteSent");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteSent) == 0x0000B8, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteSent");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteSent, Invite) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteSent::Invite' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.HandleOnPartyInviteTimedOut
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteTimedOut final
{
public:
	struct FVAL_PartyInvite                       Invite;                                            // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteTimedOut) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteTimedOut");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteTimedOut) == 0x0000B8, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteTimedOut");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteTimedOut, Invite) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyInviteTimedOut::Invite' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.HandleOnPartyMemberAdded
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberAdded final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberAdded) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberAdded");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberAdded) == 0x000050, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberAdded");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberAdded, Member) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberAdded::Member' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.HandleOnPartyMemberKicked
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberKicked final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberKicked) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberKicked");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberKicked) == 0x000050, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberKicked");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberKicked, Member) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberKicked::Member' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.HandleOnPartyMemberRemoved
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberRemoved final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberRemoved) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberRemoved");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberRemoved) == 0x000050, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberRemoved");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberRemoved, Member) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyMemberRemoved::Member' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.HandleOnPartyStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyStateChanged final
{
public:
	EVAL_PartyManagerState                        State;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyStateChanged) == 0x000001, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyStateChanged");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyStateChanged) == 0x000001, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyStateChanged");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyStateChanged, State) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPartyStateChanged::State' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.HandleOnPresenceChange
// 0x0168 (0x0168 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPresenceChange final
{
public:
	struct FPresence                              OldPresence;                                       // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPresence                              NewPresence;                                       // 0x00B0(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPresenceChange) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPresenceChange");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPresenceChange) == 0x000168, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPresenceChange");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPresenceChange, OldPresence) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPresenceChange::OldPresence' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPresenceChange, NewPresence) == 0x0000B0, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPresenceChange::NewPresence' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPresenceChange, CallFunc_EqualEqual_ReturnValue) == 0x000160, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_HandleOnPresenceChange::CallFunc_EqualEqual_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.InitializeButton
// 0x0038 (0x0038 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_InitializeButton final
{
public:
	struct FUniqueNetIdRepl                       Param_UserId;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          PartiesAllowed;                                    // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_InitializeButton) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_InitializeButton");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_InitializeButton) == 0x000038, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_InitializeButton");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_InitializeButton, Param_UserId) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_InitializeButton::Param_UserId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_InitializeButton, PartiesAllowed) == 0x000030, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_InitializeButton::PartiesAllowed' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.OnFailure_42AED4624B694C893D89C1998F62AA39
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_OnFailure_42AED4624B694C893D89C1998F62AA39 final
{
public:
	struct FGuid                                  Param_AccountId;                                   // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFailure_42AED4624B694C893D89C1998F62AA39) == 0x000004, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_OnFailure_42AED4624B694C893D89C1998F62AA39");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFailure_42AED4624B694C893D89C1998F62AA39) == 0x000010, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_OnFailure_42AED4624B694C893D89C1998F62AA39");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFailure_42AED4624B694C893D89C1998F62AA39, Param_AccountId) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_OnFailure_42AED4624B694C893D89C1998F62AA39::Param_AccountId' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusLost");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusLost");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.OnSuccess_42AED4624B694C893D89C1998F62AA39
// 0x0020 (0x0020 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_OnSuccess_42AED4624B694C893D89C1998F62AA39 final
{
public:
	struct FGuid                                  Param_AccountId;                                   // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Names;                                             // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnSuccess_42AED4624B694C893D89C1998F62AA39) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_OnSuccess_42AED4624B694C893D89C1998F62AA39");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnSuccess_42AED4624B694C893D89C1998F62AA39) == 0x000020, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_OnSuccess_42AED4624B694C893D89C1998F62AA39");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnSuccess_42AED4624B694C893D89C1998F62AA39, Param_AccountId) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_OnSuccess_42AED4624B694C893D89C1998F62AA39::Param_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_OnSuccess_42AED4624B694C893D89C1998F62AA39, Names) == 0x000010, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_OnSuccess_42AED4624B694C893D89C1998F62AA39::Names' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.ShouldHideButton
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_558E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_558F[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5590[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue;         // 0x0028(0x00B0)()
	bool                                          CallFunc_IsFTUEComplete_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFTUEMapOrExperience_ReturnValue;        // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton) == 0x000008, "Wrong alignment on WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton");
static_assert(sizeof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton) == 0x0000E8, "Wrong size on WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, ReturnValue) == 0x000000, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, Temp_bool_Variable) == 0x000010, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, Temp_bool_Variable_1) == 0x000011, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_GetValeriaCharacter_OutResult) == 0x000012, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000018, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_GetPresenceForUserId_ReturnValue) == 0x000028, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_GetPresenceForUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_IsFTUEComplete_ReturnValue) == 0x0000D8, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_IsFTUEComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_Not_PreBool_ReturnValue) == 0x0000D9, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_IsFTUEMapOrExperience_ReturnValue) == 0x0000DA, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_IsFTUEMapOrExperience_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, K2Node_Select_Default) == 0x0000DB, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000DC, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000DD, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_BooleanOR_ReturnValue) == 0x0000DE, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, K2Node_SwitchEnum_CmpSuccess) == 0x0000DF, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_BooleanOR_ReturnValue_1) == 0x0000E0, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton, CallFunc_BooleanOR_ReturnValue_2) == 0x0000E1, "Member 'WBP_PlayerCharacterRow_PartyButton_CM_C_ShouldHideButton::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function WBP_PlayerCharacterRow_PartyButton_CM.WBP_PlayerCharacterRow_PartyButton_CM_C.UpdateState
// 0x0590 (0x0590 - 0x0000)
struct WBP_PlayerCharacterRow_PartyButton_CM_C_UpdateState final
{
public:
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
