#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GardenPlotActor_WeedStatusPlate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GardenPlotActor_WeedStatusPlate.WBP_GardenPlotActor_WeedStatusPlate_C
// 0x0030 (0x02F0 - 0x02C0)
class UWBP_GardenPlotActor_WeedStatusPlate_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 MinigameMaterial;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_55;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EMinigameState                                StateChangedPrevious;                              // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GardenPlotActor_WeedStatusPlate(int32 EntryPoint, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush);
	void GetMinigameMaterial(class UImage** Material);
	void OnInitialized();
	void OnMinigameState(EMinigameState MinigameState, class FText Temp_text_Variable, bool K2Node_SwitchEnum_CmpSuccess, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, class FText Temp_text_Variable_4, class FText Temp_text_Variable_5, EMinigameState Temp_byte_Variable, class UWidgetAnimation* Temp_object_Variable, class UWidgetAnimation* Temp_object_Variable_1, class UWidgetAnimation* Temp_object_Variable_2, class UWidgetAnimation* Temp_object_Variable_3, class UWidgetAnimation* Temp_object_Variable_4, class FText Temp_text_Variable_6, class FText Temp_text_Variable_7, class FText Temp_text_Variable_8, EMinigameState Temp_byte_Variable_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class FText K2Node_Select_Default, bool CallFunc_NotEqual_ByteByte_ReturnValue, class UWidgetAnimation* K2Node_Select_Default_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GardenPlotActor_WeedStatusPlate_C">();
	}
	static class UWBP_GardenPlotActor_WeedStatusPlate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GardenPlotActor_WeedStatusPlate_C>();
	}
};
static_assert(alignof(UWBP_GardenPlotActor_WeedStatusPlate_C) == 0x000008, "Wrong alignment on UWBP_GardenPlotActor_WeedStatusPlate_C");
static_assert(sizeof(UWBP_GardenPlotActor_WeedStatusPlate_C) == 0x0002F0, "Wrong size on UWBP_GardenPlotActor_WeedStatusPlate_C");
static_assert(offsetof(UWBP_GardenPlotActor_WeedStatusPlate_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_GardenPlotActor_WeedStatusPlate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlotActor_WeedStatusPlate_C, Hide) == 0x0002C8, "Member 'UWBP_GardenPlotActor_WeedStatusPlate_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlotActor_WeedStatusPlate_C, Show) == 0x0002D0, "Member 'UWBP_GardenPlotActor_WeedStatusPlate_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlotActor_WeedStatusPlate_C, MinigameMaterial) == 0x0002D8, "Member 'UWBP_GardenPlotActor_WeedStatusPlate_C::MinigameMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlotActor_WeedStatusPlate_C, TextBlock_55) == 0x0002E0, "Member 'UWBP_GardenPlotActor_WeedStatusPlate_C::TextBlock_55' has a wrong offset!");
static_assert(offsetof(UWBP_GardenPlotActor_WeedStatusPlate_C, StateChangedPrevious) == 0x0002E8, "Member 'UWBP_GardenPlotActor_WeedStatusPlate_C::StateChangedPrevious' has a wrong offset!");

}

