#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GPPopup_TutorialModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GPPopup_TutorialModal.WBP_GPPopup_TutorialModal_C
// 0x00D0 (0x0608 - 0x0538)
class UWBP_GPPopup_TutorialModal_C final : public UVALUI_GpInteractivePopupBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Backer;                                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Primary_Next;                               // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Secondary_01_CM_C* Button_Secondary_Back;                             // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CarouselTutorialDismiss;                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CheckmarkButton_CM_C*              CheckBox_SuppressTutorials;                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CheckBox_SuppressTutorials_ActionWidget;           // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_RichTextBlock_Styled*            Description;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        DismissTypeSwitcher;                               // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Border_Styled*                   GameActionToDismiss;                               // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Primary_Next;                              // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SecondaryBack;                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PageCarouselButtons_Overlay;                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       PageSwitcher;                                      // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PressButtonToDismiss;                              // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TutorialOptOut;                                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ProgressBar_Styled*              VALUI_ProgressBar_Styled_67;                       // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        WBP_CommonUIButtonPromptItem;                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GpPopup_PopupData_C*               WBP_GpPopup_PopupData;                             // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DismissTimerHandle;                                // 0x05D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DismissTimerDuration;                              // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxTutorialPages;                                  // 0x05E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5697[0x4];                                     // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_DescriptivePopupType*              DescriptivePopupType;                              // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentPageIndex;                                  // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5698[0x4];                                     // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_AlignedPopupType*                  AlignedPopupType;                                  // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowBackDismiss;                                  // 0x0600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GPPopup_TutorialModal_Button_Primary_Next_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_GPPopup_TutorialModal_Button_Secondary_Back_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature();
	bool BP_OnHandleBackAction();
	void Construct();
	void ExecuteUbergraph_WBP_GPPopup_TutorialModal(int32 EntryPoint, int32 CallFunc_Subtract_IntInt_ReturnValue, class UVAL_KeypressTimeoutDismiss* K2Node_DynamicCast_AsTimeout_or_Keypress, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, class UVAL_DismissGameAction* K2Node_DynamicCast_AsGameplay_Action, bool K2Node_DynamicCast_bSuccess_1, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, class UVAL_DescriptivePopupType* K2Node_DynamicCast_AsDescriptive_Modal_Type, bool K2Node_DynamicCast_bSuccess_2, class UVAL_AlignedPopupType* K2Node_DynamicCast_AsAligned_Modal_Type, bool K2Node_DynamicCast_bSuccess_3);
	void GoToNextPage(int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 Temp_int_Variable);
	void GoToPreviousPage(int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 Temp_int_Variable);
	void InitializeTutorialPages(int32 Temp_int_Array_Index_Variable, class UWidget* CallFunc_GetChildAt_ReturnValue, class UWBP_GpPopup_PopupData_C* K2Node_DynamicCast_AsWBP_Gp_Popup_Popup_Data, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UWBP_GpPopup_PopupData_C* K2Node_DynamicCast_AsWBP_Gp_Popup_Popup_Data_1, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateButtons(bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GPPopup_TutorialModal_C">();
	}
	static class UWBP_GPPopup_TutorialModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GPPopup_TutorialModal_C>();
	}
};
static_assert(alignof(UWBP_GPPopup_TutorialModal_C) == 0x000008, "Wrong alignment on UWBP_GPPopup_TutorialModal_C");
static_assert(sizeof(UWBP_GPPopup_TutorialModal_C) == 0x000608, "Wrong size on UWBP_GPPopup_TutorialModal_C");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, UberGraphFrame) == 0x000538, "Member 'UWBP_GPPopup_TutorialModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, Backer) == 0x000540, "Member 'UWBP_GPPopup_TutorialModal_C::Backer' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, Button_Primary_Next) == 0x000548, "Member 'UWBP_GPPopup_TutorialModal_C::Button_Primary_Next' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, Button_Secondary_Back) == 0x000550, "Member 'UWBP_GPPopup_TutorialModal_C::Button_Secondary_Back' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, CarouselTutorialDismiss) == 0x000558, "Member 'UWBP_GPPopup_TutorialModal_C::CarouselTutorialDismiss' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, CheckBox_SuppressTutorials) == 0x000560, "Member 'UWBP_GPPopup_TutorialModal_C::CheckBox_SuppressTutorials' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, CheckBox_SuppressTutorials_ActionWidget) == 0x000568, "Member 'UWBP_GPPopup_TutorialModal_C::CheckBox_SuppressTutorials_ActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, Description) == 0x000570, "Member 'UWBP_GPPopup_TutorialModal_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, DismissTypeSwitcher) == 0x000578, "Member 'UWBP_GPPopup_TutorialModal_C::DismissTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, GameActionToDismiss) == 0x000580, "Member 'UWBP_GPPopup_TutorialModal_C::GameActionToDismiss' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, Overlay_Primary_Next) == 0x000588, "Member 'UWBP_GPPopup_TutorialModal_C::Overlay_Primary_Next' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, Overlay_SecondaryBack) == 0x000590, "Member 'UWBP_GPPopup_TutorialModal_C::Overlay_SecondaryBack' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, PageCarouselButtons_Overlay) == 0x000598, "Member 'UWBP_GPPopup_TutorialModal_C::PageCarouselButtons_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, PageSwitcher) == 0x0005A0, "Member 'UWBP_GPPopup_TutorialModal_C::PageSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, PressButtonToDismiss) == 0x0005A8, "Member 'UWBP_GPPopup_TutorialModal_C::PressButtonToDismiss' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, TutorialOptOut) == 0x0005B0, "Member 'UWBP_GPPopup_TutorialModal_C::TutorialOptOut' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, VALUI_ProgressBar_Styled_67) == 0x0005B8, "Member 'UWBP_GPPopup_TutorialModal_C::VALUI_ProgressBar_Styled_67' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, WBP_CommonUIButtonPromptItem) == 0x0005C0, "Member 'UWBP_GPPopup_TutorialModal_C::WBP_CommonUIButtonPromptItem' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, WBP_GpPopup_PopupData) == 0x0005C8, "Member 'UWBP_GPPopup_TutorialModal_C::WBP_GpPopup_PopupData' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, DismissTimerHandle) == 0x0005D0, "Member 'UWBP_GPPopup_TutorialModal_C::DismissTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, DismissTimerDuration) == 0x0005D8, "Member 'UWBP_GPPopup_TutorialModal_C::DismissTimerDuration' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, MaxTutorialPages) == 0x0005E0, "Member 'UWBP_GPPopup_TutorialModal_C::MaxTutorialPages' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, DescriptivePopupType) == 0x0005E8, "Member 'UWBP_GPPopup_TutorialModal_C::DescriptivePopupType' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, CurrentPageIndex) == 0x0005F0, "Member 'UWBP_GPPopup_TutorialModal_C::CurrentPageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, AlignedPopupType) == 0x0005F8, "Member 'UWBP_GPPopup_TutorialModal_C::AlignedPopupType' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_TutorialModal_C, AllowBackDismiss) == 0x000600, "Member 'UWBP_GPPopup_TutorialModal_C::AllowBackDismiss' has a wrong offset!");

}

