#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToolBacker_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ToolBacker_CM.WBP_ToolBacker_CM_C.ExecuteUbergraph_WBP_ToolBacker_CM
// 0x0048 (0x0048 - 0x0000)
struct WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5324[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5325[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FValeriaItem& Item)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(double WaterPercent, bool ShouldDisplayWater)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM) == 0x000008, "Wrong alignment on WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM");
static_assert(sizeof(WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM) == 0x000048, "Wrong size on WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM");
static_assert(offsetof(WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM, EntryPoint) == 0x000000, "Member 'WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM, CallFunc_GetValeriaCharacter_OutResult) == 0x000004, "Member 'WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'WBP_ToolBacker_CM_C_ExecuteUbergraph_WBP_ToolBacker_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_ToolBacker_CM.WBP_ToolBacker_CM_C.HandleDurabilityUpdated
// 0x0150 (0x0150 - 0x0000)
struct WBP_ToolBacker_CM_C_HandleDurabilityUpdated final
{
public:
	struct FValeriaItem                           Item;                                              // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLinearColor                           BadColor;                                          // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MidColor;                                          // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GoodColor;                                         // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5326[0x5];                                     // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5327[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5328[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5329[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532A[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x00EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532B[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532C[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532D[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x0134(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated) == 0x000008, "Wrong alignment on WBP_ToolBacker_CM_C_HandleDurabilityUpdated");
static_assert(sizeof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated) == 0x000150, "Wrong size on WBP_ToolBacker_CM_C_HandleDurabilityUpdated");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, Item) == 0x000000, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::Item' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, BadColor) == 0x000060, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::BadColor' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, MidColor) == 0x000070, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::MidColor' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, GoodColor) == 0x000080, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::GoodColor' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000090, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000098, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, K2Node_DynamicCast_AsItem_Type_Definition) == 0x0000A0, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A9, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_IsValid_ReturnValue) == 0x0000AA, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000B0, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000B8, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0000C8, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_BooleanAND_ReturnValue) == 0x0000D8, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_BooleanAND_ReturnValue_1) == 0x0000E8, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_MakeColor_ReturnValue) == 0x0000EC, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000100, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000108, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000110, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000118, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000120, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_MakeColor_ReturnValue_1) == 0x000124, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_MakeColor_ReturnValue_2) == 0x000134, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_MakeColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000144, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_MakeColor_R_ImplicitCast) == 0x000148, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_MakeColor_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleDurabilityUpdated, CallFunc_MakeColor_G_ImplicitCast) == 0x00014C, "Member 'WBP_ToolBacker_CM_C_HandleDurabilityUpdated::CallFunc_MakeColor_G_ImplicitCast' has a wrong offset!");

// Function WBP_ToolBacker_CM.WBP_ToolBacker_CM_C.HandleItemVisiblityUpdated
// 0x0002 (0x0002 - 0x0000)
struct WBP_ToolBacker_CM_C_HandleItemVisiblityUpdated final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolBacker_CM_C_HandleItemVisiblityUpdated) == 0x000001, "Wrong alignment on WBP_ToolBacker_CM_C_HandleItemVisiblityUpdated");
static_assert(sizeof(WBP_ToolBacker_CM_C_HandleItemVisiblityUpdated) == 0x000002, "Wrong size on WBP_ToolBacker_CM_C_HandleItemVisiblityUpdated");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleItemVisiblityUpdated, Param_IsVisible) == 0x000000, "Member 'WBP_ToolBacker_CM_C_HandleItemVisiblityUpdated::Param_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleItemVisiblityUpdated, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'WBP_ToolBacker_CM_C_HandleItemVisiblityUpdated::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_ToolBacker_CM.WBP_ToolBacker_CM_C.HandleWaterLevelUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_ToolBacker_CM_C_HandleWaterLevelUpdated final
{
public:
	double                                        WaterPercent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldDisplayWater;                                // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532E[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolBacker_CM_C_HandleWaterLevelUpdated) == 0x000008, "Wrong alignment on WBP_ToolBacker_CM_C_HandleWaterLevelUpdated");
static_assert(sizeof(WBP_ToolBacker_CM_C_HandleWaterLevelUpdated) == 0x000010, "Wrong size on WBP_ToolBacker_CM_C_HandleWaterLevelUpdated");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleWaterLevelUpdated, WaterPercent) == 0x000000, "Member 'WBP_ToolBacker_CM_C_HandleWaterLevelUpdated::WaterPercent' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleWaterLevelUpdated, ShouldDisplayWater) == 0x000008, "Member 'WBP_ToolBacker_CM_C_HandleWaterLevelUpdated::ShouldDisplayWater' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_HandleWaterLevelUpdated, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00000C, "Member 'WBP_ToolBacker_CM_C_HandleWaterLevelUpdated::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_ToolBacker_CM.WBP_ToolBacker_CM_C.Initialize
// 0x0050 (0x0050 - 0x0000)
struct WBP_ToolBacker_CM_C_Initialize final
{
public:
	class UWBP_ToolItem_CM_C*                     Param_ToolItem;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateTool_AnythingVisible;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532F[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FValeriaItem& Item)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5330[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(double WaterPercent, bool ShouldDisplayWater)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolBacker_CM_C_Initialize) == 0x000008, "Wrong alignment on WBP_ToolBacker_CM_C_Initialize");
static_assert(sizeof(WBP_ToolBacker_CM_C_Initialize) == 0x000050, "Wrong size on WBP_ToolBacker_CM_C_Initialize");
static_assert(offsetof(WBP_ToolBacker_CM_C_Initialize, Param_ToolItem) == 0x000000, "Member 'WBP_ToolBacker_CM_C_Initialize::Param_ToolItem' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_Initialize, CallFunc_UpdateTool_AnythingVisible) == 0x000008, "Member 'WBP_ToolBacker_CM_C_Initialize::CallFunc_UpdateTool_AnythingVisible' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_Initialize, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_ToolBacker_CM_C_Initialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_Initialize, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'WBP_ToolBacker_CM_C_Initialize::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_Initialize, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'WBP_ToolBacker_CM_C_Initialize::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_Initialize, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'WBP_ToolBacker_CM_C_Initialize::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_Initialize, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000048, "Member 'WBP_ToolBacker_CM_C_Initialize::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function WBP_ToolBacker_CM.WBP_ToolBacker_CM_C.OnSecondaryClicked__DelegateSignature
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_ToolBacker_CM_C_OnSecondaryClicked__DelegateSignature final
{
public:
	struct FGeometry                              My_Geometry;                                       // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FValeriaItem                           Valeria_Item;                                      // 0x0038(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FBagSlotLocation                       Bag_Slot_Location;                                 // 0x0098(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ToolBacker_CM_C_OnSecondaryClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ToolBacker_CM_C_OnSecondaryClicked__DelegateSignature");
static_assert(sizeof(WBP_ToolBacker_CM_C_OnSecondaryClicked__DelegateSignature) == 0x0000A0, "Wrong size on WBP_ToolBacker_CM_C_OnSecondaryClicked__DelegateSignature");
static_assert(offsetof(WBP_ToolBacker_CM_C_OnSecondaryClicked__DelegateSignature, My_Geometry) == 0x000000, "Member 'WBP_ToolBacker_CM_C_OnSecondaryClicked__DelegateSignature::My_Geometry' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_OnSecondaryClicked__DelegateSignature, Valeria_Item) == 0x000038, "Member 'WBP_ToolBacker_CM_C_OnSecondaryClicked__DelegateSignature::Valeria_Item' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_OnSecondaryClicked__DelegateSignature, Bag_Slot_Location) == 0x000098, "Member 'WBP_ToolBacker_CM_C_OnSecondaryClicked__DelegateSignature::Bag_Slot_Location' has a wrong offset!");

// Function WBP_ToolBacker_CM.WBP_ToolBacker_CM_C.OnToolClicked__DelegateSignature
// 0x0060 (0x0060 - 0x0000)
struct WBP_ToolBacker_CM_C_OnToolClicked__DelegateSignature final
{
public:
	struct FValeriaItem                           Item;                                              // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ToolBacker_CM_C_OnToolClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ToolBacker_CM_C_OnToolClicked__DelegateSignature");
static_assert(sizeof(WBP_ToolBacker_CM_C_OnToolClicked__DelegateSignature) == 0x000060, "Wrong size on WBP_ToolBacker_CM_C_OnToolClicked__DelegateSignature");
static_assert(offsetof(WBP_ToolBacker_CM_C_OnToolClicked__DelegateSignature, Item) == 0x000000, "Member 'WBP_ToolBacker_CM_C_OnToolClicked__DelegateSignature::Item' has a wrong offset!");

// Function WBP_ToolBacker_CM.WBP_ToolBacker_CM_C.UpdateBackerVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_ToolBacker_CM_C_UpdateBackerVisibility final
{
public:
	bool                                          Param_ShouldDisplayBacker;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolBacker_CM_C_UpdateBackerVisibility) == 0x000001, "Wrong alignment on WBP_ToolBacker_CM_C_UpdateBackerVisibility");
static_assert(sizeof(WBP_ToolBacker_CM_C_UpdateBackerVisibility) == 0x000005, "Wrong size on WBP_ToolBacker_CM_C_UpdateBackerVisibility");
static_assert(offsetof(WBP_ToolBacker_CM_C_UpdateBackerVisibility, Param_ShouldDisplayBacker) == 0x000000, "Member 'WBP_ToolBacker_CM_C_UpdateBackerVisibility::Param_ShouldDisplayBacker' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_UpdateBackerVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_ToolBacker_CM_C_UpdateBackerVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_UpdateBackerVisibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_ToolBacker_CM_C_UpdateBackerVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_UpdateBackerVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ToolBacker_CM_C_UpdateBackerVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_UpdateBackerVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_ToolBacker_CM_C_UpdateBackerVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ToolBacker_CM.WBP_ToolBacker_CM_C.UpdateWaterVisibility
// 0x0018 (0x0018 - 0x0000)
struct WBP_ToolBacker_CM_C_UpdateWaterVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5331[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ItemStyle*                       CallFunc_GetStyle_Style;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolBacker_CM_C_UpdateWaterVisibility) == 0x000008, "Wrong alignment on WBP_ToolBacker_CM_C_UpdateWaterVisibility");
static_assert(sizeof(WBP_ToolBacker_CM_C_UpdateWaterVisibility) == 0x000018, "Wrong size on WBP_ToolBacker_CM_C_UpdateWaterVisibility");
static_assert(offsetof(WBP_ToolBacker_CM_C_UpdateWaterVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_ToolBacker_CM_C_UpdateWaterVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_UpdateWaterVisibility, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_ToolBacker_CM_C_UpdateWaterVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolBacker_CM_C_UpdateWaterVisibility, CallFunc_GetStyle_Style) == 0x000008, "Member 'WBP_ToolBacker_CM_C_UpdateWaterVisibility::CallFunc_GetStyle_Style' has a wrong offset!");
