#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Checkmark_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S6UICommonWidgets_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Checkmark_CM.WBP_Checkmark_CM_C
// 0x0040 (0x15B0 - 0x1570)
class UWBP_Checkmark_CM_C final : public US6UI_CommonButton_Styled
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Checked;                                           // 0x1578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_510B[0x7];                                     // 0x1579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Style_Checked;                                     // 0x1580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Style_Unchecked;                                   // 0x1588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCheckedStateChanged;                             // 0x1590(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnfocused;                                       // 0x15A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnFocusLost();
	void BP_OnPressed();
	void ExecuteUbergraph_WBP_Checkmark_CM(int32 EntryPoint, bool K2Node_Event_IsDesignTime);
	void OnCheckedStateChanged__DelegateSignature(bool Param_Checked);
	void OnUnfocused__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void PressCheckmark(int32 CallFunc_AkEventGlobal_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void SetCheckedState(bool Param_Checked, bool CallStateChangedEvent);
	void UpdateStyle(bool Temp_bool_Variable, TSubclassOf<class UCommonButtonStyle> K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Checkmark_CM_C">();
	}
	static class UWBP_Checkmark_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Checkmark_CM_C>();
	}
};
static_assert(alignof(UWBP_Checkmark_CM_C) == 0x000010, "Wrong alignment on UWBP_Checkmark_CM_C");
static_assert(sizeof(UWBP_Checkmark_CM_C) == 0x0015B0, "Wrong size on UWBP_Checkmark_CM_C");
static_assert(offsetof(UWBP_Checkmark_CM_C, UberGraphFrame) == 0x001570, "Member 'UWBP_Checkmark_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Checkmark_CM_C, Checked) == 0x001578, "Member 'UWBP_Checkmark_CM_C::Checked' has a wrong offset!");
static_assert(offsetof(UWBP_Checkmark_CM_C, Style_Checked) == 0x001580, "Member 'UWBP_Checkmark_CM_C::Style_Checked' has a wrong offset!");
static_assert(offsetof(UWBP_Checkmark_CM_C, Style_Unchecked) == 0x001588, "Member 'UWBP_Checkmark_CM_C::Style_Unchecked' has a wrong offset!");
static_assert(offsetof(UWBP_Checkmark_CM_C, OnCheckedStateChanged) == 0x001590, "Member 'UWBP_Checkmark_CM_C::OnCheckedStateChanged' has a wrong offset!");
static_assert(offsetof(UWBP_Checkmark_CM_C, OnUnfocused) == 0x0015A0, "Member 'UWBP_Checkmark_CM_C::OnUnfocused' has a wrong offset!");

}

