#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FilterDropdownPanel_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_HidePremiumItems_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_HidePremiumItems_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_HidePremiumItems_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_HidePremiumItems_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_HidePremiumItems_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_HidePremiumItems_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_HidePremiumItems_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature, IsSelected) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_HidePremiumItems_CM_K2Node_ComponentBoundEvent_5_OnCheckedStateChanged__DelegateSignature::IsSelected' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_ShowOwnedItems_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_ShowOwnedItems_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_ShowOwnedItems_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_ShowOwnedItems_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_ShowOwnedItems_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_ShowOwnedItems_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_ShowOwnedItems_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature, IsSelected) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CheckmarkButton_ShowOwnedItems_CM_K2Node_ComponentBoundEvent_4_OnCheckedStateChanged__DelegateSignature::IsSelected' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.BndEvt__WBP_FilterDropdownPanel_CM_CustomNavigationGroup_Dropdown_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CustomNavigationGroup_Dropdown_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CustomNavigationGroup_Dropdown_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CustomNavigationGroup_Dropdown_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CustomNavigationGroup_Dropdown_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong size on WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CustomNavigationGroup_Dropdown_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CustomNavigationGroup_Dropdown_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_CustomNavigationGroup_Dropdown_K2Node_ComponentBoundEvent_1_OnCustomNavigationGroupInitialized__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.BndEvt__WBP_FilterDropdownPanel_CM_ListView_DropdownMenus_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_ListView_DropdownMenus_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_ListView_DropdownMenus_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_ListView_DropdownMenus_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_ListView_DropdownMenus_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_ListView_DropdownMenus_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_ListView_DropdownMenus_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_ListView_DropdownMenus_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_ListView_DropdownMenus_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_FilterDropdownPanel_CM_C_BndEvt__WBP_FilterDropdownPanel_CM_ListView_DropdownMenus_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.CallOnFilterOptionsChanged
// 0x0020 (0x0020 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_CallOnFilterOptionsChanged final
{
public:
	TArray<class FText>                           NewLocalVar_0;                                     // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVAL_CharacterCustomization_CosmeticTagFilterStruct> CallFunc_GetAllCurrentSelectedFilterOptions_CurrentlySelectedOptionsText; // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_CallOnFilterOptionsChanged) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_CallOnFilterOptionsChanged");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_CallOnFilterOptionsChanged) == 0x000020, "Wrong size on WBP_FilterDropdownPanel_CM_C_CallOnFilterOptionsChanged");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_CallOnFilterOptionsChanged, NewLocalVar_0) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_CallOnFilterOptionsChanged::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_CallOnFilterOptionsChanged, CallFunc_GetAllCurrentSelectedFilterOptions_CurrentlySelectedOptionsText) == 0x000010, "Member 'WBP_FilterDropdownPanel_CM_C_CallOnFilterOptionsChanged::CallFunc_GetAllCurrentSelectedFilterOptions_CurrentlySelectedOptionsText' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.ClearCurrentFilters
// 0x0040 (0x0040 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D1[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListEntry_CharacterCustomization_FilteringDropdownMenu_C* K2Node_DynamicCast_AsList_Entry_Character_Customization_Filtering_Dropdown_Menu; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D2[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters) == 0x000040, "Wrong size on WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters, CallFunc_GetListItems_ReturnValue) == 0x000010, "Member 'WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters, K2Node_DynamicCast_AsList_Entry_Character_Customization_Filtering_Dropdown_Menu) == 0x000028, "Member 'WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters::K2Node_DynamicCast_AsList_Entry_Character_Customization_Filtering_Dropdown_Menu' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_FilterDropdownPanel_CM_C_ClearCurrentFilters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.ExecuteUbergraph_WBP_FilterDropdownPanel_CM
// 0x0308 (0x0308 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsSelected;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D4[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EVAL_CharacterCustomization_CosmeticTagType> CallFunc_Map_Keys_Keys;                            // 0x0020(0x0010)(ReferenceParm)
	class UListEntry_CharacterCustomization_FilteringDropdownMenu_C* CallFunc_SpawnObject_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVAL_CharacterCustomization_CosmeticTagType   CallFunc_Array_Get_Item;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTagOptions_HasOptions;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D5[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharacterCustomization_DropdownMenuData CallFunc_Map_Find_Value;                           // 0x0040(0x0028)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D6[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D7[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVALUI_ListView_Styled* ListView)> K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<EVAL_CharacterCustomization_CosmeticTagType> Temp_byte_Variable;                                // 0x0098(0x0050)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<class FName>                             K2Node_CustomEvent_TagNames;                       // 0x00F8(0x0050)()
	TArray<class FName>                           CallFunc_Set_ToArray_Result;                       // 0x0148(0x0010)(ReferenceParm)
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup;               // 0x0158(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_SortCosmeticTagRowNamesByDisplayName_ReturnValue; // 0x0160(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D8[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharCustomization_CosmeticTagData CallFunc_GetDataTableRowFromName_OutRow;           // 0x0180(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D9[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomization_CosmeticTagFilterStruct K2Node_MakeStruct_VAL_CharacterCustomization_CosmeticTagFilterStruct; // 0x01C0(0x0038)()
	TArray<struct FVAL_CharacterCustomization_CosmeticTagFilterStruct> K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DA[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0220(0x0018)()
	struct FVAL_CharacterCustomization_DropdownMenuData K2Node_MakeStruct_VAL_CharacterCustomization_DropdownMenuData; // 0x0238(0x0028)()
	struct FVAL_CharacterCustomization_DropdownMenuData CallFunc_Map_Find_Value_1;                         // 0x0260(0x0028)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DB[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharacterCustomization_DropdownMenuData K2Node_SetFieldsInStruct_StructOut;                // 0x0290(0x0028)()
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DC[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array_1;                          // 0x02C0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DD[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_FilteringDropdownMenu_CM_C*        K2Node_DynamicCast_AsWBP_Filtering_Dropdown_Menu_CM; // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DE[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ListView_Styled*                 K2Node_CustomEvent_ListView;                       // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsSelected_1;           // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM) == 0x000308, "Wrong size on WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, EntryPoint) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_ComponentBoundEvent_IsSelected) == 0x000004, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_ComponentBoundEvent_IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Map_Keys_Keys) == 0x000020, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_SpawnObject_ReturnValue) == 0x000030, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_HasTagOptions_HasOptions) == 0x000039, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_HasTagOptions_HasOptions' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Map_Find_Value) == 0x000040, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Map_Find_ReturnValue) == 0x000068, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, Temp_int_Array_Index_Variable_1) == 0x000074, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, Temp_byte_Variable) == 0x000098, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E8, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_CustomEvent_TagNames) == 0x0000F8, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_CustomEvent_TagNames' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Set_ToArray_Result) == 0x000148, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_ComponentBoundEvent_NavGroup) == 0x000158, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_ComponentBoundEvent_NavGroup' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_SortCosmeticTagRowNamesByDisplayName_ReturnValue) == 0x000160, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_SortCosmeticTagRowNamesByDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Array_Get_Item_1) == 0x000170, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Array_Length_ReturnValue_1) == 0x000178, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_GetDataTableRowFromName_OutRow) == 0x000180, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001A8, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Conv_NameToString_ReturnValue) == 0x0001B0, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_MakeStruct_VAL_CharacterCustomization_CosmeticTagFilterStruct) == 0x0001C0, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_MakeStruct_VAL_CharacterCustomization_CosmeticTagFilterStruct' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_MakeArray_Array) == 0x0001F8, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000208, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Set_Contains_ReturnValue) == 0x000218, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Conv_StringToText_ReturnValue) == 0x000220, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_MakeStruct_VAL_CharacterCustomization_DropdownMenuData) == 0x000238, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_MakeStruct_VAL_CharacterCustomization_DropdownMenuData' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Map_Find_Value_1) == 0x000260, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Map_Find_ReturnValue_1) == 0x000288, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_SetFieldsInStruct_StructOut) == 0x000290, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, Temp_int_Loop_Counter_Variable_1) == 0x0002B8, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_MakeArray_Array_1) == 0x0002C0, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002D0, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002D4, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_ComponentBoundEvent_Item) == 0x0002D8, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_ComponentBoundEvent_Widget) == 0x0002E0, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_DynamicCast_AsWBP_Filtering_Dropdown_Menu_CM) == 0x0002E8, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_DynamicCast_AsWBP_Filtering_Dropdown_Menu_CM' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_DynamicCast_bSuccess) == 0x0002F0, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_CustomEvent_ListView) == 0x0002F8, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_CustomEvent_ListView' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, CallFunc_Array_Add_ReturnValue) == 0x000300, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM, K2Node_ComponentBoundEvent_IsSelected_1) == 0x000304, "Member 'WBP_FilterDropdownPanel_CM_C_ExecuteUbergraph_WBP_FilterDropdownPanel_CM::K2Node_ComponentBoundEvent_IsSelected_1' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.GetAllCurrentSelectedFilterOptions
// 0x0060 (0x0060 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions final
{
public:
	TArray<struct FVAL_CharacterCustomization_CosmeticTagFilterStruct> CurrentlySelectedOptionsText;                      // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FVAL_CharacterCustomization_CosmeticTagFilterStruct> CurrentlySelectedOptions;                          // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DF[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0030(0x0010)(ConstParm, ReferenceParm)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E0[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UListEntry_CharacterCustomization_FilteringDropdownMenu_C* K2Node_DynamicCast_AsList_Entry_Character_Customization_Filtering_Dropdown_Menu; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions) == 0x000060, "Wrong size on WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions, CurrentlySelectedOptionsText) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions::CurrentlySelectedOptionsText' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions, CurrentlySelectedOptions) == 0x000010, "Member 'WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions::CurrentlySelectedOptions' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions, CallFunc_GetListItems_ReturnValue) == 0x000030, "Member 'WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions, K2Node_DynamicCast_AsList_Entry_Character_Customization_Filtering_Dropdown_Menu) == 0x000050, "Member 'WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions::K2Node_DynamicCast_AsList_Entry_Character_Customization_Filtering_Dropdown_Menu' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'WBP_FilterDropdownPanel_CM_C_GetAllCurrentSelectedFilterOptions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.HasAnyActiveFilters
// 0x0020 (0x0020 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters final
{
public:
	bool                                          HasActiveFilters;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVAL_CharacterCustomization_CosmeticTagFilterStruct> CallFunc_GetAllCurrentSelectedFilterOptions_CurrentlySelectedOptionsText; // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters) == 0x000020, "Wrong size on WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters, HasActiveFilters) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters::HasActiveFilters' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters, CallFunc_GetAllCurrentSelectedFilterOptions_CurrentlySelectedOptionsText) == 0x000008, "Member 'WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters::CallFunc_GetAllCurrentSelectedFilterOptions_CurrentlySelectedOptionsText' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters, CallFunc_BooleanOR_ReturnValue) == 0x00001D, "Member 'WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters, CallFunc_BooleanOR_ReturnValue_1) == 0x00001E, "Member 'WBP_FilterDropdownPanel_CM_C_HasAnyActiveFilters::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.InitializeNewTagNames
// 0x0050 (0x0050 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_InitializeNewTagNames final
{
public:
	TSet<class FName>                             TagNames;                                          // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_InitializeNewTagNames) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_InitializeNewTagNames");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_InitializeNewTagNames) == 0x000050, "Wrong size on WBP_FilterDropdownPanel_CM_C_InitializeNewTagNames");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_InitializeNewTagNames, TagNames) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_InitializeNewTagNames::TagNames' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.OnFilterOptionFocuse__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocuse__DelegateSignature final
{
public:
	class UVALUI_ListView_Styled*                 ListView;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocuse__DelegateSignature) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocuse__DelegateSignature");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocuse__DelegateSignature) == 0x000008, "Wrong size on WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocuse__DelegateSignature");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocuse__DelegateSignature, ListView) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocuse__DelegateSignature::ListView' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.OnFilterOptionFocusedEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocusedEvent final
{
public:
	class UVALUI_ListView_Styled*                 ListView;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocusedEvent) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocusedEvent");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocusedEvent) == 0x000008, "Wrong size on WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocusedEvent");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocusedEvent, ListView) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_OnFilterOptionFocusedEvent::ListView' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.OnFilterOptionsChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_OnFilterOptionsChanged__DelegateSignature final
{
public:
	bool                                          HidePremiumItems;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnlyShowOwned;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E2[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVAL_CharacterCustomization_CosmeticTagFilterStruct> CurrentSelectedFilters;                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_OnFilterOptionsChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_OnFilterOptionsChanged__DelegateSignature");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_OnFilterOptionsChanged__DelegateSignature) == 0x000018, "Wrong size on WBP_FilterDropdownPanel_CM_C_OnFilterOptionsChanged__DelegateSignature");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_OnFilterOptionsChanged__DelegateSignature, HidePremiumItems) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_OnFilterOptionsChanged__DelegateSignature::HidePremiumItems' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_OnFilterOptionsChanged__DelegateSignature, OnlyShowOwned) == 0x000001, "Member 'WBP_FilterDropdownPanel_CM_C_OnFilterOptionsChanged__DelegateSignature::OnlyShowOwned' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_OnFilterOptionsChanged__DelegateSignature, CurrentSelectedFilters) == 0x000008, "Member 'WBP_FilterDropdownPanel_CM_C_OnFilterOptionsChanged__DelegateSignature::CurrentSelectedFilters' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_FilterDropdownPanel_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_FilterDropdownPanel_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_FilterDropdownPanel_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_FilterDropdownPanel_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_OnFocusReceived, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x0001B0, "Member 'WBP_FilterDropdownPanel_CM_C_OnFocusReceived::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_FilterDropdownPanel_CM.WBP_FilterDropdownPanel_CM_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_FilterDropdownPanel_CM_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FilterDropdownPanel_CM_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_FilterDropdownPanel_CM_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_FilterDropdownPanel_CM_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_FilterDropdownPanel_CM_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_FilterDropdownPanel_CM_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_FilterDropdownPanel_CM_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

