#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Harvesting_FTUEPopin

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Harvesting_FTUEPopin.WBP_Harvesting_FTUEPopin_C.ExecuteUbergraph_WBP_Harvesting_FTUEPopin
// 0x0068 (0x0068 - 0x0000)
struct WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617A[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_RedirectType_Title;                       // 0x0030(0x0018)()
	class FText                                   CallFunc_RedirectType_Content;                     // 0x0048(0x0018)()
	bool                                          CallFunc_RedirectType_EnableFound;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin) == 0x000008, "Wrong alignment on WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin");
static_assert(sizeof(WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin) == 0x000068, "Wrong size on WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin");
static_assert(offsetof(WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin, EntryPoint) == 0x000000, "Member 'WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin, K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM) == 0x000018, "Member 'WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin::K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM' has a wrong offset!");
static_assert(offsetof(WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin, CallFunc_RedirectType_Title) == 0x000030, "Member 'WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin::CallFunc_RedirectType_Title' has a wrong offset!");
static_assert(offsetof(WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin, CallFunc_RedirectType_Content) == 0x000048, "Member 'WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin::CallFunc_RedirectType_Content' has a wrong offset!");
static_assert(offsetof(WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin, CallFunc_RedirectType_EnableFound) == 0x000060, "Member 'WBP_Harvesting_FTUEPopin_C_ExecuteUbergraph_WBP_Harvesting_FTUEPopin::CallFunc_RedirectType_EnableFound' has a wrong offset!");

}

