#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RequestAmmoSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_RequestAmmoSlot.WBP_RequestAmmoSlot_C.ExecuteUbergraph_WBP_RequestAmmoSlot
// 0x000C (0x000C - 0x0000)
struct WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsRequestActive;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot) == 0x000004, "Wrong alignment on WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot");
static_assert(sizeof(WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot) == 0x00000C, "Wrong size on WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot");
static_assert(offsetof(WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot, EntryPoint) == 0x000000, "Member 'WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot, Temp_bool_Variable) == 0x000004, "Member 'WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot, Temp_byte_Variable) == 0x000005, "Member 'WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot, K2Node_CustomEvent_bIsRequestActive) == 0x000007, "Member 'WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot::K2Node_CustomEvent_bIsRequestActive' has a wrong offset!");
static_assert(offsetof(WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot, K2Node_Select_Default) == 0x000008, "Member 'WBP_RequestAmmoSlot_C_ExecuteUbergraph_WBP_RequestAmmoSlot::K2Node_Select_Default' has a wrong offset!");

// Function WBP_RequestAmmoSlot.WBP_RequestAmmoSlot_C.SetRequestIndication
// 0x0001 (0x0001 - 0x0000)
struct WBP_RequestAmmoSlot_C_SetRequestIndication final
{
public:
	bool                                          bIsRequestActive;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestAmmoSlot_C_SetRequestIndication) == 0x000001, "Wrong alignment on WBP_RequestAmmoSlot_C_SetRequestIndication");
static_assert(sizeof(WBP_RequestAmmoSlot_C_SetRequestIndication) == 0x000001, "Wrong size on WBP_RequestAmmoSlot_C_SetRequestIndication");
static_assert(offsetof(WBP_RequestAmmoSlot_C_SetRequestIndication, bIsRequestActive) == 0x000000, "Member 'WBP_RequestAmmoSlot_C_SetRequestIndication::bIsRequestActive' has a wrong offset!");

}

