#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerFacingIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerFacingIndicator.WBP_PlayerFacingIndicator_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_PlayerFacingIndicator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FacingIndicator;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PlayerFacingIndicator(int32 EntryPoint, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, double CallFunc_GetCameraYaw_Rotation, float CallFunc_SetRenderTransformAngle_Angle_ImplicitCast);
	void GetCameraYaw(double* Rotation, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, const struct FRotator& CallFunc_GetCameraRotation_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, double CallFunc_Add_DoubleDouble_ReturnValue, float CallFunc_NormalizeDegrees_ReturnValue, double K2Node_FunctionResult_Rotation_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast, float CallFunc_NormalizeDegrees_degrees_ImplicitCast);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerFacingIndicator_C">();
	}
	static class UWBP_PlayerFacingIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerFacingIndicator_C>();
	}
};
static_assert(alignof(UWBP_PlayerFacingIndicator_C) == 0x000008, "Wrong alignment on UWBP_PlayerFacingIndicator_C");
static_assert(sizeof(UWBP_PlayerFacingIndicator_C) == 0x0002D8, "Wrong size on UWBP_PlayerFacingIndicator_C");
static_assert(offsetof(UWBP_PlayerFacingIndicator_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_PlayerFacingIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerFacingIndicator_C, Background) == 0x0002C8, "Member 'UWBP_PlayerFacingIndicator_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerFacingIndicator_C, FacingIndicator) == 0x0002D0, "Member 'UWBP_PlayerFacingIndicator_C::FacingIndicator' has a wrong offset!");

}

