#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MaintenanceMessage_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MaintenanceMessage_CM.WBP_MaintenanceMessage_CM_C
// 0x0020 (0x0308 - 0x02E8)
class UWBP_MaintenanceMessage_CM_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                Text_Error_ServerStatus;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Notification_Basic_Error_C* WBP_Template_Notification_Basic_Error;             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PregameUIManager_C*                WBP_PregameUIManagerRef;                           // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void SetAndShowMessage(const class FString& StatusText, class FText CallFunc_Conv_StringToText_ReturnValue);
	void Construct();
	void FetchedServerStatus_Event();
	void ExecuteUbergraph_WBP_MaintenanceMessage_CM(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsEmpty_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, class UWBP_PregameUIManager_C* K2Node_DynamicCast_AsWBP_Pregame_UIManager, bool K2Node_DynamicCast_bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MaintenanceMessage_CM_C">();
	}
	static class UWBP_MaintenanceMessage_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MaintenanceMessage_CM_C>();
	}
};
static_assert(alignof(UWBP_MaintenanceMessage_CM_C) == 0x000008, "Wrong alignment on UWBP_MaintenanceMessage_CM_C");
static_assert(sizeof(UWBP_MaintenanceMessage_CM_C) == 0x000308, "Wrong size on UWBP_MaintenanceMessage_CM_C");
static_assert(offsetof(UWBP_MaintenanceMessage_CM_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_MaintenanceMessage_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MaintenanceMessage_CM_C, Text_Error_ServerStatus) == 0x0002F0, "Member 'UWBP_MaintenanceMessage_CM_C::Text_Error_ServerStatus' has a wrong offset!");
static_assert(offsetof(UWBP_MaintenanceMessage_CM_C, WBP_Template_Notification_Basic_Error) == 0x0002F8, "Member 'UWBP_MaintenanceMessage_CM_C::WBP_Template_Notification_Basic_Error' has a wrong offset!");
static_assert(offsetof(UWBP_MaintenanceMessage_CM_C, WBP_PregameUIManagerRef) == 0x000300, "Member 'UWBP_MaintenanceMessage_CM_C::WBP_PregameUIManagerRef' has a wrong offset!");

}

