#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlacementHud_SkillPoints

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlacementHud_SkillPoints.WBP_PlacementHud_SkillPoints_C.UpdateSkillPointCostUi
// 0x0270 (0x0270 - 0x0000)
struct WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi final
{
public:
	struct FSkillPointRequirement                 SkillPointRequirement;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CCA[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_FindSkillLevelConfigByType_OutResult;     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CCB[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillLevelConfig                      CallFunc_FindSkillLevelConfigByType_ReturnValue;   // 0x0078(0x0088)()
	struct FSkillPersist                          CallFunc_GetSkillLevel_ReturnValue;                // 0x0100(0x000C)(NoDestructor)
	uint8                                         Pad_4CCC[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0110(0x00D0)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CCD[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01F0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0240(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0250(0x0018)()
};
static_assert(alignof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi) == 0x000010, "Wrong alignment on WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi");
static_assert(sizeof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi) == 0x000270, "Wrong size on WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, SkillPointRequirement) == 0x000000, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::SkillPointRequirement' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, CallFunc_GetValeriaCharacter_OutResult) == 0x000060, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000068, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, CallFunc_FindSkillLevelConfigByType_OutResult) == 0x000071, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::CallFunc_FindSkillLevelConfigByType_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, CallFunc_FindSkillLevelConfigByType_ReturnValue) == 0x000078, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::CallFunc_FindSkillLevelConfigByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, CallFunc_GetSkillLevel_ReturnValue) == 0x000100, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::CallFunc_GetSkillLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, K2Node_MakeStruct_SlateBrush) == 0x000110, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0001E0, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001E8, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001F0, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, K2Node_MakeArray_Array) == 0x000240, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi, CallFunc_Format_ReturnValue) == 0x000250, "Member 'WBP_PlacementHud_SkillPoints_C_UpdateSkillPointCostUi::CallFunc_Format_ReturnValue' has a wrong offset!");

}

