#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dialogue_CM

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.AdvanceNextDialogueLine
// 0x0110 (0x0110 - 0x0000)
struct WBP_Dialogue_CM_C_AdvanceNextDialogueLine final
{
public:
	class FText                                   SpeakerDisplayName;                                // 0x0000(0x0018)(Edit, BlueprintVisible)
	class UVAL_DialogueSpeakerAsset*              CurrentDialogueSpeaker;                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UVAL_DialogueAsset*               CallFunc_GetCurrentDialogueAsset_ReturnValue;      // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UVAL_DialogueAsset*               CallFunc_GetCurrentDialogueAsset_ReturnValue_1;    // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42FC[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDialogueLine                          CallFunc_GetCurrentDialogueLine_OutCurrentLine;    // 0x0068(0x0038)()
	bool                                          CallFunc_GetCurrentDialogueLine_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42FD[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentLineNumber_ReturnValue;         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42FE[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDialogueDisplayString_ReturnValue;     // 0x00B0(0x0018)(ConstParm)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42FF[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Perform_Text_Substitutions_OutText;       // 0x00D0(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4300[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00F0(0x0018)()
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_AdvanceNextDialogueLine");
static_assert(sizeof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine) == 0x000110, "Wrong size on WBP_Dialogue_CM_C_AdvanceNextDialogueLine");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, SpeakerDisplayName) == 0x000000, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::SpeakerDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CurrentDialogueSpeaker) == 0x000018, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CurrentDialogueSpeaker' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_GetCurrentDialogueAsset_ReturnValue) == 0x000020, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_GetCurrentDialogueAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_GetCurrentDialogueAsset_ReturnValue_1) == 0x000028, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_GetCurrentDialogueAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_GetCurrentDialogueLine_OutCurrentLine) == 0x000068, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_GetCurrentDialogueLine_OutCurrentLine' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_GetCurrentDialogueLine_ReturnValue) == 0x0000A0, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_GetCurrentDialogueLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_GetCurrentLineNumber_ReturnValue) == 0x0000A4, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_GetCurrentLineNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_GetDialogueDisplayString_ReturnValue) == 0x0000B0, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_GetDialogueDisplayString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x0000C8, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_Perform_Text_Substitutions_OutText) == 0x0000D0, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_Perform_Text_Substitutions_OutText' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000E8, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_BooleanAND_ReturnValue) == 0x0000E9, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_MakeLiteralText_ReturnValue) == 0x0000F0, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_AdvanceNextDialogueLine, CallFunc_AkEventGlobal_ReturnValue) == 0x000108, "Member 'WBP_Dialogue_CM_C_AdvanceNextDialogueLine::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_BackgroundButton_CM_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_BackgroundButton_CM_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_BackgroundButton_CM_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_BackgroundButton_CM_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_BackgroundButton_CM_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_BackgroundButton_CM_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_BackgroundButton_CM_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_BackgroundButton_CM_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftButton_CM_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_GiftHintButton_CM_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_LeaveButton_CM_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_NextButton_CM_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Dialogue_CM_C_BndEvt__WBP_Dialogue_CM_StoreButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Dialogue_CM_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_Dialogue_CM_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_Dialogue_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_Dialogue_CM_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_Dialogue_CM_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_Dialogue_CM_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.CanFocusDialogueOptionButtons
// 0x0006 (0x0006 - 0x0000)
struct WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons final
{
public:
	bool                                          bFocusable;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGiveGiftScreenOpen_bOpen;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVillagerStoreOpen_bOpen;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons) == 0x000001, "Wrong alignment on WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons");
static_assert(sizeof(WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons) == 0x000006, "Wrong size on WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons");
static_assert(offsetof(WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons, bFocusable) == 0x000000, "Member 'WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons::bFocusable' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons, CallFunc_IsGiveGiftScreenOpen_bOpen) == 0x000001, "Member 'WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons::CallFunc_IsGiveGiftScreenOpen_bOpen' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons, CallFunc_IsVillagerStoreOpen_bOpen) == 0x000002, "Member 'WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons::CallFunc_IsVillagerStoreOpen_bOpen' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'WBP_Dialogue_CM_C_CanFocusDialogueOptionButtons::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.CleanupDialogue
// 0x0020 (0x0020 - 0x0000)
struct WBP_Dialogue_CM_C_CleanupDialogue final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4301[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_CleanupDialogue) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_CleanupDialogue");
static_assert(sizeof(WBP_Dialogue_CM_C_CleanupDialogue) == 0x000020, "Wrong size on WBP_Dialogue_CM_C_CleanupDialogue");
static_assert(offsetof(WBP_Dialogue_CM_C_CleanupDialogue, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_Dialogue_CM_C_CleanupDialogue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CleanupDialogue, CallFunc_GetValeriaCharacter_OutResult) == 0x000001, "Member 'WBP_Dialogue_CM_C_CleanupDialogue::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CleanupDialogue, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_Dialogue_CM_C_CleanupDialogue::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CleanupDialogue, CallFunc_GetCSM_ReturnValue) == 0x000010, "Member 'WBP_Dialogue_CM_C_CleanupDialogue::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CleanupDialogue, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_Dialogue_CM_C_CleanupDialogue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.CreateDialogueOptions
// 0x0108 (0x0108 - 0x0000)
struct WBP_Dialogue_CM_C_CreateDialogueOptions final
{
public:
	struct FVAL_DialogueOptionList                InDialogueOptionList;                              // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4302[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4303[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_DialogueSpeakerAsset*              CallFunc_GetCurrentPrimaryDialogueSpeakerAsset_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4304[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4305[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVAL_DialogueOption                    CallFunc_Array_Get_Item;                           // 0x0080(0x0028)()
	class UInputAction*                           CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4306[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_DialogueOptionButton_CM_C*         K2Node_DynamicCast_AsWBP_Dialogue_Option_Button_CM; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4307[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4308[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_CreateDialogueOptions) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_CreateDialogueOptions");
static_assert(sizeof(WBP_Dialogue_CM_C_CreateDialogueOptions) == 0x000108, "Wrong size on WBP_Dialogue_CM_C_CreateDialogueOptions");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, InDialogueOptionList) == 0x000000, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::InDialogueOptionList' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_GetCurrentPrimaryDialogueSpeakerAsset_ReturnValue) == 0x000058, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_GetCurrentPrimaryDialogueSpeakerAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000060, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, Temp_real_Variable) == 0x000068, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, Temp_real_Variable_1) == 0x000070, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, Temp_bool_Variable) == 0x000078, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, Temp_int_Variable) == 0x00007C, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_Array_Get_Item) == 0x000080, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_GetChildAt_ReturnValue) == 0x0000B8, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, K2Node_DynamicCast_AsWBP_Dialogue_Option_Button_CM) == 0x0000C0, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::K2Node_DynamicCast_AsWBP_Dialogue_Option_Button_CM' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, K2Node_Select_Default) == 0x0000D0, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, K2Node_MakeStruct_Margin) == 0x0000D8, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x0000E8, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1) == 0x0000F0, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_Array_Add_ReturnValue) == 0x0000F8, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000FC, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_CreateDialogueOptions, K2Node_MakeStruct_Top_ImplicitCast) == 0x000104, "Member 'WBP_Dialogue_CM_C_CreateDialogueOptions::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.DetermineGiveGiftState
// 0x0060 (0x0060 - 0x0000)
struct WBP_Dialogue_CM_C_DetermineGiveGiftState final
{
public:
	bool                                          GiftingEnabled;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4309[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Param_ToolTipText;                                 // 0x0008(0x0018)(Parm, OutParm)
	class FText                                   LocalTooltipText;                                  // 0x0020(0x0018)(Edit, BlueprintVisible)
	bool                                          LocalGiftingEnabled;                               // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesAcceptGifts_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentDialogueTerminal_ReturnValue;    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPostDialogueAction_ReturnValue;        // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_430A[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UVillagerGiftReceiverComponent*         CallFunc_GetVillagerGiftReceiverComponent_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVillagerInGiftableSpace_ReturnValue;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_430B[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanGiftVillager_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_DetermineGiveGiftState) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_DetermineGiveGiftState");
static_assert(sizeof(WBP_Dialogue_CM_C_DetermineGiveGiftState) == 0x000060, "Wrong size on WBP_Dialogue_CM_C_DetermineGiveGiftState");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, GiftingEnabled) == 0x000000, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::GiftingEnabled' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, Param_ToolTipText) == 0x000008, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::Param_ToolTipText' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, LocalTooltipText) == 0x000020, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::LocalTooltipText' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, LocalGiftingEnabled) == 0x000038, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::LocalGiftingEnabled' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, CallFunc_DoesAcceptGifts_ReturnValue) == 0x000039, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::CallFunc_DoesAcceptGifts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, CallFunc_IsCurrentDialogueTerminal_ReturnValue) == 0x00003A, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::CallFunc_IsCurrentDialogueTerminal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, CallFunc_HasPostDialogueAction_ReturnValue) == 0x00003B, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::CallFunc_HasPostDialogueAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, CallFunc_Not_PreBool_ReturnValue) == 0x00003D, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, CallFunc_GetVillagerGiftReceiverComponent_ReturnValue) == 0x000040, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::CallFunc_GetVillagerGiftReceiverComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, CallFunc_IsVillagerInGiftableSpace_ReturnValue) == 0x000048, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::CallFunc_IsVillagerInGiftableSpace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, CallFunc_GetValeriaCharacter_OutResult) == 0x000049, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000050, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, CallFunc_CanGiftVillager_ReturnValue) == 0x000058, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::CallFunc_CanGiftVillager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, K2Node_SwitchEnum_CmpSuccess) == 0x000059, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DetermineGiveGiftState, CallFunc_IsValid_ReturnValue_1) == 0x00005A, "Member 'WBP_Dialogue_CM_C_DetermineGiveGiftState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.DialogueProgressed
// 0x0020 (0x0020 - 0x0000)
struct WBP_Dialogue_CM_C_DialogueProgressed final
{
public:
	class UDialogueComponent*                     DialogueSourceComponent;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDialogueDisplayString_ReturnValue;     // 0x0008(0x0018)(ConstParm)
};
static_assert(alignof(WBP_Dialogue_CM_C_DialogueProgressed) == 0x000008, "Wrong alignment on WBP_Dialogue_CM_C_DialogueProgressed");
static_assert(sizeof(WBP_Dialogue_CM_C_DialogueProgressed) == 0x000020, "Wrong size on WBP_Dialogue_CM_C_DialogueProgressed");
static_assert(offsetof(WBP_Dialogue_CM_C_DialogueProgressed, DialogueSourceComponent) == 0x000000, "Member 'WBP_Dialogue_CM_C_DialogueProgressed::DialogueSourceComponent' has a wrong offset!");
static_assert(offsetof(WBP_Dialogue_CM_C_DialogueProgressed, CallFunc_GetDialogueDisplayString_ReturnValue) == 0x000008, "Member 'WBP_Dialogue_CM_C_DialogueProgressed::CallFunc_GetDialogueDisplayString_ReturnValue' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.EnableDialogueOptionButtons
// 0x0001 (0x0001 - 0x0000)
struct WBP_Dialogue_CM_C_EnableDialogueOptionButtons final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialogue_CM_C_EnableDialogueOptionButtons) == 0x000001, "Wrong alignment on WBP_Dialogue_CM_C_EnableDialogueOptionButtons");
static_assert(sizeof(WBP_Dialogue_CM_C_EnableDialogueOptionButtons) == 0x000001, "Wrong size on WBP_Dialogue_CM_C_EnableDialogueOptionButtons");
static_assert(offsetof(WBP_Dialogue_CM_C_EnableDialogueOptionButtons, bNewValue) == 0x000000, "Member 'WBP_Dialogue_CM_C_EnableDialogueOptionButtons::bNewValue' has a wrong offset!");

// Function WBP_Dialogue_CM.WBP_Dialogue_CM_C.ExecuteUbergraph_WBP_Dialogue_CM
// 0x08E8 (0x08E8 - 0x0000)
struct WBP_Dialogue_CM_C_ExecuteUbergraph_WBP_Dialogue_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_6;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_6;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_6;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_6;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_430C[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_430D[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
