#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillLevel_HUD

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_SkillLevel_HUD.WBP_SkillLevel_HUD_C.ExecuteUbergraph_WBP_SkillLevel_HUD
// 0x0048 (0x0048 - 0x0000)
struct WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USkillLevelsComponent* SkillLevels)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A4[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillLevelsComponent*                  K2Node_CustomEvent_skillLevels;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkillLevelsComponent*                  CallFunc_GetSkillLevels_SkillLevels;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A5[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD) == 0x000008, "Wrong alignment on WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD");
static_assert(sizeof(WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD) == 0x000048, "Wrong size on WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD");
static_assert(offsetof(WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD, EntryPoint) == 0x000000, "Member 'WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD, K2Node_CustomEvent_skillLevels) == 0x000018, "Member 'WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD::K2Node_CustomEvent_skillLevels' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD, CallFunc_GetSkillLevels_SkillLevels) == 0x000020, "Member 'WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD::CallFunc_GetSkillLevels_SkillLevels' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD, CallFunc_GetValeriaCharacter_OutResult) == 0x000030, "Member 'WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000038, "Member 'WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000041, "Member 'WBP_SkillLevel_HUD_C_ExecuteUbergraph_WBP_SkillLevel_HUD::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_SkillLevel_HUD.WBP_SkillLevel_HUD_C.GetInventory
// 0x0028 (0x0028 - 0x0000)
struct WBP_SkillLevel_HUD_C_GetInventory final
{
public:
	class UPlayerInventoryComponent*              Inventory;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A6[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillLevel_HUD_C_GetInventory) == 0x000008, "Wrong alignment on WBP_SkillLevel_HUD_C_GetInventory");
static_assert(sizeof(WBP_SkillLevel_HUD_C_GetInventory) == 0x000028, "Wrong size on WBP_SkillLevel_HUD_C_GetInventory");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetInventory, Inventory) == 0x000000, "Member 'WBP_SkillLevel_HUD_C_GetInventory::Inventory' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetInventory, CallFunc_GetValeriaCharacter_OutResult) == 0x000008, "Member 'WBP_SkillLevel_HUD_C_GetInventory::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetInventory, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_SkillLevel_HUD_C_GetInventory::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetInventory, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_SkillLevel_HUD_C_GetInventory::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetInventory, CallFunc_GetInventory_ReturnValue) == 0x000020, "Member 'WBP_SkillLevel_HUD_C_GetInventory::CallFunc_GetInventory_ReturnValue' has a wrong offset!");

// Function WBP_SkillLevel_HUD.WBP_SkillLevel_HUD_C.GetProgress
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_SkillLevel_HUD_C_GetProgress final
{
public:
	struct FSkillPersist                          SkillLevel;                                        // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	uint8                                         Pad_50A8[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Progress;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSkillLevelConfig                      CallFunc_GetSkillConfig_SkillConfig;               // 0x0018(0x0088)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A9[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50AA[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50AB[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillLevel_HUD_C_GetProgress) == 0x000008, "Wrong alignment on WBP_SkillLevel_HUD_C_GetProgress");
static_assert(sizeof(WBP_SkillLevel_HUD_C_GetProgress) == 0x0000E0, "Wrong size on WBP_SkillLevel_HUD_C_GetProgress");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, SkillLevel) == 0x000000, "Member 'WBP_SkillLevel_HUD_C_GetProgress::SkillLevel' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, Progress) == 0x000010, "Member 'WBP_SkillLevel_HUD_C_GetProgress::Progress' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, CallFunc_GetSkillConfig_SkillConfig) == 0x000018, "Member 'WBP_SkillLevel_HUD_C_GetProgress::CallFunc_GetSkillConfig_SkillConfig' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000A0, "Member 'WBP_SkillLevel_HUD_C_GetProgress::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000A8, "Member 'WBP_SkillLevel_HUD_C_GetProgress::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_SkillLevel_HUD_C_GetProgress::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, CallFunc_GetFloatValue_ReturnValue) == 0x0000B4, "Member 'WBP_SkillLevel_HUD_C_GetProgress::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, CallFunc_FMax_ReturnValue) == 0x0000B8, "Member 'WBP_SkillLevel_HUD_C_GetProgress::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_SkillLevel_HUD_C_GetProgress::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'WBP_SkillLevel_HUD_C_GetProgress::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x0000D0, "Member 'WBP_SkillLevel_HUD_C_GetProgress::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetProgress, CallFunc_FMax_A_ImplicitCast) == 0x0000D8, "Member 'WBP_SkillLevel_HUD_C_GetProgress::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");

// Function WBP_SkillLevel_HUD.WBP_SkillLevel_HUD_C.GetSkillConfig
// 0x0120 (0x0120 - 0x0000)
struct WBP_SkillLevel_HUD_C_GetSkillConfig final
{
public:
	struct FSkillLevelConfig                      SkillConfig;                                       // 0x0000(0x0088)(Parm, OutParm)
	EValeriaFuncResult                            CallFunc_FindSkillLevelConfigByType_OutResult;     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50AC[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillLevelConfig                      CallFunc_FindSkillLevelConfigByType_ReturnValue;   // 0x0090(0x0088)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillLevel_HUD_C_GetSkillConfig) == 0x000008, "Wrong alignment on WBP_SkillLevel_HUD_C_GetSkillConfig");
static_assert(sizeof(WBP_SkillLevel_HUD_C_GetSkillConfig) == 0x000120, "Wrong size on WBP_SkillLevel_HUD_C_GetSkillConfig");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetSkillConfig, SkillConfig) == 0x000000, "Member 'WBP_SkillLevel_HUD_C_GetSkillConfig::SkillConfig' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetSkillConfig, CallFunc_FindSkillLevelConfigByType_OutResult) == 0x000088, "Member 'WBP_SkillLevel_HUD_C_GetSkillConfig::CallFunc_FindSkillLevelConfigByType_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetSkillConfig, CallFunc_FindSkillLevelConfigByType_ReturnValue) == 0x000090, "Member 'WBP_SkillLevel_HUD_C_GetSkillConfig::CallFunc_FindSkillLevelConfigByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetSkillConfig, K2Node_SwitchEnum_CmpSuccess) == 0x000118, "Member 'WBP_SkillLevel_HUD_C_GetSkillConfig::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_SkillLevel_HUD.WBP_SkillLevel_HUD_C.GetSkillLevels
// 0x0028 (0x0028 - 0x0000)
struct WBP_SkillLevel_HUD_C_GetSkillLevels final
{
public:
	class USkillLevelsComponent*                  SkillLevels;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50AD[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50AE[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillLevelsComponent*                  CallFunc_GetSkillLevels_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillLevel_HUD_C_GetSkillLevels) == 0x000008, "Wrong alignment on WBP_SkillLevel_HUD_C_GetSkillLevels");
static_assert(sizeof(WBP_SkillLevel_HUD_C_GetSkillLevels) == 0x000028, "Wrong size on WBP_SkillLevel_HUD_C_GetSkillLevels");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetSkillLevels, SkillLevels) == 0x000000, "Member 'WBP_SkillLevel_HUD_C_GetSkillLevels::SkillLevels' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetSkillLevels, CallFunc_GetValeriaCharacter_OutResult) == 0x000008, "Member 'WBP_SkillLevel_HUD_C_GetSkillLevels::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetSkillLevels, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_SkillLevel_HUD_C_GetSkillLevels::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetSkillLevels, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_SkillLevel_HUD_C_GetSkillLevels::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_GetSkillLevels, CallFunc_GetSkillLevels_ReturnValue) == 0x000020, "Member 'WBP_SkillLevel_HUD_C_GetSkillLevels::CallFunc_GetSkillLevels_ReturnValue' has a wrong offset!");

// Function WBP_SkillLevel_HUD.WBP_SkillLevel_HUD_C.HandleSkillsChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_SkillLevel_HUD_C_HandleSkillsChanged final
{
public:
	class USkillLevelsComponent*                  SkillLevels;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillLevel_HUD_C_HandleSkillsChanged) == 0x000008, "Wrong alignment on WBP_SkillLevel_HUD_C_HandleSkillsChanged");
static_assert(sizeof(WBP_SkillLevel_HUD_C_HandleSkillsChanged) == 0x000008, "Wrong size on WBP_SkillLevel_HUD_C_HandleSkillsChanged");
static_assert(offsetof(WBP_SkillLevel_HUD_C_HandleSkillsChanged, SkillLevels) == 0x000000, "Member 'WBP_SkillLevel_HUD_C_HandleSkillsChanged::SkillLevels' has a wrong offset!");

// Function WBP_SkillLevel_HUD.WBP_SkillLevel_HUD_C.SetupConfig
// 0x0088 (0x0088 - 0x0000)
struct WBP_SkillLevel_HUD_C_SetupConfig final
{
public:
	struct FSkillLevelConfig                      CallFunc_GetSkillConfig_SkillConfig;               // 0x0000(0x0088)()
};
static_assert(alignof(WBP_SkillLevel_HUD_C_SetupConfig) == 0x000008, "Wrong alignment on WBP_SkillLevel_HUD_C_SetupConfig");
static_assert(sizeof(WBP_SkillLevel_HUD_C_SetupConfig) == 0x000088, "Wrong size on WBP_SkillLevel_HUD_C_SetupConfig");
static_assert(offsetof(WBP_SkillLevel_HUD_C_SetupConfig, CallFunc_GetSkillConfig_SkillConfig) == 0x000000, "Member 'WBP_SkillLevel_HUD_C_SetupConfig::CallFunc_GetSkillConfig_SkillConfig' has a wrong offset!");

// Function WBP_SkillLevel_HUD.WBP_SkillLevel_HUD_C.UpdateProgress
// 0x0040 (0x0040 - 0x0000)
struct WBP_SkillLevel_HUD_C_UpdateProgress final
{
public:
	class USkillLevelsComponent*                  CallFunc_GetSkillLevels_SkillLevels;               // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSkillPersist                          CallFunc_GetSkillLevel_ReturnValue;                // 0x0008(0x000C)(NoDestructor)
	uint8                                         Pad_50AF[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetProgress_Progress;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillLevel_HUD_C_UpdateProgress) == 0x000008, "Wrong alignment on WBP_SkillLevel_HUD_C_UpdateProgress");
static_assert(sizeof(WBP_SkillLevel_HUD_C_UpdateProgress) == 0x000040, "Wrong size on WBP_SkillLevel_HUD_C_UpdateProgress");
static_assert(offsetof(WBP_SkillLevel_HUD_C_UpdateProgress, CallFunc_GetSkillLevels_SkillLevels) == 0x000000, "Member 'WBP_SkillLevel_HUD_C_UpdateProgress::CallFunc_GetSkillLevels_SkillLevels' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_UpdateProgress, CallFunc_GetSkillLevel_ReturnValue) == 0x000008, "Member 'WBP_SkillLevel_HUD_C_UpdateProgress::CallFunc_GetSkillLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_UpdateProgress, CallFunc_GetProgress_Progress) == 0x000018, "Member 'WBP_SkillLevel_HUD_C_UpdateProgress::CallFunc_GetProgress_Progress' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_UpdateProgress, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_SkillLevel_HUD_C_UpdateProgress::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillLevel_HUD_C_UpdateProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000038, "Member 'WBP_SkillLevel_HUD_C_UpdateProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

