#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_TabHost

#include "Basic.hpp"

#include "ValeriaUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_Social_TabHost.WBP_Social_TabHost_C.AddTabButton
// 0x0070 (0x0070 - 0x0000)
struct WBP_Social_TabHost_C_AddTabButton final
{
public:
	class FName                                   TabName;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_InstantiatedTabButtonInfo       Info;                                              // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Social_TabHost_C_AddTabButton) == 0x000008, "Wrong alignment on WBP_Social_TabHost_C_AddTabButton");
static_assert(sizeof(WBP_Social_TabHost_C_AddTabButton) == 0x000070, "Wrong size on WBP_Social_TabHost_C_AddTabButton");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButton, TabName) == 0x000000, "Member 'WBP_Social_TabHost_C_AddTabButton::TabName' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButton, Info) == 0x000008, "Member 'WBP_Social_TabHost_C_AddTabButton::Info' has a wrong offset!");

// Function WBP_Social_TabHost.WBP_Social_TabHost_C.AddTabButtonImpl
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Social_TabHost_C_AddTabButtonImpl final
{
public:
	struct FVALUI_InstantiatedTabButtonInfo       InstantiatedTabButtonInfo;                         // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class FName                                   TabName;                                           // 0x0068(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonCreated;                                     // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Social_TabButton_C*                CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51E7[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_TabHost_C_AddTabButtonImpl) == 0x000008, "Wrong alignment on WBP_Social_TabHost_C_AddTabButtonImpl");
static_assert(sizeof(WBP_Social_TabHost_C_AddTabButtonImpl) == 0x0000B0, "Wrong size on WBP_Social_TabHost_C_AddTabButtonImpl");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButtonImpl, InstantiatedTabButtonInfo) == 0x000000, "Member 'WBP_Social_TabHost_C_AddTabButtonImpl::InstantiatedTabButtonInfo' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButtonImpl, TabName) == 0x000068, "Member 'WBP_Social_TabHost_C_AddTabButtonImpl::TabName' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButtonImpl, Button) == 0x000070, "Member 'WBP_Social_TabHost_C_AddTabButtonImpl::Button' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButtonImpl, ButtonCreated) == 0x000078, "Member 'WBP_Social_TabHost_C_AddTabButtonImpl::ButtonCreated' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButtonImpl, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'WBP_Social_TabHost_C_AddTabButtonImpl::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButtonImpl, CallFunc_Create_ReturnValue) == 0x000088, "Member 'WBP_Social_TabHost_C_AddTabButtonImpl::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButtonImpl, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000090, "Member 'WBP_Social_TabHost_C_AddTabButtonImpl::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButtonImpl, K2Node_DynamicCast_AsTexture_2D) == 0x000098, "Member 'WBP_Social_TabHost_C_AddTabButtonImpl::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButtonImpl, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'WBP_Social_TabHost_C_AddTabButtonImpl::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_AddTabButtonImpl, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x0000A8, "Member 'WBP_Social_TabHost_C_AddTabButtonImpl::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_Social_TabHost.WBP_Social_TabHost_C.ExecuteUbergraph_WBP_Social_TabHost
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51E8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51E9[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51EA[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51EB[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_2;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51EC[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Social_TabButton_C*                K2Node_DynamicCast_AsWBP_Social_Tab_Button;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51ED[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_TabName_4;                            // 0x0064(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51EE[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALUI_InstantiatedTabButtonInfo       K2Node_Event_Info_3;                               // 0x0070(0x0068)(ConstParm, ContainsInstancedReference)
	class FName                                   K2Node_Event_TabName_3;                            // 0x00D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_InstantiatedTabButtonInfo       K2Node_Event_Info_2;                               // 0x00E0(0x0068)(ConstParm, ContainsInstancedReference)
	class UButton*                                CallFunc_AddTabButtonImpl_Button;                  // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51EF[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0158(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51F0[0x2];                                     // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Social_TabButton_C*                K2Node_DynamicCast_AsWBP_Social_Tab_Button_1;      // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51F1[0x1];                                     // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_TabName_2;                            // 0x0184(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51F2[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetTabNames_ReturnValue;                  // 0x0190(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51F3[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetTabNames_ReturnValue_1;                // 0x01B0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_GetActiveTabName_ReturnValue;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TabName_1;                            // 0x01D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_InstantiatedTabButtonInfo       K2Node_Event_Info_1;                               // 0x01D8(0x0068)(ConstParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_2;             // 0x0240(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FName                                   K2Node_Event_TabName;                              // 0x0250(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_InstantiatedTabButtonInfo       K2Node_Event_Info;                                 // 0x0258(0x0068)(ConstParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Social_TabButton_C*                K2Node_DynamicCast_AsWBP_Social_Tab_Button_2;      // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51F4[0x2];                                     // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost) == 0x000008, "Wrong alignment on WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost");
static_assert(sizeof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost) == 0x0002E0, "Wrong size on WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, EntryPoint) == 0x000000, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000040, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, Temp_bool_True_if_break_was_hit_Variable_2) == 0x000041, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::Temp_bool_True_if_break_was_hit_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Not_PreBool_ReturnValue_1) == 0x000042, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Not_PreBool_ReturnValue_2) == 0x000043, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, Temp_int_Array_Index_Variable_2) == 0x000044, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_DynamicCast_AsWBP_Social_Tab_Button) == 0x000058, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_DynamicCast_AsWBP_Social_Tab_Button' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_Event_TabName_4) == 0x000064, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_Event_TabName_4' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_Event_Info_3) == 0x000070, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_Event_Info_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_Event_TabName_3) == 0x0000D8, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_Event_TabName_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_Event_Info_2) == 0x0000E0, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_Event_Info_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_AddTabButtonImpl_Button) == 0x000148, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_AddTabButtonImpl_Button' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_GetAllChildren_ReturnValue_1) == 0x000158, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Array_Get_Item_1) == 0x000168, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Array_Length_ReturnValue_1) == 0x000170, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_RemoveChild_ReturnValue) == 0x000174, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Less_IntInt_ReturnValue_1) == 0x000175, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_DynamicCast_AsWBP_Social_Tab_Button_1) == 0x000178, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_DynamicCast_AsWBP_Social_Tab_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_BooleanAND_ReturnValue_1) == 0x000181, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000182, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_Event_TabName_2) == 0x000184, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_Event_TabName_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_GetTabNames_ReturnValue) == 0x000190, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_GetTabNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Array_Find_ReturnValue) == 0x0001A0, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, Temp_int_Loop_Counter_Variable_2) == 0x0001A4, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001A8, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_GetTabNames_ReturnValue_1) == 0x0001B0, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_GetTabNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_GetActiveTabName_ReturnValue) == 0x0001C0, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_GetActiveTabName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Array_Find_ReturnValue_1) == 0x0001C8, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_AkEventGlobal_ReturnValue) == 0x0001CC, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_Event_TabName_1) == 0x0001D0, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_Event_TabName_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_Event_Info_1) == 0x0001D8, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_Event_Info_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_GetAllChildren_ReturnValue_2) == 0x000240, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_GetAllChildren_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_Event_TabName) == 0x000250, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_Event_TabName' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_Event_Info) == 0x000258, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Array_Get_Item_2) == 0x0002C0, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_DynamicCast_AsWBP_Social_Tab_Button_2) == 0x0002C8, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_DynamicCast_AsWBP_Social_Tab_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, K2Node_DynamicCast_bSuccess_2) == 0x0002D0, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0002D1, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Array_Length_ReturnValue_2) == 0x0002D4, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0002D8, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002D9, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost, CallFunc_BooleanAND_ReturnValue_2) == 0x0002DA, "Member 'WBP_Social_TabHost_C_ExecuteUbergraph_WBP_Social_TabHost::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function WBP_Social_TabHost.WBP_Social_TabHost_C.HandleDifferentActiveTabSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_TabHost_C_HandleDifferentActiveTabSet final
{
public:
	class FName                                   TabName;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_TabHost_C_HandleDifferentActiveTabSet) == 0x000004, "Wrong alignment on WBP_Social_TabHost_C_HandleDifferentActiveTabSet");
static_assert(sizeof(WBP_Social_TabHost_C_HandleDifferentActiveTabSet) == 0x000008, "Wrong size on WBP_Social_TabHost_C_HandleDifferentActiveTabSet");
static_assert(offsetof(WBP_Social_TabHost_C_HandleDifferentActiveTabSet, TabName) == 0x000000, "Member 'WBP_Social_TabHost_C_HandleDifferentActiveTabSet::TabName' has a wrong offset!");

// Function WBP_Social_TabHost.WBP_Social_TabHost_C.HideTabButton
// 0x0070 (0x0070 - 0x0000)
struct WBP_Social_TabHost_C_HideTabButton final
{
public:
	class FName                                   TabName;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_InstantiatedTabButtonInfo       Info;                                              // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Social_TabHost_C_HideTabButton) == 0x000008, "Wrong alignment on WBP_Social_TabHost_C_HideTabButton");
static_assert(sizeof(WBP_Social_TabHost_C_HideTabButton) == 0x000070, "Wrong size on WBP_Social_TabHost_C_HideTabButton");
static_assert(offsetof(WBP_Social_TabHost_C_HideTabButton, TabName) == 0x000000, "Member 'WBP_Social_TabHost_C_HideTabButton::TabName' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_HideTabButton, Info) == 0x000008, "Member 'WBP_Social_TabHost_C_HideTabButton::Info' has a wrong offset!");

// Function WBP_Social_TabHost.WBP_Social_TabHost_C.RemoveTabButton
// 0x0070 (0x0070 - 0x0000)
struct WBP_Social_TabHost_C_RemoveTabButton final
{
public:
	class FName                                   TabName;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_InstantiatedTabButtonInfo       Info;                                              // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Social_TabHost_C_RemoveTabButton) == 0x000008, "Wrong alignment on WBP_Social_TabHost_C_RemoveTabButton");
static_assert(sizeof(WBP_Social_TabHost_C_RemoveTabButton) == 0x000070, "Wrong size on WBP_Social_TabHost_C_RemoveTabButton");
static_assert(offsetof(WBP_Social_TabHost_C_RemoveTabButton, TabName) == 0x000000, "Member 'WBP_Social_TabHost_C_RemoveTabButton::TabName' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_RemoveTabButton, Info) == 0x000008, "Member 'WBP_Social_TabHost_C_RemoveTabButton::Info' has a wrong offset!");

// Function WBP_Social_TabHost.WBP_Social_TabHost_C.ShowTabButton
// 0x0070 (0x0070 - 0x0000)
struct WBP_Social_TabHost_C_ShowTabButton final
{
public:
	class FName                                   TabName;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_InstantiatedTabButtonInfo       Info;                                              // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Social_TabHost_C_ShowTabButton) == 0x000008, "Wrong alignment on WBP_Social_TabHost_C_ShowTabButton");
static_assert(sizeof(WBP_Social_TabHost_C_ShowTabButton) == 0x000070, "Wrong size on WBP_Social_TabHost_C_ShowTabButton");
static_assert(offsetof(WBP_Social_TabHost_C_ShowTabButton, TabName) == 0x000000, "Member 'WBP_Social_TabHost_C_ShowTabButton::TabName' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_ShowTabButton, Info) == 0x000008, "Member 'WBP_Social_TabHost_C_ShowTabButton::Info' has a wrong offset!");

// Function WBP_Social_TabHost.WBP_Social_TabHost_C.UpdateButtonHoverAnimPermissions
// 0x0050 (0x0050 - 0x0000)
struct WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTabName_ReturnValue;             // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51F5[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51F6[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51F7[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Social_TabButton_C*                K2Node_DynamicCast_AsWBP_Social_Tab_Button;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions) == 0x000008, "Wrong alignment on WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions");
static_assert(sizeof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions) == 0x000050, "Wrong size on WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, CallFunc_GetActiveTabName_ReturnValue) == 0x00000C, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::CallFunc_GetActiveTabName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, K2Node_DynamicCast_AsWBP_Social_Tab_Button) == 0x000040, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::K2Node_DynamicCast_AsWBP_Social_Tab_Button' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000049, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'WBP_Social_TabHost_C_UpdateButtonHoverAnimPermissions::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Social_TabHost.WBP_Social_TabHost_C.UpdateSocialButtonCount
// 0x0050 (0x0050 - 0x0000)
struct WBP_Social_TabHost_C_UpdateSocialButtonCount final
{
public:
	class FName                                   TabName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51F8[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51F9[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Social_TabButton_C*                K2Node_DynamicCast_AsWBP_Social_Tab_Button;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_TabHost_C_UpdateSocialButtonCount) == 0x000008, "Wrong alignment on WBP_Social_TabHost_C_UpdateSocialButtonCount");
static_assert(sizeof(WBP_Social_TabHost_C_UpdateSocialButtonCount) == 0x000050, "Wrong size on WBP_Social_TabHost_C_UpdateSocialButtonCount");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateSocialButtonCount, TabName) == 0x000000, "Member 'WBP_Social_TabHost_C_UpdateSocialButtonCount::TabName' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateSocialButtonCount, Count) == 0x000008, "Member 'WBP_Social_TabHost_C_UpdateSocialButtonCount::Count' has a wrong offset!");
static_assert(offsetof(WBP_Social_TabHost_C_UpdateSocialButtonCount, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_Social_TabHost_C_UpdateSocialButtonCount::Temp_int_Array_Index_Variable' has a wrong offset!");
