#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ComboBox_Menu_Option_02_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ComboBox_Menu_Option_02_CM.WBP_ComboBox_Menu_Option_02_CM_C.BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_02_CM.WBP_ComboBox_Menu_Option_02_CM_C.BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_02_CM.WBP_ComboBox_Menu_Option_02_CM_C.ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM
// 0x0038 (0x0038 - 0x0000)
struct WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C7F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0020(0x0018)()
};
static_assert(alignof(WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM");
static_assert(sizeof(WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM) == 0x000038, "Wrong size on WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM, EntryPoint) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000010, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000014, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM, CallFunc_GetText_ReturnValue) == 0x000020, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_02_CM.WBP_ComboBox_Menu_Option_02_CM_C.OnOptionSelected__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_ComboBox_Menu_Option_02_CM_C_OnOptionSelected__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C80[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_02_CM_C_OnOptionSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_02_CM_C_OnOptionSelected__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_Menu_Option_02_CM_C_OnOptionSelected__DelegateSignature) == 0x000020, "Wrong size on WBP_ComboBox_Menu_Option_02_CM_C_OnOptionSelected__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_OnOptionSelected__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_OnOptionSelected__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_OnOptionSelected__DelegateSignature, Text) == 0x000008, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_OnOptionSelected__DelegateSignature::Text' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_02_CM.WBP_ComboBox_Menu_Option_02_CM_C.SetSelected
// 0x0010 (0x0010 - 0x0000)
struct WBP_ComboBox_Menu_Option_02_CM_C_SetSelected final
{
public:
	bool                                          Param_IsSelected;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C81[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  K2Node_Select_Default_1;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_02_CM_C_SetSelected) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_02_CM_C_SetSelected");
static_assert(sizeof(WBP_ComboBox_Menu_Option_02_CM_C_SetSelected) == 0x000010, "Wrong size on WBP_ComboBox_Menu_Option_02_CM_C_SetSelected");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_SetSelected, Param_IsSelected) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_SetSelected::Param_IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_SetSelected, Temp_byte_Variable) == 0x000002, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_SetSelected, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_SetSelected, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_SetSelected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_SetSelected, K2Node_Select_Default) == 0x000005, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_SetSelected, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_SetSelected::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_ComboBox_Menu_Option_02_CM.WBP_ComboBox_Menu_Option_02_CM_C.SetTextBlockStyles
// 0x0020 (0x0020 - 0x0000)
struct WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles final
{
public:
	class UVALUI_TextBlockStyle*                  Param_UnselectedStyle;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  Param_SelectedStyle;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C82[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles) == 0x000008, "Wrong alignment on WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles");
static_assert(sizeof(WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles) == 0x000020, "Wrong size on WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles, Param_UnselectedStyle) == 0x000000, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles::Param_UnselectedStyle' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles, Param_SelectedStyle) == 0x000008, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles::Param_SelectedStyle' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles, Temp_bool_Variable) == 0x000010, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles, K2Node_Select_Default) == 0x000018, "Member 'WBP_ComboBox_Menu_Option_02_CM_C_SetTextBlockStyles::K2Node_Select_Default' has a wrong offset!");

}

