#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CreditsScreen_PF

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CreditsScreen_PF.WBP_CreditsScreen_PF_C.BP_OnHandleBackAction
// 0x0018 (0x0018 - 0x0000)
struct WBP_CreditsScreen_PF_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51D5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CreditsScreen_PF_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on WBP_CreditsScreen_PF_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_CreditsScreen_PF_C_BP_OnHandleBackAction) == 0x000018, "Wrong size on WBP_CreditsScreen_PF_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_CreditsScreen_PF_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_CreditsScreen_PF_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_BP_OnHandleBackAction, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_CreditsScreen_PF_C_BP_OnHandleBackAction::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_BP_OnHandleBackAction, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'WBP_CreditsScreen_PF_C_BP_OnHandleBackAction::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_CreditsScreen_PF.WBP_CreditsScreen_PF_C.ExecuteUbergraph_WBP_CreditsScreen_PF
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51D6[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetProjectContentDirectory_ReturnValue;   // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_LoadFileToText_OutputText;                // 0x0078(0x0018)()
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51D7[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF) == 0x000008, "Wrong alignment on WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF");
static_assert(sizeof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF) == 0x0000A8, "Wrong size on WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, EntryPoint) == 0x000000, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, CallFunc_GetProjectContentDirectory_ReturnValue) == 0x000058, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::CallFunc_GetProjectContentDirectory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, CallFunc_LoadFileToText_OutputText) == 0x000078, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::CallFunc_LoadFileToText_OutputText' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000090, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x0000A0, "Member 'WBP_CreditsScreen_PF_C_ExecuteUbergraph_WBP_CreditsScreen_PF::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_CreditsScreen_PF.WBP_CreditsScreen_PF_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CreditsScreen_PF_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CreditsScreen_PF_C_Tick) == 0x000004, "Wrong alignment on WBP_CreditsScreen_PF_C_Tick");
static_assert(sizeof(WBP_CreditsScreen_PF_C_Tick) == 0x00003C, "Wrong size on WBP_CreditsScreen_PF_C_Tick");
static_assert(offsetof(WBP_CreditsScreen_PF_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CreditsScreen_PF_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_PF_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CreditsScreen_PF_C_Tick::InDeltaTime' has a wrong offset!");

}

