#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCustomization_VariantChannel_CM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterCustomization_VariantChannel_CM.WBP_CharacterCustomization_VariantChannel_CM_C.ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FVAL_VariantChannelSettings> Temp_name_Variable;                                // 0x0008(0x0050)()
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4F[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_VariantChannelSettings            CallFunc_Map_Find_Value;                           // 0x0060(0x0040)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM");
static_assert(sizeof(WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM) == 0x0000A8, "Wrong size on WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM, EntryPoint) == 0x000000, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM, Temp_name_Variable) == 0x000008, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000058, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM, CallFunc_Map_Find_Value) == 0x000060, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM, CallFunc_Map_Find_ReturnValue) == 0x0000A0, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_VariantChannel_CM::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantChannel_CM.WBP_CharacterCustomization_VariantChannel_CM_C.GenerateVariantOptions
// 0x0170 (0x0170 - 0x0000)
struct WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions final
{
public:
	struct FGuid                                  SelectedVariantId;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UListEntry_CharacterCustomization_VariantOption_C*> Options;                                           // 0x0010(0x0010)(Parm, OutParm)
	int32                                         SelectId;                                          // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedId;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar;                                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E50[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E51[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListEntry_CharacterCustomization_VariantOption_C* CallFunc_SpawnObject_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E52[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FGuid>                            CallFunc_TryGetAllVariantOptionIds_OutVariantOptionIds; // 0x0050(0x0050)()
	bool                                          CallFunc_TryGetAllVariantOptionIds_ReturnValue;    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E53[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGuid>                          CallFunc_Set_ToArray_Result;                       // 0x00A8(0x0010)(ReferenceParm)
	struct FGuid                                  CallFunc_Array_Get_Item;                           // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E54[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharacterCustomizationVariantOptionBase CallFunc_TryGetVariantOptionById_OutVariantOption; // 0x00D0(0x0098)()
	bool                                          CallFunc_TryGetVariantOptionById_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue;          // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions");
static_assert(sizeof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions) == 0x000170, "Wrong size on WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, SelectedVariantId) == 0x000000, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::SelectedVariantId' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, Options) == 0x000010, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::Options' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, SelectId) == 0x000020, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::SelectId' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, SelectedId) == 0x000024, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::SelectedId' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, NewLocalVar) == 0x000028, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_TryGetAllVariantOptionIds_OutVariantOptionIds) == 0x000050, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_TryGetAllVariantOptionIds_OutVariantOptionIds' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_TryGetAllVariantOptionIds_ReturnValue) == 0x0000A0, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_TryGetAllVariantOptionIds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_Set_ToArray_Result) == 0x0000A8, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_TryGetVariantOptionById_OutVariantOption) == 0x0000D0, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_TryGetVariantOptionById_OutVariantOption' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_TryGetVariantOptionById_ReturnValue) == 0x000168, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_TryGetVariantOptionById_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_Less_IntInt_ReturnValue) == 0x000169, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions, CallFunc_EqualEqual_GuidGuid_ReturnValue) == 0x00016A, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_GenerateVariantOptions::CallFunc_EqualEqual_GuidGuid_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantChannel_CM.WBP_CharacterCustomization_VariantChannel_CM_C.OnButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_VariantChannel_CM_C_OnButtonClicked__DelegateSignature final
{
public:
	class UWBP_CharacterCustomization_VariantChannel_CM_C* VariantChannelWidget;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantChannel_CM_C_OnButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantChannel_CM_C_OnButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_VariantChannel_CM_C_OnButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomization_VariantChannel_CM_C_OnButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_OnButtonClicked__DelegateSignature, VariantChannelWidget) == 0x000000, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_OnButtonClicked__DelegateSignature::VariantChannelWidget' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantChannel_CM.WBP_CharacterCustomization_VariantChannel_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterCustomization_VariantChannel_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantChannel_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CharacterCustomization_VariantChannel_CM_C_PreConstruct");
static_assert(sizeof(WBP_CharacterCustomization_VariantChannel_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_CharacterCustomization_VariantChannel_CM_C_PreConstruct");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CharacterCustomization_VariantChannel_CM.WBP_CharacterCustomization_VariantChannel_CM_C.SelectChannel
// 0x0058 (0x0058 - 0x0000)
struct WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldAnimate;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E55[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E56[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E57[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E58[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_B_ImplicitCast_1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel");
static_assert(sizeof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel) == 0x000058, "Wrong size on WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, IsSelected) == 0x000000, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, ShouldAnimate) == 0x000001, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::ShouldAnimate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, CallFunc_GetEndTime_ReturnValue_1) == 0x000010, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, CallFunc_SelectFloat_ReturnValue_1) == 0x000018, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, CallFunc_AkEventGlobal_ReturnValue) == 0x000030, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, CallFunc_SelectFloat_B_ImplicitCast) == 0x000038, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::CallFunc_SelectFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000040, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, CallFunc_SelectFloat_B_ImplicitCast_1) == 0x000048, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::CallFunc_SelectFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel, CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1) == 0x000050, "Member 'WBP_CharacterCustomization_VariantChannel_CM_C_SelectChannel::CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1' has a wrong offset!");

}

