#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlacementHud

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlacementHud.WBP_PlacementHud_C.ExecuteUbergraph_WBP_PlacementHud
// 0x0380 (0x0380 - 0x0000)
struct WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1527[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           CallFunc_GetPlacedItem_Item;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalSkillCostOfPlaceable_TotalCost;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1528[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1529[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0058(0x0014)()
	bool                                          K2Node_Event_IsVisible;                            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152A[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0070(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152B[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlacementComponent*                    CallFunc_GetPlacement_Placement;                   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkillLevelsComponent*                  CallFunc_GetSkillLevels_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> CallFunc_GetItemTypeToPlace_ReturnValue;           // 0x00C8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSkillPoints_ReturnValue;       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152C[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00F8(0x0018)()
	int32                                         CallFunc_GetMaxSkillPoints_ReturnValue;            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0118(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152D[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MaxNumItemsCanPlace_ReturnValue;          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountNumItemsPlaced_ReturnValue;          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152E[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0150(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01A0(0x0050)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152F[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0208(0x0018)()
	class UVAL_ItemTypeDefinitionAsset*           CallFunc_GetPlacedItem_Item_1;                     // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0228(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UPlacementComponent*                    CallFunc_GetPlacement_Placement_1;                 // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCurrentError_Message;                  // 0x0258(0x0018)()
	int32                                         CallFunc_GetPlacedItemsCount_OutRequired;          // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlacedItemsCount_OutAvailable;         // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           K2Node_MakeStruct_ValeriaItem;                     // 0x0278(0x0060)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1530[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1531[0x6];                                     // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* ModalWidget, TArray<class UUserWidget*>& TutorialWidgets)> K2Node_CreateDelegate_OutputDelegate;              // 0x02F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue_1;    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1532[0x3];                                     // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* ModalWidget, TArray<class UUserWidget*>& TutorialWidgets)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x030C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue_1; // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowCrafterPanels_ShouldShow;       // 0x031D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1533[0x2];                                     // 0x031E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM; // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1534[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM_1; // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RedirectTutorialModalType_bSuccess;       // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RedirectTutorialModalType_bSuccess_1;     // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1535[0x5];                                     // 0x036B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlacementComponent*                    CallFunc_GetPlacement_Placement_2;                 // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud) == 0x000008, "Wrong alignment on WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud");
static_assert(sizeof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud) == 0x000380, "Wrong size on WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, EntryPoint) == 0x000000, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetPlacedItem_Item) == 0x000008, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetPlacedItem_Item' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetTotalSkillCostOfPlaceable_TotalCost) == 0x000010, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetTotalSkillCostOfPlaceable_TotalCost' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_MakeStruct_SlateColor) == 0x000058, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_Event_IsVisible) == 0x00006C, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_Event_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_Event_MyGeometry) == 0x000070, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_Event_InDeltaTime) == 0x0000A8, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetValeriaCharacter_OutResult) == 0x0000AC, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetValeriaCharacter_ReturnValue) == 0x0000B0, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetPlacement_Placement) == 0x0000B8, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetPlacement_Placement' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetSkillLevels_ReturnValue) == 0x0000C0, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetSkillLevels_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetItemTypeToPlace_ReturnValue) == 0x0000C8, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetItemTypeToPlace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetNumberOfSkillPoints_ReturnValue) == 0x0000F0, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetNumberOfSkillPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_Conv_IntToText_ReturnValue) == 0x0000F8, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetMaxSkillPoints_ReturnValue) == 0x000110, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetMaxSkillPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_Subtract_IntInt_ReturnValue) == 0x000114, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000118, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_Greater_IntInt_ReturnValue) == 0x000130, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_MaxNumItemsCanPlace_ReturnValue) == 0x000134, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_MaxNumItemsCanPlace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_CountNumItemsPlaced_ReturnValue) == 0x000138, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_CountNumItemsPlaced_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000140, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000148, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_MakeStruct_FormatArgumentData) == 0x000150, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001A0, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001F0, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_MakeArray_Array) == 0x0001F8, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_Format_ReturnValue) == 0x000208, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetPlacedItem_Item_1) == 0x000220, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetPlacedItem_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000228, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetPlacement_Placement_1) == 0x000250, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetPlacement_Placement_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetCurrentError_Message) == 0x000258, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetCurrentError_Message' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetPlacedItemsCount_OutRequired) == 0x000270, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetPlacedItemsCount_OutRequired' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetPlacedItemsCount_OutAvailable) == 0x000274, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetPlacedItemsCount_OutAvailable' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_MakeStruct_ValeriaItem) == 0x000278, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_MakeStruct_ValeriaItem' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_TextIsEmpty_ReturnValue) == 0x0002D8, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0002E0, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_CanStartTutorialForFlag_ReturnValue) == 0x0002E8, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_CanStartTutorialForFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_EqualEqual_SoftObjectReference_ReturnValue) == 0x0002E9, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_EqualEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0002F0, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_CreateDelegate_OutputDelegate) == 0x0002F8, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_CanStartTutorialForFlag_ReturnValue_1) == 0x000308, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_CanStartTutorialForFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_CreateDelegate_OutputDelegate_1) == 0x00030C, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_EqualEqual_SoftObjectReference_ReturnValue_1) == 0x00031C, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_EqualEqual_SoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_ShouldShowCrafterPanels_ShouldShow) == 0x00031D, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_ShouldShowCrafterPanels_ShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetPlayerController_ReturnValue) == 0x000320, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetPlayerController_ReturnValue_1) == 0x000328, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000330, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetUIManagerWidget_ReturnValue_1) == 0x000338, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetUIManagerWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM) == 0x000340, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_DynamicCast_bSuccess) == 0x000350, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM_1) == 0x000358, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_DynamicCast_bSuccess_1) == 0x000368, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_RedirectTutorialModalType_bSuccess) == 0x000369, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_RedirectTutorialModalType_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_RedirectTutorialModalType_bSuccess_1) == 0x00036A, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_RedirectTutorialModalType_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, CallFunc_GetPlacement_Placement_2) == 0x000370, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::CallFunc_GetPlacement_Placement_2' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud, K2Node_SwitchEnum_CmpSuccess_2) == 0x000378, "Member 'WBP_PlacementHud_C_ExecuteUbergraph_WBP_PlacementHud::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");

// Function WBP_PlacementHud.WBP_PlacementHud_C.GetCurrentError
// 0x0070 (0x0070 - 0x0000)
struct WBP_PlacementHud_C_GetCurrentError final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(Parm, OutParm)
	class UVAL_ItemTypeDefinitionAsset*           CallFunc_GetPlacedItem_Item;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlacementComponent*                    CallFunc_GetPlacement_Placement;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFreePlacementModeActive_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1536[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlacementComponent*                    CallFunc_GetPlacement_Placement_1;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FErrorMessageConfig                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0038(0x0030)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementHud_C_GetCurrentError) == 0x000008, "Wrong alignment on WBP_PlacementHud_C_GetCurrentError");
static_assert(sizeof(WBP_PlacementHud_C_GetCurrentError) == 0x000070, "Wrong size on WBP_PlacementHud_C_GetCurrentError");
static_assert(offsetof(WBP_PlacementHud_C_GetCurrentError, Message) == 0x000000, "Member 'WBP_PlacementHud_C_GetCurrentError::Message' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetCurrentError, CallFunc_GetPlacedItem_Item) == 0x000018, "Member 'WBP_PlacementHud_C_GetCurrentError::CallFunc_GetPlacedItem_Item' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetCurrentError, CallFunc_GetPlacement_Placement) == 0x000020, "Member 'WBP_PlacementHud_C_GetCurrentError::CallFunc_GetPlacement_Placement' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetCurrentError, CallFunc_IsFreePlacementModeActive_ReturnValue) == 0x000028, "Member 'WBP_PlacementHud_C_GetCurrentError::CallFunc_IsFreePlacementModeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetCurrentError, CallFunc_GetPlacement_Placement_1) == 0x000030, "Member 'WBP_PlacementHud_C_GetCurrentError::CallFunc_GetPlacement_Placement_1' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetCurrentError, CallFunc_GetDataTableRowFromName_OutRow) == 0x000038, "Member 'WBP_PlacementHud_C_GetCurrentError::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetCurrentError, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'WBP_PlacementHud_C_GetCurrentError::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetCurrentError, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000069, "Member 'WBP_PlacementHud_C_GetCurrentError::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_PlacementHud.WBP_PlacementHud_C.GetPlacedItem
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlacementHud_C_GetPlacedItem final
{
public:
	class UVAL_ItemTypeDefinitionAsset*           Item;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlacementComponent*                    CallFunc_GetPlacement_Placement;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> CallFunc_GetItemTypeToPlace_ReturnValue;           // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementHud_C_GetPlacedItem) == 0x000008, "Wrong alignment on WBP_PlacementHud_C_GetPlacedItem");
static_assert(sizeof(WBP_PlacementHud_C_GetPlacedItem) == 0x000050, "Wrong size on WBP_PlacementHud_C_GetPlacedItem");
static_assert(offsetof(WBP_PlacementHud_C_GetPlacedItem, Item) == 0x000000, "Member 'WBP_PlacementHud_C_GetPlacedItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetPlacedItem, CallFunc_GetPlacement_Placement) == 0x000008, "Member 'WBP_PlacementHud_C_GetPlacedItem::CallFunc_GetPlacement_Placement' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetPlacedItem, CallFunc_GetItemTypeToPlace_ReturnValue) == 0x000010, "Member 'WBP_PlacementHud_C_GetPlacedItem::CallFunc_GetItemTypeToPlace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetPlacedItem, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000038, "Member 'WBP_PlacementHud_C_GetPlacedItem::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetPlacedItem, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000040, "Member 'WBP_PlacementHud_C_GetPlacedItem::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetPlacedItem, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_PlacementHud_C_GetPlacedItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_PlacementHud.WBP_PlacementHud_C.GetPlacement
// 0x0028 (0x0028 - 0x0000)
struct WBP_PlacementHud_C_GetPlacement final
{
public:
	class UPlacementComponent*                    Placement;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1537[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1538[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlacementComponent*                    CallFunc_GetPlacement_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementHud_C_GetPlacement) == 0x000008, "Wrong alignment on WBP_PlacementHud_C_GetPlacement");
static_assert(sizeof(WBP_PlacementHud_C_GetPlacement) == 0x000028, "Wrong size on WBP_PlacementHud_C_GetPlacement");
static_assert(offsetof(WBP_PlacementHud_C_GetPlacement, Placement) == 0x000000, "Member 'WBP_PlacementHud_C_GetPlacement::Placement' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetPlacement, CallFunc_GetValeriaCharacter_OutResult) == 0x000008, "Member 'WBP_PlacementHud_C_GetPlacement::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetPlacement, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_PlacementHud_C_GetPlacement::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetPlacement, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_PlacementHud_C_GetPlacement::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetPlacement, CallFunc_GetPlacement_ReturnValue) == 0x000020, "Member 'WBP_PlacementHud_C_GetPlacement::CallFunc_GetPlacement_ReturnValue' has a wrong offset!");

// Function WBP_PlacementHud.WBP_PlacementHud_C.GetTotalSkillCostOfPlaceable
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlacementHud_C_GetTotalSkillCostOfPlaceable final
{
public:
	int32                                         TotalCost;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1539[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           CallFunc_GetPlacedItem_Item;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementHud_C_GetTotalSkillCostOfPlaceable) == 0x000008, "Wrong alignment on WBP_PlacementHud_C_GetTotalSkillCostOfPlaceable");
static_assert(sizeof(WBP_PlacementHud_C_GetTotalSkillCostOfPlaceable) == 0x000018, "Wrong size on WBP_PlacementHud_C_GetTotalSkillCostOfPlaceable");
static_assert(offsetof(WBP_PlacementHud_C_GetTotalSkillCostOfPlaceable, TotalCost) == 0x000000, "Member 'WBP_PlacementHud_C_GetTotalSkillCostOfPlaceable::TotalCost' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetTotalSkillCostOfPlaceable, CallFunc_GetPlacedItem_Item) == 0x000008, "Member 'WBP_PlacementHud_C_GetTotalSkillCostOfPlaceable::CallFunc_GetPlacedItem_Item' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_GetTotalSkillCostOfPlaceable, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PlacementHud_C_GetTotalSkillCostOfPlaceable::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_PlacementHud.WBP_PlacementHud_C.HandleShowMakeRecipeTutorial
// 0x0048 (0x0048 - 0x0000)
struct WBP_PlacementHud_C_HandleShowMakeRecipeTutorial final
{
public:
	class UUserWidget*                            ModalWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    TutorialWidgets;                                   // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_ModalInterface_Tutorial_C> K2Node_DynamicCast_AsBP_Modal_Interface_Tutorial;  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153A[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementHud_C_HandleShowMakeRecipeTutorial) == 0x000008, "Wrong alignment on WBP_PlacementHud_C_HandleShowMakeRecipeTutorial");
static_assert(sizeof(WBP_PlacementHud_C_HandleShowMakeRecipeTutorial) == 0x000048, "Wrong size on WBP_PlacementHud_C_HandleShowMakeRecipeTutorial");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowMakeRecipeTutorial, ModalWidget) == 0x000000, "Member 'WBP_PlacementHud_C_HandleShowMakeRecipeTutorial::ModalWidget' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowMakeRecipeTutorial, TutorialWidgets) == 0x000008, "Member 'WBP_PlacementHud_C_HandleShowMakeRecipeTutorial::TutorialWidgets' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowMakeRecipeTutorial, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'WBP_PlacementHud_C_HandleShowMakeRecipeTutorial::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowMakeRecipeTutorial, K2Node_DynamicCast_AsBP_Modal_Interface_Tutorial) == 0x000020, "Member 'WBP_PlacementHud_C_HandleShowMakeRecipeTutorial::K2Node_DynamicCast_AsBP_Modal_Interface_Tutorial' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowMakeRecipeTutorial, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_PlacementHud_C_HandleShowMakeRecipeTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowMakeRecipeTutorial, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'WBP_PlacementHud_C_HandleShowMakeRecipeTutorial::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowMakeRecipeTutorial, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000040, "Member 'WBP_PlacementHud_C_HandleShowMakeRecipeTutorial::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_PlacementHud.WBP_PlacementHud_C.HandleShowPrepStationTutorial
// 0x0048 (0x0048 - 0x0000)
struct WBP_PlacementHud_C_HandleShowPrepStationTutorial final
{
public:
	class UUserWidget*                            ModalWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    TutorialWidgets;                                   // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_ModalInterface_Tutorial_C> K2Node_DynamicCast_AsBP_Modal_Interface_Tutorial;  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153B[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementHud_C_HandleShowPrepStationTutorial) == 0x000008, "Wrong alignment on WBP_PlacementHud_C_HandleShowPrepStationTutorial");
static_assert(sizeof(WBP_PlacementHud_C_HandleShowPrepStationTutorial) == 0x000048, "Wrong size on WBP_PlacementHud_C_HandleShowPrepStationTutorial");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowPrepStationTutorial, ModalWidget) == 0x000000, "Member 'WBP_PlacementHud_C_HandleShowPrepStationTutorial::ModalWidget' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowPrepStationTutorial, TutorialWidgets) == 0x000008, "Member 'WBP_PlacementHud_C_HandleShowPrepStationTutorial::TutorialWidgets' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowPrepStationTutorial, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'WBP_PlacementHud_C_HandleShowPrepStationTutorial::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowPrepStationTutorial, K2Node_DynamicCast_AsBP_Modal_Interface_Tutorial) == 0x000020, "Member 'WBP_PlacementHud_C_HandleShowPrepStationTutorial::K2Node_DynamicCast_AsBP_Modal_Interface_Tutorial' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowPrepStationTutorial, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_PlacementHud_C_HandleShowPrepStationTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowPrepStationTutorial, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'WBP_PlacementHud_C_HandleShowPrepStationTutorial::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_HandleShowPrepStationTutorial, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000040, "Member 'WBP_PlacementHud_C_HandleShowPrepStationTutorial::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_PlacementHud.WBP_PlacementHud_C.S6OnVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlacementHud_C_S6OnVisibilityChanged final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementHud_C_S6OnVisibilityChanged) == 0x000001, "Wrong alignment on WBP_PlacementHud_C_S6OnVisibilityChanged");
static_assert(sizeof(WBP_PlacementHud_C_S6OnVisibilityChanged) == 0x000001, "Wrong size on WBP_PlacementHud_C_S6OnVisibilityChanged");
static_assert(offsetof(WBP_PlacementHud_C_S6OnVisibilityChanged, Param_IsVisible) == 0x000000, "Member 'WBP_PlacementHud_C_S6OnVisibilityChanged::Param_IsVisible' has a wrong offset!");

// Function WBP_PlacementHud.WBP_PlacementHud_C.ShouldShowCrafterPanels
// 0x0028 (0x0028 - 0x0000)
struct WBP_PlacementHud_C_ShouldShowCrafterPanels final
{
public:
	bool                                          ShouldShow;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153C[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalSkillCostOfPlaceable_TotalCost;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHousingPermissionLevel                       CallFunc_GetOccupiedHousingOwnershipActor_permissionLevel; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153D[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class AHousingOwnershipActor*           CallFunc_GetOccupiedHousingOwnershipActor_ReturnValue; // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementHud_C_ShouldShowCrafterPanels) == 0x000008, "Wrong alignment on WBP_PlacementHud_C_ShouldShowCrafterPanels");
static_assert(sizeof(WBP_PlacementHud_C_ShouldShowCrafterPanels) == 0x000028, "Wrong size on WBP_PlacementHud_C_ShouldShowCrafterPanels");
static_assert(offsetof(WBP_PlacementHud_C_ShouldShowCrafterPanels, ShouldShow) == 0x000000, "Member 'WBP_PlacementHud_C_ShouldShowCrafterPanels::ShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ShouldShowCrafterPanels, CallFunc_GetValeriaCharacter_OutResult) == 0x000001, "Member 'WBP_PlacementHud_C_ShouldShowCrafterPanels::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ShouldShowCrafterPanels, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_PlacementHud_C_ShouldShowCrafterPanels::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ShouldShowCrafterPanels, CallFunc_GetTotalSkillCostOfPlaceable_TotalCost) == 0x000010, "Member 'WBP_PlacementHud_C_ShouldShowCrafterPanels::CallFunc_GetTotalSkillCostOfPlaceable_TotalCost' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ShouldShowCrafterPanels, CallFunc_GetOccupiedHousingOwnershipActor_permissionLevel) == 0x000014, "Member 'WBP_PlacementHud_C_ShouldShowCrafterPanels::CallFunc_GetOccupiedHousingOwnershipActor_permissionLevel' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ShouldShowCrafterPanels, CallFunc_GetOccupiedHousingOwnershipActor_ReturnValue) == 0x000018, "Member 'WBP_PlacementHud_C_ShouldShowCrafterPanels::CallFunc_GetOccupiedHousingOwnershipActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ShouldShowCrafterPanels, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WBP_PlacementHud_C_ShouldShowCrafterPanels::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ShouldShowCrafterPanels, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_PlacementHud_C_ShouldShowCrafterPanels::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ShouldShowCrafterPanels, K2Node_SwitchEnum_CmpSuccess) == 0x000022, "Member 'WBP_PlacementHud_C_ShouldShowCrafterPanels::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_ShouldShowCrafterPanels, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'WBP_PlacementHud_C_ShouldShowCrafterPanels::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_PlacementHud.WBP_PlacementHud_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_PlacementHud_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlacementHud_C_Tick) == 0x000004, "Wrong alignment on WBP_PlacementHud_C_Tick");
static_assert(sizeof(WBP_PlacementHud_C_Tick) == 0x00003C, "Wrong size on WBP_PlacementHud_C_Tick");
static_assert(offsetof(WBP_PlacementHud_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_PlacementHud_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlacementHud_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_PlacementHud_C_Tick::InDeltaTime' has a wrong offset!");

}

