#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoginScreen_PF

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "S6Core_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoginScreen_PF.WBP_LoginScreen_PF_C
// 0x0078 (0x0488 - 0x0410)
class UWBP_LoginScreen_PF_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_Secondary_01_CM_C* Button_Back_CM;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WBP_TextButton_CM::UWBP_TextButton_CM_C* Button_CreateAccount;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Submit_CM;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CreateButtonTextBox;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Container;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeftArrow;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RightArrow;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_EditableTextBox_Styled*          PasswordInputBox;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Header;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_EditableTextBox_Styled*          UsernameInputBox;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnBackClick;                                       // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSubmitClick;                                     // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_LoginFlow_PF_Button_CreateAccount_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_LoginScreen_PF_Button_Back_CM_K2Node_ComponentBoundEvent_2_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_LoginScreen_PF_Button_Submit_CM_K2Node_ComponentBoundEvent_4_ButtonClicked__DelegateSignature();
	void BP_OnActivated();
	void ExecuteUbergraph_WBP_LoginScreen_PF(int32 EntryPoint, int32 CallFunc_AkEventGlobal_ReturnValue, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, class UWidget* CallFunc_GetDesiredFocusTarget_ReturnValue, ERedirectsPlatform CallFunc_GetPlatformType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, const class FString& CallFunc_SelectString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void OnBackClick__DelegateSignature();
	void OnSubmitClick__DelegateSignature();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoginScreen_PF_C">();
	}
	static class UWBP_LoginScreen_PF_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoginScreen_PF_C>();
	}
};
static_assert(alignof(UWBP_LoginScreen_PF_C) == 0x000008, "Wrong alignment on UWBP_LoginScreen_PF_C");
static_assert(sizeof(UWBP_LoginScreen_PF_C) == 0x000488, "Wrong size on UWBP_LoginScreen_PF_C");
static_assert(offsetof(UWBP_LoginScreen_PF_C, UberGraphFrame) == 0x000410, "Member 'UWBP_LoginScreen_PF_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, Button_Back_CM) == 0x000418, "Member 'UWBP_LoginScreen_PF_C::Button_Back_CM' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, Button_CreateAccount) == 0x000420, "Member 'UWBP_LoginScreen_PF_C::Button_CreateAccount' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, Button_Submit_CM) == 0x000428, "Member 'UWBP_LoginScreen_PF_C::Button_Submit_CM' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, CreateButtonTextBox) == 0x000430, "Member 'UWBP_LoginScreen_PF_C::CreateButtonTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, HBox_Container) == 0x000438, "Member 'UWBP_LoginScreen_PF_C::HBox_Container' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, Image_LeftArrow) == 0x000440, "Member 'UWBP_LoginScreen_PF_C::Image_LeftArrow' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, Image_RightArrow) == 0x000448, "Member 'UWBP_LoginScreen_PF_C::Image_RightArrow' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, PasswordInputBox) == 0x000450, "Member 'UWBP_LoginScreen_PF_C::PasswordInputBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, Text_Header) == 0x000458, "Member 'UWBP_LoginScreen_PF_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, UsernameInputBox) == 0x000460, "Member 'UWBP_LoginScreen_PF_C::UsernameInputBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, OnBackClick) == 0x000468, "Member 'UWBP_LoginScreen_PF_C::OnBackClick' has a wrong offset!");
static_assert(offsetof(UWBP_LoginScreen_PF_C, OnSubmitClick) == 0x000478, "Member 'UWBP_LoginScreen_PF_C::OnSubmitClick' has a wrong offset!");

}

