#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterContextMenuButton_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterContextMenuButton_CM.WBP_CharacterContextMenuButton_CM_C.BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterContextMenuButton_CM.WBP_CharacterContextMenuButton_CM_C.BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterContextMenuButton_CM_C_BndEvt__WBP_CharacterContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterContextMenuButton_CM.WBP_CharacterContextMenuButton_CM_C.ExecuteUbergraph_WBP_CharacterContextMenuButton_CM
// 0x0028 (0x0028 - 0x0000)
struct WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0018(0x0008)(NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM) == 0x000008, "Wrong alignment on WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM");
static_assert(sizeof(WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM) == 0x000028, "Wrong size on WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM, EntryPoint) == 0x000000, "Member 'WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM, Temp_bool_Variable) == 0x000004, "Member 'WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM, Temp_byte_Variable) == 0x000005, "Member 'WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM, K2Node_Event_IsDesignTime) == 0x000007, "Member 'WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM, K2Node_Event_InFocusEvent) == 0x000018, "Member 'WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM, K2Node_Select_Default) == 0x000020, "Member 'WBP_CharacterContextMenuButton_CM_C_ExecuteUbergraph_WBP_CharacterContextMenuButton_CM::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CharacterContextMenuButton_CM.WBP_CharacterContextMenuButton_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterContextMenuButton_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_CharacterContextMenuButton_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_CharacterContextMenuButton_CM_C_OnFocusLost");
static_assert(sizeof(WBP_CharacterContextMenuButton_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_CharacterContextMenuButton_CM_C_OnFocusLost");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_CharacterContextMenuButton_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_CharacterContextMenuButton_CM.WBP_CharacterContextMenuButton_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_CharacterContextMenuButton_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_CharacterContextMenuButton_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_CharacterContextMenuButton_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_CharacterContextMenuButton_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_CharacterContextMenuButton_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_CharacterContextMenuButton_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_CharacterContextMenuButton_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_CharacterContextMenuButton_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_CharacterContextMenuButton_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_CharacterContextMenuButton_CM.WBP_CharacterContextMenuButton_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterContextMenuButton_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterContextMenuButton_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CharacterContextMenuButton_CM_C_PreConstruct");
static_assert(sizeof(WBP_CharacterContextMenuButton_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_CharacterContextMenuButton_CM_C_PreConstruct");
static_assert(offsetof(WBP_CharacterContextMenuButton_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CharacterContextMenuButton_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

