#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DecoratedHeader

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_DecoratedHeader.WBP_DecoratedHeader_C.ExecuteUbergraph_WBP_DecoratedHeader
// 0x0008 (0x0008 - 0x0000)
struct WBP_DecoratedHeader_C_ExecuteUbergraph_WBP_DecoratedHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DecoratedHeader_C_ExecuteUbergraph_WBP_DecoratedHeader) == 0x000004, "Wrong alignment on WBP_DecoratedHeader_C_ExecuteUbergraph_WBP_DecoratedHeader");
static_assert(sizeof(WBP_DecoratedHeader_C_ExecuteUbergraph_WBP_DecoratedHeader) == 0x000008, "Wrong size on WBP_DecoratedHeader_C_ExecuteUbergraph_WBP_DecoratedHeader");
static_assert(offsetof(WBP_DecoratedHeader_C_ExecuteUbergraph_WBP_DecoratedHeader, EntryPoint) == 0x000000, "Member 'WBP_DecoratedHeader_C_ExecuteUbergraph_WBP_DecoratedHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DecoratedHeader_C_ExecuteUbergraph_WBP_DecoratedHeader, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_DecoratedHeader_C_ExecuteUbergraph_WBP_DecoratedHeader::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_DecoratedHeader.WBP_DecoratedHeader_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DecoratedHeader_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DecoratedHeader_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DecoratedHeader_C_PreConstruct");
static_assert(sizeof(WBP_DecoratedHeader_C_PreConstruct) == 0x000001, "Wrong size on WBP_DecoratedHeader_C_PreConstruct");
static_assert(offsetof(WBP_DecoratedHeader_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DecoratedHeader_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DecoratedHeader.WBP_DecoratedHeader_C.UpdateText
// 0x0018 (0x0018 - 0x0000)
struct WBP_DecoratedHeader_C_UpdateText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_DecoratedHeader_C_UpdateText) == 0x000008, "Wrong alignment on WBP_DecoratedHeader_C_UpdateText");
static_assert(sizeof(WBP_DecoratedHeader_C_UpdateText) == 0x000018, "Wrong size on WBP_DecoratedHeader_C_UpdateText");
static_assert(offsetof(WBP_DecoratedHeader_C_UpdateText, Text) == 0x000000, "Member 'WBP_DecoratedHeader_C_UpdateText::Text' has a wrong offset!");

}

