#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerSupportPopup_Pf

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerSupportPopup_Pf.WBP_PlayerSupportPopup_Pf_C.ExecuteUbergraph_WBP_PlayerSupportPopup_Pf
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Link;                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0018)()
	TDelegate<void(const class FString& Link)>    K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0108(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0120(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0138(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0188(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0198(0x0018)()
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf) == 0x000008, "Wrong alignment on WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf");
static_assert(sizeof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf) == 0x0001B8, "Wrong size on WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, EntryPoint) == 0x000000, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, K2Node_CustomEvent_Link) == 0x000018, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::K2Node_CustomEvent_Link' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, K2Node_MakeArray_Array) == 0x0000A0, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D8, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, K2Node_MakeArray_Array_1) == 0x0000E8, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, CallFunc_MakeLiteralString_ReturnValue) == 0x0000F8, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, CallFunc_Format_ReturnValue_1) == 0x000108, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000120, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, K2Node_MakeStruct_FormatArgumentData_1) == 0x000138, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, K2Node_MakeArray_Array_2) == 0x000188, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, CallFunc_Format_ReturnValue_2) == 0x000198, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf, CallFunc_AkEventGlobal_ReturnValue_1) == 0x0001B0, "Member 'WBP_PlayerSupportPopup_Pf_C_ExecuteUbergraph_WBP_PlayerSupportPopup_Pf::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");

// Function WBP_PlayerSupportPopup_Pf.WBP_PlayerSupportPopup_Pf_C.On Link Received
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerSupportPopup_Pf_C_On_Link_Received final
{
public:
	class FString                                 Link;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSupportPopup_Pf_C_On_Link_Received) == 0x000008, "Wrong alignment on WBP_PlayerSupportPopup_Pf_C_On_Link_Received");
static_assert(sizeof(WBP_PlayerSupportPopup_Pf_C_On_Link_Received) == 0x000010, "Wrong size on WBP_PlayerSupportPopup_Pf_C_On_Link_Received");
static_assert(offsetof(WBP_PlayerSupportPopup_Pf_C_On_Link_Received, Link) == 0x000000, "Member 'WBP_PlayerSupportPopup_Pf_C_On_Link_Received::Link' has a wrong offset!");

}

