#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ResetToDefault_Confirmation_PF

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ResetToDefault_Confirmation_PF.WBP_ResetToDefault_Confirmation_PF_C
// 0x0048 (0x05A0 - 0x0558)
class UWBP_ResetToDefault_Confirmation_PF_C final : public UVALUI_ModalWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                VALUI_TextBlock_Styled_62;                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_PopupSecondary_02_PF_C*   WBP_Template_PopupSecondary_02_PF;                 // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnConfirm;                                         // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCancel;                                          // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnWidgetClose;                                     // 0x0590(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_ResetToDefault_Confirmation_PF_WBP_Template_PopupSecondary_02_PF_K2Node_ComponentBoundEvent_0_Confirm__DelegateSignature();
	void BndEvt__WBP_ResetToDefault_Confirmation_PF_WBP_Template_PopupSecondary_02_PF_K2Node_ComponentBoundEvent_1_Cancel__DelegateSignature();
	void Destruct();
	void ExecuteUbergraph_WBP_ResetToDefault_Confirmation_PF(int32 EntryPoint, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue_1);
	void OnCancel__DelegateSignature();
	void OnConfirm__DelegateSignature();
	void OnWidgetClose__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ResetToDefault_Confirmation_PF_C">();
	}
	static class UWBP_ResetToDefault_Confirmation_PF_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ResetToDefault_Confirmation_PF_C>();
	}
};
static_assert(alignof(UWBP_ResetToDefault_Confirmation_PF_C) == 0x000008, "Wrong alignment on UWBP_ResetToDefault_Confirmation_PF_C");
static_assert(sizeof(UWBP_ResetToDefault_Confirmation_PF_C) == 0x0005A0, "Wrong size on UWBP_ResetToDefault_Confirmation_PF_C");
static_assert(offsetof(UWBP_ResetToDefault_Confirmation_PF_C, UberGraphFrame) == 0x000558, "Member 'UWBP_ResetToDefault_Confirmation_PF_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ResetToDefault_Confirmation_PF_C, VALUI_TextBlock_Styled_62) == 0x000560, "Member 'UWBP_ResetToDefault_Confirmation_PF_C::VALUI_TextBlock_Styled_62' has a wrong offset!");
static_assert(offsetof(UWBP_ResetToDefault_Confirmation_PF_C, WBP_Template_PopupSecondary_02_PF) == 0x000568, "Member 'UWBP_ResetToDefault_Confirmation_PF_C::WBP_Template_PopupSecondary_02_PF' has a wrong offset!");
static_assert(offsetof(UWBP_ResetToDefault_Confirmation_PF_C, OnConfirm) == 0x000570, "Member 'UWBP_ResetToDefault_Confirmation_PF_C::OnConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_ResetToDefault_Confirmation_PF_C, OnCancel) == 0x000580, "Member 'UWBP_ResetToDefault_Confirmation_PF_C::OnCancel' has a wrong offset!");
static_assert(offsetof(UWBP_ResetToDefault_Confirmation_PF_C, OnWidgetClose) == 0x000590, "Member 'UWBP_ResetToDefault_Confirmation_PF_C::OnWidgetClose' has a wrong offset!");

}

