#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerRegion

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ServerRegion.WBP_ServerRegion_C.UpdateRegion
// 0x0100 (0x0100 - 0x0000)
struct WBP_ServerRegion_C_UpdateRegion final
{
public:
	TMap<class FString, class FText>              Temp_string_Variable;                              // 0x0000(0x0050)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              K2Node_DynamicCast_AsVAL_Player_Controller_Base;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44FF[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0068(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4500[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
};
static_assert(alignof(WBP_ServerRegion_C_UpdateRegion) == 0x000008, "Wrong alignment on WBP_ServerRegion_C_UpdateRegion");
static_assert(sizeof(WBP_ServerRegion_C_UpdateRegion) == 0x000100, "Wrong size on WBP_ServerRegion_C_UpdateRegion");
static_assert(offsetof(WBP_ServerRegion_C_UpdateRegion, Temp_string_Variable) == 0x000000, "Member 'WBP_ServerRegion_C_UpdateRegion::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_UpdateRegion, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'WBP_ServerRegion_C_UpdateRegion::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_UpdateRegion, K2Node_DynamicCast_AsVAL_Player_Controller_Base) == 0x000058, "Member 'WBP_ServerRegion_C_UpdateRegion::K2Node_DynamicCast_AsVAL_Player_Controller_Base' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_UpdateRegion, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_ServerRegion_C_UpdateRegion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_UpdateRegion, CallFunc_Map_Find_Value) == 0x000068, "Member 'WBP_ServerRegion_C_UpdateRegion::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_UpdateRegion, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'WBP_ServerRegion_C_UpdateRegion::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_UpdateRegion, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'WBP_ServerRegion_C_UpdateRegion::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_UpdateRegion, K2Node_MakeArray_Array) == 0x0000D8, "Member 'WBP_ServerRegion_C_UpdateRegion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_UpdateRegion, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WBP_ServerRegion_C_UpdateRegion::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_ServerRegion.WBP_ServerRegion_C.HandleOnRegionUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerRegion_C_HandleOnRegionUpdated final
{
public:
	class FString                                 Region;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerRegion_C_HandleOnRegionUpdated) == 0x000008, "Wrong alignment on WBP_ServerRegion_C_HandleOnRegionUpdated");
static_assert(sizeof(WBP_ServerRegion_C_HandleOnRegionUpdated) == 0x000010, "Wrong size on WBP_ServerRegion_C_HandleOnRegionUpdated");
static_assert(offsetof(WBP_ServerRegion_C_HandleOnRegionUpdated, Region) == 0x000000, "Member 'WBP_ServerRegion_C_HandleOnRegionUpdated::Region' has a wrong offset!");

// Function WBP_ServerRegion.WBP_ServerRegion_C.ExecuteUbergraph_WBP_ServerRegion
// 0x0058 (0x0058 - 0x0000)
struct WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Region)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4501[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Region)>  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              K2Node_DynamicCast_AsVAL_Player_Controller_Base;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4502[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerControllerBase*              K2Node_DynamicCast_AsVAL_Player_Controller_Base_1; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion) == 0x000008, "Wrong alignment on WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion");
static_assert(sizeof(WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion) == 0x000058, "Wrong size on WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion");
static_assert(offsetof(WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion, EntryPoint) == 0x000000, "Member 'WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion, K2Node_DynamicCast_AsVAL_Player_Controller_Base) == 0x000030, "Member 'WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion::K2Node_DynamicCast_AsVAL_Player_Controller_Base' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000040, "Member 'WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion, K2Node_DynamicCast_AsVAL_Player_Controller_Base_1) == 0x000048, "Member 'WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion::K2Node_DynamicCast_AsVAL_Player_Controller_Base_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_ServerRegion_C_ExecuteUbergraph_WBP_ServerRegion::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

