#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PinRemoveConfirmModal_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PinRemoveConfirmModal_CM.WBP_PinRemoveConfirmModal_CM_C
// 0x0068 (0x05C0 - 0x0558)
class UWBP_PinRemoveConfirmModal_CM_C final : public UVALUI_ModalWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                RemoveInfoText;                                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                VALUI_TextBlock_ChangePlot_PlotName;               // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Popup_01_CM_C*            WBP_Template_Popup_ChangePlotLoad;                 // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGearComponent*                         GearComponent;                                     // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UGearSlotTypeConfig*                    SlotType;                                          // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FBagSlotLocation                       DesiredSlot;                                       // 0x0588(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	int32                                         IndexWithinType;                                   // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_50F0[0x4];                                     // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSlotFocused;                                     // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWidget*                                FocusWidget;                                       // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPinPopupClosed;                                  // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_PinRemoveConfirmModal_CM_WBP_Template_Popup_ChangePlotLoad_K2Node_ComponentBoundEvent_0_Confirm__DelegateSignature();
	void BndEvt__WBP_PinRemoveConfirmModal_CM_WBP_Template_Popup_ChangePlotLoad_K2Node_ComponentBoundEvent_1_Cancel__DelegateSignature();
	bool BP_OnHandleBackAction();
	void Close();
	void Construct();
	void ExecuteUbergraph_WBP_PinRemoveConfirmModal_CM(int32 EntryPoint, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, class UInputAction* Temp_object_Variable, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, double Temp_real_Variable, double Temp_real_Variable_1, double Temp_real_Variable_0, double Temp_real_Variable_1_0, bool Temp_bool_Variable, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, const struct FValeriaItem& CallFunc_GetGearBySlotType_ReturnValue, class UObject* CallFunc_LoadAsset_Blocking_ReturnValue, class UVAL_ItemTypeDefinitionAsset* K2Node_DynamicCast_AsItem_Type_Definition, bool K2Node_DynamicCast_bSuccess, EValeriaFuncResult CallFunc_GetVillagerCoreDataTableRow_OutResult, const struct FVillagerCoreConfig& CallFunc_GetVillagerCoreDataTableRow_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue);
	void InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnPinPopupClosed__DelegateSignature();
	void OnSlotFocused__DelegateSignature(class UWidget* Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PinRemoveConfirmModal_CM_C">();
	}
	static class UWBP_PinRemoveConfirmModal_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PinRemoveConfirmModal_CM_C>();
	}
};
static_assert(alignof(UWBP_PinRemoveConfirmModal_CM_C) == 0x000008, "Wrong alignment on UWBP_PinRemoveConfirmModal_CM_C");
static_assert(sizeof(UWBP_PinRemoveConfirmModal_CM_C) == 0x0005C0, "Wrong size on UWBP_PinRemoveConfirmModal_CM_C");
static_assert(offsetof(UWBP_PinRemoveConfirmModal_CM_C, UberGraphFrame) == 0x000558, "Member 'UWBP_PinRemoveConfirmModal_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PinRemoveConfirmModal_CM_C, RemoveInfoText) == 0x000560, "Member 'UWBP_PinRemoveConfirmModal_CM_C::RemoveInfoText' has a wrong offset!");
static_assert(offsetof(UWBP_PinRemoveConfirmModal_CM_C, VALUI_TextBlock_ChangePlot_PlotName) == 0x000568, "Member 'UWBP_PinRemoveConfirmModal_CM_C::VALUI_TextBlock_ChangePlot_PlotName' has a wrong offset!");
static_assert(offsetof(UWBP_PinRemoveConfirmModal_CM_C, WBP_Template_Popup_ChangePlotLoad) == 0x000570, "Member 'UWBP_PinRemoveConfirmModal_CM_C::WBP_Template_Popup_ChangePlotLoad' has a wrong offset!");
static_assert(offsetof(UWBP_PinRemoveConfirmModal_CM_C, GearComponent) == 0x000578, "Member 'UWBP_PinRemoveConfirmModal_CM_C::GearComponent' has a wrong offset!");
static_assert(offsetof(UWBP_PinRemoveConfirmModal_CM_C, SlotType) == 0x000580, "Member 'UWBP_PinRemoveConfirmModal_CM_C::SlotType' has a wrong offset!");
static_assert(offsetof(UWBP_PinRemoveConfirmModal_CM_C, DesiredSlot) == 0x000588, "Member 'UWBP_PinRemoveConfirmModal_CM_C::DesiredSlot' has a wrong offset!");
static_assert(offsetof(UWBP_PinRemoveConfirmModal_CM_C, IndexWithinType) == 0x000590, "Member 'UWBP_PinRemoveConfirmModal_CM_C::IndexWithinType' has a wrong offset!");
static_assert(offsetof(UWBP_PinRemoveConfirmModal_CM_C, OnSlotFocused) == 0x000598, "Member 'UWBP_PinRemoveConfirmModal_CM_C::OnSlotFocused' has a wrong offset!");
static_assert(offsetof(UWBP_PinRemoveConfirmModal_CM_C, FocusWidget) == 0x0005A8, "Member 'UWBP_PinRemoveConfirmModal_CM_C::FocusWidget' has a wrong offset!");
static_assert(offsetof(UWBP_PinRemoveConfirmModal_CM_C, OnPinPopupClosed) == 0x0005B0, "Member 'UWBP_PinRemoveConfirmModal_CM_C::OnPinPopupClosed' has a wrong offset!");

}

