#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FTUEFlagListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FTUEFlagListEntry.WBP_FTUEFlagListEntry_C
// 0x0038 (0x0320 - 0x02E8)
class UWBP_FTUEFlagListEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_Border_Styled*                   Border_Highlight;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FlagSeen;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_DisplayName;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVAL_TutorialFlagDefinition*            FTUEFlagDefinition;                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFocused;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_FTUEFlagListEntry(int32 EntryPoint, bool K2Node_Event_bIsExpanded, bool K2Node_Event_bIsSelected, class UObject* K2Node_Event_ListItemObject, class UVAL_TutorialFlagDefinition* K2Node_DynamicCast_AsVAL_Tutorial_Flag_Definition, bool K2Node_DynamicCast_bSuccess);
	void OnFocused__DelegateSignature();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void SynchronizeState(float Temp_real_Variable, bool Temp_bool_Variable, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, float Temp_real_Variable_1, const TSet<TSoftObjectPtr<class UVAL_TutorialFlagDefinition>>& CallFunc_GetAllSetFlags_ReturnValue, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush_1, bool Temp_bool_Variable_1, TSoftObjectPtr<class UVAL_TutorialFlagDefinition> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue, bool CallFunc_Set_Contains_ReturnValue, struct FSlateBrush& K2Node_Select_Default, float K2Node_Select_Default_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FTUEFlagListEntry_C">();
	}
	static class UWBP_FTUEFlagListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FTUEFlagListEntry_C>();
	}
};
static_assert(alignof(UWBP_FTUEFlagListEntry_C) == 0x000008, "Wrong alignment on UWBP_FTUEFlagListEntry_C");
static_assert(sizeof(UWBP_FTUEFlagListEntry_C) == 0x000320, "Wrong size on UWBP_FTUEFlagListEntry_C");
static_assert(offsetof(UWBP_FTUEFlagListEntry_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_FTUEFlagListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FTUEFlagListEntry_C, Border_Highlight) == 0x0002F0, "Member 'UWBP_FTUEFlagListEntry_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_FTUEFlagListEntry_C, Image_FlagSeen) == 0x0002F8, "Member 'UWBP_FTUEFlagListEntry_C::Image_FlagSeen' has a wrong offset!");
static_assert(offsetof(UWBP_FTUEFlagListEntry_C, TextBlock_DisplayName) == 0x000300, "Member 'UWBP_FTUEFlagListEntry_C::TextBlock_DisplayName' has a wrong offset!");
static_assert(offsetof(UWBP_FTUEFlagListEntry_C, FTUEFlagDefinition) == 0x000308, "Member 'UWBP_FTUEFlagListEntry_C::FTUEFlagDefinition' has a wrong offset!");
static_assert(offsetof(UWBP_FTUEFlagListEntry_C, OnFocused) == 0x000310, "Member 'UWBP_FTUEFlagListEntry_C::OnFocused' has a wrong offset!");

}

