#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cooking_ShelvedIngredient

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Cooking_ShelvedIngredient.WBP_Cooking_ShelvedIngredient_C.UpdateShelvedIngredientState
// 0x0030 (0x0030 - 0x0000)
struct WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState final
{
public:
	class UTexture2D*                             NewFoodIcon;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StarQuality;                                       // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B82[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState) == 0x000008, "Wrong alignment on WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState");
static_assert(sizeof(WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState) == 0x000030, "Wrong size on WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState");
static_assert(offsetof(WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState, NewFoodIcon) == 0x000000, "Member 'WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState::NewFoodIcon' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState, Count) == 0x000008, "Member 'WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState::Count' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState, StarQuality) == 0x00000C, "Member 'WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState::StarQuality' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState, Temp_byte_Variable) == 0x00000D, "Member 'WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState, Temp_byte_Variable_1) == 0x000029, "Member 'WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState, Temp_bool_Variable) == 0x00002A, "Member 'WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState, K2Node_Select_Default) == 0x00002B, "Member 'WBP_Cooking_ShelvedIngredient_C_UpdateShelvedIngredientState::K2Node_Select_Default' has a wrong offset!");

}

