#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PMenuTabButton_Icon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PMenuTabButton_Icon.WBP_PMenuTabButton_Icon_C
// 0x0040 (0x0300 - 0x02C0)
class UWBP_PMenuTabButton_Icon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Icon;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Main;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BoundInputActionStateIndicator_C*  WBP_BoundInputActionStateIndicator;                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        FixedWidth;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        FixedHeight;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UInputAction*                           InputAction;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PMenuTabButton_Icon(int32 EntryPoint, bool K2Node_Event_IsDesignTime, float CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast, float CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PMenuTabButton_Icon_C">();
	}
	static class UWBP_PMenuTabButton_Icon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PMenuTabButton_Icon_C>();
	}
};
static_assert(alignof(UWBP_PMenuTabButton_Icon_C) == 0x000008, "Wrong alignment on UWBP_PMenuTabButton_Icon_C");
static_assert(sizeof(UWBP_PMenuTabButton_Icon_C) == 0x000300, "Wrong size on UWBP_PMenuTabButton_Icon_C");
static_assert(offsetof(UWBP_PMenuTabButton_Icon_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_PMenuTabButton_Icon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PMenuTabButton_Icon_C, Image_Icon) == 0x0002C8, "Member 'UWBP_PMenuTabButton_Icon_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_PMenuTabButton_Icon_C, SizeBox_Main) == 0x0002D0, "Member 'UWBP_PMenuTabButton_Icon_C::SizeBox_Main' has a wrong offset!");
static_assert(offsetof(UWBP_PMenuTabButton_Icon_C, WBP_BoundInputActionStateIndicator) == 0x0002D8, "Member 'UWBP_PMenuTabButton_Icon_C::WBP_BoundInputActionStateIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_PMenuTabButton_Icon_C, FixedWidth) == 0x0002E0, "Member 'UWBP_PMenuTabButton_Icon_C::FixedWidth' has a wrong offset!");
static_assert(offsetof(UWBP_PMenuTabButton_Icon_C, FixedHeight) == 0x0002E8, "Member 'UWBP_PMenuTabButton_Icon_C::FixedHeight' has a wrong offset!");
static_assert(offsetof(UWBP_PMenuTabButton_Icon_C, InputAction) == 0x0002F0, "Member 'UWBP_PMenuTabButton_Icon_C::InputAction' has a wrong offset!");
static_assert(offsetof(UWBP_PMenuTabButton_Icon_C, Icon) == 0x0002F8, "Member 'UWBP_PMenuTabButton_Icon_C::Icon' has a wrong offset!");

}

