#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerCharacterInspectionCard_CM

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerCharacterInspectionCard_CM.WBP_PlayerCharacterInspectionCard_CM_C
// 0x0280 (0x0790 - 0x0510)
class UWBP_PlayerCharacterInspectionCard_CM_C final : public UCommonActivatableWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               Box_Loaded;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Box_Loading;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_Back;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Primary_Block;                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Primary_Report;                             // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Primary_Unblock;                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_NoGuild;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DecoratedHeader_C*                 Header_Crafting;                                   // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DecoratedHeader_C*                 Header_Neighborhood;                               // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DecoratedHeader_C*                 Header_Profession;                                 // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_BlockButton;                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Buttons;                             // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Blocked;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Button;                                   // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_GuildInfo;                                // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Root;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_CharacterName;                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_CharacterTitle;                          // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_GuildDescription;                        // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_GuildDescription_Label;                  // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_GuildMemberCount;                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_GuildMemberCount_Label;                  // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_GuildMotto;                              // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_GuildMotto_Label;                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_GuildName_1;                             // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_MapName;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_HasGuild_1;                                   // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AnimatedLoading_C*                 WBP_Loading;                                       // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerCharacterProfileImage_CM_C*  WBP_PlayerCharacterProfileImage_CM;                // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0600(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bKnowOurGuildId;                                   // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5660[0x3];                                     // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  OurGuildId;                                        // 0x0634(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bKnowTheirGuildId;                                 // 0x0644(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5661[0x3];                                     // 0x0645(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  TheirGuildId;                                      // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bKnowOurGuildRole;                                 // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_PlayerGuildMemberRole                    OurRole;                                           // 0x0659(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bKnowTheirGuildRole;                               // 0x065A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_PlayerGuildMemberRole                    TheirRole;                                         // 0x065B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bKnowTheirGuildInfo;                               // 0x065C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5662[0x3];                                     // 0x065D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PlayerGuild                       TheirGuildInfo;                                    // 0x0660(0x0118)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnBackButtonClicked;                               // 0x0778(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsButtonBlockVisible;                             // 0x0788(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Create_New_Widget;                                 // 0x0789(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewWidgetCreated;                                  // 0x078A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PlayerCharacterInspectionCard_CM_Block_K2Node_ComponentBoundEvent_2_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_PlayerCharacterInspectionCard_CM_Button_Primary_Report_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_PlayerCharacterInspectionCard_CM_Unblcok_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_PlayerCharacterInspectionCard_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_PlayerCharacterInspectionCard_CM(int32 EntryPoint, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, bool Temp_bool_Variable, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, int32 CallFunc_Array_Length_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, const struct FGuid& Temp_struct_Variable, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FOSSVAL_CharacterNameAndId>& Temp_struct_Variable_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, struct FGuid& K2Node_CustomEvent_AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& K2Node_CustomEvent_Names, bool CallFunc_IsValid_Guid_ReturnValue, bool CallFunc_IsValid_Guid_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_IsValid_Guid_ReturnValue_2, TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate, struct FGuid& K2Node_CustomEvent_AccountId_1, const struct FGuid& CallFunc_GetAccountId_ReturnValue, class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue, TDelegate<void(struct FGuid& AccountId)> K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, TDelegate<void(struct FUniqueNetIdRepl& BlockedNetId, bool bBlocked)> K2Node_CreateDelegate_OutputDelegate_2, TDelegate<void(struct FUniqueNetIdRepl& BlockedNetId, bool bBlocked)> K2Node_CreateDelegate_OutputDelegate_3, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UWBP_Block_ModalDialogue_CM_C* CallFunc_Create_ReturnValue, class UWBP_Block_ModalDialogue_PF_C* CallFunc_Create_ReturnValue_1, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, uint8 CallFunc_MakeLiteralByte_ReturnValue, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, class UWidget* CallFunc_GetActiveWidget_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_IsVisible_ReturnValue, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class UWBP_ReportPlayerModalDialog_CM_C* CallFunc_Create_ReturnValue_2, class UWBP_ReportPlayerModalDialog_PF_C* CallFunc_Create_ReturnValue_3, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue_1, bool CallFunc_IsConsole_ReturnValue, uint8 CallFunc_MakeLiteralByte_ReturnValue_1, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_3, EVAL_SocialBlockError CallFunc_RequestBlockUser_ReturnValue, const TMap<class FName, class FText>& Temp_name_Variable, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_4, class UWidget* CallFunc_GetActiveWidget_ReturnValue_1, const struct FPresence& CallFunc_GetPresenceForUserId_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, class FName CallFunc_Conv_StringToName_ReturnValue, class FText CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_5, bool CallFunc_IsUserBlocked_ReturnValue, bool CallFunc_EqualEqual_ReturnValue, bool CallFunc_IsDesktop_ReturnValue, ESlateVisibility K2Node_Select_Default, bool CallFunc_IsConsole_ReturnValue_1, bool CallFunc_IsDesktop_ReturnValue_1, uint8 CallFunc_MakeLiteralByte_ReturnValue_2, uint8 CallFunc_MakeLiteralByte_ReturnValue_3, TScriptInterface<class IBPI_SubWidgetFocusable_C> CallFunc_OnWidgetCreated_self_CastInput, TScriptInterface<class IBPI_SubWidgetFocusable_C> CallFunc_OnWidgetCreated_self_CastInput_1);
	void HandeQueryOurUserMembershipFailed(const class FString& ErrorMessage);
	void HandeQueryOurUserMembershipSucceeded(bool bHasMembership, const struct FVAL_PlayerGuild& PlayerGuild);
	void HandeQueryTheirUserMembershipFailed(const class FString& ErrorMessage);
	void HandeQueryTheirUserMembershipSucceeded(bool bHasMembership, const struct FVAL_PlayerGuild& PlayerGuild);
	void HandleOnCharacterBlocked(struct FUniqueNetIdRepl& BlockedNetId, bool bBlocked, bool CallFunc_EqualEqual_ReturnValue);
	void HandleQueryOurPlayerGuildRosterSucceeded(const struct FVAL_PlayerGuild& PlayerGuild);
	void OnBackButtonClicked__DelegateSignature(class UWBP_PlayerCharacterInspectionCard_CM_C* CharacterCardWidget);
	void OnFailure_E68A415549054C67A3D2F2AC1DE76C48(struct FGuid& AccountId);
	void OnSubWidgetClosed(bool FocusedParentWidget, bool Param_NewWidgetCreated);
	void OnSuccess_E68A415549054C67A3D2F2AC1DE76C48(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names);
	void OnVisibilityChangedEvent(ESlateVisibility InVisibility);
	void OnWidgetCreated(class UWidget* ParentWidget, class UWidget* ParentFocusedWidget);
	void SetUser(const struct FUniqueNetIdRepl& Param_UserId, TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(bool bHasMembership, const struct FVAL_PlayerGuild& PlayerGuild)> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate_2, TDelegate<void(bool bHasMembership, const struct FVAL_PlayerGuild& PlayerGuild)> K2Node_CreateDelegate_OutputDelegate_3, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2);
	void UpdateOurPlayerGuildRoster(const struct FVAL_PlayerGuild& PlayerGuild, class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, EVAL_PlayerGuildMemberRole CallFunc_TryGetRoleForUserId_OutRole, bool CallFunc_TryGetRoleForUserId_ReturnValue);
	void UpdateState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerCharacterInspectionCard_CM_C">();
	}
	static class UWBP_PlayerCharacterInspectionCard_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerCharacterInspectionCard_CM_C>();
	}
};
static_assert(alignof(UWBP_PlayerCharacterInspectionCard_CM_C) == 0x000008, "Wrong alignment on UWBP_PlayerCharacterInspectionCard_CM_C");
static_assert(sizeof(UWBP_PlayerCharacterInspectionCard_CM_C) == 0x000790, "Wrong size on UWBP_PlayerCharacterInspectionCard_CM_C");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, UberGraphFrame) == 0x000510, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Box_Loaded) == 0x000518, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Box_Loaded' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Box_Loading) == 0x000520, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Box_Loading' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Button_Back) == 0x000528, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Button_Primary_Block) == 0x000530, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Button_Primary_Block' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Button_Primary_Report) == 0x000538, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Button_Primary_Report' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Button_Primary_Unblock) == 0x000540, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Button_Primary_Unblock' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, HBox_NoGuild) == 0x000548, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::HBox_NoGuild' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Header_Crafting) == 0x000550, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Header_Crafting' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Header_Neighborhood) == 0x000558, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Header_Neighborhood' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Header_Profession) == 0x000560, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Header_Profession' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, HorizontalBox_BlockButton) == 0x000568, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::HorizontalBox_BlockButton' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, HorizontalBox_Buttons) == 0x000570, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::HorizontalBox_Buttons' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Spacer_Blocked) == 0x000578, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Spacer_Blocked' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Switcher_Button) == 0x000580, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Switcher_Button' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Switcher_GuildInfo) == 0x000588, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Switcher_GuildInfo' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Switcher_Root) == 0x000590, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Switcher_Root' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TextBlock_CharacterName) == 0x000598, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TextBlock_CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TextBlock_CharacterTitle) == 0x0005A0, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TextBlock_CharacterTitle' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TextBlock_GuildDescription) == 0x0005A8, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TextBlock_GuildDescription' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TextBlock_GuildDescription_Label) == 0x0005B0, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TextBlock_GuildDescription_Label' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TextBlock_GuildMemberCount) == 0x0005B8, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TextBlock_GuildMemberCount' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TextBlock_GuildMemberCount_Label) == 0x0005C0, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TextBlock_GuildMemberCount_Label' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TextBlock_GuildMotto) == 0x0005C8, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TextBlock_GuildMotto' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TextBlock_GuildMotto_Label) == 0x0005D0, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TextBlock_GuildMotto_Label' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TextBlock_GuildName_1) == 0x0005D8, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TextBlock_GuildName_1' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TextBlock_MapName) == 0x0005E0, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TextBlock_MapName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, VBox_HasGuild_1) == 0x0005E8, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::VBox_HasGuild_1' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, WBP_Loading) == 0x0005F0, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::WBP_Loading' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, WBP_PlayerCharacterProfileImage_CM) == 0x0005F8, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::WBP_PlayerCharacterProfileImage_CM' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, UserId) == 0x000600, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::UserId' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, bKnowOurGuildId) == 0x000630, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::bKnowOurGuildId' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, OurGuildId) == 0x000634, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::OurGuildId' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, bKnowTheirGuildId) == 0x000644, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::bKnowTheirGuildId' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TheirGuildId) == 0x000648, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TheirGuildId' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, bKnowOurGuildRole) == 0x000658, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::bKnowOurGuildRole' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, OurRole) == 0x000659, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::OurRole' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, bKnowTheirGuildRole) == 0x00065A, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::bKnowTheirGuildRole' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TheirRole) == 0x00065B, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TheirRole' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, bKnowTheirGuildInfo) == 0x00065C, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::bKnowTheirGuildInfo' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, TheirGuildInfo) == 0x000660, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::TheirGuildInfo' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, OnBackButtonClicked) == 0x000778, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::OnBackButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, bIsButtonBlockVisible) == 0x000788, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::bIsButtonBlockVisible' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, Create_New_Widget) == 0x000789, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::Create_New_Widget' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerCharacterInspectionCard_CM_C, NewWidgetCreated) == 0x00078A, "Member 'UWBP_PlayerCharacterInspectionCard_CM_C::NewWidgetCreated' has a wrong offset!");

}

