#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_OpenContextMenuButton_CM

#include "Basic.hpp"

#include "F_CommonUIButtonPrompt_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C.BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C.BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Social_OpenContextMenuButton_CM_C_BndEvt__WBP_Social_OpenContextMenuButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C.CloseContextMenu
// 0x0003 (0x0003 - 0x0000)
struct WBP_Social_OpenContextMenuButton_CM_C_CloseContextMenu final
{
public:
	bool                                          bIsNeedFocuse;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_OpenContextMenuButton_CM_C_CloseContextMenu) == 0x000001, "Wrong alignment on WBP_Social_OpenContextMenuButton_CM_C_CloseContextMenu");
static_assert(sizeof(WBP_Social_OpenContextMenuButton_CM_C_CloseContextMenu) == 0x000003, "Wrong size on WBP_Social_OpenContextMenuButton_CM_C_CloseContextMenu");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_CloseContextMenu, bIsNeedFocuse) == 0x000000, "Member 'WBP_Social_OpenContextMenuButton_CM_C_CloseContextMenu::bIsNeedFocuse' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_CloseContextMenu, CallFunc_IsOpen_ReturnValue) == 0x000001, "Member 'WBP_Social_OpenContextMenuButton_CM_C_CloseContextMenu::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_CloseContextMenu, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'WBP_Social_OpenContextMenuButton_CM_C_CloseContextMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C.ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42AD[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42AE[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42AF[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_UserId;                         // 0x0018(0x0030)(HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x0050(0x0030)(HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* MenuContent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42B0[0x2];                                     // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00A4(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM) == 0x000008, "Wrong alignment on WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM");
static_assert(sizeof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM) == 0x0000B0, "Wrong size on WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, EntryPoint) == 0x000000, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, Temp_bool_Variable) == 0x000004, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, Temp_byte_Variable) == 0x000005, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000008, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000010, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, K2Node_CustomEvent_UserId) == 0x000018, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::K2Node_CustomEvent_UserId' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000048, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, CallFunc_GetNetId_ReturnValue) == 0x000050, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::CallFunc_GetNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000090, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, K2Node_ComponentBoundEvent_Button) == 0x000098, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, CallFunc_EqualEqual_ReturnValue) == 0x0000A0, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::CallFunc_EqualEqual_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, K2Node_Select_Default) == 0x0000A1, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM, K2Node_Event_InFocusEvent) == 0x0000A4, "Member 'WBP_Social_OpenContextMenuButton_CM_C_ExecuteUbergraph_WBP_Social_OpenContextMenuButton_CM::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C.Handle on Menu Button Pressed
// 0x0010 (0x0010 - 0x0000)
struct WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed final
{
public:
	class UWBP_Social_CharacterContextMenu_CM_C*  ContentWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNeedFocuse;                                     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed) == 0x000008, "Wrong alignment on WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed");
static_assert(sizeof(WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed) == 0x000010, "Wrong size on WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed, ContentWidget) == 0x000000, "Member 'WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed::ContentWidget' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed, bIsNeedFocuse) == 0x000008, "Member 'WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed::bIsNeedFocuse' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed, CallFunc_IsOpen_ReturnValue) == 0x000009, "Member 'WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'WBP_Social_OpenContextMenuButton_CM_C_Handle_on_Menu_Button_Pressed::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C.HandleOnMenuContextCreated
// 0x0038 (0x0038 - 0x0000)
struct WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated final
{
public:
	class UUserWidget*                            MenuContent;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Social_CharacterContextMenu_CM_C*  K2Node_DynamicCast_AsWBP_Social_Character_Context_Menu_CM; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42B1[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Social_CharacterContextMenu_CM_C* ContentWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated) == 0x000008, "Wrong alignment on WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated");
static_assert(sizeof(WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated) == 0x000038, "Wrong size on WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated, MenuContent) == 0x000000, "Member 'WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated::MenuContent' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated, K2Node_DynamicCast_AsWBP_Social_Character_Context_Menu_CM) == 0x000008, "Member 'WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated::K2Node_DynamicCast_AsWBP_Social_Character_Context_Menu_CM' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_Social_OpenContextMenuButton_CM_C_HandleOnMenuContextCreated::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_OpenContextMenuButton_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_Social_OpenContextMenuButton_CM_C_OnFocusLost");
static_assert(sizeof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_Social_OpenContextMenuButton_CM_C_OnFocusLost");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_Social_OpenContextMenuButton_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C.OnFocusReceived
// 0x0240 (0x0240 - 0x0000)
struct WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt;          // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt_1;        // 0x0138(0x0040)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0178(0x00B8)()
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived) == 0x000240, "Wrong size on WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived, K2Node_MakeStruct_F_CommonUIButtonPrompt) == 0x0000F8, "Member 'WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived::K2Node_MakeStruct_F_CommonUIButtonPrompt' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived, K2Node_MakeStruct_F_CommonUIButtonPrompt_1) == 0x000138, "Member 'WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived::K2Node_MakeStruct_F_CommonUIButtonPrompt_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000178, "Member 'WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived, K2Node_MakeArray_Array) == 0x000230, "Member 'WBP_Social_OpenContextMenuButton_CM_C_OnFocusReceived::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Social_OpenContextMenuButton_CM_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Social_OpenContextMenuButton_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_OpenContextMenuButton_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_Social_OpenContextMenuButton_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_Social_OpenContextMenuButton_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Social_OpenContextMenuButton_CM_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_Social_OpenContextMenuButton_CM_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

// Function WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C.OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_OpenContextMenuButton_CM_C_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_Social_CharacterContextMenu_CM_C*  ContextMenuWidget;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_OpenContextMenuButton_CM_C_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_OpenContextMenuButton_CM_C_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_Social_OpenContextMenuButton_CM_C_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_Social_OpenContextMenuButton_CM_C_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_OnMenuOpened__DelegateSignature, ContextMenuWidget) == 0x000000, "Member 'WBP_Social_OpenContextMenuButton_CM_C_OnMenuOpened__DelegateSignature::ContextMenuWidget' has a wrong offset!");

// Function WBP_Social_OpenContextMenuButton_CM.WBP_Social_OpenContextMenuButton_CM_C.SetUserId
// 0x0030 (0x0030 - 0x0000)
struct WBP_Social_OpenContextMenuButton_CM_C_SetUserId final
{
public:
	struct FUniqueNetIdRepl                       Param_UserId;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_OpenContextMenuButton_CM_C_SetUserId) == 0x000008, "Wrong alignment on WBP_Social_OpenContextMenuButton_CM_C_SetUserId");
static_assert(sizeof(WBP_Social_OpenContextMenuButton_CM_C_SetUserId) == 0x000030, "Wrong size on WBP_Social_OpenContextMenuButton_CM_C_SetUserId");
static_assert(offsetof(WBP_Social_OpenContextMenuButton_CM_C_SetUserId, Param_UserId) == 0x000000, "Member 'WBP_Social_OpenContextMenuButton_CM_C_SetUserId::Param_UserId' has a wrong offset!");

}

