#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SearchBarButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SearchBarButton.WBP_SearchBarButton_C.BndEvt__WBP_SearchBarButton_VALUI_EditableText_Styled_50_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_SearchBarButton_C_BndEvt__WBP_SearchBarButton_VALUI_EditableText_Styled_50_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SearchBarButton_C_BndEvt__WBP_SearchBarButton_VALUI_EditableText_Styled_50_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SearchBarButton_C_BndEvt__WBP_SearchBarButton_VALUI_EditableText_Styled_50_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_SearchBarButton_C_BndEvt__WBP_SearchBarButton_VALUI_EditableText_Styled_50_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_SearchBarButton_C_BndEvt__WBP_SearchBarButton_VALUI_EditableText_Styled_50_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_SearchBarButton_C_BndEvt__WBP_SearchBarButton_VALUI_EditableText_Styled_50_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_SearchBarButton_C_BndEvt__WBP_SearchBarButton_VALUI_EditableText_Styled_50_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_SearchBarButton.WBP_SearchBarButton_C.ExecuteUbergraph_WBP_SearchBarButton
// 0x0028 (0x0028 - 0x0000)
struct WBP_SearchBarButton_C_ExecuteUbergraph_WBP_SearchBarButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ED9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)(ConstParm)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SearchBarButton_C_ExecuteUbergraph_WBP_SearchBarButton) == 0x000008, "Wrong alignment on WBP_SearchBarButton_C_ExecuteUbergraph_WBP_SearchBarButton");
static_assert(sizeof(WBP_SearchBarButton_C_ExecuteUbergraph_WBP_SearchBarButton) == 0x000028, "Wrong size on WBP_SearchBarButton_C_ExecuteUbergraph_WBP_SearchBarButton");
static_assert(offsetof(WBP_SearchBarButton_C_ExecuteUbergraph_WBP_SearchBarButton, EntryPoint) == 0x000000, "Member 'WBP_SearchBarButton_C_ExecuteUbergraph_WBP_SearchBarButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SearchBarButton_C_ExecuteUbergraph_WBP_SearchBarButton, K2Node_ComponentBoundEvent_Text) == 0x000008, "Member 'WBP_SearchBarButton_C_ExecuteUbergraph_WBP_SearchBarButton::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_SearchBarButton_C_ExecuteUbergraph_WBP_SearchBarButton, CallFunc_AkEventGlobal_ReturnValue) == 0x000020, "Member 'WBP_SearchBarButton_C_ExecuteUbergraph_WBP_SearchBarButton::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");

// Function WBP_SearchBarButton.WBP_SearchBarButton_C.GetSearchText
// 0x0030 (0x0030 - 0x0000)
struct WBP_SearchBarButton_C_GetSearchText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0018(0x0018)()
};
static_assert(alignof(WBP_SearchBarButton_C_GetSearchText) == 0x000008, "Wrong alignment on WBP_SearchBarButton_C_GetSearchText");
static_assert(sizeof(WBP_SearchBarButton_C_GetSearchText) == 0x000030, "Wrong size on WBP_SearchBarButton_C_GetSearchText");
static_assert(offsetof(WBP_SearchBarButton_C_GetSearchText, Text) == 0x000000, "Member 'WBP_SearchBarButton_C_GetSearchText::Text' has a wrong offset!");
static_assert(offsetof(WBP_SearchBarButton_C_GetSearchText, CallFunc_GetText_ReturnValue) == 0x000018, "Member 'WBP_SearchBarButton_C_GetSearchText::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function WBP_SearchBarButton.WBP_SearchBarButton_C.Handle Cancel Search
// 0x0020 (0x0020 - 0x0000)
struct WBP_SearchBarButton_C_Handle_Cancel_Search final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EDA[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SearchBarButton_C_Handle_Cancel_Search) == 0x000008, "Wrong alignment on WBP_SearchBarButton_C_Handle_Cancel_Search");
static_assert(sizeof(WBP_SearchBarButton_C_Handle_Cancel_Search) == 0x000020, "Wrong size on WBP_SearchBarButton_C_Handle_Cancel_Search");
static_assert(offsetof(WBP_SearchBarButton_C_Handle_Cancel_Search, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_SearchBarButton_C_Handle_Cancel_Search::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SearchBarButton_C_Handle_Cancel_Search, CallFunc_AkEventGlobal_ReturnValue) == 0x000010, "Member 'WBP_SearchBarButton_C_Handle_Cancel_Search::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SearchBarButton_C_Handle_Cancel_Search, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'WBP_SearchBarButton_C_Handle_Cancel_Search::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_SearchBarButton.WBP_SearchBarButton_C.Handle Start Search
// 0x0010 (0x0010 - 0x0000)
struct WBP_SearchBarButton_C_Handle_Start_Search final
{
public:
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EDB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SearchBarButton_C_Handle_Start_Search) == 0x000008, "Wrong alignment on WBP_SearchBarButton_C_Handle_Start_Search");
static_assert(sizeof(WBP_SearchBarButton_C_Handle_Start_Search) == 0x000010, "Wrong size on WBP_SearchBarButton_C_Handle_Start_Search");
static_assert(offsetof(WBP_SearchBarButton_C_Handle_Start_Search, CallFunc_AkEventGlobal_ReturnValue) == 0x000000, "Member 'WBP_SearchBarButton_C_Handle_Start_Search::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SearchBarButton_C_Handle_Start_Search, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_SearchBarButton_C_Handle_Start_Search::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_SearchBarButton.WBP_SearchBarButton_C.OnTextChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_SearchBarButton_C_OnTextChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SearchBarButton_C_OnTextChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SearchBarButton_C_OnTextChanged__DelegateSignature");
static_assert(sizeof(WBP_SearchBarButton_C_OnTextChanged__DelegateSignature) == 0x000018, "Wrong size on WBP_SearchBarButton_C_OnTextChanged__DelegateSignature");
static_assert(offsetof(WBP_SearchBarButton_C_OnTextChanged__DelegateSignature, Text) == 0x000000, "Member 'WBP_SearchBarButton_C_OnTextChanged__DelegateSignature::Text' has a wrong offset!");

}

