#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TIM_ChatPanel_CM

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.BindToListViewEvents
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_BindToListViewEvents final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* Widget)>    K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float DesiredOffset)>          K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float ScrollFraction)>         K2Node_CreateDelegate_OutputDelegate_3;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A62[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A63[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALUI_ChatTab                         CallFunc_Map_Find_Value;                           // 0x0070(0x0060)(ContainsInstancedReference)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A64[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ListView_Styled*                 K2Node_DynamicCast_AsListView_Styled;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_BindToListViewEvents");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents) == 0x0000E8, "Wrong size on WBP_TIM_ChatPanel_CM_C_BindToListViewEvents");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x00003C, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, CallFunc_Map_Keys_Keys) == 0x000050, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, CallFunc_Array_Get_Item) == 0x000064, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00006D, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, CallFunc_Map_Find_Value) == 0x000070, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, CallFunc_Map_Find_ReturnValue) == 0x0000D0, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, K2Node_DynamicCast_AsListView_Styled) == 0x0000D8, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::K2Node_DynamicCast_AsListView_Styled' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToListViewEvents, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WBP_TIM_ChatPanel_CM_C_BindToListViewEvents::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.BindToManagerEvents
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_BindToManagerEvents final
{
public:
	bool                                          Bind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A65[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSucceeded, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSucceeded, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bReconnecting, const class FString& ErrorMsg)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& CharacterName, int32 LocalUserNum, const struct FGuid& CharacterId)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& CharacterName, int32 LocalUserNum, const struct FGuid& CharacterId)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bReconnecting, const class FString& ErrorMsg)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A66[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FMessageTarget& MessageTarget)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FMessageTarget& MessageTarget)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_5;    // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_6;    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_7;    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_BindToManagerEvents");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents) == 0x0000E8, "Wrong size on WBP_TIM_ChatPanel_CM_C_BindToManagerEvents");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, Bind) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::Bind' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_5) == 0x000054, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_6) == 0x000064, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_7) == 0x000074, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000088, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_8) == 0x000090, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0000A0, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x0000A8, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x0000B0, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_4) == 0x0000B8, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000C0, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_5) == 0x0000D0, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_6) == 0x0000D8, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BindToManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue_7) == 0x0000E0, "Member 'WBP_TIM_ChatPanel_CM_C_BindToManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue_7' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.Blank Text Commited
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_Blank_Text_Commited final
{
public:
	class UVALUI_ChatInputBar*                    Param_InputBar;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_Blank_Text_Commited) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_Blank_Text_Commited");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_Blank_Text_Commited) == 0x000008, "Wrong size on WBP_TIM_ChatPanel_CM_C_Blank_Text_Commited");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Blank_Text_Commited, Param_InputBar) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_Blank_Text_Commited::Param_InputBar' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.BndEvt__WBP_TIM_ChatPanel_CM_GeneralMessagesListView_K2Node_ComponentBoundEvent_3_OnListItemsChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_BndEvt__WBP_TIM_ChatPanel_CM_GeneralMessagesListView_K2Node_ComponentBoundEvent_3_OnListItemsChanged__DelegateSignature final
{
public:
	TArray<class UObject*>                        AddedItems;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UObject*>                        RemovedItems;                                      // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_BndEvt__WBP_TIM_ChatPanel_CM_GeneralMessagesListView_K2Node_ComponentBoundEvent_3_OnListItemsChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_BndEvt__WBP_TIM_ChatPanel_CM_GeneralMessagesListView_K2Node_ComponentBoundEvent_3_OnListItemsChanged__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_BndEvt__WBP_TIM_ChatPanel_CM_GeneralMessagesListView_K2Node_ComponentBoundEvent_3_OnListItemsChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_TIM_ChatPanel_CM_C_BndEvt__WBP_TIM_ChatPanel_CM_GeneralMessagesListView_K2Node_ComponentBoundEvent_3_OnListItemsChanged__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BndEvt__WBP_TIM_ChatPanel_CM_GeneralMessagesListView_K2Node_ComponentBoundEvent_3_OnListItemsChanged__DelegateSignature, AddedItems) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_BndEvt__WBP_TIM_ChatPanel_CM_GeneralMessagesListView_K2Node_ComponentBoundEvent_3_OnListItemsChanged__DelegateSignature::AddedItems' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_BndEvt__WBP_TIM_ChatPanel_CM_GeneralMessagesListView_K2Node_ComponentBoundEvent_3_OnListItemsChanged__DelegateSignature, RemovedItems) == 0x000010, "Member 'WBP_TIM_ChatPanel_CM_C_BndEvt__WBP_TIM_ChatPanel_CM_GeneralMessagesListView_K2Node_ComponentBoundEvent_3_OnListItemsChanged__DelegateSignature::RemovedItems' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.ClearTabSidePanel
// 0x0060 (0x0060 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_ClearTabSidePanel final
{
public:
	struct FVALUI_ChatTab                         Tab;                                               // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_ClearTabSidePanel) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_ClearTabSidePanel");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_ClearTabSidePanel) == 0x000060, "Wrong size on WBP_TIM_ChatPanel_CM_C_ClearTabSidePanel");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_ClearTabSidePanel, Tab) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_ClearTabSidePanel::Tab' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.ConstructTabButton
// 0x0060 (0x0060 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_ConstructTabButton final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UBP_TIM_Chat_TabButton_C*               NewParam;                                          // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   NewLocalVar_0;                                     // 0x0020(0x0018)(Edit, BlueprintVisible)
	class UBP_TIM_Chat_TabButton_C*               TabButton;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0040(0x0018)()
	class UBP_TIM_Chat_TabButton_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_ConstructTabButton) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_ConstructTabButton");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_ConstructTabButton) == 0x000060, "Wrong size on WBP_TIM_ChatPanel_CM_C_ConstructTabButton");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_ConstructTabButton, DisplayName) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_ConstructTabButton::DisplayName' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_ConstructTabButton, NewParam) == 0x000018, "Member 'WBP_TIM_ChatPanel_CM_C_ConstructTabButton::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_ConstructTabButton, NewLocalVar_0) == 0x000020, "Member 'WBP_TIM_ChatPanel_CM_C_ConstructTabButton::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_ConstructTabButton, TabButton) == 0x000038, "Member 'WBP_TIM_ChatPanel_CM_C_ConstructTabButton::TabButton' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_ConstructTabButton, CallFunc_TextToUpper_ReturnValue) == 0x000040, "Member 'WBP_TIM_ChatPanel_CM_C_ConstructTabButton::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_ConstructTabButton, CallFunc_SpawnObject_ReturnValue) == 0x000058, "Member 'WBP_TIM_ChatPanel_CM_C_ConstructTabButton::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.DisplayErrorNotification
// 0x0028 (0x0028 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification final
{
public:
	bool                                          ShowLoadingThrobber;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A67[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ErrorText;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification) == 0x000028, "Wrong size on WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification, ShowLoadingThrobber) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification::ShowLoadingThrobber' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification, ErrorText) == 0x000008, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification::ErrorText' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification, Temp_byte_Variable) == 0x000020, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification, Temp_byte_Variable_1) == 0x000021, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification, Temp_bool_Variable) == 0x000022, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification, K2Node_Select_Default) == 0x000023, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayErrorNotification::K2Node_Select_Default' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.DisplayScrollBarInMessagePanels
// 0x0080 (0x0080 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels final
{
public:
	bool                                          Display;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A68[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALUI_ChatTab                         CallFunc_Map_Find_Value;                           // 0x0008(0x0060)(ContainsInstancedReference)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A69[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ListView_Styled*                 K2Node_DynamicCast_AsListView_Styled;              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldScrollBarBeVisible_ReturnValue;     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels) == 0x000080, "Wrong size on WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels, Display) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels::Display' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels, CallFunc_Map_Find_Value) == 0x000008, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels, CallFunc_Map_Find_ReturnValue) == 0x000068, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels, K2Node_DynamicCast_AsListView_Styled) == 0x000070, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels::K2Node_DynamicCast_AsListView_Styled' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels, CallFunc_ShouldScrollBarBeVisible_ReturnValue) == 0x000079, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels::CallFunc_ShouldScrollBarBeVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels, CallFunc_BooleanAND_ReturnValue) == 0x00007A, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayScrollBarInMessagePanels::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.DisplayTabHost
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_DisplayTabHost final
{
public:
	bool                                          Display;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_DisplayTabHost) == 0x000001, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_DisplayTabHost");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_DisplayTabHost) == 0x000001, "Wrong size on WBP_TIM_ChatPanel_CM_C_DisplayTabHost");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_DisplayTabHost, Display) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_DisplayTabHost::Display' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.Do Custom Navigation Channels
// 0x0030 (0x0030 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A6A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A6B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels) == 0x000030, "Wrong size on WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels, Param_Navigation) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels, ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000018, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Channels::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.Do Custom Navigation Chat List
// 0x0078 (0x0078 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A6C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A6D[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A6E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A6F[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollbarDistanceFromBottom_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A70[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue_2;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_InScrollOffset_ImplicitCast; // 0x0058(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A71[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_InScrollOffset_ImplicitCast_1; // 0x0070(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List) == 0x000078, "Wrong size on WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, Param_Navigation) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_GetScrollOffset_ReturnValue) == 0x000014, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_GetScrollOffset_ReturnValue_1) == 0x000018, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_GetScrollOffset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_GetScrollbarDistanceFromBottom_ReturnValue) == 0x00002C, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_GetScrollbarDistanceFromBottom_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_BooleanOR_ReturnValue) == 0x000031, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_GetScrollOffset_ReturnValue_2) == 0x000034, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_GetScrollOffset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_GetChildAt_ReturnValue) == 0x000040, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_SetScrollOffset_InScrollOffset_ImplicitCast) == 0x000058, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_SetScrollOffset_InScrollOffset_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1) == 0x000060, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List, CallFunc_SetScrollOffset_InScrollOffset_ImplicitCast_1) == 0x000070, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Chat_List::CallFunc_SetScrollOffset_InScrollOffset_ImplicitCast_1' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.Do Custom Navigation Input Bar
// 0x0038 (0x0038 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A72[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A73[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A74[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar) == 0x000038, "Wrong size on WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar, Param_Navigation) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar, ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar, CallFunc_GetChildrenCount_ReturnValue) == 0x000014, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000018, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar, CallFunc_Array_IsEmpty_ReturnValue) == 0x00002C, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar, CallFunc_GetChildAt_ReturnValue) == 0x000030, "Member 'WBP_TIM_ChatPanel_CM_C_Do_Custom_Navigation_Input_Bar::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.EnableChatProximityTextUpdateTimer
// 0x0018 (0x0018 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A75[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer) == 0x000008, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer) == 0x000018, "Wrong size on WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer, Enabled) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer::Enabled' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000010, "Member 'WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'WBP_TIM_ChatPanel_CM_C_EnableChatProximityTextUpdateTimer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.EnableMouseCaptureOnMessagePanel
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_EnableMouseCaptureOnMessagePanel final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatPanel_CM_C_EnableMouseCaptureOnMessagePanel) == 0x000001, "Wrong alignment on WBP_TIM_ChatPanel_CM_C_EnableMouseCaptureOnMessagePanel");
static_assert(sizeof(WBP_TIM_ChatPanel_CM_C_EnableMouseCaptureOnMessagePanel) == 0x000001, "Wrong size on WBP_TIM_ChatPanel_CM_C_EnableMouseCaptureOnMessagePanel");
static_assert(offsetof(WBP_TIM_ChatPanel_CM_C_EnableMouseCaptureOnMessagePanel, Enable) == 0x000000, "Member 'WBP_TIM_ChatPanel_CM_C_EnableMouseCaptureOnMessagePanel::Enable' has a wrong offset!");

// Function WBP_TIM_ChatPanel_CM.WBP_TIM_ChatPanel_CM_C.ExecuteUbergraph_WBP_TIM_ChatPanel_CM
// 0x0B70 (0x0B70 - 0x0000)
struct WBP_TIM_ChatPanel_CM_C_ExecuteUbergraph_WBP_TIM_ChatPanel_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A76[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A77[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A78[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A79[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A7A[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x00D8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x0100(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A7B[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A7C[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0140(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0168(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
