#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EmoteBar_CM

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_EmoteBar_CM.WBP_EmoteBar_CM_C.ExecuteUbergraph_WBP_EmoteBar_CM
// 0x0018 (0x0018 - 0x0000)
struct WBP_EmoteBar_CM_C_ExecuteUbergraph_WBP_EmoteBar_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EE7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_EmoteButton*                     K2Node_Event_Button;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EmoteBar_CM_C_ExecuteUbergraph_WBP_EmoteBar_CM) == 0x000008, "Wrong alignment on WBP_EmoteBar_CM_C_ExecuteUbergraph_WBP_EmoteBar_CM");
static_assert(sizeof(WBP_EmoteBar_CM_C_ExecuteUbergraph_WBP_EmoteBar_CM) == 0x000018, "Wrong size on WBP_EmoteBar_CM_C_ExecuteUbergraph_WBP_EmoteBar_CM");
static_assert(offsetof(WBP_EmoteBar_CM_C_ExecuteUbergraph_WBP_EmoteBar_CM, EntryPoint) == 0x000000, "Member 'WBP_EmoteBar_CM_C_ExecuteUbergraph_WBP_EmoteBar_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_EmoteBar_CM_C_ExecuteUbergraph_WBP_EmoteBar_CM, K2Node_Event_Button) == 0x000008, "Member 'WBP_EmoteBar_CM_C_ExecuteUbergraph_WBP_EmoteBar_CM::K2Node_Event_Button' has a wrong offset!");
static_assert(offsetof(WBP_EmoteBar_CM_C_ExecuteUbergraph_WBP_EmoteBar_CM, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000010, "Member 'WBP_EmoteBar_CM_C_ExecuteUbergraph_WBP_EmoteBar_CM::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_EmoteBar_CM.WBP_EmoteBar_CM_C.HandleAddButtonToContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_EmoteBar_CM_C_HandleAddButtonToContainer final
{
public:
	class UVALUI_EmoteButton*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EmoteBar_CM_C_HandleAddButtonToContainer) == 0x000008, "Wrong alignment on WBP_EmoteBar_CM_C_HandleAddButtonToContainer");
static_assert(sizeof(WBP_EmoteBar_CM_C_HandleAddButtonToContainer) == 0x000008, "Wrong size on WBP_EmoteBar_CM_C_HandleAddButtonToContainer");
static_assert(offsetof(WBP_EmoteBar_CM_C_HandleAddButtonToContainer, Button) == 0x000000, "Member 'WBP_EmoteBar_CM_C_HandleAddButtonToContainer::Button' has a wrong offset!");

}

