#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Item_CM

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Item_CM.WBP_Item_CM_C.CanOpenTooltip
// 0x0002 (0x0002 - 0x0000)
struct WBP_Item_CM_C_CanOpenTooltip final
{
public:
	bool                                          CanOpen;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_CanOpenTooltip) == 0x000001, "Wrong alignment on WBP_Item_CM_C_CanOpenTooltip");
static_assert(sizeof(WBP_Item_CM_C_CanOpenTooltip) == 0x000002, "Wrong size on WBP_Item_CM_C_CanOpenTooltip");
static_assert(offsetof(WBP_Item_CM_C_CanOpenTooltip, CanOpen) == 0x000000, "Member 'WBP_Item_CM_C_CanOpenTooltip::CanOpen' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_CanOpenTooltip, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'WBP_Item_CM_C_CanOpenTooltip::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.ExecuteUbergraph_WBP_Item_CM
// 0x0468 (0x0468 - 0x0000)
struct WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemGrowthLevelInfo_OutTransitiveState; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransitiveDecorProgressStep           CallFunc_GetItemGrowthLevelInfo_OutProgressStepInfo; // 0x0008(0x0228)()
	bool                                          CallFunc_GetItemGrowthLevelInfo_ReturnValue;       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52DD[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52DE[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  K2Node_CustomEvent_NewStyle;                       // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_BottomPadding;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0250(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0288(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0300(0x0078)(ConstParm)
	struct FItemVariantConfig                     CallFunc_Array_Get_Item;                           // 0x0378(0x0040)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52DF[0x6];                                     // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_TintAsset>          CallFunc_GetTintFromPersistID_ReturnValue;         // 0x03C0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E0[0x4];                                     // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TintAsset*                         K2Node_DynamicCast_AsTint_Asset;                   // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E1[0x6];                                     // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E2[0x4];                                     // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E3[0x7];                                     // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0430(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E4[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E5[0x3];                                     // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM) == 0x000008, "Wrong alignment on WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM");
static_assert(sizeof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM) == 0x000468, "Wrong size on WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, EntryPoint) == 0x000000, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_GetItemGrowthLevelInfo_OutTransitiveState) == 0x000004, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_GetItemGrowthLevelInfo_OutTransitiveState' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_GetItemGrowthLevelInfo_OutProgressStepInfo) == 0x000008, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_GetItemGrowthLevelInfo_OutProgressStepInfo' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_GetItemGrowthLevelInfo_ReturnValue) == 0x000230, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_GetItemGrowthLevelInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, Temp_int_Array_Index_Variable) == 0x000234, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000238, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_CustomEvent_NewStyle) == 0x000240, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_CustomEvent_NewStyle' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_CustomEvent_BottomPadding) == 0x000248, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_CustomEvent_BottomPadding' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_Event_MyGeometry) == 0x000250, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_Event_MouseEvent_1) == 0x000288, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_Event_MouseEvent) == 0x000300, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_Array_Get_Item) == 0x000378, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0003B8, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x0003B9, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_GetTintFromPersistID_ReturnValue) == 0x0003C0, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_GetTintFromPersistID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0003E8, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0003F0, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_DynamicCast_AsTint_Asset) == 0x0003F8, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_DynamicCast_AsTint_Asset' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_DynamicCast_bSuccess) == 0x000400, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000401, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000408, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_Array_Length_ReturnValue) == 0x000410, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_DynamicCast_AsTexture_2D) == 0x000418, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_DynamicCast_bSuccess_1) == 0x000420, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, Temp_object_Variable) == 0x000428, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000430, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_DynamicCast_AsTexture_2D_1) == 0x000440, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_DynamicCast_bSuccess_2) == 0x000448, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, K2Node_CustomEvent_Loaded) == 0x000450, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, Temp_int_Loop_Counter_Variable) == 0x000458, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_Less_IntInt_ReturnValue) == 0x00045C, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM, CallFunc_Add_IntInt_ReturnValue) == 0x000460, "Member 'WBP_Item_CM_C_ExecuteUbergraph_WBP_Item_CM::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.GetItem
// 0x0060 (0x0060 - 0x0000)
struct WBP_Item_CM_C_GetItem final
{
public:
	struct FValeriaItem                           Param_Item;                                        // 0x0000(0x0060)(Parm, OutParm)
};
static_assert(alignof(WBP_Item_CM_C_GetItem) == 0x000008, "Wrong alignment on WBP_Item_CM_C_GetItem");
static_assert(sizeof(WBP_Item_CM_C_GetItem) == 0x000060, "Wrong size on WBP_Item_CM_C_GetItem");
static_assert(offsetof(WBP_Item_CM_C_GetItem, Param_Item) == 0x000000, "Member 'WBP_Item_CM_C_GetItem::Param_Item' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.GetPlayerItemAmount
// 0x0030 (0x0030 - 0x0000)
struct WBP_Item_CM_C_GetPlayerItemAmount final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStarQualityConstraint                 Temp_struct_Variable;                              // 0x0004(0x0008)(ConstParm, NoDestructor)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E6[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_K2_GetItemAmountByType_ReturnValue;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_GetPlayerItemAmount) == 0x000008, "Wrong alignment on WBP_Item_CM_C_GetPlayerItemAmount");
static_assert(sizeof(WBP_Item_CM_C_GetPlayerItemAmount) == 0x000030, "Wrong size on WBP_Item_CM_C_GetPlayerItemAmount");
static_assert(offsetof(WBP_Item_CM_C_GetPlayerItemAmount, Amount) == 0x000000, "Member 'WBP_Item_CM_C_GetPlayerItemAmount::Amount' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_GetPlayerItemAmount, Temp_struct_Variable) == 0x000004, "Member 'WBP_Item_CM_C_GetPlayerItemAmount::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_GetPlayerItemAmount, CallFunc_GetValeriaCharacter_OutResult) == 0x00000C, "Member 'WBP_Item_CM_C_GetPlayerItemAmount::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_GetPlayerItemAmount, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_Item_CM_C_GetPlayerItemAmount::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_GetPlayerItemAmount, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_Item_CM_C_GetPlayerItemAmount::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_GetPlayerItemAmount, CallFunc_GetInventory_ReturnValue) == 0x000020, "Member 'WBP_Item_CM_C_GetPlayerItemAmount::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_GetPlayerItemAmount, CallFunc_K2_GetItemAmountByType_ReturnValue) == 0x000028, "Member 'WBP_Item_CM_C_GetPlayerItemAmount::CallFunc_K2_GetItemAmountByType_ReturnValue' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.GetTooltipWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Item_CM_C_GetTooltipWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_GetTooltipWidget) == 0x000008, "Wrong alignment on WBP_Item_CM_C_GetTooltipWidget");
static_assert(sizeof(WBP_Item_CM_C_GetTooltipWidget) == 0x000008, "Wrong size on WBP_Item_CM_C_GetTooltipWidget");
static_assert(offsetof(WBP_Item_CM_C_GetTooltipWidget, ReturnValue) == 0x000000, "Member 'WBP_Item_CM_C_GetTooltipWidget::ReturnValue' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.HandlePlayerInventoryChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_Item_CM_C_HandlePlayerInventoryChanged final
{
public:
	class UInventoryComponent*                    Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStarQualityConstraint                 Temp_struct_Variable;                              // 0x0008(0x0008)(ConstParm, NoDestructor)
	int32                                         CallFunc_K2_GetItemAmountByType_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_HandlePlayerInventoryChanged) == 0x000008, "Wrong alignment on WBP_Item_CM_C_HandlePlayerInventoryChanged");
static_assert(sizeof(WBP_Item_CM_C_HandlePlayerInventoryChanged) == 0x000018, "Wrong size on WBP_Item_CM_C_HandlePlayerInventoryChanged");
static_assert(offsetof(WBP_Item_CM_C_HandlePlayerInventoryChanged, Inventory) == 0x000000, "Member 'WBP_Item_CM_C_HandlePlayerInventoryChanged::Inventory' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_HandlePlayerInventoryChanged, Temp_struct_Variable) == 0x000008, "Member 'WBP_Item_CM_C_HandlePlayerInventoryChanged::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_HandlePlayerInventoryChanged, CallFunc_K2_GetItemAmountByType_ReturnValue) == 0x000010, "Member 'WBP_Item_CM_C_HandlePlayerInventoryChanged::CallFunc_K2_GetItemAmountByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_HandlePlayerInventoryChanged, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Item_CM_C_HandlePlayerInventoryChanged::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.OnLoaded_0E55E99A47DBEB05B2AB9C865F838F03
// 0x0008 (0x0008 - 0x0000)
struct WBP_Item_CM_C_OnLoaded_0E55E99A47DBEB05B2AB9C865F838F03 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_OnLoaded_0E55E99A47DBEB05B2AB9C865F838F03) == 0x000008, "Wrong alignment on WBP_Item_CM_C_OnLoaded_0E55E99A47DBEB05B2AB9C865F838F03");
static_assert(sizeof(WBP_Item_CM_C_OnLoaded_0E55E99A47DBEB05B2AB9C865F838F03) == 0x000008, "Wrong size on WBP_Item_CM_C_OnLoaded_0E55E99A47DBEB05B2AB9C865F838F03");
static_assert(offsetof(WBP_Item_CM_C_OnLoaded_0E55E99A47DBEB05B2AB9C865F838F03, Loaded) == 0x000000, "Member 'WBP_Item_CM_C_OnLoaded_0E55E99A47DBEB05B2AB9C865F838F03::Loaded' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Item_CM_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Item_CM_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_Item_CM_C_OnMouseEnter");
static_assert(sizeof(WBP_Item_CM_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_Item_CM_C_OnMouseEnter");
static_assert(offsetof(WBP_Item_CM_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_Item_CM_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_Item_CM_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_Item_CM_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Item_CM_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_Item_CM_C_OnMouseLeave");
static_assert(sizeof(WBP_Item_CM_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_Item_CM_C_OnMouseLeave");
static_assert(offsetof(WBP_Item_CM_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_Item_CM_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.OpenTooltip
// 0x0001 (0x0001 - 0x0000)
struct WBP_Item_CM_C_OpenTooltip final
{
public:
	bool                                          CallFunc_CanOpenTooltip_CanOpen;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_OpenTooltip) == 0x000001, "Wrong alignment on WBP_Item_CM_C_OpenTooltip");
static_assert(sizeof(WBP_Item_CM_C_OpenTooltip) == 0x000001, "Wrong size on WBP_Item_CM_C_OpenTooltip");
static_assert(offsetof(WBP_Item_CM_C_OpenTooltip, CallFunc_CanOpenTooltip_CanOpen) == 0x000000, "Member 'WBP_Item_CM_C_OpenTooltip::CallFunc_CanOpenTooltip_CanOpen' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.SetItem
// 0x0068 (0x0068 - 0x0000)
struct WBP_Item_CM_C_SetItem final
{
public:
	struct FValeriaItem                           NewItem;                                           // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_ItemEquals_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_SetItem) == 0x000008, "Wrong alignment on WBP_Item_CM_C_SetItem");
static_assert(sizeof(WBP_Item_CM_C_SetItem) == 0x000068, "Wrong size on WBP_Item_CM_C_SetItem");
static_assert(offsetof(WBP_Item_CM_C_SetItem, NewItem) == 0x000000, "Member 'WBP_Item_CM_C_SetItem::NewItem' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_SetItem, CallFunc_ItemEquals_ReturnValue) == 0x000060, "Member 'WBP_Item_CM_C_SetItem::CallFunc_ItemEquals_ReturnValue' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.SetRecipeConfigId
// 0x0004 (0x0004 - 0x0000)
struct WBP_Item_CM_C_SetRecipeConfigId final
{
public:
	int32                                         Param_RecipeConfigId;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_SetRecipeConfigId) == 0x000004, "Wrong alignment on WBP_Item_CM_C_SetRecipeConfigId");
static_assert(sizeof(WBP_Item_CM_C_SetRecipeConfigId) == 0x000004, "Wrong size on WBP_Item_CM_C_SetRecipeConfigId");
static_assert(offsetof(WBP_Item_CM_C_SetRecipeConfigId, Param_RecipeConfigId) == 0x000000, "Member 'WBP_Item_CM_C_SetRecipeConfigId::Param_RecipeConfigId' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.SetStyle
// 0x0010 (0x0010 - 0x0000)
struct WBP_Item_CM_C_SetStyle final
{
public:
	class UVALUI_ItemStyle*                       NewStyle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_SetStyle) == 0x000008, "Wrong alignment on WBP_Item_CM_C_SetStyle");
static_assert(sizeof(WBP_Item_CM_C_SetStyle) == 0x000010, "Wrong size on WBP_Item_CM_C_SetStyle");
static_assert(offsetof(WBP_Item_CM_C_SetStyle, NewStyle) == 0x000000, "Member 'WBP_Item_CM_C_SetStyle::NewStyle' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_SetStyle, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'WBP_Item_CM_C_SetStyle::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.SetTextStyle
// 0x0010 (0x0010 - 0x0000)
struct WBP_Item_CM_C_SetTextStyle final
{
public:
	class UVALUI_TextBlockStyle*                  NewStyle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Param_BottomPadding;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_SetTextStyle) == 0x000008, "Wrong alignment on WBP_Item_CM_C_SetTextStyle");
static_assert(sizeof(WBP_Item_CM_C_SetTextStyle) == 0x000010, "Wrong size on WBP_Item_CM_C_SetTextStyle");
static_assert(offsetof(WBP_Item_CM_C_SetTextStyle, NewStyle) == 0x000000, "Member 'WBP_Item_CM_C_SetTextStyle::NewStyle' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_SetTextStyle, Param_BottomPadding) == 0x000008, "Member 'WBP_Item_CM_C_SetTextStyle::Param_BottomPadding' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.SetTotalAmount
// 0x0004 (0x0004 - 0x0000)
struct WBP_Item_CM_C_SetTotalAmount final
{
public:
	int32                                         NewTotalAmount;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_SetTotalAmount) == 0x000004, "Wrong alignment on WBP_Item_CM_C_SetTotalAmount");
static_assert(sizeof(WBP_Item_CM_C_SetTotalAmount) == 0x000004, "Wrong size on WBP_Item_CM_C_SetTotalAmount");
static_assert(offsetof(WBP_Item_CM_C_SetTotalAmount, NewTotalAmount) == 0x000000, "Member 'WBP_Item_CM_C_SetTotalAmount::NewTotalAmount' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.UpdateAmount
// 0x0240 (0x0240 - 0x0000)
struct WBP_Item_CM_C_UpdateAmount final
{
public:
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerItemAmount_Amount;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E8[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0140(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_4;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0198(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01A8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01F8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0210(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0220(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_UpdateAmount) == 0x000008, "Wrong alignment on WBP_Item_CM_C_UpdateAmount");
static_assert(sizeof(WBP_Item_CM_C_UpdateAmount) == 0x000240, "Wrong size on WBP_Item_CM_C_UpdateAmount");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000000, "Member 'WBP_Item_CM_C_UpdateAmount::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000008, "Member 'WBP_Item_CM_C_UpdateAmount::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_Item_CM_C_UpdateAmount::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'WBP_Item_CM_C_UpdateAmount::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, CallFunc_GetPlayerItemAmount_Amount) == 0x0000B0, "Member 'WBP_Item_CM_C_UpdateAmount::CallFunc_GetPlayerItemAmount_Amount' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_Item_CM_C_UpdateAmount::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0000C8, "Member 'WBP_Item_CM_C_UpdateAmount::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'WBP_Item_CM_C_UpdateAmount::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E8, "Member 'WBP_Item_CM_C_UpdateAmount::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x000138, "Member 'WBP_Item_CM_C_UpdateAmount::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, K2Node_MakeStruct_FormatArgumentData_3) == 0x000140, "Member 'WBP_Item_CM_C_UpdateAmount::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, CallFunc_Conv_IntToInt64_ReturnValue_4) == 0x000190, "Member 'WBP_Item_CM_C_UpdateAmount::CallFunc_Conv_IntToInt64_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, K2Node_MakeArray_Array_1) == 0x000198, "Member 'WBP_Item_CM_C_UpdateAmount::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001A8, "Member 'WBP_Item_CM_C_UpdateAmount::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, CallFunc_Format_ReturnValue_1) == 0x0001F8, "Member 'WBP_Item_CM_C_UpdateAmount::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, K2Node_MakeArray_Array_2) == 0x000210, "Member 'WBP_Item_CM_C_UpdateAmount::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, CallFunc_Format_ReturnValue_2) == 0x000220, "Member 'WBP_Item_CM_C_UpdateAmount::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, CallFunc_Greater_IntInt_ReturnValue) == 0x000238, "Member 'WBP_Item_CM_C_UpdateAmount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateAmount, K2Node_SwitchEnum_CmpSuccess) == 0x000239, "Member 'WBP_Item_CM_C_UpdateAmount::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.UpdateCapacity
// 0x0008 (0x0008 - 0x0000)
struct WBP_Item_CM_C_UpdateCapacity final
{
public:
	float                                         CallFunc_GetWaterPercent_percent;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWaterPercent_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_UpdateCapacity) == 0x000004, "Wrong alignment on WBP_Item_CM_C_UpdateCapacity");
static_assert(sizeof(WBP_Item_CM_C_UpdateCapacity) == 0x000008, "Wrong size on WBP_Item_CM_C_UpdateCapacity");
static_assert(offsetof(WBP_Item_CM_C_UpdateCapacity, CallFunc_GetWaterPercent_percent) == 0x000000, "Member 'WBP_Item_CM_C_UpdateCapacity::CallFunc_GetWaterPercent_percent' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateCapacity, CallFunc_GetWaterPercent_ReturnValue) == 0x000004, "Member 'WBP_Item_CM_C_UpdateCapacity::CallFunc_GetWaterPercent_ReturnValue' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.UpdateConsumableFlag
// 0x0004 (0x0004 - 0x0000)
struct WBP_Item_CM_C_UpdateConsumableFlag final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_UpdateConsumableFlag) == 0x000001, "Wrong alignment on WBP_Item_CM_C_UpdateConsumableFlag");
static_assert(sizeof(WBP_Item_CM_C_UpdateConsumableFlag) == 0x000004, "Wrong size on WBP_Item_CM_C_UpdateConsumableFlag");
static_assert(offsetof(WBP_Item_CM_C_UpdateConsumableFlag, Temp_bool_Variable) == 0x000000, "Member 'WBP_Item_CM_C_UpdateConsumableFlag::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateConsumableFlag, Temp_byte_Variable) == 0x000001, "Member 'WBP_Item_CM_C_UpdateConsumableFlag::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateConsumableFlag, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Item_CM_C_UpdateConsumableFlag::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateConsumableFlag, K2Node_Select_Default) == 0x000003, "Member 'WBP_Item_CM_C_UpdateConsumableFlag::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.UpdateItem
// 0x0058 (0x0058 - 0x0000)
struct WBP_Item_CM_C_UpdateItem final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52EA[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_SoftObjectReference_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52EB[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateVisibility_bAnythingVisible;        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_UpdateItem) == 0x000008, "Wrong alignment on WBP_Item_CM_C_UpdateItem");
static_assert(sizeof(WBP_Item_CM_C_UpdateItem) == 0x000058, "Wrong size on WBP_Item_CM_C_UpdateItem");
static_assert(offsetof(WBP_Item_CM_C_UpdateItem, Temp_byte_Variable) == 0x000000, "Member 'WBP_Item_CM_C_UpdateItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateItem, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000008, "Member 'WBP_Item_CM_C_UpdateItem::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateItem, Temp_byte_Variable_1) == 0x000030, "Member 'WBP_Item_CM_C_UpdateItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateItem, Temp_bool_Variable) == 0x000031, "Member 'WBP_Item_CM_C_UpdateItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateItem, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000038, "Member 'WBP_Item_CM_C_UpdateItem::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateItem, CallFunc_NotEqual_SoftObjectReference_ReturnValue) == 0x000040, "Member 'WBP_Item_CM_C_UpdateItem::CallFunc_NotEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateItem, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000048, "Member 'WBP_Item_CM_C_UpdateItem::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateItem, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_Item_CM_C_UpdateItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateItem, CallFunc_UpdateVisibility_bAnythingVisible) == 0x000051, "Member 'WBP_Item_CM_C_UpdateItem::CallFunc_UpdateVisibility_bAnythingVisible' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateItem, K2Node_Select_Default) == 0x000052, "Member 'WBP_Item_CM_C_UpdateItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateItem, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000053, "Member 'WBP_Item_CM_C_UpdateItem::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.UpdateMainIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_Item_CM_C_UpdateMainIcon final
{
public:
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_UpdateMainIcon) == 0x000001, "Wrong alignment on WBP_Item_CM_C_UpdateMainIcon");
static_assert(sizeof(WBP_Item_CM_C_UpdateMainIcon) == 0x000001, "Wrong size on WBP_Item_CM_C_UpdateMainIcon");
static_assert(offsetof(WBP_Item_CM_C_UpdateMainIcon, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000000, "Member 'WBP_Item_CM_C_UpdateMainIcon::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.UpdateQualityIcon
// 0x0005 (0x0005 - 0x0000)
struct WBP_Item_CM_C_UpdateQualityIcon final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_UpdateQualityIcon) == 0x000001, "Wrong alignment on WBP_Item_CM_C_UpdateQualityIcon");
static_assert(sizeof(WBP_Item_CM_C_UpdateQualityIcon) == 0x000005, "Wrong size on WBP_Item_CM_C_UpdateQualityIcon");
static_assert(offsetof(WBP_Item_CM_C_UpdateQualityIcon, Temp_bool_Variable) == 0x000000, "Member 'WBP_Item_CM_C_UpdateQualityIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateQualityIcon, Temp_byte_Variable) == 0x000001, "Member 'WBP_Item_CM_C_UpdateQualityIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateQualityIcon, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Item_CM_C_UpdateQualityIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateQualityIcon, CallFunc_Greater_ByteByte_ReturnValue) == 0x000003, "Member 'WBP_Item_CM_C_UpdateQualityIcon::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateQualityIcon, K2Node_Select_Default) == 0x000004, "Member 'WBP_Item_CM_C_UpdateQualityIcon::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Item_CM.WBP_Item_CM_C.UpdateStyle
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Item_CM_C_UpdateStyle final
{
public:
	struct FMargin                                OutlineFontPadding;                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                RegularFontPadding;                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52EC[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52ED[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52EE[0x1];                                     // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52EF[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate;              // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F0[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue_1;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F1[0x1];                                     // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_CM_C_UpdateStyle) == 0x000008, "Wrong alignment on WBP_Item_CM_C_UpdateStyle");
static_assert(sizeof(WBP_Item_CM_C_UpdateStyle) == 0x0000B0, "Wrong size on WBP_Item_CM_C_UpdateStyle");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, OutlineFontPadding) == 0x000000, "Member 'WBP_Item_CM_C_UpdateStyle::OutlineFontPadding' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, RegularFontPadding) == 0x000010, "Member 'WBP_Item_CM_C_UpdateStyle::RegularFontPadding' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, Temp_byte_Variable) == 0x000020, "Member 'WBP_Item_CM_C_UpdateStyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, Temp_bool_Variable) == 0x000021, "Member 'WBP_Item_CM_C_UpdateStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, Temp_byte_Variable_1) == 0x000022, "Member 'WBP_Item_CM_C_UpdateStyle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, Temp_byte_Variable_2) == 0x000023, "Member 'WBP_Item_CM_C_UpdateStyle::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, Temp_byte_Variable_3) == 0x000024, "Member 'WBP_Item_CM_C_UpdateStyle::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, Temp_bool_Variable_1) == 0x000025, "Member 'WBP_Item_CM_C_UpdateStyle::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, CallFunc_GetPathName_ReturnValue) == 0x000028, "Member 'WBP_Item_CM_C_UpdateStyle::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'WBP_Item_CM_C_UpdateStyle::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, Temp_byte_Variable_4) == 0x000048, "Member 'WBP_Item_CM_C_UpdateStyle::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000050, "Member 'WBP_Item_CM_C_UpdateStyle::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, Temp_byte_Variable_5) == 0x000058, "Member 'WBP_Item_CM_C_UpdateStyle::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, Temp_bool_Variable_2) == 0x000059, "Member 'WBP_Item_CM_C_UpdateStyle::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, K2Node_Select_Default) == 0x00005A, "Member 'WBP_Item_CM_C_UpdateStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, K2Node_Select_Default_1) == 0x00005B, "Member 'WBP_Item_CM_C_UpdateStyle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'WBP_Item_CM_C_UpdateStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, K2Node_Select_Default_2) == 0x00005D, "Member 'WBP_Item_CM_C_UpdateStyle::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, CallFunc_GetValeriaCharacter_OutResult) == 0x00005E, "Member 'WBP_Item_CM_C_UpdateStyle::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000060, "Member 'WBP_Item_CM_C_UpdateStyle::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, K2Node_MakeStruct_Margin) == 0x000068, "Member 'WBP_Item_CM_C_UpdateStyle::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, CallFunc_GetInventory_ReturnValue) == 0x000078, "Member 'WBP_Item_CM_C_UpdateStyle::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'WBP_Item_CM_C_UpdateStyle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Item_CM_C_UpdateStyle, K2Node_CreateDelegate_OutputDelegate) == 0x000084, "Member 'WBP_Item_CM_C_UpdateStyle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
