#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GraphicsSettings_RestartWindow_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_classes.hpp"
#include "S6UICore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GraphicsSettings_RestartWindow_CM.WBP_GraphicsSettings_RestartWindow_CM_C
// 0x0030 (0x0588 - 0x0558)
class UWBP_GraphicsSettings_RestartWindow_CM_C final : public UVALUI_ModalWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                VALUI_TextBlock_Styled;                            // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_PopupSecondary_02_CM_C*   WBP_Template_PopupSecondary_02_CM;                 // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnConfirm;                                         // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         ConfirmDelaySeconds;                               // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GraphicsSettings_UnappliedChangesWindow_CM_WBP_Template_PopupSecondary_02_CM_K2Node_ComponentBoundEvent_1_Confirm__DelegateSignature();
	bool CanClose(ES6UI_ModalWidgetState CallFunc_GetModalWidgetState_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void Construct();
	void ExecuteUbergraph_WBP_GraphicsSettings_RestartWindow_CM(int32 EntryPoint, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue, bool CallFunc_GetFirstRunSetupNeedRestart_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue);
	void HandleStartClosing_BP(bool bPermitLatentClosing, bool* bOutHasLatentClosingLogic);
	void HandleStartOpening_BP(bool* bOutHasLatentOpeningLogic);
	void OnConfirm__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GraphicsSettings_RestartWindow_CM_C">();
	}
	static class UWBP_GraphicsSettings_RestartWindow_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GraphicsSettings_RestartWindow_CM_C>();
	}
};
static_assert(alignof(UWBP_GraphicsSettings_RestartWindow_CM_C) == 0x000008, "Wrong alignment on UWBP_GraphicsSettings_RestartWindow_CM_C");
static_assert(sizeof(UWBP_GraphicsSettings_RestartWindow_CM_C) == 0x000588, "Wrong size on UWBP_GraphicsSettings_RestartWindow_CM_C");
static_assert(offsetof(UWBP_GraphicsSettings_RestartWindow_CM_C, UberGraphFrame) == 0x000558, "Member 'UWBP_GraphicsSettings_RestartWindow_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_RestartWindow_CM_C, VALUI_TextBlock_Styled) == 0x000560, "Member 'UWBP_GraphicsSettings_RestartWindow_CM_C::VALUI_TextBlock_Styled' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_RestartWindow_CM_C, WBP_Template_PopupSecondary_02_CM) == 0x000568, "Member 'UWBP_GraphicsSettings_RestartWindow_CM_C::WBP_Template_PopupSecondary_02_CM' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_RestartWindow_CM_C, OnConfirm) == 0x000570, "Member 'UWBP_GraphicsSettings_RestartWindow_CM_C::OnConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_RestartWindow_CM_C, ConfirmDelaySeconds) == 0x000580, "Member 'UWBP_GraphicsSettings_RestartWindow_CM_C::ConfirmDelaySeconds' has a wrong offset!");

}

