#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TIM_ChatMessageContextMenu_CM

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "S6PlatformServiceSubsystems_structs.hpp"
#include "Engine_structs.hpp"
#include "S6Core_structs.hpp"
#include "UMG_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Block_1_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Kudos_1_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_1_K2Node_ComponentBoundEvent_22_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Message_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_23_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Mute_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Report_1_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unblock_1_K2Node_ComponentBoundEvent_24_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_BndEvt__WBP_TIM_ChatMessageContextMenu_CM_Button_Unmute_1_K2Node_ComponentBoundEvent_25_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.CreateReportPlayerModalWidget
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget final
{
public:
	ES6PLAT_PlayerBehaviorReportType              Report_Type;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ES6PLAT_PlayerBehaviorReportSource            Report_Source;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56DC[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       TargetNetId;                                       // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FValeriaChatMessage                    Param_Message;                                     // 0x0038(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
	class US6UI_ModalWidgetBase*                  Widget;                                            // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  ReportModal;                                       // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportPlayerModalDialog_PF_C*      CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UCommonInputSubsystem*            CallFunc_GetCommonInputSystem_ReturnValue;         // 0x00C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56DD[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ReportPlayerModalDialog_CM_C*      CallFunc_Create_ReturnValue_1;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget) == 0x0000E8, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, Report_Type) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::Report_Type' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, Report_Source) == 0x000001, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::Report_Source' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, TargetNetId) == 0x000008, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::TargetNetId' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, Param_Message) == 0x000038, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::Param_Message' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, Widget) == 0x0000A0, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, ReportModal) == 0x0000A8, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::ReportModal' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B0, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, CallFunc_GetCommonInputSystem_ReturnValue) == 0x0000C0, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::CallFunc_GetCommonInputSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000C8, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000D0, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, CallFunc_Create_ReturnValue_1) == 0x0000D8, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E0, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_CreateReportPlayerModalWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatMessageContextMenu_CM.WBP_TIM_ChatMessageContextMenu_CM_C.ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM
// 0x04D8 (0x04D8 - 0x0000)
struct WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56DE[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56DF[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56E0[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetIdFromChatMessageSender_ReturnValue; // 0x0098(0x0030)(HasGetValueTypeHash)
	struct FMessageTarget                         CallFunc_MakeMessageTarget_DirectMessage_ReturnValue; // 0x00C8(0x0028)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetIdFromChatMessageSender_ReturnValue_1; // 0x00F0(0x0030)(HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  CallFunc_CreateReportPlayerModalWidget_Widget;     // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0130(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0158(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56E1[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetNetIdFromChatMessageSender_ReturnValue_2; // 0x0180(0x0030)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetIdFromChatMessageSender_ReturnValue_3; // 0x01C0(0x0030)(HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetIdFromChatMessageSender_ReturnValue_4; // 0x01F8(0x0030)(HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56E2[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x0238(0x0030)(HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56E3[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56E4[0x3];                                     // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_4;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_5;              // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_6;              // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue_1;                   // 0x0298(0x0030)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue_2;                   // 0x02C8(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue_1;                 // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue_2;                 // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56E5[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_15;              // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_14;              // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_13;              // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_12;              // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_11;              // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_10;              // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_9;               // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_8;               // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_7;               // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Block_ModalDialogue_CM_C*          CallFunc_Create_ReturnValue;                       // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Block_ModalDialogue_PF_C*          CallFunc_Create_ReturnValue_1;                     // 0x0388(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_2;         // 0x0390(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_5;    // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_6;    // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue;                    // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56E6[0x6];                                     // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_7;              // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56E7[0x4];                                     // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetNetIdFromChatMessageSender_ReturnValue_5; // 0x03C8(0x0030)(HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_7;    // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue;         // 0x0400(0x00B0)()
	EVAL_SocialBlockError                         CallFunc_RequestBlockUser_ReturnValue;             // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56E8[0x7];                                     // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56E9[0x4];                                     // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  CallFunc_CreateReportPlayerModalWidget_Widget_1;   // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowPlatformProfileUI_ReturnValue;        // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM) == 0x000008, "Wrong alignment on WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM");
static_assert(sizeof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM) == 0x0004D8, "Wrong size on WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, EntryPoint) == 0x000000, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, Temp_bool_Variable) == 0x000004, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, Temp_object_Variable) == 0x000038, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, Temp_real_Variable) == 0x000048, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, Temp_real_Variable_1) == 0x000050, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, Temp_real_Variable_0) == 0x000058, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, Temp_bool_Variable_1) == 0x000068, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000070, "Member 'WBP_TIM_ChatMessageContextMenu_CM_C_ExecuteUbergraph_WBP_TIM_ChatMessageContextMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
