#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListEntry_RequestableItemType_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ListEntry_RequestableItemType_CM.WBP_ListEntry_RequestableItemType_CM_C
// 0x0048 (0x0308 - 0x02C0)
class UWBP_ListEntry_RequestableItemType_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMenuAnchor*                            MenuAnchor_Tooltip;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_CM_C*                         WBP_Item_CM;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListItemButton_CM_C*               WBP_ListItemButton_CM;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListItem_RequestableItemType_C*        RequestableItemType;                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   Display_Name;                                      // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShowTooltip;                                      // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class UWBP_ListItemButton_CM_C* ListItemButton);
	void BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_2_OnUnhovered__DelegateSignature(class UWBP_ListItemButton_CM_C* ListItemButton);
	void BndEvt__WBP_ListEntry_RequestableItemType_CM_WBP_ListItemButton_CM_K2Node_ComponentBoundEvent_3_OnButtonFocusLost__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_ListEntry_RequestableItemType_CM(int32 EntryPoint, class UObject* CallFunc_GetListItemObject_ReturnValue, bool K2Node_Event_bIsSelected, class UListViewBase* CallFunc_GetOwningListView_ReturnValue, class UObject* CallFunc_GetListItemObject_ReturnValue_1, class UListView* K2Node_DynamicCast_AsList_View, bool K2Node_DynamicCast_bSuccess, class UListViewBase* CallFunc_GetOwningListView_ReturnValue_1, TArray<class UObject*>& CallFunc_BP_GetSelectedItems_Items, bool CallFunc_BP_GetSelectedItems_ReturnValue, class UListView* K2Node_DynamicCast_AsList_View_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_Array_Contains_ReturnValue, const struct FGeometry& K2Node_Event_MyGeometry, struct FPointerEvent& K2Node_Event_MouseEvent_1, struct FPointerEvent& K2Node_Event_MouseEvent, class UObject* K2Node_Event_ListItemObject, class UListItem_RequestableItemType_C* K2Node_DynamicCast_AsList_Item_Requestable_Item_Type, bool K2Node_DynamicCast_bSuccess_2, EInventoryRequestStatus K2Node_CustomEvent_RequestStatus, bool K2Node_CustomEvent_bIsExpired, bool CallFunc_Not_PreBool_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_Event_bIsExpanded, class UWBP_ListItemButton_CM_C* K2Node_ComponentBoundEvent_ListItemButton_1, bool CallFunc_IsUsingTouch_IsTouch, class UWBP_ListItemButton_CM_C* K2Node_ComponentBoundEvent_ListItemButton, bool CallFunc_IsUsingTouch_IsTouch_1, bool CallFunc_CanClearSelfSelection_CanClear, bool CallFunc_BooleanAND_ReturnValue);
	class UUserWidget* MakeTooltipWidget(class UWBP_BasicTooltip_C* CallFunc_Create_ReturnValue);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnMouseEnter(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void OnMouseLeave(struct FPointerEvent& MouseEvent);
	void SetListItemSelection(bool Selected, class UObject* CallFunc_GetListItemObject_ReturnValue, class UListViewBase* CallFunc_GetOwningListView_ReturnValue, class UTileView* K2Node_DynamicCast_AsTile_View, bool K2Node_DynamicCast_bSuccess);
	void Update_Item_Button(EInventoryRequestStatus RequestStatus, bool bIsExpired);
	void UpdateFromItemType(class UObject* CallFunc_LoadAsset_Blocking_ReturnValue, class UVAL_ItemTypeDefinitionAsset* K2Node_DynamicCast_AsItem_Type_Definition, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, const struct FValeriaItem& K2Node_MakeStruct_ValeriaItem);

	void CanClearSelfSelection(bool* CanClear, class UObject* CallFunc_GetListItemObject_ReturnValue, class UObject* CallFunc_GetOuterObject_ReturnValue, class UWBP_RequestItemPicker_CM_C* K2Node_DynamicCast_AsWBP_Request_Item_Picker_CM, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Has_Focus_Item_in_Request_Button_HasFocus, bool CallFunc_Not_PreBool_ReturnValue) const;
	void IsUsingTouch(bool* IsTouch, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, bool CallFunc_IsInputMethodActive_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ListEntry_RequestableItemType_CM_C">();
	}
	static class UWBP_ListEntry_RequestableItemType_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ListEntry_RequestableItemType_CM_C>();
	}
};
static_assert(alignof(UWBP_ListEntry_RequestableItemType_CM_C) == 0x000008, "Wrong alignment on UWBP_ListEntry_RequestableItemType_CM_C");
static_assert(sizeof(UWBP_ListEntry_RequestableItemType_CM_C) == 0x000308, "Wrong size on UWBP_ListEntry_RequestableItemType_CM_C");
static_assert(offsetof(UWBP_ListEntry_RequestableItemType_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ListEntry_RequestableItemType_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_RequestableItemType_CM_C, MenuAnchor_Tooltip) == 0x0002C8, "Member 'UWBP_ListEntry_RequestableItemType_CM_C::MenuAnchor_Tooltip' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_RequestableItemType_CM_C, WBP_Item_CM) == 0x0002D0, "Member 'UWBP_ListEntry_RequestableItemType_CM_C::WBP_Item_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_RequestableItemType_CM_C, WBP_ListItemButton_CM) == 0x0002D8, "Member 'UWBP_ListEntry_RequestableItemType_CM_C::WBP_ListItemButton_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_RequestableItemType_CM_C, RequestableItemType) == 0x0002E0, "Member 'UWBP_ListEntry_RequestableItemType_CM_C::RequestableItemType' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_RequestableItemType_CM_C, Display_Name) == 0x0002E8, "Member 'UWBP_ListEntry_RequestableItemType_CM_C::Display_Name' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_RequestableItemType_CM_C, bShowTooltip) == 0x000300, "Member 'UWBP_ListEntry_RequestableItemType_CM_C::bShowTooltip' has a wrong offset!");

}

