#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SelectableButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SelectableButton.WBP_SelectableButton_C.ExecuteUbergraph_WBP_SelectableButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DFE[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton) == 0x000004, "Wrong alignment on WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton");
static_assert(sizeof(WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton) == 0x000010, "Wrong size on WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton");
static_assert(offsetof(WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton, EntryPoint) == 0x000000, "Member 'WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton, K2Node_Event_IsDesignTime) == 0x000008, "Member 'WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton, CallFunc_AkEventGlobal_ReturnValue_1) == 0x00000C, "Member 'WBP_SelectableButton_C_ExecuteUbergraph_WBP_SelectableButton::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");

// Function WBP_SelectableButton.WBP_SelectableButton_C.OnSelectionChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_SelectableButton_C_OnSelectionChanged__DelegateSignature final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectableButton_C_OnSelectionChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_SelectableButton_C_OnSelectionChanged__DelegateSignature");
static_assert(sizeof(WBP_SelectableButton_C_OnSelectionChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_SelectableButton_C_OnSelectionChanged__DelegateSignature");
static_assert(offsetof(WBP_SelectableButton_C_OnSelectionChanged__DelegateSignature, Selected) == 0x000000, "Member 'WBP_SelectableButton_C_OnSelectionChanged__DelegateSignature::Selected' has a wrong offset!");

// Function WBP_SelectableButton.WBP_SelectableButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SelectableButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectableButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SelectableButton_C_PreConstruct");
static_assert(sizeof(WBP_SelectableButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_SelectableButton_C_PreConstruct");
static_assert(offsetof(WBP_SelectableButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SelectableButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SelectableButton.WBP_SelectableButton_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_SelectableButton_C_SetSelected final
{
public:
	bool                                          New_Selection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectableButton_C_SetSelected) == 0x000001, "Wrong alignment on WBP_SelectableButton_C_SetSelected");
static_assert(sizeof(WBP_SelectableButton_C_SetSelected) == 0x000001, "Wrong size on WBP_SelectableButton_C_SetSelected");
static_assert(offsetof(WBP_SelectableButton_C_SetSelected, New_Selection) == 0x000000, "Member 'WBP_SelectableButton_C_SetSelected::New_Selection' has a wrong offset!");

// Function WBP_SelectableButton.WBP_SelectableButton_C.UpdateStyle
// 0x0010 (0x0010 - 0x0000)
struct WBP_SelectableButton_C_UpdateStyle final
{
public:
	bool                                          Param_Is_Selected;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DFF[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ButtonStyle*                     K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectableButton_C_UpdateStyle) == 0x000008, "Wrong alignment on WBP_SelectableButton_C_UpdateStyle");
static_assert(sizeof(WBP_SelectableButton_C_UpdateStyle) == 0x000010, "Wrong size on WBP_SelectableButton_C_UpdateStyle");
static_assert(offsetof(WBP_SelectableButton_C_UpdateStyle, Param_Is_Selected) == 0x000000, "Member 'WBP_SelectableButton_C_UpdateStyle::Param_Is_Selected' has a wrong offset!");
static_assert(offsetof(WBP_SelectableButton_C_UpdateStyle, Temp_bool_Variable) == 0x000001, "Member 'WBP_SelectableButton_C_UpdateStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SelectableButton_C_UpdateStyle, K2Node_Select_Default) == 0x000008, "Member 'WBP_SelectableButton_C_UpdateStyle::K2Node_Select_Default' has a wrong offset!");

}

