#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InstanceSelector

#include "Basic.hpp"

#include "OnlineSubsystemUtils_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_InstanceSelector.WBP_InstanceSelector_C.BndEvt__InstanceDropDown_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_InstanceSelector_C_BndEvt__InstanceDropDown_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InstanceSelector_C_BndEvt__InstanceDropDown_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InstanceSelector_C_BndEvt__InstanceDropDown_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_InstanceSelector_C_BndEvt__InstanceDropDown_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_InstanceSelector_C_BndEvt__InstanceDropDown_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_InstanceSelector_C_BndEvt__InstanceDropDown_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_InstanceSelector_C_BndEvt__InstanceDropDown_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_BndEvt__InstanceDropDown_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_InstanceSelector_C_BndEvt__InstanceDropDown_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_InstanceSelector.WBP_InstanceSelector_C.BndEvt__SearchLANToggle_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_InstanceSelector_C_BndEvt__SearchLANToggle_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InstanceSelector_C_BndEvt__SearchLANToggle_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_InstanceSelector_C_BndEvt__SearchLANToggle_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_InstanceSelector_C_BndEvt__SearchLANToggle_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_InstanceSelector_C_BndEvt__SearchLANToggle_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_InstanceSelector_C_BndEvt__SearchLANToggle_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_InstanceSelector_C_BndEvt__SearchLANToggle_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_InstanceSelector.WBP_InstanceSelector_C.ExecuteUbergraph_WBP_InstanceSelector
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_418D[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results_1;                      // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results;                        // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBlueprintSessionResult>        Temp_struct_Variable;                              // 0x0048(0x0010)(ReferenceParm)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_418E[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_418F[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4190[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFindSessionsCallbackProxy*             CallFunc_FindSessions_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector) == 0x000008, "Wrong alignment on WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector");
static_assert(sizeof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector) == 0x0000A8, "Wrong size on WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, EntryPoint) == 0x000000, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, Temp_bool_Variable) == 0x000004, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, Temp_byte_Variable) == 0x000005, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, K2Node_CustomEvent_Results_1) == 0x000008, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::K2Node_CustomEvent_Results_1' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, K2Node_CustomEvent_Results) == 0x000028, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, Temp_struct_Variable) == 0x000048, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, K2Node_ComponentBoundEvent_SelectedItem) == 0x000058, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, K2Node_ComponentBoundEvent_SelectionType) == 0x000068, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000069, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, K2Node_Select_Default) == 0x00006A, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, K2Node_ComponentBoundEvent_bIsChecked) == 0x000078, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, K2Node_MakeArray_Array) == 0x000080, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, CallFunc_IsChecked_ReturnValue) == 0x000090, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, CallFunc_FindSessions_ReturnValue) == 0x000098, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::CallFunc_FindSessions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'WBP_InstanceSelector_C_ExecuteUbergraph_WBP_InstanceSelector::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_InstanceSelector.WBP_InstanceSelector_C.GetSelectedInstanceOption
// 0x0410 (0x0410 - 0x0000)
struct WBP_InstanceSelector_C_GetSelectedInstanceOption final
{
public:
	struct FBlueprintSessionResult                Session;                                           // 0x0000(0x0120)(Parm, OutParm)
	class FString                                 SelectedOption;                                    // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4191[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4192[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0140(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4193[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4194[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintSessionResult                CallFunc_Array_Get_Item_1;                         // 0x0170(0x0120)()
	class FString                                 CallFunc_GetSessionIdString_ReturnValue;           // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4195[0x3];                                     // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4196[0x3];                                     // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x02B0(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4197[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBlueprintSessionResult                CallFunc_CreateSessionResult_ReturnValue;          // 0x02E0(0x0120)()
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InstanceSelector_C_GetSelectedInstanceOption) == 0x000008, "Wrong alignment on WBP_InstanceSelector_C_GetSelectedInstanceOption");
static_assert(sizeof(WBP_InstanceSelector_C_GetSelectedInstanceOption) == 0x000410, "Wrong size on WBP_InstanceSelector_C_GetSelectedInstanceOption");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, Session) == 0x000000, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::Session' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, SelectedOption) == 0x000120, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::SelectedOption' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, Temp_bool_True_if_break_was_hit_Variable) == 0x000130, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, Temp_int_Array_Index_Variable) == 0x000134, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_Not_PreBool_ReturnValue) == 0x000138, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_ParseIntoArray_ReturnValue) == 0x000140, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000150, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_Array_Get_Item) == 0x000158, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, Temp_int_Loop_Counter_Variable) == 0x000168, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_Array_Get_Item_1) == 0x000170, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_GetSessionIdString_ReturnValue) == 0x000290, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_GetSessionIdString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_Add_IntInt_ReturnValue) == 0x0002A0, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0002A4, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_Array_Length_ReturnValue) == 0x0002A8, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_Less_IntInt_ReturnValue) == 0x0002AC, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_GetText_ReturnValue) == 0x0002B0, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_BooleanAND_ReturnValue) == 0x0002C8, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_Conv_TextToString_ReturnValue) == 0x0002D0, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_CreateSessionResult_ReturnValue) == 0x0002E0, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_CreateSessionResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_GetSelectedInstanceOption, CallFunc_GetSelectedOption_ReturnValue) == 0x000400, "Member 'WBP_InstanceSelector_C_GetSelectedInstanceOption::CallFunc_GetSelectedOption_ReturnValue' has a wrong offset!");

// Function WBP_InstanceSelector.WBP_InstanceSelector_C.OnFailure_EBFCCC514C136190829303A6BDEDEDA4
// 0x0010 (0x0010 - 0x0000)
struct WBP_InstanceSelector_C_OnFailure_EBFCCC514C136190829303A6BDEDEDA4 final
{
public:
	TArray<struct FBlueprintSessionResult>        Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_InstanceSelector_C_OnFailure_EBFCCC514C136190829303A6BDEDEDA4) == 0x000008, "Wrong alignment on WBP_InstanceSelector_C_OnFailure_EBFCCC514C136190829303A6BDEDEDA4");
static_assert(sizeof(WBP_InstanceSelector_C_OnFailure_EBFCCC514C136190829303A6BDEDEDA4) == 0x000010, "Wrong size on WBP_InstanceSelector_C_OnFailure_EBFCCC514C136190829303A6BDEDEDA4");
static_assert(offsetof(WBP_InstanceSelector_C_OnFailure_EBFCCC514C136190829303A6BDEDEDA4, Results) == 0x000000, "Member 'WBP_InstanceSelector_C_OnFailure_EBFCCC514C136190829303A6BDEDEDA4::Results' has a wrong offset!");

// Function WBP_InstanceSelector.WBP_InstanceSelector_C.OnSuccess_EBFCCC514C136190829303A6BDEDEDA4
// 0x0010 (0x0010 - 0x0000)
struct WBP_InstanceSelector_C_OnSuccess_EBFCCC514C136190829303A6BDEDEDA4 final
{
public:
	TArray<struct FBlueprintSessionResult>        Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_InstanceSelector_C_OnSuccess_EBFCCC514C136190829303A6BDEDEDA4) == 0x000008, "Wrong alignment on WBP_InstanceSelector_C_OnSuccess_EBFCCC514C136190829303A6BDEDEDA4");
static_assert(sizeof(WBP_InstanceSelector_C_OnSuccess_EBFCCC514C136190829303A6BDEDEDA4) == 0x000010, "Wrong size on WBP_InstanceSelector_C_OnSuccess_EBFCCC514C136190829303A6BDEDEDA4");
static_assert(offsetof(WBP_InstanceSelector_C_OnSuccess_EBFCCC514C136190829303A6BDEDEDA4, Results) == 0x000000, "Member 'WBP_InstanceSelector_C_OnSuccess_EBFCCC514C136190829303A6BDEDEDA4::Results' has a wrong offset!");

// Function WBP_InstanceSelector.WBP_InstanceSelector_C.UpdateInstanceOptionList
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_InstanceSelector_C_UpdateInstanceOptionList final
{
public:
	TArray<struct FBlueprintSessionResult>        SessionResults;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 PreviousSelectedOption;                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4198[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintSessionResult                CallFunc_Array_Get_Item;                           // 0x0028(0x0120)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4199[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSessionIdString_ReturnValue;           // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetServerName_ReturnValue;                // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419A[0x5];                                     // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419B[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InstanceSelector_C_UpdateInstanceOptionList) == 0x000008, "Wrong alignment on WBP_InstanceSelector_C_UpdateInstanceOptionList");
static_assert(sizeof(WBP_InstanceSelector_C_UpdateInstanceOptionList) == 0x0001B8, "Wrong size on WBP_InstanceSelector_C_UpdateInstanceOptionList");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, SessionResults) == 0x000000, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::SessionResults' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, PreviousSelectedOption) == 0x000010, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::PreviousSelectedOption' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_GetSessionIdString_ReturnValue) == 0x000150, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_GetSessionIdString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_GetServerName_ReturnValue) == 0x000160, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_GetServerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_Concat_StrStr_ReturnValue) == 0x000170, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000180, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000190, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_IsEmpty_ReturnValue) == 0x000191, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_BooleanOR_ReturnValue) == 0x000192, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_GetSelectedOption_ReturnValue) == 0x000198, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_GetSelectedOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, Temp_int_Loop_Counter_Variable) == 0x0001A8, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_Less_IntInt_ReturnValue) == 0x0001AC, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InstanceSelector_C_UpdateInstanceOptionList, CallFunc_Add_IntInt_ReturnValue) == 0x0001B0, "Member 'WBP_InstanceSelector_C_UpdateInstanceOptionList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_InstanceSelector.WBP_InstanceSelector_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_InstanceSelector_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InstanceSelector_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_InstanceSelector_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_InstanceSelector_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_InstanceSelector_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_InstanceSelector_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_InstanceSelector_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

