#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NamingErrorTooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_NamingErrorTooltip.WBP_NamingErrorTooltip_C.InitializeErrors
// 0x0010 (0x0010 - 0x0000)
struct WBP_NamingErrorTooltip_C_InitializeErrors final
{
public:
	TArray<class FText>                           Errors;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_NamingErrorTooltip_C_InitializeErrors) == 0x000008, "Wrong alignment on WBP_NamingErrorTooltip_C_InitializeErrors");
static_assert(sizeof(WBP_NamingErrorTooltip_C_InitializeErrors) == 0x000010, "Wrong size on WBP_NamingErrorTooltip_C_InitializeErrors");
static_assert(offsetof(WBP_NamingErrorTooltip_C_InitializeErrors, Errors) == 0x000000, "Member 'WBP_NamingErrorTooltip_C_InitializeErrors::Errors' has a wrong offset!");

// Function WBP_NamingErrorTooltip.WBP_NamingErrorTooltip_C.ExecuteUbergraph_WBP_NamingErrorTooltip
// 0x0060 (0x0060 - 0x0000)
struct WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_CustomEvent_Errors;                         // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C3[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0028(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C4[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_BP_CreateEntry_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_NamingError_C*                     K2Node_DynamicCast_AsWBP_Naming_Error;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip) == 0x000008, "Wrong alignment on WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip");
static_assert(sizeof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip) == 0x000060, "Wrong size on WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip");
static_assert(offsetof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip, EntryPoint) == 0x000000, "Member 'WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip, K2Node_CustomEvent_Errors) == 0x000008, "Member 'WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip::K2Node_CustomEvent_Errors' has a wrong offset!");
static_assert(offsetof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip, CallFunc_BP_CreateEntry_ReturnValue) == 0x000048, "Member 'WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip::CallFunc_BP_CreateEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip, K2Node_DynamicCast_AsWBP_Naming_Error) == 0x000050, "Member 'WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip::K2Node_DynamicCast_AsWBP_Naming_Error' has a wrong offset!");
static_assert(offsetof(WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_NamingErrorTooltip_C_ExecuteUbergraph_WBP_NamingErrorTooltip::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

