#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainWidget_Console

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ETutorialVolumeType_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S6UICore_structs.hpp"
#include "Palia_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UMG_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.ActivateChatPanel
// 0x0007 (0x0007 - 0x0000)
struct WBP_MainWidget_Console_C_ActivateChatPanel final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanActivateChat_CanActivate;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVALUI_ChatPanelState                         CallFunc_GetCurrentChatState_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVALUI_ChatPanelState                         CallFunc_GetCurrentChatState_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_ActivateChatPanel) == 0x000001, "Wrong alignment on WBP_MainWidget_Console_C_ActivateChatPanel");
static_assert(sizeof(WBP_MainWidget_Console_C_ActivateChatPanel) == 0x000007, "Wrong size on WBP_MainWidget_Console_C_ActivateChatPanel");
static_assert(offsetof(WBP_MainWidget_Console_C_ActivateChatPanel, Activate) == 0x000000, "Member 'WBP_MainWidget_Console_C_ActivateChatPanel::Activate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_ActivateChatPanel, CallFunc_CanActivateChat_CanActivate) == 0x000001, "Member 'WBP_MainWidget_Console_C_ActivateChatPanel::CallFunc_CanActivateChat_CanActivate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_ActivateChatPanel, CallFunc_GetCurrentChatState_ReturnValue) == 0x000002, "Member 'WBP_MainWidget_Console_C_ActivateChatPanel::CallFunc_GetCurrentChatState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_ActivateChatPanel, CallFunc_GetCurrentChatState_ReturnValue_1) == 0x000003, "Member 'WBP_MainWidget_Console_C_ActivateChatPanel::CallFunc_GetCurrentChatState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_ActivateChatPanel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'WBP_MainWidget_Console_C_ActivateChatPanel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_ActivateChatPanel, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'WBP_MainWidget_Console_C_ActivateChatPanel::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_ActivateChatPanel, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'WBP_MainWidget_Console_C_ActivateChatPanel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.Bind to Character Action Input Event
// 0x0050 (0x0050 - 0x0000)
struct WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event) == 0x000004, "Wrong alignment on WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event");
static_assert(sizeof(WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event) == 0x000050, "Wrong size on WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event");
static_assert(offsetof(WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'WBP_MainWidget_Console_C_Bind_to_Character_Action_Input_Event::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.BindEventsOnPlayerPawnNS
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS final
{
public:
	TDelegate<void(class AValeriaCharacter* InValeriaCharacter, class UPrivateSpaceConfig* PrivateSpaceConfig)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* InValeriaCharacter, class UPrivateSpaceConfig* PrivateSpaceConfig)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterTeleportComponent*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPlacementComponent* PC, bool IsPlacing)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCharacterStateMachineComponent* Csm, struct FCharacterStateChangeParams& Params, ECharacterState StateBeingExited, ECharacterState StateBeingEntered)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlacementComponent*                    CallFunc_GetPlacement_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCharacterStateMachineComponent* Csm, struct FCharacterStateChangeParams& Params, TArray<ECharacterState>& StatesExited, ECharacterState StateEntered)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F15[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFishingViewComponent* FishingView, const struct FFishingMiniGameViewState& ViewState, class UFishingComponent* Source)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F16[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_FishingViewComponent_C*             CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFishingComponent*                      CallFunc_GetFishing_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFishingViewComponent*                  CallFunc_GetComponentByClass_ReturnValue_2;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue_1;               // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfActionBarRows_ReturnValue;     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS) == 0x000008, "Wrong alignment on WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS");
static_assert(sizeof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS) == 0x0000B8, "Wrong size on WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, CallFunc_GetInventory_ReturnValue) == 0x000010, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, CallFunc_GetPlacement_ReturnValue) == 0x000050, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::CallFunc_GetPlacement_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, K2Node_CreateDelegate_OutputDelegate_4) == 0x000058, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, K2Node_CreateDelegate_OutputDelegate_5) == 0x00006C, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000080, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, K2Node_CreateDelegate_OutputDelegate_6) == 0x000088, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, CallFunc_GetFishing_ReturnValue) == 0x000098, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::CallFunc_GetFishing_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0000A0, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, CallFunc_GetInventory_ReturnValue_1) == 0x0000A8, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::CallFunc_GetInventory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, CallFunc_GetNumberOfActionBarRows_ReturnValue) == 0x0000B0, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::CallFunc_GetNumberOfActionBarRows_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS, CallFunc_IsValid_ReturnValue_1) == 0x0000B4, "Member 'WBP_MainWidget_Console_C_BindEventsOnPlayerPawnNS::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.BindToChatManagerEvents
// 0x0018 (0x0018 - 0x0000)
struct WBP_MainWidget_Console_C_BindToChatManagerEvents final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_BindToChatManagerEvents) == 0x000008, "Wrong alignment on WBP_MainWidget_Console_C_BindToChatManagerEvents");
static_assert(sizeof(WBP_MainWidget_Console_C_BindToChatManagerEvents) == 0x000018, "Wrong size on WBP_MainWidget_Console_C_BindToChatManagerEvents");
static_assert(offsetof(WBP_MainWidget_Console_C_BindToChatManagerEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_MainWidget_Console_C_BindToChatManagerEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BindToChatManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'WBP_MainWidget_Console_C_BindToChatManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.BndEvt__WBP_MainWidget_Console_WBP_HotBar_PF_K2Node_ComponentBoundEvent_0_OnEnterUseSeedFurnitureMode__DelegateSignature
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_MainWidget_Console_C_BndEvt__WBP_MainWidget_Console_WBP_HotBar_PF_K2Node_ComponentBoundEvent_0_OnEnterUseSeedFurnitureMode__DelegateSignature final
{
public:
	int32                                         Number;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F17[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            InBrush;                                           // 0x0010(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_MainWidget_Console_C_BndEvt__WBP_MainWidget_Console_WBP_HotBar_PF_K2Node_ComponentBoundEvent_0_OnEnterUseSeedFurnitureMode__DelegateSignature) == 0x000010, "Wrong alignment on WBP_MainWidget_Console_C_BndEvt__WBP_MainWidget_Console_WBP_HotBar_PF_K2Node_ComponentBoundEvent_0_OnEnterUseSeedFurnitureMode__DelegateSignature");
static_assert(sizeof(WBP_MainWidget_Console_C_BndEvt__WBP_MainWidget_Console_WBP_HotBar_PF_K2Node_ComponentBoundEvent_0_OnEnterUseSeedFurnitureMode__DelegateSignature) == 0x0000E0, "Wrong size on WBP_MainWidget_Console_C_BndEvt__WBP_MainWidget_Console_WBP_HotBar_PF_K2Node_ComponentBoundEvent_0_OnEnterUseSeedFurnitureMode__DelegateSignature");
static_assert(offsetof(WBP_MainWidget_Console_C_BndEvt__WBP_MainWidget_Console_WBP_HotBar_PF_K2Node_ComponentBoundEvent_0_OnEnterUseSeedFurnitureMode__DelegateSignature, Number) == 0x000000, "Member 'WBP_MainWidget_Console_C_BndEvt__WBP_MainWidget_Console_WBP_HotBar_PF_K2Node_ComponentBoundEvent_0_OnEnterUseSeedFurnitureMode__DelegateSignature::Number' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_BndEvt__WBP_MainWidget_Console_WBP_HotBar_PF_K2Node_ComponentBoundEvent_0_OnEnterUseSeedFurnitureMode__DelegateSignature, InBrush) == 0x000010, "Member 'WBP_MainWidget_Console_C_BndEvt__WBP_MainWidget_Console_WBP_HotBar_PF_K2Node_ComponentBoundEvent_0_OnEnterUseSeedFurnitureMode__DelegateSignature::InBrush' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.CanActivateChat
// 0x0003 (0x0003 - 0x0000)
struct WBP_MainWidget_Console_C_CanActivateChat final
{
public:
	bool                                          CanActivate;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_CanActivateChat) == 0x000001, "Wrong alignment on WBP_MainWidget_Console_C_CanActivateChat");
static_assert(sizeof(WBP_MainWidget_Console_C_CanActivateChat) == 0x000003, "Wrong size on WBP_MainWidget_Console_C_CanActivateChat");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateChat, CanActivate) == 0x000000, "Member 'WBP_MainWidget_Console_C_CanActivateChat::CanActivate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateChat, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'WBP_MainWidget_Console_C_CanActivateChat::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateChat, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_MainWidget_Console_C_CanActivateChat::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.CanActivateEmoteWheel
// 0x0030 (0x0030 - 0x0000)
struct WBP_MainWidget_Console_C_CanActivateEmoteWheel final
{
public:
	bool                                          CanActivate;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F18[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGASComponent*                   CallFunc_GetGAS_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCurrentlyMove_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_GetCurrentStateType_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesStatePreventCircularWheels_Prevented; // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlacementMode_InPlacementMode;        // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_CanActivateEmoteWheel) == 0x000008, "Wrong alignment on WBP_MainWidget_Console_C_CanActivateEmoteWheel");
static_assert(sizeof(WBP_MainWidget_Console_C_CanActivateEmoteWheel) == 0x000030, "Wrong size on WBP_MainWidget_Console_C_CanActivateEmoteWheel");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CanActivate) == 0x000000, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CanActivate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_GetValeriaCharacter_OutResult) == 0x000001, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_GetGAS_ReturnValue) == 0x000010, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_GetGAS_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_GetCSM_ReturnValue) == 0x000018, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_CanCurrentlyMove_ReturnValue) == 0x000020, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_CanCurrentlyMove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_GetCurrentStateType_ReturnValue) == 0x000021, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_GetCurrentStateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_DoesStatePreventCircularWheels_Prevented) == 0x000023, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_DoesStatePreventCircularWheels_Prevented' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, K2Node_SwitchEnum_CmpSuccess) == 0x000024, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_IsInPlacementMode_InPlacementMode) == 0x000025, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_IsInPlacementMode_InPlacementMode' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_BooleanOR_ReturnValue) == 0x000026, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_BooleanOR_ReturnValue_1) == 0x000027, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_BooleanOR_ReturnValue_2) == 0x000028, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateEmoteWheel, CallFunc_Not_PreBool_ReturnValue_1) == 0x000029, "Member 'WBP_MainWidget_Console_C_CanActivateEmoteWheel::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.CanActivatePMenu
// 0x0028 (0x0028 - 0x0000)
struct WBP_MainWidget_Console_C_CanActivatePMenu final
{
public:
	bool                                          bCanActivate;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F19[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlacementMode_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1A[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_GetCurrentStateType_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_CanActivatePMenu) == 0x000008, "Wrong alignment on WBP_MainWidget_Console_C_CanActivatePMenu");
static_assert(sizeof(WBP_MainWidget_Console_C_CanActivatePMenu) == 0x000028, "Wrong size on WBP_MainWidget_Console_C_CanActivatePMenu");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivatePMenu, bCanActivate) == 0x000000, "Member 'WBP_MainWidget_Console_C_CanActivatePMenu::bCanActivate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivatePMenu, CallFunc_GetValeriaCharacter_OutResult) == 0x000001, "Member 'WBP_MainWidget_Console_C_CanActivatePMenu::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivatePMenu, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_MainWidget_Console_C_CanActivatePMenu::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivatePMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_MainWidget_Console_C_CanActivatePMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivatePMenu, CallFunc_IsInPlacementMode_ReturnValue) == 0x000011, "Member 'WBP_MainWidget_Console_C_CanActivatePMenu::CallFunc_IsInPlacementMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivatePMenu, CallFunc_GetCSM_ReturnValue) == 0x000018, "Member 'WBP_MainWidget_Console_C_CanActivatePMenu::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivatePMenu, CallFunc_GetCurrentStateType_ReturnValue) == 0x000020, "Member 'WBP_MainWidget_Console_C_CanActivatePMenu::CallFunc_GetCurrentStateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivatePMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_MainWidget_Console_C_CanActivatePMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivatePMenu, CallFunc_BooleanNOR_ReturnValue) == 0x000022, "Member 'WBP_MainWidget_Console_C_CanActivatePMenu::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.CanActivateToolWheel
// 0x0048 (0x0048 - 0x0000)
struct WBP_MainWidget_Console_C_CanActivateToolWheel final
{
public:
	bool                                          CanActivate;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1B[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ValeriaPlayerController_C*          K2Node_DynamicCast_AsBP_Valeria_Player_Controller; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlacementMode_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1C[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGASComponent*                   CallFunc_GetGAS_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityMarkedLockedIn_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_GetCurrentStateType_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesStatePreventCircularWheels_Prevented; // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_CanActivateToolWheel) == 0x000008, "Wrong alignment on WBP_MainWidget_Console_C_CanActivateToolWheel");
static_assert(sizeof(WBP_MainWidget_Console_C_CanActivateToolWheel) == 0x000048, "Wrong size on WBP_MainWidget_Console_C_CanActivateToolWheel");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CanActivate) == 0x000000, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CanActivate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CallFunc_GetValeriaCharacter_OutResult) == 0x000001, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000010, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, K2Node_DynamicCast_AsBP_Valeria_Player_Controller) == 0x000018, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::K2Node_DynamicCast_AsBP_Valeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CallFunc_IsInPlacementMode_ReturnValue) == 0x000021, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CallFunc_IsInPlacementMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CallFunc_GetGAS_ReturnValue) == 0x000028, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CallFunc_GetGAS_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CallFunc_IsAbilityMarkedLockedIn_ReturnValue) == 0x000030, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CallFunc_IsAbilityMarkedLockedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CallFunc_GetCSM_ReturnValue) == 0x000038, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CallFunc_GetCurrentStateType_ReturnValue) == 0x000041, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CallFunc_GetCurrentStateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, K2Node_SwitchEnum_CmpSuccess) == 0x000042, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CallFunc_DoesStatePreventCircularWheels_Prevented) == 0x000043, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CallFunc_DoesStatePreventCircularWheels_Prevented' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanActivateToolWheel, CallFunc_BooleanOR_ReturnValue_1) == 0x000044, "Member 'WBP_MainWidget_Console_C_CanActivateToolWheel::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.CanOpenMenus
// 0x0038 (0x0038 - 0x0000)
struct WBP_MainWidget_Console_C_CanOpenMenus final
{
public:
	bool                                          Param_CanOpenMenus;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_GameplayUIManager_C*               K2Node_DynamicCast_AsWBP_Gameplay_UIManager;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOpenMenus_ReturnValue;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFullscreenFadeInActive_IsActive;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_CanOpenMenus) == 0x000008, "Wrong alignment on WBP_MainWidget_Console_C_CanOpenMenus");
static_assert(sizeof(WBP_MainWidget_Console_C_CanOpenMenus) == 0x000038, "Wrong size on WBP_MainWidget_Console_C_CanOpenMenus");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, Param_CanOpenMenus) == 0x000000, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::Param_CanOpenMenus' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, CallFunc_GetValeriaCharacter_OutResult) == 0x000018, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000020, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, K2Node_DynamicCast_AsWBP_Gameplay_UIManager) == 0x000028, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::K2Node_DynamicCast_AsWBP_Gameplay_UIManager' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, CallFunc_CanOpenMenus_ReturnValue) == 0x000031, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::CallFunc_CanOpenMenus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, CallFunc_IsFullscreenFadeInActive_IsActive) == 0x000032, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::CallFunc_IsFullscreenFadeInActive_IsActive' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, CallFunc_Not_PreBool_ReturnValue) == 0x000033, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, K2Node_SwitchEnum_CmpSuccess) == 0x000034, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CanOpenMenus, CallFunc_BooleanAND_ReturnValue) == 0x000035, "Member 'WBP_MainWidget_Console_C_CanOpenMenus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.Check for Crafted Tutorial Items
// 0x02A8 (0x02A8 - 0x0000)
struct WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items final
{
public:
	int32                                         RecipeId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F20[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> Param_StoveItemType;                               // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> TentItemType;                                      // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	struct FRecipeConfig                          CallFunc_GetRecipeConfigById_ReturnValue;          // 0x0058(0x0240)()
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items) == 0x000008, "Wrong alignment on WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items");
static_assert(sizeof(WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items) == 0x0002A8, "Wrong size on WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items");
static_assert(offsetof(WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items, RecipeId) == 0x000000, "Member 'WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items::RecipeId' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items, Param_StoveItemType) == 0x000008, "Member 'WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items::Param_StoveItemType' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items, TentItemType) == 0x000030, "Member 'WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items::TentItemType' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items, CallFunc_GetRecipeConfigById_ReturnValue) == 0x000058, "Member 'WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items::CallFunc_GetRecipeConfigById_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000298, "Member 'WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002A0, "Member 'WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items, CallFunc_CanStartTutorialForFlag_ReturnValue) == 0x0002A1, "Member 'WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items::CallFunc_CanStartTutorialForFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items, CallFunc_BooleanAND_ReturnValue) == 0x0002A2, "Member 'WBP_MainWidget_Console_C_Check_for_Crafted_Tutorial_Items::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.Check for Workbench
// 0x0038 (0x0038 - 0x0000)
struct WBP_MainWidget_Console_C_Check_for_Workbench final
{
public:
	class AValeriaCharacter*                      VC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> WorkbenchType;                                     // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_OwnsItem_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_Check_for_Workbench) == 0x000008, "Wrong alignment on WBP_MainWidget_Console_C_Check_for_Workbench");
static_assert(sizeof(WBP_MainWidget_Console_C_Check_for_Workbench) == 0x000038, "Wrong size on WBP_MainWidget_Console_C_Check_for_Workbench");
static_assert(offsetof(WBP_MainWidget_Console_C_Check_for_Workbench, VC) == 0x000000, "Member 'WBP_MainWidget_Console_C_Check_for_Workbench::VC' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Check_for_Workbench, WorkbenchType) == 0x000008, "Member 'WBP_MainWidget_Console_C_Check_for_Workbench::WorkbenchType' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Check_for_Workbench, CallFunc_OwnsItem_ReturnValue) == 0x000030, "Member 'WBP_MainWidget_Console_C_Check_for_Workbench::CallFunc_OwnsItem_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.CloseSocialPanel
// 0x0040 (0x0040 - 0x0000)
struct WBP_MainWidget_Console_C_CloseSocialPanel final
{
public:
	struct FVALUI_MainHUDState                    HUDState;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_5F21[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_StateViewModel*                   CallFunc_GetViewModel_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_StateViewModel*                   CallFunc_GetViewModel_ReturnValue_1;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_MainHUDViewModel*                K2Node_DynamicCast_AsVALUI_Main_HUDView_Model;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F22[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_MainHUDViewModel*                K2Node_DynamicCast_AsVALUI_Main_HUDView_Model_1;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_CloseSocialPanel) == 0x000008, "Wrong alignment on WBP_MainWidget_Console_C_CloseSocialPanel");
static_assert(sizeof(WBP_MainWidget_Console_C_CloseSocialPanel) == 0x000040, "Wrong size on WBP_MainWidget_Console_C_CloseSocialPanel");
static_assert(offsetof(WBP_MainWidget_Console_C_CloseSocialPanel, HUDState) == 0x000000, "Member 'WBP_MainWidget_Console_C_CloseSocialPanel::HUDState' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CloseSocialPanel, CallFunc_GetViewModel_ReturnValue) == 0x000010, "Member 'WBP_MainWidget_Console_C_CloseSocialPanel::CallFunc_GetViewModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CloseSocialPanel, CallFunc_GetViewModel_ReturnValue_1) == 0x000018, "Member 'WBP_MainWidget_Console_C_CloseSocialPanel::CallFunc_GetViewModel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CloseSocialPanel, K2Node_DynamicCast_AsVALUI_Main_HUDView_Model) == 0x000020, "Member 'WBP_MainWidget_Console_C_CloseSocialPanel::K2Node_DynamicCast_AsVALUI_Main_HUDView_Model' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CloseSocialPanel, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_MainWidget_Console_C_CloseSocialPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CloseSocialPanel, K2Node_DynamicCast_AsVALUI_Main_HUDView_Model_1) == 0x000030, "Member 'WBP_MainWidget_Console_C_CloseSocialPanel::K2Node_DynamicCast_AsVALUI_Main_HUDView_Model_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_CloseSocialPanel, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_MainWidget_Console_C_CloseSocialPanel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.Cooking Tutorial Setup
// 0x0030 (0x0030 - 0x0000)
struct WBP_MainWidget_Console_C_Cooking_Tutorial_Setup final
{
public:
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F23[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F24[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillPersist                          CallFunc_GetSkillLevel_ReturnValue;                // 0x001C(0x000C)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_Cooking_Tutorial_Setup) == 0x000008, "Wrong alignment on WBP_MainWidget_Console_C_Cooking_Tutorial_Setup");
static_assert(sizeof(WBP_MainWidget_Console_C_Cooking_Tutorial_Setup) == 0x000030, "Wrong size on WBP_MainWidget_Console_C_Cooking_Tutorial_Setup");
static_assert(offsetof(WBP_MainWidget_Console_C_Cooking_Tutorial_Setup, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_MainWidget_Console_C_Cooking_Tutorial_Setup::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Cooking_Tutorial_Setup, CallFunc_GetValeriaCharacter_OutResult) == 0x000008, "Member 'WBP_MainWidget_Console_C_Cooking_Tutorial_Setup::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Cooking_Tutorial_Setup, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_MainWidget_Console_C_Cooking_Tutorial_Setup::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Cooking_Tutorial_Setup, CallFunc_CanStartTutorialForFlag_ReturnValue) == 0x000018, "Member 'WBP_MainWidget_Console_C_Cooking_Tutorial_Setup::CallFunc_CanStartTutorialForFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Cooking_Tutorial_Setup, CallFunc_GetSkillLevel_ReturnValue) == 0x00001C, "Member 'WBP_MainWidget_Console_C_Cooking_Tutorial_Setup::CallFunc_GetSkillLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Cooking_Tutorial_Setup, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'WBP_MainWidget_Console_C_Cooking_Tutorial_Setup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_Console_C_Cooking_Tutorial_Setup, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000029, "Member 'WBP_MainWidget_Console_C_Cooking_Tutorial_Setup::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_Console.WBP_MainWidget_Console_C.DialogueSetup
// 0x0150 (0x0150 - 0x0000)
struct WBP_MainWidget_Console_C_DialogueSetup final
{
public:
	ECharacterState                               CharacterState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LeaveDialogueUnchanged;                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F25[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogueListToShow                    Param_DialoguesToShow;                             // 0x0008(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDialogueComponent*                     Param_DialogueComponent;                           // 0x0140(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_Console_C_DialogueSetup) == 0x000008, "Wrong alignment on WBP_MainWidget_Console_C_DialogueSetup");
static_assert(sizeof(WBP_MainWidget_Console_C_DialogueSetup) == 0x000150, "Wrong size on WBP_MainWidget_Console_C_DialogueSetup");
static_assert(offsetof(WBP_MainWidget_Console_C_DialogueSetup, CharacterState) == 0x000000, "Member 'WBP_MainWidget_Console_C_DialogueSetup::CharacterState' has a wrong offset!");
