#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuildActivityTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GuildActivityTracker.WBP_GuildActivityTracker_C
// 0x0020 (0x02E0 - 0x02C0)
class UWBP_GuildActivityTracker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BasicHighlightDecorator_C*         HighlightDecorator;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor_Popin_C*                    MenuAnchor_Popin;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_TrackedQuests;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BindGuildQuestsChanged(bool ShouldBind, class UVAL_PlayerGuildComponent* LocalComponent, TDelegate<void(class UVAL_PlayerGuildComponent* PlayerGuildComponent)> K2Node_CreateDelegate_OutputDelegate, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UVAL_PlayerGuildComponent* CallFunc_GetComponentByClass_ReturnValue);
	void CreatePinWidgetFromQuest(struct FVAL_PlayerGuildQuest& Quest, class UVAL_PlayerGuildComponent* PlayerGuildComp, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UWBP_ListEntry_GuildActivityTracker_C* CallFunc_Create_ReturnValue, bool CallFunc_IsQuestPinned_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue);
	void Destruct();
	void ExecuteUbergraph_WBP_GuildActivityTracker(int32 EntryPoint, bool CallFunc_IsFeatureEnabled_ReturnValue, int32 Temp_int_Variable, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Array_Index_Variable_2, bool K2Node_Event_IsDesignTime, class UVAL_PlayerGuildComponent* K2Node_CustomEvent_PlayerGuildComp, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, class UVAL_PlayerGuildComponent* CallFunc_GetComponentByClass_ReturnValue, const struct FVAL_PlayerGuildQuest& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const struct FVAL_PlayerGuildQuest& CallFunc_Array_Get_Item_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, const struct FVAL_PlayerGuildQuest& CallFunc_Array_Get_Item_2, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_Less_IntInt_ReturnValue_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UWBP_ListEntry_GuildActivityTracker_C* CallFunc_Create_ReturnValue, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, bool CallFunc_IsFeatureEnabled_ReturnValue_1, bool CallFunc_IsFeatureEnabled_ReturnValue_2);
	void HandleOnGuildPinnedQuestsChanged(class UVAL_PlayerGuildComponent* PlayerGuildComponent);
	void InitializeFromCharacter(class UVAL_PlayerGuildComponent* PlayerGuildComp, TDelegate<void(class UVAL_PlayerGuildComponent* PlayerGuildComponent)> K2Node_CreateDelegate_OutputDelegate);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void RebuildQuests(class UVAL_PlayerGuildComponent* PlayerGuildComp);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GuildActivityTracker_C">();
	}
	static class UWBP_GuildActivityTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GuildActivityTracker_C>();
	}
};
static_assert(alignof(UWBP_GuildActivityTracker_C) == 0x000008, "Wrong alignment on UWBP_GuildActivityTracker_C");
static_assert(sizeof(UWBP_GuildActivityTracker_C) == 0x0002E0, "Wrong size on UWBP_GuildActivityTracker_C");
static_assert(offsetof(UWBP_GuildActivityTracker_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_GuildActivityTracker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GuildActivityTracker_C, HighlightDecorator) == 0x0002C8, "Member 'UWBP_GuildActivityTracker_C::HighlightDecorator' has a wrong offset!");
static_assert(offsetof(UWBP_GuildActivityTracker_C, MenuAnchor_Popin) == 0x0002D0, "Member 'UWBP_GuildActivityTracker_C::MenuAnchor_Popin' has a wrong offset!");
static_assert(offsetof(UWBP_GuildActivityTracker_C, VBox_TrackedQuests) == 0x0002D8, "Member 'UWBP_GuildActivityTracker_C::VBox_TrackedQuests' has a wrong offset!");

}

