#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Notification_DebugTest_WithBindings

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Notification_DebugTest_WithBindings.WBP_Notification_DebugTest_WithBindings_C.Close
// 0x0001 (0x0001 - 0x0000)
struct WBP_Notification_DebugTest_WithBindings_C_Close final
{
public:
	bool                                          CallFunc_TryDismissNotification_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_DebugTest_WithBindings_C_Close) == 0x000001, "Wrong alignment on WBP_Notification_DebugTest_WithBindings_C_Close");
static_assert(sizeof(WBP_Notification_DebugTest_WithBindings_C_Close) == 0x000001, "Wrong size on WBP_Notification_DebugTest_WithBindings_C_Close");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_Close, CallFunc_TryDismissNotification_ReturnValue) == 0x000000, "Member 'WBP_Notification_DebugTest_WithBindings_C_Close::CallFunc_TryDismissNotification_ReturnValue' has a wrong offset!");

// Function WBP_Notification_DebugTest_WithBindings.WBP_Notification_DebugTest_WithBindings_C.ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings
// 0x0080 (0x0080 - 0x0000)
struct WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EE9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_NotificationQueue*               K2Node_Event_NotificationQueue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_Event_NotificationId;                       // 0x0010(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryDismissNotification_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryDismissNotification_ReturnValue_1;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EEA[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_NotificationQueue*               K2Node_Event_NotificationQueue_1;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_Event_NotificationId_1;                     // 0x0030(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_RegisterInputActionBinding_ReturnValue;   // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_RegisterInputActionBinding_ReturnValue_1; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings) == 0x000008, "Wrong alignment on WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings");
static_assert(sizeof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings) == 0x000080, "Wrong size on WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings, EntryPoint) == 0x000000, "Member 'WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings, K2Node_Event_NotificationQueue) == 0x000008, "Member 'WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings::K2Node_Event_NotificationQueue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings, K2Node_Event_NotificationId) == 0x000010, "Member 'WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings::K2Node_Event_NotificationId' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings, CallFunc_TryDismissNotification_ReturnValue) == 0x000020, "Member 'WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings::CallFunc_TryDismissNotification_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings, CallFunc_TryDismissNotification_ReturnValue_1) == 0x000021, "Member 'WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings::CallFunc_TryDismissNotification_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings, K2Node_Event_NotificationQueue_1) == 0x000028, "Member 'WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings::K2Node_Event_NotificationQueue_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings, K2Node_Event_NotificationId_1) == 0x000030, "Member 'WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings::K2Node_Event_NotificationId_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings, CallFunc_RegisterInputActionBinding_ReturnValue) == 0x000050, "Member 'WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings::CallFunc_RegisterInputActionBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings, CallFunc_RegisterInputActionBinding_ReturnValue_1) == 0x000070, "Member 'WBP_Notification_DebugTest_WithBindings_C_ExecuteUbergraph_WBP_Notification_DebugTest_WithBindings::CallFunc_RegisterInputActionBinding_ReturnValue_1' has a wrong offset!");

// Function WBP_Notification_DebugTest_WithBindings.WBP_Notification_DebugTest_WithBindings_C.HandleInputAction_AcceptPartyInvite_Triggered
// 0x0030 (0x0030 - 0x0000)
struct WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           InputAction;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered) == 0x000008, "Wrong alignment on WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered");
static_assert(sizeof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered) == 0x000030, "Wrong size on WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered, ActionValue) == 0x000000, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered, ElapsedTime) == 0x000020, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered, TriggeredTime) == 0x000024, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered, InputAction) == 0x000028, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_AcceptPartyInvite_Triggered::InputAction' has a wrong offset!");

// Function WBP_Notification_DebugTest_WithBindings.WBP_Notification_DebugTest_WithBindings_C.HandleInputAction_DismissNotification_Triggered
// 0x0030 (0x0030 - 0x0000)
struct WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           InputAction;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered) == 0x000008, "Wrong alignment on WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered");
static_assert(sizeof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered) == 0x000030, "Wrong size on WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered, ActionValue) == 0x000000, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered, ElapsedTime) == 0x000020, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered, TriggeredTime) == 0x000024, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered, InputAction) == 0x000028, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleInputAction_DismissNotification_Triggered::InputAction' has a wrong offset!");

// Function WBP_Notification_DebugTest_WithBindings.WBP_Notification_DebugTest_WithBindings_C.HandleNotificationDismissed
// 0x0018 (0x0018 - 0x0000)
struct WBP_Notification_DebugTest_WithBindings_C_HandleNotificationDismissed final
{
public:
	class UVALUI_NotificationQueue*               NotificationQueue;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  NotificationId;                                    // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_DebugTest_WithBindings_C_HandleNotificationDismissed) == 0x000008, "Wrong alignment on WBP_Notification_DebugTest_WithBindings_C_HandleNotificationDismissed");
static_assert(sizeof(WBP_Notification_DebugTest_WithBindings_C_HandleNotificationDismissed) == 0x000018, "Wrong size on WBP_Notification_DebugTest_WithBindings_C_HandleNotificationDismissed");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleNotificationDismissed, NotificationQueue) == 0x000000, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleNotificationDismissed::NotificationQueue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleNotificationDismissed, NotificationId) == 0x000008, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleNotificationDismissed::NotificationId' has a wrong offset!");

// Function WBP_Notification_DebugTest_WithBindings.WBP_Notification_DebugTest_WithBindings_C.HandleNotificationShown
// 0x0018 (0x0018 - 0x0000)
struct WBP_Notification_DebugTest_WithBindings_C_HandleNotificationShown final
{
public:
	class UVALUI_NotificationQueue*               NotificationQueue;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  NotificationId;                                    // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_DebugTest_WithBindings_C_HandleNotificationShown) == 0x000008, "Wrong alignment on WBP_Notification_DebugTest_WithBindings_C_HandleNotificationShown");
static_assert(sizeof(WBP_Notification_DebugTest_WithBindings_C_HandleNotificationShown) == 0x000018, "Wrong size on WBP_Notification_DebugTest_WithBindings_C_HandleNotificationShown");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleNotificationShown, NotificationQueue) == 0x000000, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleNotificationShown::NotificationQueue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_HandleNotificationShown, NotificationId) == 0x000008, "Member 'WBP_Notification_DebugTest_WithBindings_C_HandleNotificationShown::NotificationId' has a wrong offset!");

// Function WBP_Notification_DebugTest_WithBindings.WBP_Notification_DebugTest_WithBindings_C.MatchesNotification
// 0x0048 (0x0048 - 0x0000)
struct WBP_Notification_DebugTest_WithBindings_C_MatchesNotification final
{
public:
	class FText                                   NotificationText;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TSoftObjectPtr<class UTexture2D>              NotificationIcon;                                  // 0x0018(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_DebugTest_WithBindings_C_MatchesNotification) == 0x000008, "Wrong alignment on WBP_Notification_DebugTest_WithBindings_C_MatchesNotification");
static_assert(sizeof(WBP_Notification_DebugTest_WithBindings_C_MatchesNotification) == 0x000048, "Wrong size on WBP_Notification_DebugTest_WithBindings_C_MatchesNotification");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_MatchesNotification, NotificationText) == 0x000000, "Member 'WBP_Notification_DebugTest_WithBindings_C_MatchesNotification::NotificationText' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_MatchesNotification, NotificationIcon) == 0x000018, "Member 'WBP_Notification_DebugTest_WithBindings_C_MatchesNotification::NotificationIcon' has a wrong offset!");
static_assert(offsetof(WBP_Notification_DebugTest_WithBindings_C_MatchesNotification, ReturnValue) == 0x000040, "Member 'WBP_Notification_DebugTest_WithBindings_C_MatchesNotification::ReturnValue' has a wrong offset!");

}

