#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NearbyChatPlayerEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NearbyChatPlayerEntry.WBP_NearbyChatPlayerEntry_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_NearbyChatPlayerEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                Text_Name;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_NearbyChatEntry_C*                  PlayerEntry;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_NearbyChatPlayerEntry(int32 EntryPoint, struct FGuid& K2Node_CustomEvent_AccountId_1, struct FGuid& K2Node_CustomEvent_CharacterId_1, TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId)> K2Node_CreateDelegate_OutputDelegate, struct FGuid& K2Node_CustomEvent_AccountId, struct FGuid& K2Node_CustomEvent_CharacterId, struct FOSSVAL_CharacterNameAndId& K2Node_CustomEvent_Name, TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId, struct FOSSVAL_CharacterNameAndId& Name)> K2Node_CreateDelegate_OutputDelegate_1, const struct FOSSVAL_CharacterNameAndId& Temp_struct_Variable, const struct FGuid& Temp_struct_Variable_1, const struct FGuid& Temp_struct_Variable_2, bool K2Node_Event_bIsExpanded, bool K2Node_Event_bIsSelected, class UObject* K2Node_Event_ListItemObject, class UBP_NearbyChatEntry_C* K2Node_DynamicCast_AsBP_Nearby_Chat_Entry, bool K2Node_DynamicCast_bSuccess, class UOSSVAL_GetCharacterNameByAccountIdAndCharacterIdProxy* CallFunc_GetCharacterNameByAccountIdAndCharacterId_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void OnFailure_B88370F24494268F2C181994EE5770DF(struct FGuid& AccountId, struct FGuid& CharacterId);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnSuccess_B88370F24494268F2C181994EE5770DF(struct FGuid& AccountId, struct FGuid& CharacterId, struct FOSSVAL_CharacterNameAndId& Param_Name);
	void SetName(const class FString& Param_Name, class FText CallFunc_Conv_StringToText_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NearbyChatPlayerEntry_C">();
	}
	static class UWBP_NearbyChatPlayerEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NearbyChatPlayerEntry_C>();
	}
};
static_assert(alignof(UWBP_NearbyChatPlayerEntry_C) == 0x000008, "Wrong alignment on UWBP_NearbyChatPlayerEntry_C");
static_assert(sizeof(UWBP_NearbyChatPlayerEntry_C) == 0x0002D8, "Wrong size on UWBP_NearbyChatPlayerEntry_C");
static_assert(offsetof(UWBP_NearbyChatPlayerEntry_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_NearbyChatPlayerEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NearbyChatPlayerEntry_C, Text_Name) == 0x0002C8, "Member 'UWBP_NearbyChatPlayerEntry_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UWBP_NearbyChatPlayerEntry_C, PlayerEntry) == 0x0002D0, "Member 'UWBP_NearbyChatPlayerEntry_C::PlayerEntry' has a wrong offset!");

}

