#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCustomization_TabButtonsPanel_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CharacterCustomization_WardrobeButtonInfo_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C
// 0x00C8 (0x0388 - 0x02C0)
class UWBP_CharacterCustomization_TabButtonsPanel_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    Action_L;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    Action_R;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_DepthSortedHorizontalBox*        HBox_TabButtons;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FBP_CharacterCustomization_WardrobeButtonInfo> ButtonsInfo;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FMargin                                ButtonPadding;                                     // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	FMulticastInlineDelegateProperty_             OnButtonClicked;                                   // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class FName, class UWBP_CharacterCustomization_TabButton_CM_C*> TabButtons;                                        // 0x0310(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   ActiveTabName;                                     // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPreTabSetActive;                                 // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPostTabSetActive;                                // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM(int32 EntryPoint, const TSet<class FName>& K2Node_MakeSet_Set, bool K2Node_Event_IsDesignTime);
	void GenerateButtons(const TSet<class FName>& ExcludedButtons, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TDelegate<void(class UWBP_CharacterCustomization_TabButton_CM_C* Button)> K2Node_CreateDelegate_OutputDelegate, class UWBP_CharacterCustomization_TabButton_CM_C* CallFunc_Create_ReturnValue, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue, const struct FBP_CharacterCustomization_WardrobeButtonInfo& CallFunc_Array_Get_Item, bool CallFunc_Set_Contains_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void GetActiveTabName(class FName* Param_Name);
	void GetTabNames(TArray<class FName>* TabNames, TArray<class FName>& CallFunc_Map_Keys_Keys);
	void HandleOnButtonClickedCM(class UWBP_CharacterCustomization_TabButton_CM_C* Button, bool CallFunc_TrySetActiveTabName_Success);
	void OnButtonClicked__DelegateSignature(const struct FBP_CharacterCustomization_WardrobeButtonInfo& WardrobeButtonInfo);
	void OnPostTabSetActive__DelegateSignature(class FName TabName);
	void OnPreTabSetActive__DelegateSignature(class FName Tab_Name);
	void PreConstruct(bool IsDesignTime);
	void TrySetActiveTabName(class FName TabName, bool* Success, bool FoundTab, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, class UWBP_CharacterCustomization_TabButton_CM_C* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UWBP_CharacterCustomization_TabButton_CM_C* CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, TArray<class FName>& CallFunc_Map_Keys_Keys, class FName CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UWBP_CharacterCustomization_TabButton_CM_C* CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue);
	void UpdateTabBadgeCount(class FName Tab_Name, int32 Badge_Number, class UWBP_CharacterCustomization_TabButton_CM_C* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterCustomization_TabButtonsPanel_CM_C">();
	}
	static class UWBP_CharacterCustomization_TabButtonsPanel_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterCustomization_TabButtonsPanel_CM_C>();
	}
};
static_assert(alignof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C) == 0x000008, "Wrong alignment on UWBP_CharacterCustomization_TabButtonsPanel_CM_C");
static_assert(sizeof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C) == 0x000388, "Wrong size on UWBP_CharacterCustomization_TabButtonsPanel_CM_C");
static_assert(offsetof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_CharacterCustomization_TabButtonsPanel_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C, Action_L) == 0x0002C8, "Member 'UWBP_CharacterCustomization_TabButtonsPanel_CM_C::Action_L' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C, Action_R) == 0x0002D0, "Member 'UWBP_CharacterCustomization_TabButtonsPanel_CM_C::Action_R' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C, HBox_TabButtons) == 0x0002D8, "Member 'UWBP_CharacterCustomization_TabButtonsPanel_CM_C::HBox_TabButtons' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C, ButtonsInfo) == 0x0002E0, "Member 'UWBP_CharacterCustomization_TabButtonsPanel_CM_C::ButtonsInfo' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C, ButtonPadding) == 0x0002F0, "Member 'UWBP_CharacterCustomization_TabButtonsPanel_CM_C::ButtonPadding' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C, OnButtonClicked) == 0x000300, "Member 'UWBP_CharacterCustomization_TabButtonsPanel_CM_C::OnButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C, TabButtons) == 0x000310, "Member 'UWBP_CharacterCustomization_TabButtonsPanel_CM_C::TabButtons' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C, ActiveTabName) == 0x000360, "Member 'UWBP_CharacterCustomization_TabButtonsPanel_CM_C::ActiveTabName' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C, OnPreTabSetActive) == 0x000368, "Member 'UWBP_CharacterCustomization_TabButtonsPanel_CM_C::OnPreTabSetActive' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCustomization_TabButtonsPanel_CM_C, OnPostTabSetActive) == 0x000378, "Member 'UWBP_CharacterCustomization_TabButtonsPanel_CM_C::OnPostTabSetActive' has a wrong offset!");

}

