#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyMemberRowContextMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"
#include "UMG_structs.hpp"
#include "S6Core_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyMemberRowContextMenu.WBP_PartyMemberRowContextMenu_C
// 0x0168 (0x0678 - 0x0510)
class UWBP_PartyMemberRowContextMenu_C final : public UCommonActivatableWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               BlockButtonContainer;                              // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        BlockUnblockSwitcher;                              // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_Block;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_ChangeLeader;                               // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_KickFromParty;                              // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_Message;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_Mute;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_ProfileUI;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_Unblock;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_Unmute;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ChangeLeaderButtonContainer;                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_44;                                          // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               KickFromPartyButtonContainer_2;                    // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MessageButtonContainer;                            // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MuteButtonContainer;                               // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MuteUnmuteSwitcher;                                // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PS5Icon_1;                                         // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               UnblockButtonContainer;                            // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               UnmuteButtonContainer;                             // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ViewProfileButtonContainer;                        // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 XSXIcon_1;                                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMenuButtonPressed;                               // 0x05F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 CharacterName;                                     // 0x0600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVAL_PartyMember                       PartyMember;                                       // 0x0610(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidget*                                FirstFocusItem;                                    // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CharacterFullName;                                 // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PartyMemberRowContextMenu_Button_Block_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_Button_ChangeLeader_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_Button_KickFromParty_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_Button_Message_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_Button_Mute_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_Button_ProfileUI_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_Button_ProfileUI_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_Button_Unblock_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_Button_Unblock_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_Button_Unmute_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PartyMemberRowContextMenu_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_PartyMemberRowContextMenu(int32 EntryPoint, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, const struct FOSSVAL_CharacterNameAndId& Temp_struct_Variable, int32 CallFunc_GetPlayerControllerID_ReturnValue, const struct FGuid& Temp_struct_Variable_1, const struct FGuid& Temp_struct_Variable_2, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_3, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_1, float K2Node_EnhancedInputActionEvent_ElapsedTime_1, float K2Node_EnhancedInputActionEvent_TriggeredTime_1, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_1, class UInputAction* Temp_object_Variable, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, double Temp_real_Variable, double Temp_real_Variable_1, double Temp_real_Variable_0, double Temp_real_Variable_1_0, bool Temp_bool_Variable, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_1, class UInputAction* Temp_object_Variable_1, double Temp_real_Variable_2, double Temp_real_Variable_2_0, double Temp_real_Variable_3, bool Temp_bool_Variable_1, double Temp_real_Variable_3_0, class UChatManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_4, bool Temp_bool_Variable_2, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_5, struct FGuid& K2Node_CustomEvent_AccountId, struct FGuid& K2Node_CustomEvent_CharacterId, struct FOSSVAL_CharacterNameAndId& K2Node_CustomEvent_Name, TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId, struct FOSSVAL_CharacterNameAndId& Name)> K2Node_CreateDelegate_OutputDelegate, const struct FVAL_PartyMember& K2Node_CustomEvent_Member, class UOSSVAL_GetCharacterNameByAccountIdAndCharacterIdProxy* CallFunc_GetCharacterNameByAccountIdAndCharacterId_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_DoesPartyContainMember_ReturnValue, struct FGuid& K2Node_CustomEvent_AccountId_1, struct FGuid& K2Node_CustomEvent_CharacterId_1, bool CallFunc_DoesPartyContainMember_ReturnValue_1, TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId)> K2Node_CreateDelegate_OutputDelegate_1, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_2, int32 CallFunc_AkEventGlobal_ReturnValue_3, int32 CallFunc_AkEventGlobal_ReturnValue_4, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_15, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_14, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_13, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_12, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_11, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_10, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_9, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_6, class UChatManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_7, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, bool CallFunc_EqualEqual_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_8, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_7, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_6, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_5, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_4, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_3, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_2, int32 CallFunc_AkEventGlobal_ReturnValue_5, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_8, class UWBP_Block_ModalDialogue_CM_C* CallFunc_Create_ReturnValue, EVAL_SocialBlockError CallFunc_RequestBlockUser_ReturnValue, class UWBP_Block_ModalDialogue_PF_C* CallFunc_Create_ReturnValue_1, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, class UChatManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_9, bool CallFunc_IsConsole_ReturnValue, bool CallFunc_IsDesktop_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_6, int32 CallFunc_AkEventGlobal_ReturnValue_7, int32 CallFunc_AkEventGlobal_ReturnValue_8, int32 CallFunc_AkEventGlobal_ReturnValue_9, int32 CallFunc_AkEventGlobal_ReturnValue_10, const struct FMessageTarget& CallFunc_MakeMessageTarget_DirectMessage_ReturnValue, const struct FPresence& CallFunc_GetPresenceForUserId_ReturnValue, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, bool CallFunc_ShowPlatformProfileUI_ReturnValue, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, bool CallFunc_IsSupportProfileUI_ReturnValue, ESlateVisibility K2Node_Select_Default);
	void InitContextMenuNavigation(const TArray<class UWidget*>& VisibleChildWidgets, int32 Temp_int_Array_Index_Variable, bool CallFunc_IsSupportProfileUI_ReturnValue, TArray<class UWBP_Template_Button_CM_C*>& K2Node_MakeArray_Array, int32 Temp_int_Loop_Counter_Variable, class UWBP_Template_Button_CM_C* CallFunc_Array_Get_Item, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, TArray<class UWidget*>& K2Node_MakeArray_Array_1, class UWidget* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_GetIsEnabled_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, class UWidget* CallFunc_Array_Get_Item_2, class UWidget* CallFunc_Array_Get_Item_3, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, class UWidget* CallFunc_Array_Get_Item_4, int32 CallFunc_Subtract_IntInt_ReturnValue_2, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, class UWidget* CallFunc_Array_Get_Item_5, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue);
	void InpActEvt_IA_UI_Back_Cancel_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UIBack_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	bool IsSupportProfileUI(bool CallFunc_IsXSXPlatform_ReturnValue, bool CallFunc_IsPS5Platform_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, ERedirectsPlatform CallFunc_GetPlatformType_ReturnValue, const struct FPresence& CallFunc_GetPresenceForUserId_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void OnFailure_93CB708A4ABA3CD27B091EB61FE2FAFC(struct FGuid& AccountId, struct FGuid& CharacterId);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnMenuButtonPressed__DelegateSignature(class UWBP_PartyMemberRowContextMenu_C* ContentWidget);
	void OnSuccess_93CB708A4ABA3CD27B091EB61FE2FAFC(struct FGuid& AccountId, struct FGuid& CharacterId, struct FOSSVAL_CharacterNameAndId& Param_Name);
	void SetPartyMember(const struct FVAL_PartyMember& Member);
	void UpdateAvailableButtons(class UChatManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, bool CallFunc_IsUserMuted_New_ReturnValue, bool CallFunc_IsUserBlocked_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool Temp_bool_Variable, bool Temp_bool_Variable_1, class UWidget* K2Node_Select_Default, class UWidget* K2Node_Select_Default_1, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, bool CallFunc_IsCurrentPartyValid_ReturnValue, bool CallFunc_EqualEqual_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyMemberRowContextMenu_C">();
	}
	static class UWBP_PartyMemberRowContextMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyMemberRowContextMenu_C>();
	}
};
static_assert(alignof(UWBP_PartyMemberRowContextMenu_C) == 0x000008, "Wrong alignment on UWBP_PartyMemberRowContextMenu_C");
static_assert(sizeof(UWBP_PartyMemberRowContextMenu_C) == 0x000678, "Wrong size on UWBP_PartyMemberRowContextMenu_C");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, UberGraphFrame) == 0x000510, "Member 'UWBP_PartyMemberRowContextMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, BlockButtonContainer) == 0x000518, "Member 'UWBP_PartyMemberRowContextMenu_C::BlockButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, BlockUnblockSwitcher) == 0x000520, "Member 'UWBP_PartyMemberRowContextMenu_C::BlockUnblockSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Button_Block) == 0x000528, "Member 'UWBP_PartyMemberRowContextMenu_C::Button_Block' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Button_ChangeLeader) == 0x000530, "Member 'UWBP_PartyMemberRowContextMenu_C::Button_ChangeLeader' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Button_KickFromParty) == 0x000538, "Member 'UWBP_PartyMemberRowContextMenu_C::Button_KickFromParty' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Button_Message) == 0x000540, "Member 'UWBP_PartyMemberRowContextMenu_C::Button_Message' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Button_Mute) == 0x000548, "Member 'UWBP_PartyMemberRowContextMenu_C::Button_Mute' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Button_ProfileUI) == 0x000550, "Member 'UWBP_PartyMemberRowContextMenu_C::Button_ProfileUI' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Button_Unblock) == 0x000558, "Member 'UWBP_PartyMemberRowContextMenu_C::Button_Unblock' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Button_Unmute) == 0x000560, "Member 'UWBP_PartyMemberRowContextMenu_C::Button_Unmute' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, ChangeLeaderButtonContainer) == 0x000568, "Member 'UWBP_PartyMemberRowContextMenu_C::ChangeLeaderButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Image) == 0x000570, "Member 'UWBP_PartyMemberRowContextMenu_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Image_1) == 0x000578, "Member 'UWBP_PartyMemberRowContextMenu_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Image_2) == 0x000580, "Member 'UWBP_PartyMemberRowContextMenu_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Image_3) == 0x000588, "Member 'UWBP_PartyMemberRowContextMenu_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Image_4) == 0x000590, "Member 'UWBP_PartyMemberRowContextMenu_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Image_5) == 0x000598, "Member 'UWBP_PartyMemberRowContextMenu_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, Image_44) == 0x0005A0, "Member 'UWBP_PartyMemberRowContextMenu_C::Image_44' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, KickFromPartyButtonContainer_2) == 0x0005A8, "Member 'UWBP_PartyMemberRowContextMenu_C::KickFromPartyButtonContainer_2' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, MessageButtonContainer) == 0x0005B0, "Member 'UWBP_PartyMemberRowContextMenu_C::MessageButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, MuteButtonContainer) == 0x0005B8, "Member 'UWBP_PartyMemberRowContextMenu_C::MuteButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, MuteUnmuteSwitcher) == 0x0005C0, "Member 'UWBP_PartyMemberRowContextMenu_C::MuteUnmuteSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, PS5Icon_1) == 0x0005C8, "Member 'UWBP_PartyMemberRowContextMenu_C::PS5Icon_1' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, UnblockButtonContainer) == 0x0005D0, "Member 'UWBP_PartyMemberRowContextMenu_C::UnblockButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, UnmuteButtonContainer) == 0x0005D8, "Member 'UWBP_PartyMemberRowContextMenu_C::UnmuteButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, ViewProfileButtonContainer) == 0x0005E0, "Member 'UWBP_PartyMemberRowContextMenu_C::ViewProfileButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, XSXIcon_1) == 0x0005E8, "Member 'UWBP_PartyMemberRowContextMenu_C::XSXIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, OnMenuButtonPressed) == 0x0005F0, "Member 'UWBP_PartyMemberRowContextMenu_C::OnMenuButtonPressed' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, CharacterName) == 0x000600, "Member 'UWBP_PartyMemberRowContextMenu_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, PartyMember) == 0x000610, "Member 'UWBP_PartyMemberRowContextMenu_C::PartyMember' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, FirstFocusItem) == 0x000660, "Member 'UWBP_PartyMemberRowContextMenu_C::FirstFocusItem' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMemberRowContextMenu_C, CharacterFullName) == 0x000668, "Member 'UWBP_PartyMemberRowContextMenu_C::CharacterFullName' has a wrong offset!");

}

