#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cooking_Minigame_Chopping

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Cooking_Minigame_Chopping.WBP_Cooking_Minigame_Chopping_C._Internal_KickMarkerConsiderAddingTicks
// 0x0138 (0x0138 - 0x0000)
struct WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks final
{
public:
	double                                        NextTimerDelay;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCanBeDisplayed;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A18[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        UpdateDeltaTimeConstrained;                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewMarkerCount;                                    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActiveConfigInputPeriodTime;                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeFromFirstNewMarker;                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        UpdateDeltaTime;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OldLastTimerKickTime;                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Cooking_Minigame_Chopping_Marker_C* IndicatorToUse;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A19[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1A[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1B[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1C[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1D[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Cooking_Minigame_Chopping_Marker_C* CallFunc_Get_Next_Inactive_Indicator_Indicator;    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1E[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_4;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeElapsed_ReturnValue;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1F[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCenterPositionOfSuccessMarker_X_Position; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_B_ImplicitCast;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast_1;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_B_ImplicitCast;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_LastTimerKickTime_ImplicitCast; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks");
static_assert(sizeof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks) == 0x000138, "Wrong size on WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, NextTimerDelay) == 0x000000, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::NextTimerDelay' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, MaxCanBeDisplayed) == 0x000008, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::MaxCanBeDisplayed' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, UpdateDeltaTimeConstrained) == 0x000010, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::UpdateDeltaTimeConstrained' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, NewMarkerCount) == 0x000018, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::NewMarkerCount' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, ActiveConfigInputPeriodTime) == 0x00001C, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::ActiveConfigInputPeriodTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, TimeFromFirstNewMarker) == 0x000020, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::TimeFromFirstNewMarker' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, UpdateDeltaTime) == 0x000028, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::UpdateDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, OldLastTimerKickTime) == 0x000030, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::OldLastTimerKickTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, IndicatorToUse) == 0x000038, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::IndicatorToUse' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, Temp_int_Variable) == 0x000040, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000044, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, Temp_int_Variable_1) == 0x00004C, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_SafeDivide_ReturnValue) == 0x000050, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_FTrunc_ReturnValue) == 0x000060, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Min_ReturnValue) == 0x000064, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000070, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000078, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000080, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_BooleanAND_ReturnValue) == 0x000088, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Subtract_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_FMax_ReturnValue) == 0x000090, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000098, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Greater_IntInt_ReturnValue) == 0x000099, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_SafeDivide_ReturnValue_1) == 0x0000A0, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_FFloor_ReturnValue) == 0x0000A8, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000AC, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0000B8, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Percent_FloatFloat_ReturnValue) == 0x0000C0, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0000C8, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Get_Next_Inactive_Indicator_Indicator) == 0x0000D0, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Get_Next_Inactive_Indicator_Indicator' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Subtract_DoubleDouble_ReturnValue_4) == 0x0000E0, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Subtract_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000E8, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_GetTimeElapsed_ReturnValue) == 0x0000F0, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_GetTimeElapsed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0000F8, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_GetCenterPositionOfSuccessMarker_X_Position) == 0x000100, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_GetCenterPositionOfSuccessMarker_X_Position' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_SafeDivide_B_ImplicitCast) == 0x000108, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Multiply_IntFloat_B_ImplicitCast) == 0x000110, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Multiply_IntFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000118, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_SafeDivide_B_ImplicitCast_1) == 0x000120, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_SafeDivide_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, CallFunc_Percent_FloatFloat_B_ImplicitCast) == 0x000128, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::CallFunc_Percent_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks, K2Node_VariableSet_LastTimerKickTime_ImplicitCast) == 0x000130, "Member 'WBP_Cooking_Minigame_Chopping_C__Internal_KickMarkerConsiderAddingTicks::K2Node_VariableSet_LastTimerKickTime_ImplicitCast' has a wrong offset!");

// Function WBP_Cooking_Minigame_Chopping.WBP_Cooking_Minigame_Chopping_C.CheckForCollidingMarkers
// 0x0088 (0x0088 - 0x0000)
struct WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A20[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A21[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A22[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Cooking_Minigame_Chopping_Marker_C* CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A23[0x1];                                     // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_1;                // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers");
static_assert(sizeof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers) == 0x000088, "Wrong size on WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, Widget) == 0x000000, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_GetPosition_ReturnValue) == 0x000018, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_BreakVector2D_X) == 0x000030, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000054, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_IsVisible_ReturnValue) == 0x000056, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000058, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_GetPosition_ReturnValue_1) == 0x000060, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_GetPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_BreakVector2D_X_1) == 0x000070, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_BreakVector2D_Y_1) == 0x000078, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000080, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_BooleanAND_ReturnValue) == 0x000081, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers, CallFunc_BooleanAND_ReturnValue_1) == 0x000082, "Member 'WBP_Cooking_Minigame_Chopping_C_CheckForCollidingMarkers::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_Cooking_Minigame_Chopping.WBP_Cooking_Minigame_Chopping_C.ExecuteUbergraph_WBP_Cooking_Minigame_Chopping
// 0x0130 (0x0130 - 0x0000)
struct WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPaused_ReturnValue;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A24[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A25[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A26[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPaused_ReturnValue_1;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A27[0x5];                                     // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_4;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMod_Remainder;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPaused_ReturnValue_2;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A28[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A29[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Cooking_Minigame_Chopping_Marker_C* CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A2A[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc__Internal_KickMarkerConsiderAddingTicks_NextTimerDelay; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue_2;                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A2B[0x1];                                     // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_5;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A2C[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMod_Divisor_ImplicitCast;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AkSetRTPC_Value_ImplicitCast;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMod_Dividend_ImplicitCast;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RetriggerableDelay_Duration_ImplicitCast; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping");
static_assert(sizeof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping) == 0x000130, "Wrong size on WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, EntryPoint) == 0x000000, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_IsPaused_ReturnValue) == 0x000006, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_IsPaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_IsPlaying_ReturnValue) == 0x000009, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_AkEventGlobal_ReturnValue) == 0x00001C, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000020, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_AkEventGlobal_ReturnValue_2) == 0x000024, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_AkEventGlobal_ReturnValue_3) == 0x000028, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_AkEventGlobal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, K2Node_Event_MyGeometry) == 0x00002C, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, K2Node_Event_InDeltaTime) == 0x000064, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, K2Node_SwitchEnum_CmpSuccess_1) == 0x000068, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, K2Node_SwitchEnum_CmpSuccess_2) == 0x000069, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000088, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_IsPaused_ReturnValue_1) == 0x000089, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_IsPaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_Not_PreBool_ReturnValue_1) == 0x00008A, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_PlayAnimationForward_ReturnValue) == 0x000090, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000098, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000A0, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_IsPlaying_ReturnValue_1) == 0x0000A9, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_BooleanAND_ReturnValue_1) == 0x0000AA, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_IsValid_ReturnValue_2) == 0x0000AB, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_AkEventGlobal_ReturnValue_4) == 0x0000AC, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_AkEventGlobal_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_FMod_Remainder) == 0x0000B0, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_FMod_ReturnValue) == 0x0000B8, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_IsPaused_ReturnValue_2) == 0x0000BC, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_IsPaused_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000C8, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_Less_IntInt_ReturnValue) == 0x0000E4, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc__Internal_KickMarkerConsiderAddingTicks_NextTimerDelay) == 0x0000E8, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc__Internal_KickMarkerConsiderAddingTicks_NextTimerDelay' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_IsValid_ReturnValue_3) == 0x0000F0, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping, CallFunc_IsPlaying_ReturnValue_2) == 0x0000F1, "Member 'WBP_Cooking_Minigame_Chopping_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping::CallFunc_IsPlaying_ReturnValue_2' has a wrong offset!");
