#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FontAwesomeGlyph

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_FontAwesomeGlyph.WBP_FontAwesomeGlyph_C.ExecuteUbergraph_WBP_FontAwesomeGlyph
// 0x0008 (0x0008 - 0x0000)
struct WBP_FontAwesomeGlyph_C_ExecuteUbergraph_WBP_FontAwesomeGlyph final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FontAwesomeGlyph_C_ExecuteUbergraph_WBP_FontAwesomeGlyph) == 0x000004, "Wrong alignment on WBP_FontAwesomeGlyph_C_ExecuteUbergraph_WBP_FontAwesomeGlyph");
static_assert(sizeof(WBP_FontAwesomeGlyph_C_ExecuteUbergraph_WBP_FontAwesomeGlyph) == 0x000008, "Wrong size on WBP_FontAwesomeGlyph_C_ExecuteUbergraph_WBP_FontAwesomeGlyph");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_ExecuteUbergraph_WBP_FontAwesomeGlyph, EntryPoint) == 0x000000, "Member 'WBP_FontAwesomeGlyph_C_ExecuteUbergraph_WBP_FontAwesomeGlyph::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_ExecuteUbergraph_WBP_FontAwesomeGlyph, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_FontAwesomeGlyph_C_ExecuteUbergraph_WBP_FontAwesomeGlyph::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_FontAwesomeGlyph.WBP_FontAwesomeGlyph_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_FontAwesomeGlyph_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FontAwesomeGlyph_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_FontAwesomeGlyph_C_PreConstruct");
static_assert(sizeof(WBP_FontAwesomeGlyph_C_PreConstruct) == 0x000001, "Wrong size on WBP_FontAwesomeGlyph_C_PreConstruct");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_FontAwesomeGlyph_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_FontAwesomeGlyph.WBP_FontAwesomeGlyph_C.UpdateFromProperties
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_FontAwesomeGlyph_C_UpdateFromProperties final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5038[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0028(0x0058)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	float                                         K2Node_MakeStruct_Size_ImplicitCast;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FontAwesomeGlyph_C_UpdateFromProperties) == 0x000008, "Wrong alignment on WBP_FontAwesomeGlyph_C_UpdateFromProperties");
static_assert(sizeof(WBP_FontAwesomeGlyph_C_UpdateFromProperties) == 0x0000A8, "Wrong size on WBP_FontAwesomeGlyph_C_UpdateFromProperties");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_UpdateFromProperties, Temp_bool_Variable) == 0x000000, "Member 'WBP_FontAwesomeGlyph_C_UpdateFromProperties::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_UpdateFromProperties, Temp_name_Variable) == 0x000004, "Member 'WBP_FontAwesomeGlyph_C_UpdateFromProperties::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_UpdateFromProperties, Temp_name_Variable_1) == 0x00000C, "Member 'WBP_FontAwesomeGlyph_C_UpdateFromProperties::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_UpdateFromProperties, CallFunc_FTrunc_ReturnValue) == 0x000014, "Member 'WBP_FontAwesomeGlyph_C_UpdateFromProperties::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_UpdateFromProperties, K2Node_Select_Default) == 0x000018, "Member 'WBP_FontAwesomeGlyph_C_UpdateFromProperties::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_UpdateFromProperties, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WBP_FontAwesomeGlyph_C_UpdateFromProperties::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_UpdateFromProperties, K2Node_MakeStruct_SlateFontInfo) == 0x000028, "Member 'WBP_FontAwesomeGlyph_C_UpdateFromProperties::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_UpdateFromProperties, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WBP_FontAwesomeGlyph_C_UpdateFromProperties::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_UpdateFromProperties, K2Node_MakeStruct_Size_ImplicitCast) == 0x000098, "Member 'WBP_FontAwesomeGlyph_C_UpdateFromProperties::K2Node_MakeStruct_Size_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_UpdateFromProperties, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00009C, "Member 'WBP_FontAwesomeGlyph_C_UpdateFromProperties::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_FontAwesomeGlyph_C_UpdateFromProperties, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x0000A0, "Member 'WBP_FontAwesomeGlyph_C_UpdateFromProperties::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

}

