#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PinnedQuestGoal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PinnedQuestGoal.WBP_PinnedQuestGoal_C
// 0x0030 (0x02F0 - 0x02C0)
class UWBP_PinnedQuestGoal_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Border_Checkbox;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_checkmark;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Strikethrough;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_RichTextBlock_Styled*            RichTextBlock_Description;                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_RichTextBlockStyle*              ConsoleTextStyleOverride;                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PinnedQuestGoal(int32 EntryPoint, bool K2Node_Event_IsDesignTime, bool CallFunc_IsConsole_ReturnValue);
	void PreConstruct(bool IsDesignTime);
	void SetFromDescriptionText(class FText Description);
	void SetFromQuestGoalState(const struct FVAL_QuestGoalState& QuestGoalState, const struct FVAL_QuestGoalDef& QuestGoalDef, bool IsBranchingGoal, EVAL_QuestBranchingGoalChoiceStatus ChoiceStatus, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class FText CallFunc_GetQuestGoalDescription_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class FText CallFunc_PerformTextSubstitutionsForCharacter_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PinnedQuestGoal_C">();
	}
	static class UWBP_PinnedQuestGoal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PinnedQuestGoal_C>();
	}
};
static_assert(alignof(UWBP_PinnedQuestGoal_C) == 0x000008, "Wrong alignment on UWBP_PinnedQuestGoal_C");
static_assert(sizeof(UWBP_PinnedQuestGoal_C) == 0x0002F0, "Wrong size on UWBP_PinnedQuestGoal_C");
static_assert(offsetof(UWBP_PinnedQuestGoal_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_PinnedQuestGoal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PinnedQuestGoal_C, Border_Checkbox) == 0x0002C8, "Member 'UWBP_PinnedQuestGoal_C::Border_Checkbox' has a wrong offset!");
static_assert(offsetof(UWBP_PinnedQuestGoal_C, Image_checkmark) == 0x0002D0, "Member 'UWBP_PinnedQuestGoal_C::Image_checkmark' has a wrong offset!");
static_assert(offsetof(UWBP_PinnedQuestGoal_C, Image_Strikethrough) == 0x0002D8, "Member 'UWBP_PinnedQuestGoal_C::Image_Strikethrough' has a wrong offset!");
static_assert(offsetof(UWBP_PinnedQuestGoal_C, RichTextBlock_Description) == 0x0002E0, "Member 'UWBP_PinnedQuestGoal_C::RichTextBlock_Description' has a wrong offset!");
static_assert(offsetof(UWBP_PinnedQuestGoal_C, ConsoleTextStyleOverride) == 0x0002E8, "Member 'UWBP_PinnedQuestGoal_C::ConsoleTextStyleOverride' has a wrong offset!");

}

