#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyRebindGroupEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "KeyRebinding_structs.hpp"


namespace SDK::Params
{

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_12_OnNavigated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_12_OnNavigated__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_12_OnNavigated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_12_OnNavigated__DelegateSignature");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_12_OnNavigated__DelegateSignature) == 0x000008, "Wrong size on WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_12_OnNavigated__DelegateSignature");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_12_OnNavigated__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_12_OnNavigated__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_9_OnCustomNavigationGroupInitialized__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_9_OnCustomNavigationGroupInitialized__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_9_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong alignment on WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_9_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_9_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong size on WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_9_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_9_OnCustomNavigationGroupInitialized__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_BndEvt__WBP_KeyRebindGroupEntry_NavigationGroup_K2Node_ComponentBoundEvent_9_OnCustomNavigationGroupInitialized__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_6_OnFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_6_OnFocused__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_6_OnFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_6_OnFocused__DelegateSignature");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_6_OnFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_6_OnFocused__DelegateSignature");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_6_OnFocused__DelegateSignature, Widget) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_6_OnFocused__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_7_OnLostFocus__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_7_OnLostFocus__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_7_OnLostFocus__DelegateSignature) == 0x000008, "Wrong alignment on WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_7_OnLostFocus__DelegateSignature");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_7_OnLostFocus__DelegateSignature) == 0x000008, "Wrong size on WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_7_OnLostFocus__DelegateSignature");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_7_OnLostFocus__DelegateSignature, Widget) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_BndEvt__WBP_TestGroupEntry_WBP_Button_Gamepad_K2Node_ComponentBoundEvent_7_OnLostFocus__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.ExecuteUbergraph_WBP_KeyRebindGroupEntry
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54EB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputKeysIcon>                 K2Node_Event_RefreshIcons;                         // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup_1;             // 0x0028(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54EC[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54ED[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetFocusedWidget_FocusedWidget;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetFocusedWidget_FocusedWidget_1;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetFocusedWidget_FocusedWidget_2;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetFocusedWidget_FocusedWidget_3;         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0088(0x0008)(NoDestructor)
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup;               // 0x0090(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_GetKeyRebindEntryDescWithCore_ReturnValue; // 0x00A8(0x0018)()
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry) == 0x000008, "Wrong alignment on WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry) == 0x0000C0, "Wrong size on WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, EntryPoint) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_Event_RefreshIcons) == 0x000008, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_Event_RefreshIcons' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_ComponentBoundEvent_Widget_1) == 0x000018, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_ComponentBoundEvent_Widget) == 0x000020, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_ComponentBoundEvent_NavGroup_1) == 0x000028, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_ComponentBoundEvent_NavGroup_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_CreateDelegate_OutputDelegate_2) == 0x000054, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, CallFunc_GetFocusedWidget_FocusedWidget) == 0x000068, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::CallFunc_GetFocusedWidget_FocusedWidget' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, CallFunc_GetFocusedWidget_FocusedWidget_1) == 0x000070, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::CallFunc_GetFocusedWidget_FocusedWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, CallFunc_GetFocusedWidget_FocusedWidget_2) == 0x000078, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::CallFunc_GetFocusedWidget_FocusedWidget_2' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, CallFunc_GetFocusedWidget_FocusedWidget_3) == 0x000080, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::CallFunc_GetFocusedWidget_FocusedWidget_3' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_Event_InFocusEvent) == 0x000088, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_ComponentBoundEvent_NavGroup) == 0x000090, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_ComponentBoundEvent_NavGroup' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, K2Node_MakeArray_Array) == 0x000098, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry, CallFunc_GetKeyRebindEntryDescWithCore_ReturnValue) == 0x0000A8, "Member 'WBP_KeyRebindGroupEntry_C_ExecuteUbergraph_WBP_KeyRebindGroupEntry::CallFunc_GetKeyRebindEntryDescWithCore_ReturnValue' has a wrong offset!");

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.GetFocusedWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_GetFocusedWidget final
{
public:
	class UWidget*                                Param_FocusedWidget;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_GetFocusedWidget) == 0x000008, "Wrong alignment on WBP_KeyRebindGroupEntry_C_GetFocusedWidget");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_GetFocusedWidget) == 0x000008, "Wrong size on WBP_KeyRebindGroupEntry_C_GetFocusedWidget");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_GetFocusedWidget, Param_FocusedWidget) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_GetFocusedWidget::Param_FocusedWidget' has a wrong offset!");

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_KeyRebindGroupEntry_C_OnFocusLost");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_OnFocusLost) == 0x000008, "Wrong size on WBP_KeyRebindGroupEntry_C_OnFocusLost");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_KeyRebindGroupEntry_C_OnFocusReceived");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_KeyRebindGroupEntry_C_OnFocusReceived");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_KeyRebindGroupEntry_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_KeyRebindGroupEntry_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_KeyRebindGroupEntry_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_OnFocusReceived, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0001B0, "Member 'WBP_KeyRebindGroupEntry_C_OnFocusReceived::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_OnFocusReceived, K2Node_SwitchInteger_CmpSuccess) == 0x0001B4, "Member 'WBP_KeyRebindGroupEntry_C_OnFocusReceived::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.OnIconRefreshed
// 0x0010 (0x0010 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_OnIconRefreshed final
{
public:
	TArray<struct FInputKeysIcon>                 RefreshIcons;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_OnIconRefreshed) == 0x000008, "Wrong alignment on WBP_KeyRebindGroupEntry_C_OnIconRefreshed");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_OnIconRefreshed) == 0x000010, "Wrong size on WBP_KeyRebindGroupEntry_C_OnIconRefreshed");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_OnIconRefreshed, RefreshIcons) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_OnIconRefreshed::RefreshIcons' has a wrong offset!");

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_KeyRebindGroupEntry_C_PreConstruct");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_KeyRebindGroupEntry_C_PreConstruct");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.RefreshButtonImage
// 0x0520 (0x0520 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_RefreshButtonImage final
{
public:
	TArray<struct FInputKeysIcon>                 InputPin;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FInputKeysIcon                         SecondIcons;                                       // 0x0010(0x01A0)(Edit, BlueprintVisible)
	struct FInputKeysIcon                         FirstIcons;                                        // 0x01B0(0x01A0)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54EE[0x3];                                     // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54EF[0xC];                                     // 0x0364(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputKeysIcon                         CallFunc_Array_Get_Item;                           // 0x0370(0x01A0)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage) == 0x000010, "Wrong alignment on WBP_KeyRebindGroupEntry_C_RefreshButtonImage");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage) == 0x000520, "Wrong size on WBP_KeyRebindGroupEntry_C_RefreshButtonImage");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage, InputPin) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_RefreshButtonImage::InputPin' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage, SecondIcons) == 0x000010, "Member 'WBP_KeyRebindGroupEntry_C_RefreshButtonImage::SecondIcons' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage, FirstIcons) == 0x0001B0, "Member 'WBP_KeyRebindGroupEntry_C_RefreshButtonImage::FirstIcons' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage, Temp_int_Loop_Counter_Variable) == 0x000350, "Member 'WBP_KeyRebindGroupEntry_C_RefreshButtonImage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage, CallFunc_Array_Length_ReturnValue) == 0x000354, "Member 'WBP_KeyRebindGroupEntry_C_RefreshButtonImage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage, CallFunc_Add_IntInt_ReturnValue) == 0x000358, "Member 'WBP_KeyRebindGroupEntry_C_RefreshButtonImage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage, CallFunc_Less_IntInt_ReturnValue) == 0x00035C, "Member 'WBP_KeyRebindGroupEntry_C_RefreshButtonImage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage, Temp_int_Array_Index_Variable) == 0x000360, "Member 'WBP_KeyRebindGroupEntry_C_RefreshButtonImage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage, CallFunc_Array_Get_Item) == 0x000370, "Member 'WBP_KeyRebindGroupEntry_C_RefreshButtonImage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage, K2Node_SwitchInteger_CmpSuccess) == 0x000510, "Member 'WBP_KeyRebindGroupEntry_C_RefreshButtonImage::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshButtonImage, K2Node_SwitchEnum_CmpSuccess) == 0x000511, "Member 'WBP_KeyRebindGroupEntry_C_RefreshButtonImage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_KeyRebindGroupEntry.WBP_KeyRebindGroupEntry_C.RefreshFocusedWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_KeyRebindGroupEntry_C_RefreshFocusedWidget final
{
public:
	class UWidget*                                InFocusedWidget;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebindGroupEntry_C_RefreshFocusedWidget) == 0x000008, "Wrong alignment on WBP_KeyRebindGroupEntry_C_RefreshFocusedWidget");
static_assert(sizeof(WBP_KeyRebindGroupEntry_C_RefreshFocusedWidget) == 0x000010, "Wrong size on WBP_KeyRebindGroupEntry_C_RefreshFocusedWidget");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshFocusedWidget, InFocusedWidget) == 0x000000, "Member 'WBP_KeyRebindGroupEntry_C_RefreshFocusedWidget::InFocusedWidget' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebindGroupEntry_C_RefreshFocusedWidget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'WBP_KeyRebindGroupEntry_C_RefreshFocusedWidget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

