#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogueOptionButton_CM

#include "Basic.hpp"

#include "ValeriaUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_DialogueOptionButton_CM.WBP_DialogueOptionButton_CM_C.BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_DialogueOptionButton_CM.WBP_DialogueOptionButton_CM_C.BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_DialogueOptionButton_CM.WBP_DialogueOptionButton_CM_C.BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_DialogueOptionButton_CM_C_BndEvt__WBP_DialogueOptionButton_CM_DialogueOptionButton_CM_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_DialogueOptionButton_CM.WBP_DialogueOptionButton_CM_C.Commit Option
// 0x0008 (0x0008 - 0x0000)
struct WBP_DialogueOptionButton_CM_C_Commit_Option final
{
public:
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDialogueTextFullyDisplayed_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueOptionButton_CM_C_Commit_Option) == 0x000004, "Wrong alignment on WBP_DialogueOptionButton_CM_C_Commit_Option");
static_assert(sizeof(WBP_DialogueOptionButton_CM_C_Commit_Option) == 0x000008, "Wrong size on WBP_DialogueOptionButton_CM_C_Commit_Option");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_Commit_Option, CallFunc_AkEventGlobal_ReturnValue) == 0x000000, "Member 'WBP_DialogueOptionButton_CM_C_Commit_Option::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_Commit_Option, CallFunc_IsDialogueTextFullyDisplayed_ReturnValue) == 0x000004, "Member 'WBP_DialogueOptionButton_CM_C_Commit_Option::CallFunc_IsDialogueTextFullyDisplayed_ReturnValue' has a wrong offset!");

// Function WBP_DialogueOptionButton_CM.WBP_DialogueOptionButton_CM_C.ExecuteUbergraph_WBP_DialogueOptionButton_CM
// 0x0188 (0x0188 - 0x0000)
struct WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B45[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B46[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_BasicTooltip_C*                    CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B47[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B48[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B49[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0080(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0094(0x0014)()
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00A8(0x0008)(NoDestructor)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM) == 0x000008, "Wrong alignment on WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM");
static_assert(sizeof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM) == 0x000188, "Wrong size on WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, EntryPoint) == 0x000000, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000010, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_GetCurrentInputType_ReturnValue) == 0x000018, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, Temp_bool_Variable) == 0x000019, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, Temp_byte_Variable) == 0x00001A, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, Temp_byte_Variable_1) == 0x00001B, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, Temp_byte_Variable_2) == 0x00001C, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, Temp_byte_Variable_3) == 0x00001D, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, Temp_byte_Variable_4) == 0x00001E, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, Temp_byte_Variable_5) == 0x00001F, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, Temp_byte_Variable_6) == 0x000020, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000040, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_PlayAnimation_ReturnValue_1) == 0x000048, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000050, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x000054, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_GetVisibility_ReturnValue) == 0x000058, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_ComponentBoundEvent_Button_2) == 0x000060, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000068, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000070, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_ComponentBoundEvent_Button) == 0x000078, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_MakeStruct_SlateColor) == 0x000080, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_MakeStruct_SlateColor_1) == 0x000094, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_Event_InFocusEvent) == 0x0000A8, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_GetDisplayName_ReturnValue) == 0x0000B0, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C0, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_MakeStruct_FormatArgumentData) == 0x0000D8, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_MakeArray_Array) == 0x000128, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_Format_ReturnValue) == 0x000138, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_Conv_TextToString_ReturnValue) == 0x000150, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_CustomEvent_bNewInputType) == 0x000160, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000161, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_Select_Default) == 0x000162, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_Select_Default_1) == 0x000163, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000164, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000174, "Member 'WBP_DialogueOptionButton_CM_C_ExecuteUbergraph_WBP_DialogueOptionButton_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_DialogueOptionButton_CM.WBP_DialogueOptionButton_CM_C.Handle Input Action Commit Option Triggered
// 0x0040 (0x0040 - 0x0000)
struct WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           InputAction;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered) == 0x000008, "Wrong alignment on WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered");
static_assert(sizeof(WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered) == 0x000040, "Wrong size on WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered, ActionValue) == 0x000000, "Member 'WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered, ElapsedTime) == 0x000020, "Member 'WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered, TriggeredTime) == 0x000024, "Member 'WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered, InputAction) == 0x000028, "Member 'WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered::InputAction' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered, CallFunc_GetParent_ReturnValue) == 0x000030, "Member 'WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered, CallFunc_IsVisible_ReturnValue) == 0x000038, "Member 'WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered, CallFunc_IsVisible_ReturnValue_1) == 0x000039, "Member 'WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'WBP_DialogueOptionButton_CM_C_Handle_Input_Action_Commit_Option_Triggered::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_DialogueOptionButton_CM.WBP_DialogueOptionButton_CM_C.InputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_DialogueOptionButton_CM_C_InputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueOptionButton_CM_C_InputMethodChanged) == 0x000001, "Wrong alignment on WBP_DialogueOptionButton_CM_C_InputMethodChanged");
static_assert(sizeof(WBP_DialogueOptionButton_CM_C_InputMethodChanged) == 0x000001, "Wrong size on WBP_DialogueOptionButton_CM_C_InputMethodChanged");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_InputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_DialogueOptionButton_CM_C_InputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_DialogueOptionButton_CM.WBP_DialogueOptionButton_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_DialogueOptionButton_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_DialogueOptionButton_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_DialogueOptionButton_CM_C_OnFocusLost");
static_assert(sizeof(WBP_DialogueOptionButton_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_DialogueOptionButton_CM_C_OnFocusLost");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_DialogueOptionButton_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_DialogueOptionButton_CM.WBP_DialogueOptionButton_CM_C.SetUISize
// 0x0002 (0x0002 - 0x0000)
struct WBP_DialogueOptionButton_CM_C_SetUISize final
{
public:
	EVALUI_UISize                                 NewSize;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueOptionButton_CM_C_SetUISize) == 0x000001, "Wrong alignment on WBP_DialogueOptionButton_CM_C_SetUISize");
static_assert(sizeof(WBP_DialogueOptionButton_CM_C_SetUISize) == 0x000002, "Wrong size on WBP_DialogueOptionButton_CM_C_SetUISize");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_SetUISize, NewSize) == 0x000000, "Member 'WBP_DialogueOptionButton_CM_C_SetUISize::NewSize' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_SetUISize, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_DialogueOptionButton_CM_C_SetUISize::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_DialogueOptionButton_CM.WBP_DialogueOptionButton_CM_C.SetupDialogueOption
// 0x0220 (0x0220 - 0x0000)
struct WBP_DialogueOptionButton_CM_C_SetupDialogueOption final
{
public:
	struct FDialogueToShow                        Param_Dialogue;                                    // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVAL_DialogueOption                    DialogueOption;                                    // 0x0060(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UVAL_DialogueSpeakerAsset*              DialogueSpeaker;                                   // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialogue_CM_C*                     Parent;                                            // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CancelOption;                                      // 0x0098(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4A[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           InputAction_CommitOption;                          // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 HintString;                                        // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable;                              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_6;                            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_7;                            // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_8;                            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_9;                            // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_10;                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_11;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_12;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_13;                           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVillagerDialogueIcon                         Temp_byte_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4B[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4C[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      K2Node_DynamicCast_AsValeria_Character;            // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4D[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_DialogueContext                   K2Node_MakeStruct_VAL_DialogueContext;             // 0x0150(0x0010)(NoDestructor)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4E[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_PerformTextSubstitutionsForDialogue_ReturnValue; // 0x0170(0x0018)()
	TSet<EVillagerDialogueIcon>                   K2Node_MakeSet_Set;                                // 0x0188(0x0050)(ConstParm)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4F[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x01DC(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x01F0(0x0014)()
	bool                                          Temp_bool_Variable_2;                              // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B50[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_3;                           // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogueOptionButton_CM_C_SetupDialogueOption) == 0x000008, "Wrong alignment on WBP_DialogueOptionButton_CM_C_SetupDialogueOption");
static_assert(sizeof(WBP_DialogueOptionButton_CM_C_SetupDialogueOption) == 0x000220, "Wrong size on WBP_DialogueOptionButton_CM_C_SetupDialogueOption");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_SetupDialogueOption, Param_Dialogue) == 0x000000, "Member 'WBP_DialogueOptionButton_CM_C_SetupDialogueOption::Param_Dialogue' has a wrong offset!");
static_assert(offsetof(WBP_DialogueOptionButton_CM_C_SetupDialogueOption, DialogueOption) == 0x000060, "Member 'WBP_DialogueOptionButton_CM_C_SetupDialogueOption::DialogueOption' has a wrong offset!");
