#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListEntry_CommunityRequest_CM

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "F_CommonUIButtonPrompt_structs.hpp"
#include "UMG_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.BndEvt__WBP_ListEntry_CommunityRequest_CM_Button_Close_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_Button_Close_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_Button_Close_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_Button_Close_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_Button_Close_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_Button_Close_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_Button_Close_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_Button_Close_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.BndEvt__WBP_ListEntry_CommunityRequest_CM_DefaultAcceptBtn_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_DefaultAcceptBtn_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_DefaultAcceptBtn_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_DefaultAcceptBtn_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_DefaultAcceptBtn_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_DefaultAcceptBtn_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_DefaultAcceptBtn_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_DefaultAcceptBtn_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.BndEvt__WBP_ListEntry_CommunityRequest_CM_S6UI_CustomNavigationGroup_Request_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_S6UI_CustomNavigationGroup_Request_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_S6UI_CustomNavigationGroup_Request_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_S6UI_CustomNavigationGroup_Request_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_S6UI_CustomNavigationGroup_Request_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_S6UI_CustomNavigationGroup_Request_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_S6UI_CustomNavigationGroup_Request_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_BndEvt__WBP_ListEntry_CommunityRequest_CM_S6UI_CustomNavigationGroup_Request_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM
// 0x0198 (0x0198 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B7[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostGlobalEvent_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B8[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ListObject_CommunityRequest_C*      K2Node_DynamicCast_AsBP_List_Object_Community_Request; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B9[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostGlobalEvent_ReturnValue_1;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVAL_PlayerGuild& PlayerGuild)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_PlayerGuild                       CallFunc_TryGetPlayerGuild_OutPlayerGuildInfo;     // 0x0050(0x0118)()
	bool                                          CallFunc_TryGetPlayerGuild_ReturnValue;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57BA[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup;               // 0x0180(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM) == 0x000198, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, EntryPoint) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, K2Node_Event_bIsExpanded) == 0x000004, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, K2Node_Event_bIsSelected) == 0x000005, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, CallFunc_PostGlobalEvent_ReturnValue) == 0x000010, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::CallFunc_PostGlobalEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, K2Node_DynamicCast_AsBP_List_Object_Community_Request) == 0x000018, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::K2Node_DynamicCast_AsBP_List_Object_Community_Request' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, CallFunc_PostGlobalEvent_ReturnValue_1) == 0x000024, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::CallFunc_PostGlobalEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000048, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, CallFunc_TryGetPlayerGuild_OutPlayerGuildInfo) == 0x000050, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::CallFunc_TryGetPlayerGuild_OutPlayerGuildInfo' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, CallFunc_TryGetPlayerGuild_ReturnValue) == 0x000168, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::CallFunc_TryGetPlayerGuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000170, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, K2Node_ComponentBoundEvent_Button) == 0x000178, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, K2Node_ComponentBoundEvent_NavGroup) == 0x000180, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::K2Node_ComponentBoundEvent_NavGroup' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM, K2Node_MakeArray_Array) == 0x000188, "Member 'WBP_ListEntry_CommunityRequest_CM_C_ExecuteUbergraph_WBP_ListEntry_CommunityRequest_CM::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.HandleEnhancedInputAction
// 0x0010 (0x0010 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_HandleEnhancedInputAction final
{
public:
	class UInputAction*                           IA;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHandled;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_HandleEnhancedInputAction) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_HandleEnhancedInputAction");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_HandleEnhancedInputAction) == 0x000010, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_HandleEnhancedInputAction");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_HandleEnhancedInputAction, IA) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_HandleEnhancedInputAction::IA' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_HandleEnhancedInputAction, IsHandled) == 0x000008, "Member 'WBP_ListEntry_CommunityRequest_CM_C_HandleEnhancedInputAction::IsHandled' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_HandleEnhancedInputAction, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'WBP_ListEntry_CommunityRequest_CM_C_HandleEnhancedInputAction::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.HandleQueryPlayerGuildFailed
// 0x0010 (0x0010 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildFailed final
{
public:
	class FString                                 ErrorMessage;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildFailed) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildFailed");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildFailed) == 0x000010, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildFailed");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildFailed, ErrorMessage) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildFailed::ErrorMessage' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.HandleQueryPlayerGuildSucceeded
// 0x0118 (0x0118 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildSucceeded final
{
public:
	struct FVAL_PlayerGuild                       Guild;                                             // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildSucceeded) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildSucceeded");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildSucceeded) == 0x000118, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildSucceeded");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildSucceeded, Guild) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_HandleQueryPlayerGuildSucceeded::Guild' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.OnAcceptRequest__DelegateSignature
// 0x0078 (0x0078 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_OnAcceptRequest__DelegateSignature final
{
public:
	struct FVAL_PlayerGuildInvitation             GuildInvitation;                                   // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_OnAcceptRequest__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_OnAcceptRequest__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_OnAcceptRequest__DelegateSignature) == 0x000078, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_OnAcceptRequest__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnAcceptRequest__DelegateSignature, GuildInvitation) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnAcceptRequest__DelegateSignature::GuildInvitation' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.OnDismissRequest__DelegateSignature
// 0x0078 (0x0078 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_OnDismissRequest__DelegateSignature final
{
public:
	struct FVAL_PlayerGuildInvitation             GuildInvitation;                                   // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_OnDismissRequest__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_OnDismissRequest__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_OnDismissRequest__DelegateSignature) == 0x000078, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_OnDismissRequest__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnDismissRequest__DelegateSignature, GuildInvitation) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnDismissRequest__DelegateSignature::GuildInvitation' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_OnFocusLost");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_OnFocusLost");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.OnFocusReceived
// 0x0280 (0x0280 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt;          // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt_1;        // 0x0138(0x0040)(HasGetValueTypeHash)
	struct FF_CommonUIButtonPrompt                K2Node_MakeStruct_F_CommonUIButtonPrompt_2;        // 0x0178(0x0040)(HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_MakeArray_Array;                            // 0x01B8(0x0010)(ReferenceParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01C8(0x00B8)()
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived) == 0x000280, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived, K2Node_MakeStruct_F_CommonUIButtonPrompt) == 0x0000F8, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived::K2Node_MakeStruct_F_CommonUIButtonPrompt' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived, K2Node_MakeStruct_F_CommonUIButtonPrompt_1) == 0x000138, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived::K2Node_MakeStruct_F_CommonUIButtonPrompt_1' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived, K2Node_MakeStruct_F_CommonUIButtonPrompt_2) == 0x000178, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived::K2Node_MakeStruct_F_CommonUIButtonPrompt_2' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived, K2Node_MakeArray_Array) == 0x0001B8, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0001C8, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ListEntry_CommunityRequest_CM.WBP_ListEntry_CommunityRequest_CM_C.OnMarkFocusUI__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ListEntry_CommunityRequest_CM_C_OnMarkFocusUI__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        UIPrompt;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ListEntry_CommunityRequest_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListEntry_CommunityRequest_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(sizeof(WBP_ListEntry_CommunityRequest_CM_C_OnMarkFocusUI__DelegateSignature) == 0x000018, "Wrong size on WBP_ListEntry_CommunityRequest_CM_C_OnMarkFocusUI__DelegateSignature");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnMarkFocusUI__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnMarkFocusUI__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_ListEntry_CommunityRequest_CM_C_OnMarkFocusUI__DelegateSignature, UIPrompt) == 0x000008, "Member 'WBP_ListEntry_CommunityRequest_CM_C_OnMarkFocusUI__DelegateSignature::UIPrompt' has a wrong offset!");

}

