#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToolWheelUtilityButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ToolWheelUtilityButton.WBP_ToolWheelUtilityButton_C
// 0x0038 (0x0320 - 0x02E8)
class UWBP_ToolWheelUtilityButton_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Backer;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsBeingHovered;                                    // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E02[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             IconOveride;                                       // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCancelButton;                                    // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ToolWheelUtilityButton(int32 EntryPoint, bool CallFunc_IsValid_ReturnValue, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush);
	void HandleHover(const struct FSlateColor& IconHoveredTintColor, class UTexture* BackerHoveredImage, bool CallFunc_GetIsEnabled_ReturnValue, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue);
	void HandleUnhover(class UTexture* BackerUnhoveredImage, const struct FSlateColor& IconUnhoveredTintColor, bool CallFunc_GetIsEnabled_ReturnValue, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue);
	void UpdateToCancel(class UTexture2D* CancelIcon, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush);
	void UpdateToReequip(class UTexture2D* ReequipIcon, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush);
	void UpdateToUnequip(class UTexture2D* UnequipIcon, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ToolWheelUtilityButton_C">();
	}
	static class UWBP_ToolWheelUtilityButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ToolWheelUtilityButton_C>();
	}
};
static_assert(alignof(UWBP_ToolWheelUtilityButton_C) == 0x000008, "Wrong alignment on UWBP_ToolWheelUtilityButton_C");
static_assert(sizeof(UWBP_ToolWheelUtilityButton_C) == 0x000320, "Wrong size on UWBP_ToolWheelUtilityButton_C");
static_assert(offsetof(UWBP_ToolWheelUtilityButton_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ToolWheelUtilityButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ToolWheelUtilityButton_C, HoverAnim) == 0x0002F0, "Member 'UWBP_ToolWheelUtilityButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_ToolWheelUtilityButton_C, Image_Backer) == 0x0002F8, "Member 'UWBP_ToolWheelUtilityButton_C::Image_Backer' has a wrong offset!");
static_assert(offsetof(UWBP_ToolWheelUtilityButton_C, Image_Icon) == 0x000300, "Member 'UWBP_ToolWheelUtilityButton_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ToolWheelUtilityButton_C, IsBeingHovered) == 0x000308, "Member 'UWBP_ToolWheelUtilityButton_C::IsBeingHovered' has a wrong offset!");
static_assert(offsetof(UWBP_ToolWheelUtilityButton_C, IconOveride) == 0x000310, "Member 'UWBP_ToolWheelUtilityButton_C::IconOveride' has a wrong offset!");
static_assert(offsetof(UWBP_ToolWheelUtilityButton_C, IsCancelButton) == 0x000318, "Member 'UWBP_ToolWheelUtilityButton_C::IsCancelButton' has a wrong offset!");

}

