#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BannerNotificationSlot

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_BannerNotificationSlot.WBP_BannerNotificationSlot_C.CanShowBannerNotification
// 0x0020 (0x0020 - 0x0000)
struct WBP_BannerNotificationSlot_C_CanShowBannerNotification final
{
public:
	bool                                          CanShow;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD2[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_GetCurrentStateType_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BannerNotificationSlot_C_CanShowBannerNotification) == 0x000008, "Wrong alignment on WBP_BannerNotificationSlot_C_CanShowBannerNotification");
static_assert(sizeof(WBP_BannerNotificationSlot_C_CanShowBannerNotification) == 0x000020, "Wrong size on WBP_BannerNotificationSlot_C_CanShowBannerNotification");
static_assert(offsetof(WBP_BannerNotificationSlot_C_CanShowBannerNotification, CanShow) == 0x000000, "Member 'WBP_BannerNotificationSlot_C_CanShowBannerNotification::CanShow' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_CanShowBannerNotification, CallFunc_MakeLiteralByte_ReturnValue) == 0x000001, "Member 'WBP_BannerNotificationSlot_C_CanShowBannerNotification::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_CanShowBannerNotification, CallFunc_GetValeriaCharacter_OutResult) == 0x000002, "Member 'WBP_BannerNotificationSlot_C_CanShowBannerNotification::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_CanShowBannerNotification, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_BannerNotificationSlot_C_CanShowBannerNotification::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_CanShowBannerNotification, CallFunc_GetCSM_ReturnValue) == 0x000010, "Member 'WBP_BannerNotificationSlot_C_CanShowBannerNotification::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_CanShowBannerNotification, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_BannerNotificationSlot_C_CanShowBannerNotification::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_CanShowBannerNotification, CallFunc_GetCurrentStateType_ReturnValue) == 0x000019, "Member 'WBP_BannerNotificationSlot_C_CanShowBannerNotification::CallFunc_GetCurrentStateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_CanShowBannerNotification, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'WBP_BannerNotificationSlot_C_CanShowBannerNotification::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_CanShowBannerNotification, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'WBP_BannerNotificationSlot_C_CanShowBannerNotification::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_BannerNotificationSlot.WBP_BannerNotificationSlot_C.HandleInputAction_DismissNotification_Triggered
// 0x0038 (0x0038 - 0x0000)
struct WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           InputAction;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryDismissNotification_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered) == 0x000008, "Wrong alignment on WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered");
static_assert(sizeof(WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered) == 0x000038, "Wrong size on WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered");
static_assert(offsetof(WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered, ActionValue) == 0x000000, "Member 'WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered, ElapsedTime) == 0x000020, "Member 'WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered, TriggeredTime) == 0x000024, "Member 'WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered, InputAction) == 0x000028, "Member 'WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered::InputAction' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered, CallFunc_IsValid_Guid_ReturnValue) == 0x000030, "Member 'WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered, CallFunc_TryDismissNotification_ReturnValue) == 0x000031, "Member 'WBP_BannerNotificationSlot_C_HandleInputAction_DismissNotification_Triggered::CallFunc_TryDismissNotification_ReturnValue' has a wrong offset!");

// Function WBP_BannerNotificationSlot.WBP_BannerNotificationSlot_C.HandleNotificationDismissed_Banner
// 0x0020 (0x0020 - 0x0000)
struct WBP_BannerNotificationSlot_C_HandleNotificationDismissed_Banner final
{
public:
	class UVALUI_NotificationQueue*               NotificationQueue;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  AffectedNotificationId;                            // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                NotificationWidget;                                // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BannerNotificationSlot_C_HandleNotificationDismissed_Banner) == 0x000008, "Wrong alignment on WBP_BannerNotificationSlot_C_HandleNotificationDismissed_Banner");
static_assert(sizeof(WBP_BannerNotificationSlot_C_HandleNotificationDismissed_Banner) == 0x000020, "Wrong size on WBP_BannerNotificationSlot_C_HandleNotificationDismissed_Banner");
static_assert(offsetof(WBP_BannerNotificationSlot_C_HandleNotificationDismissed_Banner, NotificationQueue) == 0x000000, "Member 'WBP_BannerNotificationSlot_C_HandleNotificationDismissed_Banner::NotificationQueue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_HandleNotificationDismissed_Banner, AffectedNotificationId) == 0x000008, "Member 'WBP_BannerNotificationSlot_C_HandleNotificationDismissed_Banner::AffectedNotificationId' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_HandleNotificationDismissed_Banner, NotificationWidget) == 0x000018, "Member 'WBP_BannerNotificationSlot_C_HandleNotificationDismissed_Banner::NotificationWidget' has a wrong offset!");

// Function WBP_BannerNotificationSlot.WBP_BannerNotificationSlot_C.HandleNotificationPushed_Banner
// 0x0018 (0x0018 - 0x0000)
struct WBP_BannerNotificationSlot_C_HandleNotificationPushed_Banner final
{
public:
	class UVALUI_NotificationQueue*               NotificationQueue;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  AffectedNotificationId;                            // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BannerNotificationSlot_C_HandleNotificationPushed_Banner) == 0x000008, "Wrong alignment on WBP_BannerNotificationSlot_C_HandleNotificationPushed_Banner");
static_assert(sizeof(WBP_BannerNotificationSlot_C_HandleNotificationPushed_Banner) == 0x000018, "Wrong size on WBP_BannerNotificationSlot_C_HandleNotificationPushed_Banner");
static_assert(offsetof(WBP_BannerNotificationSlot_C_HandleNotificationPushed_Banner, NotificationQueue) == 0x000000, "Member 'WBP_BannerNotificationSlot_C_HandleNotificationPushed_Banner::NotificationQueue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_HandleNotificationPushed_Banner, AffectedNotificationId) == 0x000008, "Member 'WBP_BannerNotificationSlot_C_HandleNotificationPushed_Banner::AffectedNotificationId' has a wrong offset!");

// Function WBP_BannerNotificationSlot.WBP_BannerNotificationSlot_C.SetNotificationQueue
// 0x0028 (0x0028 - 0x0000)
struct WBP_BannerNotificationSlot_C_SetNotificationQueue final
{
public:
	class UVALUI_NotificationQueue*               Param_Notification_Queue;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVALUI_NotificationQueue* NotificationQueue, struct FGuid& AffectedNotificationId, class UWidget* NotificationWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVALUI_NotificationQueue* NotificationQueue, struct FGuid& AffectedNotificationId)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BannerNotificationSlot_C_SetNotificationQueue) == 0x000008, "Wrong alignment on WBP_BannerNotificationSlot_C_SetNotificationQueue");
static_assert(sizeof(WBP_BannerNotificationSlot_C_SetNotificationQueue) == 0x000028, "Wrong size on WBP_BannerNotificationSlot_C_SetNotificationQueue");
static_assert(offsetof(WBP_BannerNotificationSlot_C_SetNotificationQueue, Param_Notification_Queue) == 0x000000, "Member 'WBP_BannerNotificationSlot_C_SetNotificationQueue::Param_Notification_Queue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_SetNotificationQueue, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_BannerNotificationSlot_C_SetNotificationQueue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_SetNotificationQueue, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_BannerNotificationSlot_C_SetNotificationQueue::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_BannerNotificationSlot.WBP_BannerNotificationSlot_C.TryShowNextBannerNotification
// 0x0058 (0x0058 - 0x0000)
struct WBP_BannerNotificationSlot_C_TryShowNextBannerNotification final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FGuid>                          CallFunc_GetAlllNotificationIds_ReturnValue;       // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD3[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetNotificationById_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowBannerNotification_CanShow;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD4[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetContent_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification) == 0x000008, "Wrong alignment on WBP_BannerNotificationSlot_C_TryShowNextBannerNotification");
static_assert(sizeof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification) == 0x000058, "Wrong size on WBP_BannerNotificationSlot_C_TryShowNextBannerNotification");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, CallFunc_GetAlllNotificationIds_ReturnValue) == 0x000018, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::CallFunc_GetAlllNotificationIds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, CallFunc_GetNotificationById_ReturnValue) == 0x000030, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::CallFunc_GetNotificationById_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, CallFunc_CanShowBannerNotification_CanShow) == 0x000038, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::CallFunc_CanShowBannerNotification_CanShow' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000039, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, CallFunc_GetContent_ReturnValue) == 0x000040, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::CallFunc_GetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, CallFunc_SetContent_ReturnValue) == 0x000048, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::CallFunc_SetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_TryShowNextBannerNotification, CallFunc_Not_PreBool_ReturnValue) == 0x000051, "Member 'WBP_BannerNotificationSlot_C_TryShowNextBannerNotification::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_BannerNotificationSlot.WBP_BannerNotificationSlot_C.UpdateInputActionsForNotifications
// 0x0024 (0x0024 - 0x0000)
struct WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications final
{
public:
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue_1;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD5[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_RegisterInputActionBinding_ReturnValue;   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications) == 0x000004, "Wrong alignment on WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications");
static_assert(sizeof(WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications) == 0x000024, "Wrong size on WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications");
static_assert(offsetof(WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications, CallFunc_IsValid_Guid_ReturnValue) == 0x000000, "Member 'WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications, CallFunc_IsValid_Guid_ReturnValue_1) == 0x000001, "Member 'WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications::CallFunc_IsValid_Guid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications, CallFunc_RegisterInputActionBinding_ReturnValue) == 0x000014, "Member 'WBP_BannerNotificationSlot_C_UpdateInputActionsForNotifications::CallFunc_RegisterInputActionBinding_ReturnValue' has a wrong offset!");

}

