#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialWindow_PartyRow_Slot_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S6UICore_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SocialWindow_PartyRow_Slot_CM.WBP_SocialWindow_PartyRow_Slot_CM_C
// 0x00B8 (0x0378 - 0x02C0)
class UWBP_SocialWindow_PartyRow_Slot_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_Button_Styled*                   EmptyPartyMemberButton;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyLeaderIcon;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PlayerCharacterContainer;                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Content;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerCharacterProfileImage_CM_C*  WBP_PlayerCharacterProfileImage_CM;                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_ContextMenuAnchor_CM_C*   WBP_Template_ContextMenuAnchor_CM;                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnInspectPlayerCharacter;                          // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVAL_PartyMember                       PartyMember;                                       // 0x0308(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FS6UI_ContextMenu                      PartyMemberContextMenu;                            // 0x0358(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BndEvt__WBP_SocialWindow_PartyRow_Slot_CM_WBP_PlayerCharacterProfileImage_CM_K2Node_ComponentBoundEvent_0_OnProfileImageClicked__DelegateSignature(class UWBP_PlayerCharacterProfileImage_CM_C* PlayerCharacterImageWidget);
	void BndEvt__WBP_SocialWindow_PartyRow_Slot_EmptyPartyMemberButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SocialWindow_PartyRow_Slot_EmptyPartyMemberButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void CreateContextMenu();
	void Destruct();
	void ExecuteUbergraph_WBP_SocialWindow_PartyRow_Slot_CM(int32 EntryPoint, bool Temp_bool_Variable, bool Temp_bool_Variable_1, struct FGuid& K2Node_CustomEvent_AccountId_1, struct FGuid& K2Node_CustomEvent_CharacterId_1, TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId)> K2Node_CreateDelegate_OutputDelegate, struct FGuid& K2Node_CustomEvent_AccountId, struct FGuid& K2Node_CustomEvent_CharacterId, struct FOSSVAL_CharacterNameAndId& K2Node_CustomEvent_Name, TDelegate<void(struct FGuid& AccountId, struct FGuid& CharacterId, struct FOSSVAL_CharacterNameAndId& Name)> K2Node_CreateDelegate_OutputDelegate_1, const struct FOSSVAL_CharacterNameAndId& Temp_struct_Variable, const struct FGuid& Temp_struct_Variable_1, const struct FGuid& Temp_struct_Variable_2, class FText CallFunc_Conv_StringToText_ReturnValue, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_2, class FText CallFunc_MakeLiteralText_ReturnValue, ESlateVisibility Temp_byte_Variable, bool CallFunc_IsValid_ReturnValue, class UOSSVAL_GetCharacterNameByAccountIdAndCharacterIdProxy* CallFunc_GetCharacterNameByAccountIdAndCharacterId_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UWidget* K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue_2, ESlateVisibility Temp_byte_Variable_1, bool CallFunc_EqualEqual_ReturnValue, ESlateVisibility K2Node_Select_Default_1, class UWBP_PlayerCharacterProfileImage_CM_C* K2Node_ComponentBoundEvent_PlayerCharacterImageWidget, bool CallFunc_IsDesktop_ReturnValue, TDelegate<void(class UUserWidget* MenuContent)> K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_EqualEqual_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue);
	void HandleOnContextMenuButtonPressed(class UWBP_PartyMemberRowContextMenu_C* ContentWidget);
	void HandleOnMenuContentCreated(class UUserWidget* MenuContent, TDelegate<void(class UWBP_PartyMemberRowContextMenu_C* ContentWidget)> K2Node_CreateDelegate_OutputDelegate, class UWBP_PartyMemberRowContextMenu_C* K2Node_DynamicCast_AsWBP_Party_Member_Row_Context_Menu, bool K2Node_DynamicCast_bSuccess);
	void OnFailure_F935566249BF6262C46F6894186F5687(struct FGuid& AccountId, struct FGuid& CharacterId);
	void OnInspectPlayerCharacter__DelegateSignature(const struct FUniqueNetIdRepl& UserId);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& Reply, const struct FKey& CallFunc_PointerEvent_GetEffectingButton_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, const struct FEventReply& CallFunc_Unhandled_ReturnValue, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, bool CallFunc_EqualEqual_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void OnSuccess_F935566249BF6262C46F6894186F5687(struct FGuid& AccountId, struct FGuid& CharacterId, struct FOSSVAL_CharacterNameAndId& Param_Name);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SocialWindow_PartyRow_Slot_CM_C">();
	}
	static class UWBP_SocialWindow_PartyRow_Slot_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SocialWindow_PartyRow_Slot_CM_C>();
	}
};
static_assert(alignof(UWBP_SocialWindow_PartyRow_Slot_CM_C) == 0x000008, "Wrong alignment on UWBP_SocialWindow_PartyRow_Slot_CM_C");
static_assert(sizeof(UWBP_SocialWindow_PartyRow_Slot_CM_C) == 0x000378, "Wrong size on UWBP_SocialWindow_PartyRow_Slot_CM_C");
static_assert(offsetof(UWBP_SocialWindow_PartyRow_Slot_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_SocialWindow_PartyRow_Slot_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_PartyRow_Slot_CM_C, EmptyPartyMemberButton) == 0x0002C8, "Member 'UWBP_SocialWindow_PartyRow_Slot_CM_C::EmptyPartyMemberButton' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_PartyRow_Slot_CM_C, PartyLeaderIcon) == 0x0002D0, "Member 'UWBP_SocialWindow_PartyRow_Slot_CM_C::PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_PartyRow_Slot_CM_C, PlayerCharacterContainer) == 0x0002D8, "Member 'UWBP_SocialWindow_PartyRow_Slot_CM_C::PlayerCharacterContainer' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_PartyRow_Slot_CM_C, Switcher_Content) == 0x0002E0, "Member 'UWBP_SocialWindow_PartyRow_Slot_CM_C::Switcher_Content' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_PartyRow_Slot_CM_C, WBP_PlayerCharacterProfileImage_CM) == 0x0002E8, "Member 'UWBP_SocialWindow_PartyRow_Slot_CM_C::WBP_PlayerCharacterProfileImage_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_PartyRow_Slot_CM_C, WBP_Template_ContextMenuAnchor_CM) == 0x0002F0, "Member 'UWBP_SocialWindow_PartyRow_Slot_CM_C::WBP_Template_ContextMenuAnchor_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_PartyRow_Slot_CM_C, OnInspectPlayerCharacter) == 0x0002F8, "Member 'UWBP_SocialWindow_PartyRow_Slot_CM_C::OnInspectPlayerCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_PartyRow_Slot_CM_C, PartyMember) == 0x000308, "Member 'UWBP_SocialWindow_PartyRow_Slot_CM_C::PartyMember' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_PartyRow_Slot_CM_C, PartyMemberContextMenu) == 0x000358, "Member 'UWBP_SocialWindow_PartyRow_Slot_CM_C::PartyMemberContextMenu' has a wrong offset!");

}

