#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InteractPlate_Prompt

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_InteractPlate_Prompt.WBP_InteractPlate_Prompt_C.ExecuteUbergraph_WBP_InteractPlate_Prompt
// 0x0018 (0x0018 - 0x0000)
struct WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_480F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractableComponent*                 K2Node_Event_interactable;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInteractablePlatePayload              K2Node_Event_payload;                              // 0x0010(0x0002)(ConstParm, NoDestructor)
};
static_assert(alignof(WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt) == 0x000008, "Wrong alignment on WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt");
static_assert(sizeof(WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt) == 0x000018, "Wrong size on WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt, EntryPoint) == 0x000000, "Member 'WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt, K2Node_Event_interactable) == 0x000008, "Member 'WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt::K2Node_Event_interactable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt, K2Node_Event_payload) == 0x000010, "Member 'WBP_InteractPlate_Prompt_C_ExecuteUbergraph_WBP_InteractPlate_Prompt::K2Node_Event_payload' has a wrong offset!");

// Function WBP_InteractPlate_Prompt.WBP_InteractPlate_Prompt_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_InteractPlate_Prompt_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_Prompt_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_InteractPlate_Prompt_C_PreConstruct");
static_assert(sizeof(WBP_InteractPlate_Prompt_C_PreConstruct) == 0x000001, "Wrong size on WBP_InteractPlate_Prompt_C_PreConstruct");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_InteractPlate_Prompt_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_InteractPlate_Prompt.WBP_InteractPlate_Prompt_C.Update
// 0x0010 (0x0010 - 0x0000)
struct WBP_InteractPlate_Prompt_C_Update final
{
public:
	class UInteractableComponent*                 Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInteractablePlatePayload              Payload;                                           // 0x0008(0x0002)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_InteractPlate_Prompt_C_Update) == 0x000008, "Wrong alignment on WBP_InteractPlate_Prompt_C_Update");
static_assert(sizeof(WBP_InteractPlate_Prompt_C_Update) == 0x000010, "Wrong size on WBP_InteractPlate_Prompt_C_Update");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update, Interactable) == 0x000000, "Member 'WBP_InteractPlate_Prompt_C_Update::Interactable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update, Payload) == 0x000008, "Member 'WBP_InteractPlate_Prompt_C_Update::Payload' has a wrong offset!");

// Function WBP_InteractPlate_Prompt.WBP_InteractPlate_Prompt_C.Update Alignment
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_InteractPlate_Prompt_C_Update_Alignment final
{
public:
	TArray<class UWidget*>                        Prompts;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CurrentIndex;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4810[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MidRange;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MidRangeFloor;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CalculatedMaxStepRange;                            // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4811[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4812[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4813[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4814[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_Prompt_C_Update_Alignment) == 0x000008, "Wrong alignment on WBP_InteractPlate_Prompt_C_Update_Alignment");
static_assert(sizeof(WBP_InteractPlate_Prompt_C_Update_Alignment) == 0x0000E8, "Wrong size on WBP_InteractPlate_Prompt_C_Update_Alignment");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, Prompts) == 0x000000, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::Prompts' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CurrentIndex) == 0x000010, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CurrentIndex' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, MidRange) == 0x000018, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::MidRange' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, MidRangeFloor) == 0x000020, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::MidRangeFloor' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CalculatedMaxStepRange) == 0x000028, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CalculatedMaxStepRange' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, Temp_int_Variable) == 0x000038, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_IsVisible_ReturnValue) == 0x00004C, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_GetChildrenCount_ReturnValue) == 0x000050, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Max_ReturnValue) == 0x000054, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000058, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000068, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_FFloor_ReturnValue) == 0x000070, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000078, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000080, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Abs_ReturnValue) == 0x000098, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_GetAllChildren_ReturnValue) == 0x0000A0, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0000B0, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_FMin_ReturnValue) == 0x0000B8, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_MakeVector2D_ReturnValue) == 0x0000C8, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000D8, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_Update_Alignment, CallFunc_FTrunc_ReturnValue) == 0x0000E0, "Member 'WBP_InteractPlate_Prompt_C_Update_Alignment::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function WBP_InteractPlate_Prompt.WBP_InteractPlate_Prompt_C.UpdateAllPickupEntries
// 0x0100 (0x0100 - 0x0000)
struct WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries final
{
public:
	class UInteractableComponent*                 InteractableComp;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInteractablePlatePayload              PlatePayload;                                      // 0x0008(0x0002)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_4815[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       ClosetInteractable;                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      VC;                                                // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	EInteractEventIndex                           CurrentEventIdx;                                   // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedsRealignment;                                  // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4816[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Idx;                                               // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        Prompts;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UObject*                                QuaternaryInteractable;                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                TertiaryInteractable;                              // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MouseSecondaryInteractable;                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MousePrimaryInteractable;                          // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                SecondaryInteractable;                             // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CurrentInteractable;                               // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4817[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4818[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractEventIndex                           CallFunc_Array_Get_Item;                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4819[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481A[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481B[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InteractPlate_PromptEntry_C*       CallFunc_SpawnObject_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481C[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class USphereComponent*                 CallFunc_K2_FindClosestInteractableLocation_ReturnValue; // 0x00C8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractPlate_PromptEntry_C*       K2Node_DynamicCast_AsWBP_Interact_Plate_Prompt_Entry; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481D[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetInteractable_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481E[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries) == 0x000008, "Wrong alignment on WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries");
static_assert(sizeof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries) == 0x000100, "Wrong size on WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, InteractableComp) == 0x000000, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::InteractableComp' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, PlatePayload) == 0x000008, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::PlatePayload' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, ClosetInteractable) == 0x000010, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::ClosetInteractable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, VC) == 0x000018, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::VC' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CurrentEventIdx) == 0x000020, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CurrentEventIdx' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, NeedsRealignment) == 0x000021, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::NeedsRealignment' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, Idx) == 0x000024, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::Idx' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, Prompts) == 0x000028, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::Prompts' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, QuaternaryInteractable) == 0x000038, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::QuaternaryInteractable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, TertiaryInteractable) == 0x000040, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::TertiaryInteractable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, MouseSecondaryInteractable) == 0x000048, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::MouseSecondaryInteractable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, MousePrimaryInteractable) == 0x000050, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::MousePrimaryInteractable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, SecondaryInteractable) == 0x000058, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::SecondaryInteractable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CurrentInteractable) == 0x000060, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CurrentInteractable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_GetValeriaCharacter_OutResult) == 0x000074, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000078, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, Temp_int_Variable) == 0x000084, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A1, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_RemoveChildAt_ReturnValue) == 0x0000A2, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A3, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_SpawnObject_ReturnValue) == 0x0000A8, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_Array_Add_ReturnValue) == 0x0000B0, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0000B4, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_AddChild_ReturnValue) == 0x0000B8, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_Array_Get_Item_2) == 0x0000C0, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_K2_FindClosestInteractableLocation_ReturnValue) == 0x0000C8, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_K2_FindClosestInteractableLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, K2Node_DynamicCast_AsWBP_Interact_Plate_Prompt_Entry) == 0x0000D0, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::K2Node_DynamicCast_AsWBP_Interact_Plate_Prompt_Entry' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_GetInteractable_ReturnValue) == 0x0000E0, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_GetInteractable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E8, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries, CallFunc_GetAllChildren_ReturnValue) == 0x0000F0, "Member 'WBP_InteractPlate_Prompt_C_UpdateAllPickupEntries::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");

// Function WBP_InteractPlate_Prompt.WBP_InteractPlate_Prompt_C.UpdatePickupEntry
// 0x0020 (0x0020 - 0x0000)
struct WBP_InteractPlate_Prompt_C_UpdatePickupEntry final
{
public:
	class UInteractableComponent*                 InteractableComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Interactable;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractPlate_PromptEntry_C*       PickupEntry;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EInteractEventIndex                           InteractEventIndex;                                // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InteractPlate_Prompt_C_UpdatePickupEntry) == 0x000008, "Wrong alignment on WBP_InteractPlate_Prompt_C_UpdatePickupEntry");
static_assert(sizeof(WBP_InteractPlate_Prompt_C_UpdatePickupEntry) == 0x000020, "Wrong size on WBP_InteractPlate_Prompt_C_UpdatePickupEntry");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdatePickupEntry, InteractableComponent) == 0x000000, "Member 'WBP_InteractPlate_Prompt_C_UpdatePickupEntry::InteractableComponent' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdatePickupEntry, Interactable) == 0x000008, "Member 'WBP_InteractPlate_Prompt_C_UpdatePickupEntry::Interactable' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdatePickupEntry, PickupEntry) == 0x000010, "Member 'WBP_InteractPlate_Prompt_C_UpdatePickupEntry::PickupEntry' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdatePickupEntry, InteractEventIndex) == 0x000018, "Member 'WBP_InteractPlate_Prompt_C_UpdatePickupEntry::InteractEventIndex' has a wrong offset!");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdatePickupEntry, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_InteractPlate_Prompt_C_UpdatePickupEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_InteractPlate_Prompt.WBP_InteractPlate_Prompt_C.UpdateRefillWaterCan
// 0x0010 (0x0010 - 0x0000)
struct WBP_InteractPlate_Prompt_C_UpdateRefillWaterCan final
{
public:
	TArray<struct FShopItemAdditionalCost>        K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_InteractPlate_Prompt_C_UpdateRefillWaterCan) == 0x000008, "Wrong alignment on WBP_InteractPlate_Prompt_C_UpdateRefillWaterCan");
static_assert(sizeof(WBP_InteractPlate_Prompt_C_UpdateRefillWaterCan) == 0x000010, "Wrong size on WBP_InteractPlate_Prompt_C_UpdateRefillWaterCan");
static_assert(offsetof(WBP_InteractPlate_Prompt_C_UpdateRefillWaterCan, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_InteractPlate_Prompt_C_UpdateRefillWaterCan::K2Node_MakeArray_Array' has a wrong offset!");

}

