#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerNamePlate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerNamePlate.WBP_PlayerNamePlate_C
// 0x0058 (0x0318 - 0x02C0)
class UWBP_PlayerNamePlate_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_Border_Styled*                   Border_CheatsEnabled;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Border_Styled*                   Border_GodModeEnabled;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Plate;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyLeaderIcon;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_PlayerGuild;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlatformPlayerName_C*              WBP_PlatformPlayerName;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AValeriaCharacter*                      Character;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  TextBlockStyle_DefaultRelationship;                // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  TextBlockStyle_NeighborRelationship;               // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  TextBlockStyle_PartyMemberRelationship;            // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_PlayerNamePlate(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_1, TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_1, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_3, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_2, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_3, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_4, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_5, TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_6, class AValeriaCharacter* K2Node_CustomEvent_Character_1, class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_4, const TSet<struct FUniqueNetIdRepl>& K2Node_CustomEvent_PlayerCharacterIds, TDelegate<void(TSet<struct FUniqueNetIdRepl>& BlockedUsers)> K2Node_CreateDelegate_OutputDelegate_7, class UDebugInfoComponent* K2Node_CustomEvent_DebugInfo, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_5, class UDebugInfoComponent* CallFunc_GetDebugInfoComponent_ReturnValue, class AValeriaCharacter* K2Node_CustomEvent_Character, EValeriaCharacterEvent K2Node_CustomEvent_Event, bool CallFunc_IsValid_ReturnValue_2, TDelegate<void(class AValeriaCharacter* Character, EValeriaCharacterEvent Event)> K2Node_CreateDelegate_OutputDelegate_8, TDelegate<void(class UDebugInfoComponent* DebugInfo)> K2Node_CreateDelegate_OutputDelegate_9, TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_10, TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem, struct FUniqueNetIdRepl& AffectedUserNetId)> K2Node_CreateDelegate_OutputDelegate_11, TSet<struct FUniqueNetIdRepl>& K2Node_CustomEvent_BlockedUsers, bool CallFunc_IsValid_ReturnValue_3, class UDebugInfoComponent* CallFunc_GetDebugInfoComponent_ReturnValue_1, TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem, struct FUniqueNetIdRepl& AffectedUserNetId)> K2Node_CreateDelegate_OutputDelegate_12, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_6, bool CallFunc_IsValid_ReturnValue_4, TDelegate<void(class AValeriaCharacter* Character, EValeriaCharacterEvent Event)> K2Node_CreateDelegate_OutputDelegate_13, TDelegate<void(class UDebugInfoComponent* DebugInfo)> K2Node_CreateDelegate_OutputDelegate_14, const struct FUniqueNetIdRepl& CallFunc_GetCharacterNetId_NetId, TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_15, EVAL_PartyManagerState K2Node_CustomEvent_state_1, struct FVAL_PartyMember& K2Node_CustomEvent_Member_3, TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_16, struct FVAL_PartyMember& K2Node_CustomEvent_Member_2, struct FVAL_PartyMember& K2Node_CustomEvent_Member_1, struct FVAL_PartyMember& K2Node_CustomEvent_Member, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_17, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_18, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_19, TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_20, EVAL_PartyManagerState K2Node_CustomEvent_state, TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_21, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue);
	void GetCharacterNetId(struct FUniqueNetIdRepl* NetId, const struct FUniqueNetIdRepl& CallFunc_GetNetIdFromPlayerState_ReturnValue);
	void Handle_On_Game_User_Settings_UI_Needs_Update(const struct FUniqueNetIdRepl& CallFunc_GetCharacterNetId_NetId, const struct FUniqueNetIdRepl& CallFunc_GetCharacterNetId_NetId_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_NotEqual_StrStr_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue);
	void Handle_User_Membership_Changed(class UVAL_PlayerGuildSubsystem* PlayerGuildManager, struct FUniqueNetIdRepl& AffectedUserNetId, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, const struct FUniqueNetIdRepl& CallFunc_GetCharacterNetId_NetId, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, TSet<struct FUniqueNetIdRepl>& K2Node_MakeSet_Set, bool CallFunc_Set_Contains_ReturnValue);
	void HandleBlockListChanged(TSet<struct FUniqueNetIdRepl>& BlockedUsers);
	void HandleCharacterChanged(class AValeriaCharacter* Param_Character, EValeriaCharacterEvent Event);
	void HandleDebugInfoChanged(class UDebugInfoComponent* DebugInfo);
	void HandleFriendshipChanged(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds);
	void HandleOnPartyStateChanged(EVAL_PartyManagerState State);
	void IsBlocked(bool* bBlocked, const struct FUniqueNetIdRepl& CallFunc_GetCharacterNetId_NetId, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, bool CallFunc_IsUserBlocked_ReturnValue);
	void IsFriend(bool* bFriend, const struct FUniqueNetIdRepl& CallFunc_GetCharacterNetId_NetId, class UVAL_FriendsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, bool CallFunc_IsFriend_ReturnValue);
	void IsInParty(bool* bInParty, bool* bLeader, const struct FUniqueNetIdRepl& CallFunc_GetCharacterNetId_NetId, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UVAL_PartyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, TArray<struct FUniqueNetIdRepl>& CallFunc_GetAllPartyMemberIds_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_EqualEqual_ReturnValue);
	void IsNeighbor(bool* bNeighbor, bool NewLocalVar_0, const struct FUniqueNetIdRepl& CallFunc_GetCharacterNetId_NetId, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, bool CallFunc_TryGetUserMembership_bOutHasMembership, const struct FVAL_PlayerGuild& CallFunc_TryGetUserMembership_PlayerGuild, bool CallFunc_TryGetUserMembership_ReturnValue, bool CallFunc_TryGetUserMembership_bOutHasMembership_1, const struct FVAL_PlayerGuild& CallFunc_TryGetUserMembership_PlayerGuild_1, bool CallFunc_TryGetUserMembership_ReturnValue_1, bool CallFunc_EqualEqual_GuidGuid_ReturnValue);
	void OnMemberAdded_Event(struct FVAL_PartyMember& Member);
	void OnMemberKicked_Event(struct FVAL_PartyMember& Member);
	void OnMemberPromoted_Event(struct FVAL_PartyMember& Member);
	void OnMemberRemoved_Event(struct FVAL_PartyMember& Member);
	void OnPartyStateChanged(EVAL_PartyManagerState State);
	void QueueUpdateAffiliation();
	void SetPlayerCharacter(class AValeriaCharacter* Param_Character);
	void UpdateCheatIcon(bool CallFunc_IsValid_ReturnValue, class UDebugInfoComponent* CallFunc_GetDebugInfoComponent_ReturnValue, bool CallFunc_AreCheatsEnabled_ReturnValue);
	void UpdateFromAffiliations(class UVALUI_TextBlockStyle* DesiredTextBlockStyle, const struct FUniqueNetIdRepl& CallFunc_GetCharacterNetId_NetId, bool CallFunc_IsValid_ReturnValue, ESlateVisibility Temp_byte_Variable, TSoftObjectPtr<class UVALUI_TextBlockStyle> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, bool CallFunc_IsNeighbor_bNeighbor, class UVAL_PlayerGuildSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, bool CallFunc_TryGetUserMembership_bOutHasMembership, const struct FVAL_PlayerGuild& CallFunc_TryGetUserMembership_PlayerGuild, bool CallFunc_TryGetUserMembership_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, bool CallFunc_IsInParty_bInParty, bool CallFunc_IsInParty_bLeader, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, bool CallFunc_IsInParty_bInParty_1, bool CallFunc_IsInParty_bLeader_1, bool CallFunc_BooleanAND_ReturnValue, ESlateVisibility K2Node_Select_Default);
	void UpdateGodModeIcon(bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsGodModeEnabled_ReturnValue);
	void UpdateName(class FText NewLocalVar_1, class FText NewLocalVar, class FText NewLocalVar_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerNamePlate_C">();
	}
	static class UWBP_PlayerNamePlate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerNamePlate_C>();
	}
};
static_assert(alignof(UWBP_PlayerNamePlate_C) == 0x000008, "Wrong alignment on UWBP_PlayerNamePlate_C");
static_assert(sizeof(UWBP_PlayerNamePlate_C) == 0x000318, "Wrong size on UWBP_PlayerNamePlate_C");
static_assert(offsetof(UWBP_PlayerNamePlate_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_PlayerNamePlate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerNamePlate_C, Border_CheatsEnabled) == 0x0002C8, "Member 'UWBP_PlayerNamePlate_C::Border_CheatsEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerNamePlate_C, Border_GodModeEnabled) == 0x0002D0, "Member 'UWBP_PlayerNamePlate_C::Border_GodModeEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerNamePlate_C, HBox_Plate) == 0x0002D8, "Member 'UWBP_PlayerNamePlate_C::HBox_Plate' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerNamePlate_C, PartyLeaderIcon) == 0x0002E0, "Member 'UWBP_PlayerNamePlate_C::PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerNamePlate_C, Text_PlayerGuild) == 0x0002E8, "Member 'UWBP_PlayerNamePlate_C::Text_PlayerGuild' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerNamePlate_C, WBP_PlatformPlayerName) == 0x0002F0, "Member 'UWBP_PlayerNamePlate_C::WBP_PlatformPlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerNamePlate_C, Character) == 0x0002F8, "Member 'UWBP_PlayerNamePlate_C::Character' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerNamePlate_C, TextBlockStyle_DefaultRelationship) == 0x000300, "Member 'UWBP_PlayerNamePlate_C::TextBlockStyle_DefaultRelationship' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerNamePlate_C, TextBlockStyle_NeighborRelationship) == 0x000308, "Member 'UWBP_PlayerNamePlate_C::TextBlockStyle_NeighborRelationship' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerNamePlate_C, TextBlockStyle_PartyMemberRelationship) == 0x000310, "Member 'UWBP_PlayerNamePlate_C::TextBlockStyle_PartyMemberRelationship' has a wrong offset!");

}

