#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Compass

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Compass.WBP_Compass_C.AddToTrackerPanel
// 0x0068 (0x0068 - 0x0000)
struct WBP_Compass_C_AddToTrackerPanel final
{
public:
	class UWBP_Compass_Tick_ActorTracker_C*       Tracker;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0048(0x0020)(NoDestructor)
};
static_assert(alignof(WBP_Compass_C_AddToTrackerPanel) == 0x000008, "Wrong alignment on WBP_Compass_C_AddToTrackerPanel");
static_assert(sizeof(WBP_Compass_C_AddToTrackerPanel) == 0x000068, "Wrong size on WBP_Compass_C_AddToTrackerPanel");
static_assert(offsetof(WBP_Compass_C_AddToTrackerPanel, Tracker) == 0x000000, "Member 'WBP_Compass_C_AddToTrackerPanel::Tracker' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddToTrackerPanel, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'WBP_Compass_C_AddToTrackerPanel::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddToTrackerPanel, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WBP_Compass_C_AddToTrackerPanel::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddToTrackerPanel, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'WBP_Compass_C_AddToTrackerPanel::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddToTrackerPanel, CallFunc_MakeVector2D_ReturnValue_1) == 0x000028, "Member 'WBP_Compass_C_AddToTrackerPanel::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddToTrackerPanel, CallFunc_MakeVector2D_ReturnValue_2) == 0x000038, "Member 'WBP_Compass_C_AddToTrackerPanel::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddToTrackerPanel, K2Node_MakeStruct_Anchors) == 0x000048, "Member 'WBP_Compass_C_AddToTrackerPanel::K2Node_MakeStruct_Anchors' has a wrong offset!");

// Function WBP_Compass.WBP_Compass_C.AddTracker
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_Compass_C_AddTracker final
{
public:
	class UTrackingComponent*                     TrackingComponentObject;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FTrackedItemInfo                       TrackedItemInfo;                                   // 0x0008(0x0148)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bIsFocused;                                        // 0x0150(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowOnCompass_bShouldShow;          // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4E[0x6];                                     // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidgetFromPool_ReturnValue;            // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Compass_Tick_ActorTracker_C*       K2Node_DynamicCast_AsWBP_Compass_Tick_Actor_Tracker; // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4F[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidgetFromPool_ReturnValue_1;          // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Compass_Tick_ActorTracker_C*       K2Node_DynamicCast_AsWBP_Compass_Tick_Actor_Tracker_1; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F50[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Compass_Tick_ActorTracker_C*       CallFunc_Map_Find_Value;                           // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F51[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Compass_Tick_ActorTracker_C*       CallFunc_Map_Find_Value_1;                         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F52[0x6];                                     // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x01C0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Compass_C_AddTracker) == 0x000008, "Wrong alignment on WBP_Compass_C_AddTracker");
static_assert(sizeof(WBP_Compass_C_AddTracker) == 0x0001F0, "Wrong size on WBP_Compass_C_AddTracker");
static_assert(offsetof(WBP_Compass_C_AddTracker, TrackingComponentObject) == 0x000000, "Member 'WBP_Compass_C_AddTracker::TrackingComponentObject' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, TrackedItemInfo) == 0x000008, "Member 'WBP_Compass_C_AddTracker::TrackedItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, bIsFocused) == 0x000150, "Member 'WBP_Compass_C_AddTracker::bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, CallFunc_ShouldShowOnCompass_bShouldShow) == 0x000151, "Member 'WBP_Compass_C_AddTracker::CallFunc_ShouldShowOnCompass_bShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, CallFunc_GetOwningPlayer_ReturnValue) == 0x000158, "Member 'WBP_Compass_C_AddTracker::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, CallFunc_GetWidgetFromPool_ReturnValue) == 0x000160, "Member 'WBP_Compass_C_AddTracker::CallFunc_GetWidgetFromPool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, K2Node_DynamicCast_AsWBP_Compass_Tick_Actor_Tracker) == 0x000168, "Member 'WBP_Compass_C_AddTracker::K2Node_DynamicCast_AsWBP_Compass_Tick_Actor_Tracker' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'WBP_Compass_C_AddTracker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, CallFunc_GetWidgetFromPool_ReturnValue_1) == 0x000178, "Member 'WBP_Compass_C_AddTracker::CallFunc_GetWidgetFromPool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, K2Node_DynamicCast_AsWBP_Compass_Tick_Actor_Tracker_1) == 0x000180, "Member 'WBP_Compass_C_AddTracker::K2Node_DynamicCast_AsWBP_Compass_Tick_Actor_Tracker_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, K2Node_DynamicCast_bSuccess_1) == 0x000188, "Member 'WBP_Compass_C_AddTracker::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, CallFunc_AddChild_ReturnValue) == 0x000190, "Member 'WBP_Compass_C_AddTracker::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, CallFunc_Map_Find_Value) == 0x000198, "Member 'WBP_Compass_C_AddTracker::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, CallFunc_Map_Find_ReturnValue) == 0x0001A0, "Member 'WBP_Compass_C_AddTracker::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, CallFunc_Map_Find_Value_1) == 0x0001A8, "Member 'WBP_Compass_C_AddTracker::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, CallFunc_Map_Find_ReturnValue_1) == 0x0001B0, "Member 'WBP_Compass_C_AddTracker::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, Temp_bool_Variable) == 0x0001B1, "Member 'WBP_Compass_C_AddTracker::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0001B8, "Member 'WBP_Compass_C_AddTracker::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, K2Node_Select_Default) == 0x0001C0, "Member 'WBP_Compass_C_AddTracker::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_AddTracker, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0001E8, "Member 'WBP_Compass_C_AddTracker::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function WBP_Compass.WBP_Compass_C.ClearAllTrackers
// 0x0058 (0x0058 - 0x0000)
struct WBP_Compass_C_ClearAllTrackers final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Compass_Tick_ActorTracker_C*> CallFunc_Map_Values_Values;                        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWBP_Compass_Tick_ActorTracker_C*> CallFunc_Map_Values_Values_1;                      // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_Compass_Tick_ActorTracker_C*       CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Compass_Tick_ActorTracker_C*       CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Compass_C_ClearAllTrackers) == 0x000008, "Wrong alignment on WBP_Compass_C_ClearAllTrackers");
static_assert(sizeof(WBP_Compass_C_ClearAllTrackers) == 0x000058, "Wrong size on WBP_Compass_C_ClearAllTrackers");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_Compass_C_ClearAllTrackers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Compass_C_ClearAllTrackers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Compass_C_ClearAllTrackers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'WBP_Compass_C_ClearAllTrackers::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'WBP_Compass_C_ClearAllTrackers::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_Compass_C_ClearAllTrackers::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, CallFunc_Map_Values_Values) == 0x000018, "Member 'WBP_Compass_C_ClearAllTrackers::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, CallFunc_Map_Values_Values_1) == 0x000028, "Member 'WBP_Compass_C_ClearAllTrackers::CallFunc_Map_Values_Values_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_Compass_C_ClearAllTrackers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WBP_Compass_C_ClearAllTrackers::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_Compass_C_ClearAllTrackers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'WBP_Compass_C_ClearAllTrackers::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_Compass_C_ClearAllTrackers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ClearAllTrackers, CallFunc_Less_IntInt_ReturnValue_1) == 0x000051, "Member 'WBP_Compass_C_ClearAllTrackers::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Compass.WBP_Compass_C.ExecuteUbergraph_WBP_Compass
// 0x06E0 (0x06E0 - 0x0000)
struct WBP_Compass_C_ExecuteUbergraph_WBP_Compass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F53[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTrackingComponent*                     CallFunc_GetTrackingComponent_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTrackingComponent* Compass, struct FTrackedItemInfo& TrackedItemInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F54[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterTeleportComponent*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F55[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTrackingComponent*                     K2Node_CustomEvent_compass_2;                      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTrackedItemInfo                       K2Node_CustomEvent_trackedItemInfo_2;              // 0x0050(0x0148)(ConstParm)
	class UTrackingComponent*                     K2Node_CustomEvent_compass_1;                      // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTrackedItemInfo                       K2Node_CustomEvent_trackedItemInfo_1;              // 0x01A0(0x0148)(ConstParm)
	bool                                          CallFunc_Client_IsFocusedItem_ReturnValue;         // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F56[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTrackingComponent*                     K2Node_CustomEvent_compass;                        // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTrackedItemInfo                       K2Node_CustomEvent_trackedItemInfo;                // 0x02F8(0x0148)(ConstParm)
	class UWBP_Compass_Tick_ActorTracker_C*       CallFunc_FindBestWidgetForDistance_CompassMarkerWidget; // 0x0440(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F57[0x2];                                     // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaCharacter* InValeriaCharacter, ETeleportTravelType TeleportTravelType, TSoftObjectPtr<class UPrivateSpaceConfig> PrivateSpaceConfig)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x044C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x045E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x045F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTrackingComponent* Compass, struct FTrackedItemInfo& TrackedItemInfo)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0460(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector2D& NewWindowSize)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0470(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector2D& NewWindowSize)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0480(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaGameState*                      K2Node_DynamicCast_AsValeria_Game_State;           // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F58[0x7];                                     // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaGameState*                      K2Node_DynamicCast_AsValeria_Game_State_1;         // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F59[0x7];                                     // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FValeriaGraphicSettings& GraphicSettings)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x04C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F5A[0x7];                                     // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x04E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FValeriaGraphicSettings& GraphicSettings)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x04E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F5B[0x7];                                     // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCameraYaw_Rotation;                    // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTrackingComponent* Compass, struct FTrackedItemInfo& TrackedItemInfo)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0508(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F5C[0x8];                                     // 0x0518(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetCameraTransform_Transform;             // 0x0520(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0580(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x05B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x05C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x05E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F5D[0x3];                                     // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x05F4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F5E[0x7];                                     // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_WidgetPoolManager*                CallFunc_SpawnObject_ReturnValue;                  // 0x0638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCompassDisplaySettingEnabled_IsEnabled; // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0642(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F5F[0x1];                                     // 0x0643(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaCharacter* InValeriaCharacter, class UPrivateSpaceConfig* PrivateSpaceConfig)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0644(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* InValeriaCharacter, class UPrivateSpaceConfig* PrivateSpaceConfig)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0654(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult_1;   // 0x0664(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F60[0x3];                                     // 0x0665(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue_1; // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult_2;   // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F61[0x7];                                     // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue_2; // 0x0678(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTrackingComponent*                     CallFunc_GetTrackingComponent_ReturnValue_1;       // 0x0680(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTrackingComponent*                     CallFunc_GetTrackingComponent_ReturnValue_2;       // 0x0688(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F62[0x2];                                     // 0x0692(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bActive)>                 K2Node_CreateDelegate_OutputDelegate_11;           // 0x0694(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bActive;                        // 0x06A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F63[0x3];                                     // 0x06A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bActive)>                 K2Node_CreateDelegate_OutputDelegate_12;           // 0x06A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x06B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x06C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x06C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass) == 0x000010, "Wrong alignment on WBP_Compass_C_ExecuteUbergraph_WBP_Compass");
static_assert(sizeof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass) == 0x0006E0, "Wrong size on WBP_Compass_C_ExecuteUbergraph_WBP_Compass");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, EntryPoint) == 0x000000, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetValeriaPlayerController_OutResult) == 0x000005, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000008, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetTrackingComponent_ReturnValue) == 0x000010, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetTrackingComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetValeriaCharacter_OutResult) == 0x00002A, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000030, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_HasAuthority_ReturnValue) == 0x000040, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_SwitchEnum_CmpSuccess_1) == 0x000041, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CustomEvent_compass_2) == 0x000048, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CustomEvent_compass_2' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CustomEvent_trackedItemInfo_2) == 0x000050, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CustomEvent_trackedItemInfo_2' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CustomEvent_compass_1) == 0x000198, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CustomEvent_compass_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CustomEvent_trackedItemInfo_1) == 0x0001A0, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CustomEvent_trackedItemInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_Client_IsFocusedItem_ReturnValue) == 0x0002E8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_Client_IsFocusedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CustomEvent_compass) == 0x0002F0, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CustomEvent_compass' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CustomEvent_trackedItemInfo) == 0x0002F8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CustomEvent_trackedItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_FindBestWidgetForDistance_CompassMarkerWidget) == 0x000440, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_FindBestWidgetForDistance_CompassMarkerWidget' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000448, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_IsValid_ReturnValue_1) == 0x000449, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_1) == 0x00044C, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_IsValid_ReturnValue_2) == 0x00045C, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, Temp_bool_Variable) == 0x00045D, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_Not_PreBool_ReturnValue_1) == 0x00045E, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_IsValid_ReturnValue_3) == 0x00045F, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_2) == 0x000460, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_3) == 0x000470, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_4) == 0x000480, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetGameState_ReturnValue) == 0x000490, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetGameState_ReturnValue_1) == 0x000498, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_DynamicCast_AsValeria_Game_State) == 0x0004A0, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_DynamicCast_AsValeria_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_DynamicCast_bSuccess) == 0x0004A8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_DynamicCast_AsValeria_Game_State_1) == 0x0004B0, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_DynamicCast_AsValeria_Game_State_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_DynamicCast_bSuccess_1) == 0x0004B8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x0004C0, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_5) == 0x0004C8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_IsValid_ReturnValue_4) == 0x0004D8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetValeriaGameUserSettings_ReturnValue_1) == 0x0004E0, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetValeriaGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_6) == 0x0004E8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_IsValid_ReturnValue_5) == 0x0004F8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetCameraYaw_Rotation) == 0x000500, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetCameraYaw_Rotation' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_7) == 0x000508, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetCameraTransform_Transform) == 0x000520, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetCameraTransform_Transform' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetCachedGeometry_ReturnValue) == 0x000580, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetLocalSize_ReturnValue) == 0x0005B8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_8) == 0x0005C8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_BreakVector2D_X) == 0x0005D8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_BreakVector2D_Y) == 0x0005E0, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0005E8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0005F0, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_Event_MyGeometry) == 0x0005F4, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_Event_InDeltaTime) == 0x00062C, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_IsValid_ReturnValue_6) == 0x000630, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_SpawnObject_ReturnValue) == 0x000638, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_IsCompassDisplaySettingEnabled_IsEnabled) == 0x000640, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_IsCompassDisplaySettingEnabled_IsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_Not_PreBool_ReturnValue_2) == 0x000641, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_IsValid_ReturnValue_7) == 0x000642, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_9) == 0x000644, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_10) == 0x000654, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetValeriaPlayerController_OutResult_1) == 0x000664, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetValeriaPlayerController_OutResult_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetValeriaPlayerController_ReturnValue_1) == 0x000668, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetValeriaPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetValeriaPlayerController_OutResult_2) == 0x000670, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetValeriaPlayerController_OutResult_2' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetValeriaPlayerController_ReturnValue_2) == 0x000678, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetValeriaPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetTrackingComponent_ReturnValue_1) == 0x000680, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetTrackingComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_GetTrackingComponent_ReturnValue_2) == 0x000688, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_GetTrackingComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_SwitchEnum_CmpSuccess_2) == 0x000690, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_SwitchEnum_CmpSuccess_3) == 0x000691, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_11) == 0x000694, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CustomEvent_bActive) == 0x0006A4, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CustomEvent_bActive' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, K2Node_CreateDelegate_OutputDelegate_12) == 0x0006A8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_PlayAnimation_ReturnValue) == 0x0006B8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_PlayAnimation_ReturnValue_1) == 0x0006C0, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_PlayAnimation_ReturnValue_2) == 0x0006C8, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_ExecuteUbergraph_WBP_Compass, CallFunc_IsValid_ReturnValue_8) == 0x0006D0, "Member 'WBP_Compass_C_ExecuteUbergraph_WBP_Compass::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");

// Function WBP_Compass.WBP_Compass_C.FindBestWidgetForDistance
// 0x0140 (0x0140 - 0x0000)
struct WBP_Compass_C_FindBestWidgetForDistance final
{
public:
	class UWBP_Compass_Tick_ActorTracker_C*       CompassMarkerWidget;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayerForwardVector;                               // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Compass_Tick_ActorTracker_C*       BestWidget;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        BestDegreesFromCenter;                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F64[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Compass_Tick_ActorTracker_C*> CallFunc_Map_Values_Values;                        // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F65[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Compass_Tick_ActorTracker_C*       CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F66[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F67[0x2];                                     // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F68[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Compass_C_FindBestWidgetForDistance) == 0x000008, "Wrong alignment on WBP_Compass_C_FindBestWidgetForDistance");
static_assert(sizeof(WBP_Compass_C_FindBestWidgetForDistance) == 0x000140, "Wrong size on WBP_Compass_C_FindBestWidgetForDistance");
static_assert(offsetof(WBP_Compass_C_FindBestWidgetForDistance, CompassMarkerWidget) == 0x000000, "Member 'WBP_Compass_C_FindBestWidgetForDistance::CompassMarkerWidget' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_FindBestWidgetForDistance, PlayerForwardVector) == 0x000008, "Member 'WBP_Compass_C_FindBestWidgetForDistance::PlayerForwardVector' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_FindBestWidgetForDistance, BestWidget) == 0x000020, "Member 'WBP_Compass_C_FindBestWidgetForDistance::BestWidget' has a wrong offset!");
static_assert(offsetof(WBP_Compass_C_FindBestWidgetForDistance, BestDegreesFromCenter) == 0x000028, "Member 'WBP_Compass_C_FindBestWidgetForDistance::BestDegreesFromCenter' has a wrong offset!");
