#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TIM_ChatTextEmoji_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_TIM_ChatTextEmoji_CM.WBP_TIM_ChatTextEmoji_CM_C.BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatTextEmoji_CM.WBP_TIM_ChatTextEmoji_CM_C.BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatTextEmoji_CM.WBP_TIM_ChatTextEmoji_CM_C.BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TIM_ChatTextEmoji_CM_C_BndEvt__WBP_TIM_ChatTextEmoji_CM_Button_Emoji_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TIM_ChatTextEmoji_CM.WBP_TIM_ChatTextEmoji_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_TIM_ChatTextEmoji_CM.WBP_TIM_ChatTextEmoji_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_TIM_ChatTextEmoji_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_TIM_ChatTextEmoji_CM.WBP_TIM_ChatTextEmoji_CM_C.ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM
// 0x0068 (0x0068 - 0x0000)
struct WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F30[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F31[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TIM_ChatTextEmojiListItem_C*        K2Node_DynamicCast_AsBP_TIM_Chat_Text_Emoji_List_Item; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F32[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0038(0x0018)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0058(0x0008)(NoDestructor)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM) == 0x000008, "Wrong alignment on WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM");
static_assert(sizeof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM) == 0x000068, "Wrong size on WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, EntryPoint) == 0x000000, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, K2Node_Event_bIsExpanded) == 0x000010, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, K2Node_Event_bIsSelected) == 0x000011, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, K2Node_Event_ListItemObject) == 0x000018, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, K2Node_DynamicCast_AsBP_TIM_Chat_Text_Emoji_List_Item) == 0x000020, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::K2Node_DynamicCast_AsBP_TIM_Chat_Text_Emoji_List_Item' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000030, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, CallFunc_GetText_ReturnValue) == 0x000038, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, K2Node_ComponentBoundEvent_Button_2) == 0x000050, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, K2Node_Event_InFocusEvent) == 0x000058, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000060, "Member 'WBP_TIM_ChatTextEmoji_CM_C_ExecuteUbergraph_WBP_TIM_ChatTextEmoji_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");

// Function WBP_TIM_ChatTextEmoji_CM.WBP_TIM_ChatTextEmoji_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatTextEmoji_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_TIM_ChatTextEmoji_CM_C_OnFocusLost");
static_assert(sizeof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_TIM_ChatTextEmoji_CM_C_OnFocusLost");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_TIM_ChatTextEmoji_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_TIM_ChatTextEmoji_CM.WBP_TIM_ChatTextEmoji_CM_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived) == 0x0001C0, "Wrong size on WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000F8, "Member 'WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived, CallFunc_GetCurrentInputType_ReturnValue) == 0x0001B8, "Member 'WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001B9, "Member 'WBP_TIM_ChatTextEmoji_CM_C_OnFocusReceived::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_TIM_ChatTextEmoji_CM.WBP_TIM_ChatTextEmoji_CM_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_TIM_ChatTextEmoji_CM_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TIM_ChatTextEmoji_CM_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_TIM_ChatTextEmoji_CM_C_OnListItemObjectSet");
static_assert(sizeof(WBP_TIM_ChatTextEmoji_CM_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_TIM_ChatTextEmoji_CM_C_OnListItemObjectSet");
static_assert(offsetof(WBP_TIM_ChatTextEmoji_CM_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_TIM_ChatTextEmoji_CM_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

}

