#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsPanel_PF

#include "Basic.hpp"

#include "E_CloseKeyRebindMenuType_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "KeyRebinding_structs.hpp"
#include "ValeriaUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.BndEvt__WBP_SettingsPanel_PF_WBP_AccessibilitySettings_PF_K2Node_ComponentBoundEvent_5_OnDropDownOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_AccessibilitySettings_PF_K2Node_ComponentBoundEvent_5_OnDropDownOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        Param_OpenedDropDownBox;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_AccessibilitySettings_PF_K2Node_ComponentBoundEvent_5_OnDropDownOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_AccessibilitySettings_PF_K2Node_ComponentBoundEvent_5_OnDropDownOpened__DelegateSignature");
static_assert(sizeof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_AccessibilitySettings_PF_K2Node_ComponentBoundEvent_5_OnDropDownOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_AccessibilitySettings_PF_K2Node_ComponentBoundEvent_5_OnDropDownOpened__DelegateSignature");
static_assert(offsetof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_AccessibilitySettings_PF_K2Node_ComponentBoundEvent_5_OnDropDownOpened__DelegateSignature, Param_OpenedDropDownBox) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_AccessibilitySettings_PF_K2Node_ComponentBoundEvent_5_OnDropDownOpened__DelegateSignature::Param_OpenedDropDownBox' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.BndEvt__WBP_SettingsPanel_PF_WBP_Audio_Settings_PF_K2Node_ComponentBoundEvent_3_OnDropDownOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_Audio_Settings_PF_K2Node_ComponentBoundEvent_3_OnDropDownOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        Param_OpenedDropDownBox;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_Audio_Settings_PF_K2Node_ComponentBoundEvent_3_OnDropDownOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_Audio_Settings_PF_K2Node_ComponentBoundEvent_3_OnDropDownOpened__DelegateSignature");
static_assert(sizeof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_Audio_Settings_PF_K2Node_ComponentBoundEvent_3_OnDropDownOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_Audio_Settings_PF_K2Node_ComponentBoundEvent_3_OnDropDownOpened__DelegateSignature");
static_assert(offsetof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_Audio_Settings_PF_K2Node_ComponentBoundEvent_3_OnDropDownOpened__DelegateSignature, Param_OpenedDropDownBox) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_Audio_Settings_PF_K2Node_ComponentBoundEvent_3_OnDropDownOpened__DelegateSignature::Param_OpenedDropDownBox' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_0_OnDropDownOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_0_OnDropDownOpened__DelegateSignature final
{
public:
	class UWBP_SettingsItem_Dropdown_CM_C*        Param_OpenedDropDownBox;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_0_OnDropDownOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_0_OnDropDownOpened__DelegateSignature");
static_assert(sizeof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_0_OnDropDownOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_0_OnDropDownOpened__DelegateSignature");
static_assert(offsetof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_0_OnDropDownOpened__DelegateSignature, Param_OpenedDropDownBox) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_0_OnDropDownOpened__DelegateSignature::Param_OpenedDropDownBox' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_13_OnFTUEFocusedItemChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_13_OnFTUEFocusedItemChanged__DelegateSignature final
{
public:
	bool                                          IsFTUEFlag;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_13_OnFTUEFocusedItemChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_13_OnFTUEFocusedItemChanged__DelegateSignature");
static_assert(sizeof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_13_OnFTUEFocusedItemChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_13_OnFTUEFocusedItemChanged__DelegateSignature");
static_assert(offsetof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_13_OnFTUEFocusedItemChanged__DelegateSignature, IsFTUEFlag) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_PF_WBP_GameplaySettings_PF_K2Node_ComponentBoundEvent_13_OnFTUEFocusedItemChanged__DelegateSignature::IsFTUEFlag' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature final
{
public:
	class UVALUI_TabButtonHostBase*               TabButtonHost;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature");
static_assert(sizeof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature");
static_assert(offsetof(WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature, TabButtonHost) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature::TabButtonHost' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsPanel_PF_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_SettingsPanel_PF_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_SettingsPanel_PF_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_SettingsPanel_PF_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_SettingsPanel_PF_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.CloseSettingsPanel
// 0x0018 (0x0018 - 0x0000)
struct WBP_SettingsPanel_PF_C_CloseSettingsPanel final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56CA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_CloseSettingsPanel) == 0x000008, "Wrong alignment on WBP_SettingsPanel_PF_C_CloseSettingsPanel");
static_assert(sizeof(WBP_SettingsPanel_PF_C_CloseSettingsPanel) == 0x000018, "Wrong size on WBP_SettingsPanel_PF_C_CloseSettingsPanel");
static_assert(offsetof(WBP_SettingsPanel_PF_C_CloseSettingsPanel, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_CloseSettingsPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_CloseSettingsPanel, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_SettingsPanel_PF_C_CloseSettingsPanel::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_CloseSettingsPanel, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'WBP_SettingsPanel_PF_C_CloseSettingsPanel::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.DisplayKeyRebindPrompt
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsPanel_PF_C_DisplayKeyRebindPrompt final
{
public:
	bool                                          bIsActivated;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_DisplayKeyRebindPrompt) == 0x000001, "Wrong alignment on WBP_SettingsPanel_PF_C_DisplayKeyRebindPrompt");
static_assert(sizeof(WBP_SettingsPanel_PF_C_DisplayKeyRebindPrompt) == 0x000001, "Wrong size on WBP_SettingsPanel_PF_C_DisplayKeyRebindPrompt");
static_assert(offsetof(WBP_SettingsPanel_PF_C_DisplayKeyRebindPrompt, bIsActivated) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_DisplayKeyRebindPrompt::bIsActivated' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.ExecutePrePopupAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsPanel_PF_C_ExecutePrePopupAction final
{
public:
	E_CloseKeyRebindMenuType                      PrePopupAction;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_ExecutePrePopupAction) == 0x000001, "Wrong alignment on WBP_SettingsPanel_PF_C_ExecutePrePopupAction");
static_assert(sizeof(WBP_SettingsPanel_PF_C_ExecutePrePopupAction) == 0x000001, "Wrong size on WBP_SettingsPanel_PF_C_ExecutePrePopupAction");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecutePrePopupAction, PrePopupAction) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_ExecutePrePopupAction::PrePopupAction' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.ExecuteUbergraph_WBP_SettingsPanel_PF
// 0x03B8 (0x03B8 - 0x0000)
struct WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNextTabName_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56CB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetNextTabName_Output;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56CC[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTabName_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TabButtonHostBase*               K2Node_ComponentBoundEvent_TabButtonHost;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_InstantiatedTabButtonInfo       CallFunc_TryGetTabInfo_OutInfo;                    // 0x0028(0x0068)(ContainsInstancedReference)
	bool                                          CallFunc_TryGetTabInfo_ReturnValue;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56CD[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActiveTabName_ReturnValue_1;           // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56CE[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALUI_InstantiatedTabButtonInfo       CallFunc_TryGetTabInfo_OutInfo_1;                  // 0x00A0(0x0068)(ContainsInstancedReference)
	bool                                          CallFunc_TryGetTabInfo_ReturnValue_1;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56CF[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidgetInputExtended*  K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D0[0x6];                                     // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropDownBox_2;    // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropDownBox_1;    // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsItem_Dropdown_CM_C*        K2Node_ComponentBoundEvent_OpenedDropDownBox;      // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0170(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0198(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D1[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0204(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsFTUEFlag;             // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D2[0x2];                                     // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsActivated)>            K2Node_CreateDelegate_OutputDelegate_6;            // 0x0218(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_KeyRebindInterface_C> K2Node_Event_OwnerWidget;                          // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CloseKeyRebindMenuType                      K2Node_Event_PrePopupAction_1;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D3[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyRebind_DisplayResult               K2Node_Event_KeyRebindResultInfo;                  // 0x0240(0x00E0)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0320(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0330(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CloseKeyRebindMenuType                      K2Node_Event_PrePopupAction;                       // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D4[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D5[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0368(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0390(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsActivated;                   // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNextTabName_ReturnValue_1;             // 0x03AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetNextTabName_Output_1;                  // 0x03AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF) == 0x000008, "Wrong alignment on WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF");
static_assert(sizeof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF) == 0x0003B8, "Wrong size on WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, EntryPoint) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_GetNextTabName_ReturnValue) == 0x000004, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_GetNextTabName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_GetNextTabName_Output) == 0x000008, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_GetNextTabName_Output' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_AkEventGlobal_ReturnValue) == 0x000014, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_GetActiveTabName_ReturnValue) == 0x000018, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_GetActiveTabName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_ComponentBoundEvent_TabButtonHost) == 0x000020, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_ComponentBoundEvent_TabButtonHost' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_TryGetTabInfo_OutInfo) == 0x000028, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_TryGetTabInfo_OutInfo' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_TryGetTabInfo_ReturnValue) == 0x000090, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_TryGetTabInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_GetActiveTabName_ReturnValue_1) == 0x000094, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_GetActiveTabName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_TryGetTabInfo_OutInfo_1) == 0x0000A0, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_TryGetTabInfo_OutInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_TryGetTabInfo_ReturnValue_1) == 0x000108, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_TryGetTabInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended) == 0x000110, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_bool_Variable) == 0x000119, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000120, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_real_Variable) == 0x000128, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_ComponentBoundEvent_OpenedDropDownBox_2) == 0x000130, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_ComponentBoundEvent_OpenedDropDownBox_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_ComponentBoundEvent_OpenedDropDownBox_1) == 0x000138, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_ComponentBoundEvent_OpenedDropDownBox_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_ComponentBoundEvent_OpenedDropDownBox) == 0x000140, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_ComponentBoundEvent_OpenedDropDownBox' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_GetOwningPlayer_ReturnValue) == 0x000148, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000150, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000158, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_AkEventGlobal_ReturnValue_2) == 0x00015C, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_real_Variable_1) == 0x000160, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_object_Variable) == 0x000168, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000170, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000190, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000194, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000198, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_CreateDelegate_OutputDelegate) == 0x0001A0, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_real_Variable_1_0) == 0x0001B0, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_real_Variable_0) == 0x0001B8, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x0001C0, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001C4, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001D4, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001E4, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001F4, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_CreateDelegate_OutputDelegate_5) == 0x000204, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_ComponentBoundEvent_IsFTUEFlag) == 0x000214, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_ComponentBoundEvent_IsFTUEFlag' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_bool_Variable_1) == 0x000215, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_CreateDelegate_OutputDelegate_6) == 0x000218, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_Event_OwnerWidget) == 0x000228, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_Event_OwnerWidget' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_Event_PrePopupAction_1) == 0x000238, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_Event_PrePopupAction_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_Event_KeyRebindResultInfo) == 0x000240, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_Event_KeyRebindResultInfo' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_CreateDelegate_OutputDelegate_7) == 0x000320, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_CreateDelegate_OutputDelegate_8) == 0x000330, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_real_Variable_2) == 0x000340, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_real_Variable_3) == 0x000348, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_Event_PrePopupAction) == 0x000350, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_Event_PrePopupAction' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_object_Variable_1) == 0x000358, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_SwitchEnum_CmpSuccess) == 0x000360, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000368, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000388, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00038C, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000390, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_real_Variable_3_0) == 0x000398, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, Temp_real_Variable_2_0) == 0x0003A0, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0003A8, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, K2Node_CustomEvent_bIsActivated) == 0x0003A9, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::K2Node_CustomEvent_bIsActivated' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_Not_PreBool_ReturnValue) == 0x0003AA, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_GetNextTabName_ReturnValue_1) == 0x0003AB, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_GetNextTabName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF, CallFunc_GetNextTabName_Output_1) == 0x0003AC, "Member 'WBP_SettingsPanel_PF_C_ExecuteUbergraph_WBP_SettingsPanel_PF::CallFunc_GetNextTabName_Output_1' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.GetNextTabName
// 0x0050 (0x0050 - 0x0000)
struct WBP_SettingsPanel_PF_C_GetNextTabName final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D6[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Output;                                            // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextIndex;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetTabNames_ReturnValue;                  // 0x0010(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTabName_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetTabNames_ReturnValue_1;                // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D7[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_GetNextTabName) == 0x000008, "Wrong alignment on WBP_SettingsPanel_PF_C_GetNextTabName");
static_assert(sizeof(WBP_SettingsPanel_PF_C_GetNextTabName) == 0x000050, "Wrong size on WBP_SettingsPanel_PF_C_GetNextTabName");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, Condition) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::Condition' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, ReturnValue) == 0x000001, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, Output) == 0x000004, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::Output' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, NextIndex) == 0x00000C, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::NextIndex' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, CallFunc_GetTabNames_ReturnValue) == 0x000010, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::CallFunc_GetTabNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, CallFunc_GetActiveTabName_ReturnValue) == 0x000028, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::CallFunc_GetActiveTabName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, CallFunc_GetTabNames_ReturnValue_1) == 0x000030, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::CallFunc_GetTabNames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, CallFunc_Array_Find_ReturnValue) == 0x000044, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_GetNextTabName, CallFunc_Subtract_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_SettingsPanel_PF_C_GetNextTabName::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.Handing Input Action Switch Tab
// 0x0010 (0x0010 - 0x0000)
struct WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab final
{
public:
	bool                                          bLeftSwitch;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNextTabName_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D8[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetNextTabName_Output;                    // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrySetActiveTabName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab) == 0x000004, "Wrong alignment on WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab");
static_assert(sizeof(WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab) == 0x000010, "Wrong size on WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab");
static_assert(offsetof(WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab, bLeftSwitch) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab::bLeftSwitch' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab, CallFunc_GetNextTabName_ReturnValue) == 0x000001, "Member 'WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab::CallFunc_GetNextTabName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab, CallFunc_GetNextTabName_Output) == 0x000004, "Member 'WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab::CallFunc_GetNextTabName_Output' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab, CallFunc_TrySetActiveTabName_ReturnValue) == 0x00000C, "Member 'WBP_SettingsPanel_PF_C_Handing_Input_Action_Switch_Tab::CallFunc_TrySetActiveTabName_ReturnValue' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_SettingsPanel_PF_C_InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsPanel_PF_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SettingsPanel_PF_C_PreConstruct");
static_assert(sizeof(WBP_SettingsPanel_PF_C_PreConstruct) == 0x000001, "Wrong size on WBP_SettingsPanel_PF_C_PreConstruct");
static_assert(offsetof(WBP_SettingsPanel_PF_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SettingsPanel_PF.WBP_SettingsPanel_PF_C.PreswitchCheckforKeyRebindMenu
// 0x0038 (0x0038 - 0x0000)
struct WBP_SettingsPanel_PF_C_PreswitchCheckforKeyRebindMenu final
{
public:
	E_CloseKeyRebindMenuType                      ExcuteStatus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_KeyRebindInterface_C> K2Node_DynamicCast_AsBPI_Key_Rebind_Interface;     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56DA[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_KeyRebindInterface_C> CallFunc_ToggleButtonCheckPopup_OwnerWidget_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsPanel_PF_C_PreswitchCheckforKeyRebindMenu) == 0x000008, "Wrong alignment on WBP_SettingsPanel_PF_C_PreswitchCheckforKeyRebindMenu");
static_assert(sizeof(WBP_SettingsPanel_PF_C_PreswitchCheckforKeyRebindMenu) == 0x000038, "Wrong size on WBP_SettingsPanel_PF_C_PreswitchCheckforKeyRebindMenu");
static_assert(offsetof(WBP_SettingsPanel_PF_C_PreswitchCheckforKeyRebindMenu, ExcuteStatus) == 0x000000, "Member 'WBP_SettingsPanel_PF_C_PreswitchCheckforKeyRebindMenu::ExcuteStatus' has a wrong offset!");
static_assert(offsetof(WBP_SettingsPanel_PF_C_PreswitchCheckforKeyRebindMenu, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_SettingsPanel_PF_C_PreswitchCheckforKeyRebindMenu::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
