#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FontAwesomeGlyph

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FontAwesomeGlyph.WBP_FontAwesomeGlyph_C
// 0x0098 (0x0358 - 0x02C0)
class UWBP_FontAwesomeGlyph_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_Icon;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Glyph;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Width;                                             // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Height;                                            // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Glyphs;                                            // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bUseSolidStyle;                                    // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5037[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   OutlineSettings;                                   // 0x0300(0x0020)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              ShadowOffset;                                      // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           ShadowColor;                                       // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateColor                            GlyphColorAndOpacity;                              // 0x0340(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_FontAwesomeGlyph(int32 EntryPoint, bool K2Node_Event_IsDesignTime);
	void PreConstruct(bool IsDesignTime);
	void UpdateFromProperties(bool Temp_bool_Variable, class FName Temp_name_Variable, class FName Temp_name_Variable_1, int32 CallFunc_FTrunc_ReturnValue, class FName K2Node_Select_Default, double CallFunc_Conv_IntToDouble_ReturnValue, const struct FSlateFontInfo& K2Node_MakeStruct_SlateFontInfo, class FText CallFunc_Conv_StringToText_ReturnValue, float K2Node_MakeStruct_Size_ImplicitCast, float CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast, float CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FontAwesomeGlyph_C">();
	}
	static class UWBP_FontAwesomeGlyph_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FontAwesomeGlyph_C>();
	}
};
static_assert(alignof(UWBP_FontAwesomeGlyph_C) == 0x000008, "Wrong alignment on UWBP_FontAwesomeGlyph_C");
static_assert(sizeof(UWBP_FontAwesomeGlyph_C) == 0x000358, "Wrong size on UWBP_FontAwesomeGlyph_C");
static_assert(offsetof(UWBP_FontAwesomeGlyph_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_FontAwesomeGlyph_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FontAwesomeGlyph_C, SizeBox_Icon) == 0x0002C8, "Member 'UWBP_FontAwesomeGlyph_C::SizeBox_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_FontAwesomeGlyph_C, TextBlock_Glyph) == 0x0002D0, "Member 'UWBP_FontAwesomeGlyph_C::TextBlock_Glyph' has a wrong offset!");
static_assert(offsetof(UWBP_FontAwesomeGlyph_C, Width) == 0x0002D8, "Member 'UWBP_FontAwesomeGlyph_C::Width' has a wrong offset!");
static_assert(offsetof(UWBP_FontAwesomeGlyph_C, Height) == 0x0002E0, "Member 'UWBP_FontAwesomeGlyph_C::Height' has a wrong offset!");
static_assert(offsetof(UWBP_FontAwesomeGlyph_C, Glyphs) == 0x0002E8, "Member 'UWBP_FontAwesomeGlyph_C::Glyphs' has a wrong offset!");
static_assert(offsetof(UWBP_FontAwesomeGlyph_C, bUseSolidStyle) == 0x0002F8, "Member 'UWBP_FontAwesomeGlyph_C::bUseSolidStyle' has a wrong offset!");
static_assert(offsetof(UWBP_FontAwesomeGlyph_C, OutlineSettings) == 0x000300, "Member 'UWBP_FontAwesomeGlyph_C::OutlineSettings' has a wrong offset!");
static_assert(offsetof(UWBP_FontAwesomeGlyph_C, ShadowOffset) == 0x000320, "Member 'UWBP_FontAwesomeGlyph_C::ShadowOffset' has a wrong offset!");
static_assert(offsetof(UWBP_FontAwesomeGlyph_C, ShadowColor) == 0x000330, "Member 'UWBP_FontAwesomeGlyph_C::ShadowColor' has a wrong offset!");
static_assert(offsetof(UWBP_FontAwesomeGlyph_C, GlyphColorAndOpacity) == 0x000340, "Member 'UWBP_FontAwesomeGlyph_C::GlyphColorAndOpacity' has a wrong offset!");

}

