#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EmoteSelectedTip_CM

#include "Basic.hpp"

#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_EmoteSelectedTip_CM.WBP_EmoteSelectedTip_CM_C.SetFocusTip
// 0x0010 (0x0010 - 0x0000)
struct WBP_EmoteSelectedTip_CM_C_SetFocusTip final
{
public:
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EmoteSelectedTip_CM_C_SetFocusTip) == 0x000008, "Wrong alignment on WBP_EmoteSelectedTip_CM_C_SetFocusTip");
static_assert(sizeof(WBP_EmoteSelectedTip_CM_C_SetFocusTip) == 0x000010, "Wrong size on WBP_EmoteSelectedTip_CM_C_SetFocusTip");
static_assert(offsetof(WBP_EmoteSelectedTip_CM_C_SetFocusTip, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_EmoteSelectedTip_CM_C_SetFocusTip::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EmoteSelectedTip_CM_C_SetFocusTip, CallFunc_GetCurrentInputType_ReturnValue) == 0x000008, "Member 'WBP_EmoteSelectedTip_CM_C_SetFocusTip::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EmoteSelectedTip_CM_C_SetFocusTip, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'WBP_EmoteSelectedTip_CM_C_SetFocusTip::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

