#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainLobby_CM

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainLobby_CM.WBP_MainLobby_CM_C.BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainLobby_CM.WBP_MainLobby_CM_C.BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Exit_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainLobby_CM.WBP_MainLobby_CM_C.BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainLobby_CM.WBP_MainLobby_CM_C.BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Help_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainLobby_CM.WBP_MainLobby_CM_C.BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainLobby_CM.WBP_MainLobby_CM_C.BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainLobby_CM_C_BndEvt__WBP_MainLobby_CM_Button_Settings_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainLobby_CM.WBP_MainLobby_CM_C.ExecuteUbergraph_WBP_MainLobby_CM
// 0x0418 (0x0418 - 0x0000)
struct WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3378[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget_1;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PopupEULA_CM_C*                    K2Node_DynamicCast_AsWBP_Popup_EULA_CM;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3379[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget;                    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PrivacyPolicy_CM_C*                K2Node_DynamicCast_AsWBP_Privacy_Policy_CM;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337A[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_5;    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BuildIsShipping_ReturnValue;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337B[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetValeriaBuildInfoString_ReturnValue;    // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetVersionString_ReturnValue;             // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0108(0x0018)()
	bool                                          CallFunc_IsValidVersionString_ReturnValue;         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337C[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_6;    // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_7;    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_4;              // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337D[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_5;              // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_6;              // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337E[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_8;    // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337F[0x2];                                     // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x01AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3380[0x2];                                     // 0x01BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetHoveredInputBox_OutWidget;             // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3381[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_Widget;                         // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0200(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0228(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3382[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3383[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue;                    // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3384[0x2];                                     // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0264(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0274(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3385[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue_1;                  // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3386[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_7;              // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3387[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSteamEnabled_ReturnValue;               // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3388[0x3];                                     // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& ErrorMessage, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x02DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3389[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ErrorMessage_1;                 // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ErrorCode;                      // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338A[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_ErrorMessage;                   // 0x0308(0x0018)()
	TDelegate<void(class FText ErrorMessage)>     K2Node_CreateDelegate_OutputDelegate_11;           // 0x0320(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText ErrorMessage)>     K2Node_CreateDelegate_OutputDelegate_12;           // 0x0330(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338B[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0350(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x0368(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338C[0x6];                                     // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Msg;                                  // 0x0390(0x0018)(ConstParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x03A8(0x0018)()
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x03C0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x03E8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ErrorMessage, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x03F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldRecommendRestart_ShouldRecommend;   // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338D[0x2];                                     // 0x0412(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM) == 0x000008, "Wrong alignment on WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM");
static_assert(sizeof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM) == 0x000418, "Wrong size on WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, EntryPoint) == 0x000000, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_byte_Variable) == 0x000004, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CustomEvent_ModalWidget_1) == 0x000018, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CustomEvent_ModalWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_object_Variable) == 0x000030, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_DynamicCast_AsWBP_Popup_EULA_CM) == 0x000048, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_DynamicCast_AsWBP_Popup_EULA_CM' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CustomEvent_ModalWidget) == 0x000058, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CustomEvent_ModalWidget' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_object_Variable_1) == 0x000070, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x000078, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_DynamicCast_AsWBP_Privacy_Policy_CM) == 0x000088, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_DynamicCast_AsWBP_Privacy_Policy_CM' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000098, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0000A0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x0000A8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x0000B0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_4) == 0x0000B8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_5) == 0x0000C0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_BuildIsShipping_ReturnValue) == 0x0000C8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_BuildIsShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetValeriaBuildInfoString_ReturnValue) == 0x0000D0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetValeriaBuildInfoString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetVersionString_ReturnValue) == 0x0000E0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetVersionString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000108, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_IsValidVersionString_ReturnValue) == 0x000120, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_IsValidVersionString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_6) == 0x000128, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_7) == 0x000130, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000138, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x00013C, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_ComponentBoundEvent_Button_5) == 0x000140, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_ComponentBoundEvent_Button_4) == 0x000148, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x000150, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_AkEventGlobal_ReturnValue_3) == 0x000154, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_AkEventGlobal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_ComponentBoundEvent_Button_3) == 0x000158, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_ComponentBoundEvent_Button_2) == 0x000160, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_AkEventGlobal_ReturnValue_4) == 0x000168, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_AkEventGlobal_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000170, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_ComponentBoundEvent_Button) == 0x000178, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_AkEventGlobal_ReturnValue_5) == 0x000180, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_AkEventGlobal_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_AkEventGlobal_ReturnValue_6) == 0x000184, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_AkEventGlobal_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_byte_Variable_1) == 0x000188, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_8) == 0x000190, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_5) == 0x000198, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_bool_Variable) == 0x0001A8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CustomEvent_bNewInputType) == 0x0001A9, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001AC, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_SwitchEnum_CmpSuccess) == 0x0001BC, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_Event_IsDesignTime) == 0x0001BD, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetHoveredInputBox_OutWidget) == 0x0001C0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetHoveredInputBox_OutWidget' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_real_Variable) == 0x0001C8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_IsValid_ReturnValue) == 0x0001D0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_real_Variable_1) == 0x0001D8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CustomEvent_Widget) == 0x0001E0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_object_Variable_2) == 0x0001E8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001F0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000200, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000220, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000224, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000228, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_real_Variable_1_0) == 0x000230, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_real_Variable_0) == 0x000238, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000240, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x000248, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_bool_Variable_1) == 0x000250, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_OpenModal_ReturnValue) == 0x000258, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_OpenModal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_Select_Default) == 0x000260, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_IsValid_ReturnValue_1) == 0x000261, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_8) == 0x000264, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_9) == 0x000274, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000288, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_OpenModal_ReturnValue_1) == 0x000290, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_OpenModal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_IsValid_ReturnValue_2) == 0x000298, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetDesiredSize_ReturnValue) == 0x0002A0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_AkEventGlobal_ReturnValue_7) == 0x0002B0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_AkEventGlobal_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_BreakVector2D_X) == 0x0002B8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_BreakVector2D_Y) == 0x0002C0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_MakeStruct_Margin) == 0x0002C8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_IsSteamEnabled_ReturnValue) == 0x0002D8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_IsSteamEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_10) == 0x0002DC, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CustomEvent_ErrorMessage_1) == 0x0002F0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CustomEvent_ErrorMessage_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CustomEvent_ErrorCode) == 0x000300, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CustomEvent_ErrorCode' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CustomEvent_ErrorMessage) == 0x000308, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CustomEvent_ErrorMessage' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_11) == 0x000320, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_12) == 0x000330, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_bool_Variable_2) == 0x000340, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_real_Variable_2) == 0x000348, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_13) == 0x000350, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_real_Variable_3) == 0x000360, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_14) == 0x000368, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_object_Variable_3) == 0x000378, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_GetActiveWidget_ReturnValue) == 0x000380, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000388, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_BooleanAND_ReturnValue) == 0x000389, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_Event_Msg) == 0x000390, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_Event_Msg' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_MakeLiteralText_ReturnValue) == 0x0003A8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x0003C0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x0003E0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x0003E4, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x0003E8, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_CreateDelegate_OutputDelegate_15) == 0x0003F0, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_real_Variable_3_0) == 0x000400, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, Temp_real_Variable_2_0) == 0x000408, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000410, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, CallFunc_ShouldRecommendRestart_ShouldRecommend) == 0x000411, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::CallFunc_ShouldRecommendRestart_ShouldRecommend' has a wrong offset!");
static_assert(offsetof(WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM, K2Node_MakeStruct_Left_ImplicitCast) == 0x000414, "Member 'WBP_MainLobby_CM_C_ExecuteUbergraph_WBP_MainLobby_CM::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");

// Function WBP_MainLobby_CM.WBP_MainLobby_CM_C.GetHoveredInputBox
// 0x0010 (0x0010 - 0x0000)
struct WBP_MainLobby_CM_C_GetHoveredInputBox final
{
public:
	class UWidget*                                OutWidget;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainLobby_CM_C_GetHoveredInputBox) == 0x000008, "Wrong alignment on WBP_MainLobby_CM_C_GetHoveredInputBox");
static_assert(sizeof(WBP_MainLobby_CM_C_GetHoveredInputBox) == 0x000010, "Wrong size on WBP_MainLobby_CM_C_GetHoveredInputBox");
