#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemTooltip

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.ExecuteUbergraph_WBP_ItemTooltip
// 0x0038 (0x0038 - 0x0000)
struct WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5048[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5049[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip");
static_assert(sizeof(WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip) == 0x000038, "Wrong size on WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip");
static_assert(offsetof(WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip, EntryPoint) == 0x000000, "Member 'WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000028, "Member 'WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip, CallFunc_GetCurrentInputType_ReturnValue) == 0x000030, "Member 'WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000034, "Member 'WBP_ItemTooltip_C_ExecuteUbergraph_WBP_ItemTooltip::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.FindConfig
// 0x0090 (0x0090 - 0x0000)
struct WBP_ItemTooltip_C_FindConfig final
{
public:
	struct FValeriaItem                           Valeria_Item;                                      // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UVAL_ItemTypeDefinitionAsset*           Loaded_Item_Type;                                  // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504A[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           ItemType;                                          // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_FindConfig) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_FindConfig");
static_assert(sizeof(WBP_ItemTooltip_C_FindConfig) == 0x000090, "Wrong size on WBP_ItemTooltip_C_FindConfig");
static_assert(offsetof(WBP_ItemTooltip_C_FindConfig, Valeria_Item) == 0x000000, "Member 'WBP_ItemTooltip_C_FindConfig::Valeria_Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_FindConfig, Loaded_Item_Type) == 0x000060, "Member 'WBP_ItemTooltip_C_FindConfig::Loaded_Item_Type' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_FindConfig, Success) == 0x000068, "Member 'WBP_ItemTooltip_C_FindConfig::Success' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_FindConfig, ItemType) == 0x000070, "Member 'WBP_ItemTooltip_C_FindConfig::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_FindConfig, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000078, "Member 'WBP_ItemTooltip_C_FindConfig::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_FindConfig, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000080, "Member 'WBP_ItemTooltip_C_FindConfig::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_FindConfig, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WBP_ItemTooltip_C_FindConfig::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_FindConfig, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'WBP_ItemTooltip_C_FindConfig::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetBodyColor
// 0x0098 (0x0098 - 0x0000)
struct WBP_ItemTooltip_C_GetBodyColor final
{
public:
	EItemRarity                                   ItemRarity;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemRarity                                   Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504C[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_GetBodyColor) == 0x000004, "Wrong alignment on WBP_ItemTooltip_C_GetBodyColor");
static_assert(sizeof(WBP_ItemTooltip_C_GetBodyColor) == 0x000098, "Wrong size on WBP_ItemTooltip_C_GetBodyColor");
static_assert(offsetof(WBP_ItemTooltip_C_GetBodyColor, ItemRarity) == 0x000000, "Member 'WBP_ItemTooltip_C_GetBodyColor::ItemRarity' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBodyColor, Color) == 0x000004, "Member 'WBP_ItemTooltip_C_GetBodyColor::Color' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBodyColor, Temp_byte_Variable) == 0x000014, "Member 'WBP_ItemTooltip_C_GetBodyColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBodyColor, Temp_struct_Variable) == 0x000018, "Member 'WBP_ItemTooltip_C_GetBodyColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBodyColor, Temp_struct_Variable_1) == 0x000028, "Member 'WBP_ItemTooltip_C_GetBodyColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBodyColor, Temp_struct_Variable_2) == 0x000038, "Member 'WBP_ItemTooltip_C_GetBodyColor::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBodyColor, Temp_struct_Variable_3) == 0x000048, "Member 'WBP_ItemTooltip_C_GetBodyColor::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBodyColor, Temp_struct_Variable_4) == 0x000058, "Member 'WBP_ItemTooltip_C_GetBodyColor::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBodyColor, Temp_struct_Variable_5) == 0x000068, "Member 'WBP_ItemTooltip_C_GetBodyColor::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBodyColor, Temp_struct_Variable_6) == 0x000078, "Member 'WBP_ItemTooltip_C_GetBodyColor::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBodyColor, K2Node_Select_Default) == 0x000088, "Member 'WBP_ItemTooltip_C_GetBodyColor::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetBuffIcon
// 0x0038 (0x0038 - 0x0000)
struct WBP_ItemTooltip_C_GetBuffIcon final
{
public:
	bool                                          IsStarQuality;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           ItemType;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BuffIcon;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504E[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetQualityBuffIcon_BuffIcon;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetNormalBuffIcon_BuffIcon;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_GetBuffIcon) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_GetBuffIcon");
static_assert(sizeof(WBP_ItemTooltip_C_GetBuffIcon) == 0x000038, "Wrong size on WBP_ItemTooltip_C_GetBuffIcon");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffIcon, IsStarQuality) == 0x000000, "Member 'WBP_ItemTooltip_C_GetBuffIcon::IsStarQuality' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffIcon, ItemType) == 0x000008, "Member 'WBP_ItemTooltip_C_GetBuffIcon::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffIcon, BuffIcon) == 0x000010, "Member 'WBP_ItemTooltip_C_GetBuffIcon::BuffIcon' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffIcon, Temp_bool_Variable) == 0x000018, "Member 'WBP_ItemTooltip_C_GetBuffIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffIcon, CallFunc_GetQualityBuffIcon_BuffIcon) == 0x000020, "Member 'WBP_ItemTooltip_C_GetBuffIcon::CallFunc_GetQualityBuffIcon_BuffIcon' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffIcon, CallFunc_GetNormalBuffIcon_BuffIcon) == 0x000028, "Member 'WBP_ItemTooltip_C_GetBuffIcon::CallFunc_GetNormalBuffIcon_BuffIcon' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffIcon, K2Node_Select_Default) == 0x000030, "Member 'WBP_ItemTooltip_C_GetBuffIcon::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetBuffText
// 0x0078 (0x0078 - 0x0000)
struct WBP_ItemTooltip_C_GetBuffText final
{
public:
	bool                                          StarQuality;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           Type;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   BuffText;                                          // 0x0010(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5050[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetNormalBuffText_BuffText;               // 0x0030(0x0018)()
	class FText                                   CallFunc_GetQualityBuffText_BuffText;              // 0x0048(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
};
static_assert(alignof(WBP_ItemTooltip_C_GetBuffText) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_GetBuffText");
static_assert(sizeof(WBP_ItemTooltip_C_GetBuffText) == 0x000078, "Wrong size on WBP_ItemTooltip_C_GetBuffText");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffText, StarQuality) == 0x000000, "Member 'WBP_ItemTooltip_C_GetBuffText::StarQuality' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffText, Type) == 0x000008, "Member 'WBP_ItemTooltip_C_GetBuffText::Type' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffText, BuffText) == 0x000010, "Member 'WBP_ItemTooltip_C_GetBuffText::BuffText' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffText, Temp_bool_Variable) == 0x000028, "Member 'WBP_ItemTooltip_C_GetBuffText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffText, CallFunc_GetNormalBuffText_BuffText) == 0x000030, "Member 'WBP_ItemTooltip_C_GetBuffText::CallFunc_GetNormalBuffText_BuffText' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffText, CallFunc_GetQualityBuffText_BuffText) == 0x000048, "Member 'WBP_ItemTooltip_C_GetBuffText::CallFunc_GetQualityBuffText_BuffText' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetBuffText, K2Node_Select_Default) == 0x000060, "Member 'WBP_ItemTooltip_C_GetBuffText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetHeaderColor
// 0x0098 (0x0098 - 0x0000)
struct WBP_ItemTooltip_C_GetHeaderColor final
{
public:
	EItemRarity                                   ItemRarity;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5051[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemRarity                                   Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5052[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_GetHeaderColor) == 0x000004, "Wrong alignment on WBP_ItemTooltip_C_GetHeaderColor");
static_assert(sizeof(WBP_ItemTooltip_C_GetHeaderColor) == 0x000098, "Wrong size on WBP_ItemTooltip_C_GetHeaderColor");
static_assert(offsetof(WBP_ItemTooltip_C_GetHeaderColor, ItemRarity) == 0x000000, "Member 'WBP_ItemTooltip_C_GetHeaderColor::ItemRarity' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetHeaderColor, Color) == 0x000004, "Member 'WBP_ItemTooltip_C_GetHeaderColor::Color' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetHeaderColor, Temp_byte_Variable) == 0x000014, "Member 'WBP_ItemTooltip_C_GetHeaderColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetHeaderColor, Temp_struct_Variable) == 0x000018, "Member 'WBP_ItemTooltip_C_GetHeaderColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetHeaderColor, Temp_struct_Variable_1) == 0x000028, "Member 'WBP_ItemTooltip_C_GetHeaderColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetHeaderColor, Temp_struct_Variable_2) == 0x000038, "Member 'WBP_ItemTooltip_C_GetHeaderColor::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetHeaderColor, Temp_struct_Variable_3) == 0x000048, "Member 'WBP_ItemTooltip_C_GetHeaderColor::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetHeaderColor, Temp_struct_Variable_4) == 0x000058, "Member 'WBP_ItemTooltip_C_GetHeaderColor::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetHeaderColor, Temp_struct_Variable_5) == 0x000068, "Member 'WBP_ItemTooltip_C_GetHeaderColor::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetHeaderColor, Temp_struct_Variable_6) == 0x000078, "Member 'WBP_ItemTooltip_C_GetHeaderColor::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetHeaderColor, K2Node_Select_Default) == 0x000088, "Member 'WBP_ItemTooltip_C_GetHeaderColor::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetItemName
// 0x0168 (0x0168 - 0x0000)
struct WBP_ItemTooltip_C_GetItemName final
{
public:
	class UVAL_ItemTypeDefinitionAsset*           ItemType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TintPersistID;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5053[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0010(0x0018)(Parm, OutParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5054[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_TintAsset>          CallFunc_GetTintFromPersistID_ReturnValue;         // 0x0030(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_TintAsset>          CallFunc_GetTintFromPersistID_ReturnValue_1;       // 0x0058(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5055[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TintAsset*                         K2Node_DynamicCast_AsTint_Asset;                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5056[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0018)()
};
static_assert(alignof(WBP_ItemTooltip_C_GetItemName) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_GetItemName");
static_assert(sizeof(WBP_ItemTooltip_C_GetItemName) == 0x000168, "Wrong size on WBP_ItemTooltip_C_GetItemName");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, ItemType) == 0x000000, "Member 'WBP_ItemTooltip_C_GetItemName::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, TintPersistID) == 0x000008, "Member 'WBP_ItemTooltip_C_GetItemName::TintPersistID' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, Text) == 0x000010, "Member 'WBP_ItemTooltip_C_GetItemName::Text' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_ItemTooltip_C_GetItemName::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, CallFunc_GetTintFromPersistID_ReturnValue) == 0x000030, "Member 'WBP_ItemTooltip_C_GetItemName::CallFunc_GetTintFromPersistID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, CallFunc_GetTintFromPersistID_ReturnValue_1) == 0x000058, "Member 'WBP_ItemTooltip_C_GetItemName::CallFunc_GetTintFromPersistID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000080, "Member 'WBP_ItemTooltip_C_GetItemName::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000088, "Member 'WBP_ItemTooltip_C_GetItemName::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, K2Node_DynamicCast_AsTint_Asset) == 0x000090, "Member 'WBP_ItemTooltip_C_GetItemName::K2Node_DynamicCast_AsTint_Asset' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WBP_ItemTooltip_C_GetItemName::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, CallFunc_BooleanAND_ReturnValue) == 0x000099, "Member 'WBP_ItemTooltip_C_GetItemName::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'WBP_ItemTooltip_C_GetItemName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F0, "Member 'WBP_ItemTooltip_C_GetItemName::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, K2Node_MakeArray_Array) == 0x000140, "Member 'WBP_ItemTooltip_C_GetItemName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetItemName, CallFunc_Format_ReturnValue) == 0x000150, "Member 'WBP_ItemTooltip_C_GetItemName::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetNormalBuffIcon
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_ItemTooltip_C_GetNormalBuffIcon final
{
public:
	class UVAL_ItemTypeDefinitionAsset*           ItemType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BuffIcon;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetBuffDataTableRow_OutResult;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5057[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBuffConfig                            CallFunc_GetBuffDataTableRow_ReturnValue;          // 0x0018(0x0098)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_GetNormalBuffIcon) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_GetNormalBuffIcon");
static_assert(sizeof(WBP_ItemTooltip_C_GetNormalBuffIcon) == 0x0000B8, "Wrong size on WBP_ItemTooltip_C_GetNormalBuffIcon");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffIcon, ItemType) == 0x000000, "Member 'WBP_ItemTooltip_C_GetNormalBuffIcon::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffIcon, BuffIcon) == 0x000008, "Member 'WBP_ItemTooltip_C_GetNormalBuffIcon::BuffIcon' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffIcon, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_ItemTooltip_C_GetNormalBuffIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffIcon, CallFunc_GetBuffDataTableRow_OutResult) == 0x000011, "Member 'WBP_ItemTooltip_C_GetNormalBuffIcon::CallFunc_GetBuffDataTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffIcon, CallFunc_GetBuffDataTableRow_ReturnValue) == 0x000018, "Member 'WBP_ItemTooltip_C_GetNormalBuffIcon::CallFunc_GetBuffDataTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffIcon, K2Node_SwitchEnum_CmpSuccess) == 0x0000B0, "Member 'WBP_ItemTooltip_C_GetNormalBuffIcon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetNormalBuffText
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_ItemTooltip_C_GetNormalBuffText final
{
public:
	class UVAL_ItemTypeDefinitionAsset*           ItemType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   BuffText;                                          // 0x0008(0x0018)(Parm, OutParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetBuffDataTableRow_OutResult;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5058[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBuffConfig                            CallFunc_GetBuffDataTableRow_ReturnValue;          // 0x0028(0x0098)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_GetNormalBuffText) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_GetNormalBuffText");
static_assert(sizeof(WBP_ItemTooltip_C_GetNormalBuffText) == 0x0000C8, "Wrong size on WBP_ItemTooltip_C_GetNormalBuffText");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffText, ItemType) == 0x000000, "Member 'WBP_ItemTooltip_C_GetNormalBuffText::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffText, BuffText) == 0x000008, "Member 'WBP_ItemTooltip_C_GetNormalBuffText::BuffText' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffText, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_ItemTooltip_C_GetNormalBuffText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffText, CallFunc_GetBuffDataTableRow_OutResult) == 0x000021, "Member 'WBP_ItemTooltip_C_GetNormalBuffText::CallFunc_GetBuffDataTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffText, CallFunc_GetBuffDataTableRow_ReturnValue) == 0x000028, "Member 'WBP_ItemTooltip_C_GetNormalBuffText::CallFunc_GetBuffDataTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetNormalBuffText, K2Node_SwitchEnum_CmpSuccess) == 0x0000C0, "Member 'WBP_ItemTooltip_C_GetNormalBuffText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetQualityBuffIcon
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_ItemTooltip_C_GetQualityBuffIcon final
{
public:
	class UVAL_ItemTypeDefinitionAsset*           ItemType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BuffIcon;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetBuffDataTableRow_OutResult;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5059[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBuffConfig                            CallFunc_GetBuffDataTableRow_ReturnValue;          // 0x0018(0x0098)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_GetQualityBuffIcon) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_GetQualityBuffIcon");
static_assert(sizeof(WBP_ItemTooltip_C_GetQualityBuffIcon) == 0x0000B8, "Wrong size on WBP_ItemTooltip_C_GetQualityBuffIcon");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffIcon, ItemType) == 0x000000, "Member 'WBP_ItemTooltip_C_GetQualityBuffIcon::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffIcon, BuffIcon) == 0x000008, "Member 'WBP_ItemTooltip_C_GetQualityBuffIcon::BuffIcon' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffIcon, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_ItemTooltip_C_GetQualityBuffIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffIcon, CallFunc_GetBuffDataTableRow_OutResult) == 0x000011, "Member 'WBP_ItemTooltip_C_GetQualityBuffIcon::CallFunc_GetBuffDataTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffIcon, CallFunc_GetBuffDataTableRow_ReturnValue) == 0x000018, "Member 'WBP_ItemTooltip_C_GetQualityBuffIcon::CallFunc_GetBuffDataTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffIcon, K2Node_SwitchEnum_CmpSuccess) == 0x0000B0, "Member 'WBP_ItemTooltip_C_GetQualityBuffIcon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetQualityBuffText
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_ItemTooltip_C_GetQualityBuffText final
{
public:
	class UVAL_ItemTypeDefinitionAsset*           ItemType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   BuffText;                                          // 0x0008(0x0018)(Parm, OutParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetBuffDataTableRow_OutResult;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505A[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBuffConfig                            CallFunc_GetBuffDataTableRow_ReturnValue;          // 0x0028(0x0098)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_GetQualityBuffText) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_GetQualityBuffText");
static_assert(sizeof(WBP_ItemTooltip_C_GetQualityBuffText) == 0x0000C8, "Wrong size on WBP_ItemTooltip_C_GetQualityBuffText");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffText, ItemType) == 0x000000, "Member 'WBP_ItemTooltip_C_GetQualityBuffText::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffText, BuffText) == 0x000008, "Member 'WBP_ItemTooltip_C_GetQualityBuffText::BuffText' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffText, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_ItemTooltip_C_GetQualityBuffText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffText, CallFunc_GetBuffDataTableRow_OutResult) == 0x000021, "Member 'WBP_ItemTooltip_C_GetQualityBuffText::CallFunc_GetBuffDataTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffText, CallFunc_GetBuffDataTableRow_ReturnValue) == 0x000028, "Member 'WBP_ItemTooltip_C_GetQualityBuffText::CallFunc_GetBuffDataTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetQualityBuffText, K2Node_SwitchEnum_CmpSuccess) == 0x0000C0, "Member 'WBP_ItemTooltip_C_GetQualityBuffText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetSellValuePerItem
// 0x0070 (0x0070 - 0x0000)
struct WBP_ItemTooltip_C_GetSellValuePerItem final
{
public:
	struct FValeriaItem                           Param_Item;                                        // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Amount;                                            // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ComputeSaleValuePerItem_vitalAmountPerItem; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVitalType                                    CallFunc_ComputeSaleValuePerItem_vitalType;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemIsEmpty_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_GetSellValuePerItem) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_GetSellValuePerItem");
static_assert(sizeof(WBP_ItemTooltip_C_GetSellValuePerItem) == 0x000070, "Wrong size on WBP_ItemTooltip_C_GetSellValuePerItem");
static_assert(offsetof(WBP_ItemTooltip_C_GetSellValuePerItem, Param_Item) == 0x000000, "Member 'WBP_ItemTooltip_C_GetSellValuePerItem::Param_Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetSellValuePerItem, Amount) == 0x000060, "Member 'WBP_ItemTooltip_C_GetSellValuePerItem::Amount' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetSellValuePerItem, CallFunc_ComputeSaleValuePerItem_vitalAmountPerItem) == 0x000064, "Member 'WBP_ItemTooltip_C_GetSellValuePerItem::CallFunc_ComputeSaleValuePerItem_vitalAmountPerItem' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetSellValuePerItem, CallFunc_ComputeSaleValuePerItem_vitalType) == 0x000068, "Member 'WBP_ItemTooltip_C_GetSellValuePerItem::CallFunc_ComputeSaleValuePerItem_vitalType' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetSellValuePerItem, CallFunc_ItemIsEmpty_ReturnValue) == 0x000069, "Member 'WBP_ItemTooltip_C_GetSellValuePerItem::CallFunc_ItemIsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetSellValueText
// 0x0098 (0x0098 - 0x0000)
struct WBP_ItemTooltip_C_GetSellValueText final
{
public:
	struct FValeriaItem                           Param_Item;                                        // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Text;                                              // 0x0060(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetSellTextForItem_OutSellText;           // 0x0078(0x0018)()
	bool                                          CallFunc_ItemIsEmpty_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_GetSellValueText) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_GetSellValueText");
static_assert(sizeof(WBP_ItemTooltip_C_GetSellValueText) == 0x000098, "Wrong size on WBP_ItemTooltip_C_GetSellValueText");
static_assert(offsetof(WBP_ItemTooltip_C_GetSellValueText, Param_Item) == 0x000000, "Member 'WBP_ItemTooltip_C_GetSellValueText::Param_Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetSellValueText, Text) == 0x000060, "Member 'WBP_ItemTooltip_C_GetSellValueText::Text' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetSellValueText, CallFunc_GetSellTextForItem_OutSellText) == 0x000078, "Member 'WBP_ItemTooltip_C_GetSellValueText::CallFunc_GetSellTextForItem_OutSellText' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetSellValueText, CallFunc_ItemIsEmpty_ReturnValue) == 0x000090, "Member 'WBP_ItemTooltip_C_GetSellValueText::CallFunc_ItemIsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetStarQualityFocusReward
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_ItemTooltip_C_GetStarQualityFocusReward final
{
public:
	struct FQuestRewardConfig                     QuestRewardConfig;                                 // 0x0000(0x0178)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         FocusAmount;                                       // 0x0178(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505B[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UQualityGlobalConfig*             CallFunc_GetQualityGlobalConfig_ReturnValue;       // 0x0180(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505C[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_B_ImplicitCast;         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_GetStarQualityFocusReward) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_GetStarQualityFocusReward");
static_assert(sizeof(WBP_ItemTooltip_C_GetStarQualityFocusReward) == 0x0001A0, "Wrong size on WBP_ItemTooltip_C_GetStarQualityFocusReward");
static_assert(offsetof(WBP_ItemTooltip_C_GetStarQualityFocusReward, QuestRewardConfig) == 0x000000, "Member 'WBP_ItemTooltip_C_GetStarQualityFocusReward::QuestRewardConfig' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetStarQualityFocusReward, FocusAmount) == 0x000178, "Member 'WBP_ItemTooltip_C_GetStarQualityFocusReward::FocusAmount' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetStarQualityFocusReward, CallFunc_GetQualityGlobalConfig_ReturnValue) == 0x000180, "Member 'WBP_ItemTooltip_C_GetStarQualityFocusReward::CallFunc_GetQualityGlobalConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetStarQualityFocusReward, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000188, "Member 'WBP_ItemTooltip_C_GetStarQualityFocusReward::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetStarQualityFocusReward, CallFunc_FTrunc_ReturnValue) == 0x000190, "Member 'WBP_ItemTooltip_C_GetStarQualityFocusReward::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetStarQualityFocusReward, CallFunc_Multiply_IntFloat_B_ImplicitCast) == 0x000198, "Member 'WBP_ItemTooltip_C_GetStarQualityFocusReward::CallFunc_Multiply_IntFloat_B_ImplicitCast' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetTotalSellValue
// 0x0078 (0x0078 - 0x0000)
struct WBP_ItemTooltip_C_GetTotalSellValue final
{
public:
	struct FValeriaItem                           Param_Item;                                        // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Amount;                                            // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemIsEmpty_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505D[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ComputeSaleValuePerItem_vitalAmountPerItem; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVitalType                                    CallFunc_ComputeSaleValuePerItem_vitalType;        // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505E[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_GetTotalSellValue) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_GetTotalSellValue");
static_assert(sizeof(WBP_ItemTooltip_C_GetTotalSellValue) == 0x000078, "Wrong size on WBP_ItemTooltip_C_GetTotalSellValue");
static_assert(offsetof(WBP_ItemTooltip_C_GetTotalSellValue, Param_Item) == 0x000000, "Member 'WBP_ItemTooltip_C_GetTotalSellValue::Param_Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetTotalSellValue, Amount) == 0x000060, "Member 'WBP_ItemTooltip_C_GetTotalSellValue::Amount' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetTotalSellValue, CallFunc_ItemIsEmpty_ReturnValue) == 0x000064, "Member 'WBP_ItemTooltip_C_GetTotalSellValue::CallFunc_ItemIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetTotalSellValue, CallFunc_ComputeSaleValuePerItem_vitalAmountPerItem) == 0x000068, "Member 'WBP_ItemTooltip_C_GetTotalSellValue::CallFunc_ComputeSaleValuePerItem_vitalAmountPerItem' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetTotalSellValue, CallFunc_ComputeSaleValuePerItem_vitalType) == 0x00006C, "Member 'WBP_ItemTooltip_C_GetTotalSellValue::CallFunc_ComputeSaleValuePerItem_vitalType' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_GetTotalSellValue, CallFunc_Multiply_IntInt_ReturnValue) == 0x000070, "Member 'WBP_ItemTooltip_C_GetTotalSellValue::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.IsRecipe
// 0x0002 (0x0002 - 0x0000)
struct WBP_ItemTooltip_C_IsRecipe final
{
public:
	bool                                          Param_IsRecipe;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_IsRecipe) == 0x000001, "Wrong alignment on WBP_ItemTooltip_C_IsRecipe");
static_assert(sizeof(WBP_ItemTooltip_C_IsRecipe) == 0x000002, "Wrong size on WBP_ItemTooltip_C_IsRecipe");
static_assert(offsetof(WBP_ItemTooltip_C_IsRecipe, Param_IsRecipe) == 0x000000, "Member 'WBP_ItemTooltip_C_IsRecipe::Param_IsRecipe' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_IsRecipe, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000001, "Member 'WBP_ItemTooltip_C_IsRecipe::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.IsStarQuality
// 0x0068 (0x0068 - 0x0000)
struct WBP_ItemTooltip_C_IsStarQuality final
{
public:
	struct FValeriaItem                           Param_Item;                                        // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Param_IsStarQuality;                               // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_IsStarQuality) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_IsStarQuality");
static_assert(sizeof(WBP_ItemTooltip_C_IsStarQuality) == 0x000068, "Wrong size on WBP_ItemTooltip_C_IsStarQuality");
static_assert(offsetof(WBP_ItemTooltip_C_IsStarQuality, Param_Item) == 0x000000, "Member 'WBP_ItemTooltip_C_IsStarQuality::Param_Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_IsStarQuality, Param_IsStarQuality) == 0x000060, "Member 'WBP_ItemTooltip_C_IsStarQuality::Param_IsStarQuality' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_IsStarQuality, CallFunc_Greater_ByteByte_ReturnValue) == 0x000061, "Member 'WBP_ItemTooltip_C_IsStarQuality::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.Set Item for Tooltip
// 0x0090 (0x0090 - 0x0000)
struct WBP_ItemTooltip_C_Set_Item_for_Tooltip final
{
public:
	struct FValeriaItem                           NewItem;                                           // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             BuffIcon;                                          // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   BuffText;                                          // 0x0068(0x0018)(Edit, BlueprintVisible)
	class UVAL_ItemTypeDefinitionAsset*           ItemType;                                          // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasAlert;                                         // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltip_C_Set_Item_for_Tooltip) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_Set_Item_for_Tooltip");
static_assert(sizeof(WBP_ItemTooltip_C_Set_Item_for_Tooltip) == 0x000090, "Wrong size on WBP_ItemTooltip_C_Set_Item_for_Tooltip");
static_assert(offsetof(WBP_ItemTooltip_C_Set_Item_for_Tooltip, NewItem) == 0x000000, "Member 'WBP_ItemTooltip_C_Set_Item_for_Tooltip::NewItem' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_Set_Item_for_Tooltip, BuffIcon) == 0x000060, "Member 'WBP_ItemTooltip_C_Set_Item_for_Tooltip::BuffIcon' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_Set_Item_for_Tooltip, BuffText) == 0x000068, "Member 'WBP_ItemTooltip_C_Set_Item_for_Tooltip::BuffText' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_Set_Item_for_Tooltip, ItemType) == 0x000080, "Member 'WBP_ItemTooltip_C_Set_Item_for_Tooltip::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_Set_Item_for_Tooltip, bHasAlert) == 0x000088, "Member 'WBP_ItemTooltip_C_Set_Item_for_Tooltip::bHasAlert' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.SetCategory
// 0x0060 (0x0060 - 0x0000)
struct WBP_ItemTooltip_C_SetCategory final
{
public:
	class UVAL_ItemTypeDefinitionAsset*           ItemType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5060[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemCategoryName_Name;                 // 0x0030(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)()
};
static_assert(alignof(WBP_ItemTooltip_C_SetCategory) == 0x000008, "Wrong alignment on WBP_ItemTooltip_C_SetCategory");
static_assert(sizeof(WBP_ItemTooltip_C_SetCategory) == 0x000060, "Wrong size on WBP_ItemTooltip_C_SetCategory");
static_assert(offsetof(WBP_ItemTooltip_C_SetCategory, ItemType) == 0x000000, "Member 'WBP_ItemTooltip_C_SetCategory::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_SetCategory, Temp_bool_Variable) == 0x000008, "Member 'WBP_ItemTooltip_C_SetCategory::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_SetCategory, Temp_text_Variable) == 0x000010, "Member 'WBP_ItemTooltip_C_SetCategory::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_SetCategory, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000028, "Member 'WBP_ItemTooltip_C_SetCategory::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_SetCategory, CallFunc_GetItemCategoryName_Name) == 0x000030, "Member 'WBP_ItemTooltip_C_SetCategory::CallFunc_GetItemCategoryName_Name' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltip_C_SetCategory, K2Node_Select_Default) == 0x000048, "Member 'WBP_ItemTooltip_C_SetCategory::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ItemTooltip.WBP_ItemTooltip_C.SetCost
// 0x0160 (0x0160 - 0x0000)
struct WBP_ItemTooltip_C_SetCost final
{
public:
	struct FStoreItem                             StoreItemToDisplay;                                // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
