#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ComboBox_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_Button_Expand_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.BndEvt__WBP_ComboBox_CM_WBP_Template_ContextMenuAnchor_K2Node_ComponentBoundEvent_3_OnMenuContentCreated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_WBP_Template_ContextMenuAnchor_K2Node_ComponentBoundEvent_3_OnMenuContentCreated__DelegateSignature final
{
public:
	class UUserWidget*                            MenuContent;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_WBP_Template_ContextMenuAnchor_K2Node_ComponentBoundEvent_3_OnMenuContentCreated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_WBP_Template_ContextMenuAnchor_K2Node_ComponentBoundEvent_3_OnMenuContentCreated__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_WBP_Template_ContextMenuAnchor_K2Node_ComponentBoundEvent_3_OnMenuContentCreated__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_WBP_Template_ContextMenuAnchor_K2Node_ComponentBoundEvent_3_OnMenuContentCreated__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_WBP_Template_ContextMenuAnchor_K2Node_ComponentBoundEvent_3_OnMenuContentCreated__DelegateSignature, MenuContent) == 0x000000, "Member 'WBP_ComboBox_CM_C_BndEvt__WBP_ComboBox_CM_WBP_Template_ContextMenuAnchor_K2Node_ComponentBoundEvent_3_OnMenuContentCreated__DelegateSignature::MenuContent' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.ExecuteUbergraph_WBP_ComboBox_CM
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0008(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_120E[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bClosedByLostFocus)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_120F[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index, class FText Text)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1210[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0058(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0070(0x0018)()
	TDelegate<void(bool bIsOpen)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsOpen;                        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1211[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_MenuContent;            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ComboBox_Menu_CM_C*                K2Node_DynamicCast_AsWBP_Combo_Box_Menu_CM;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsShow;                              // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1212[0x1];                                     // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00C4(0x0008)(NoDestructor)
	bool                                          K2Node_CustomEvent_bClosedByLostFocus;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM");
static_assert(sizeof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM) == 0x0000D0, "Wrong size on WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, EntryPoint) == 0x000000, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_CustomEvent_Index) == 0x000004, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_CustomEvent_Text) == 0x000008, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_Event_IsDesignTime) == 0x000021, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000024, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000038, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x00003C, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, CallFunc_IsOpen_ReturnValue) == 0x000040, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, CallFunc_GetText_ReturnValue) == 0x000058, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, CallFunc_GetText_ReturnValue_1) == 0x000070, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_CustomEvent_bIsOpen) == 0x000098, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_CustomEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_ComponentBoundEvent_Button_1) == 0x0000A0, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_ComponentBoundEvent_Button) == 0x0000A8, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_ComponentBoundEvent_MenuContent) == 0x0000B0, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_ComponentBoundEvent_MenuContent' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_DynamicCast_AsWBP_Combo_Box_Menu_CM) == 0x0000B8, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_DynamicCast_AsWBP_Combo_Box_Menu_CM' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_Event_bIsShow) == 0x0000C2, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_Event_bIsShow' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_Event_InFocusEvent) == 0x0000C4, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM, K2Node_CustomEvent_bClosedByLostFocus) == 0x0000CC, "Member 'WBP_ComboBox_CM_C_ExecuteUbergraph_WBP_ComboBox_CM::K2Node_CustomEvent_bClosedByLostFocus' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.Get Menu Anchor Is Open
// 0x0002 (0x0002 - 0x0000)
struct WBP_ComboBox_CM_C_Get_Menu_Anchor_Is_Open final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_Get_Menu_Anchor_Is_Open) == 0x000001, "Wrong alignment on WBP_ComboBox_CM_C_Get_Menu_Anchor_Is_Open");
static_assert(sizeof(WBP_ComboBox_CM_C_Get_Menu_Anchor_Is_Open) == 0x000002, "Wrong size on WBP_ComboBox_CM_C_Get_Menu_Anchor_Is_Open");
static_assert(offsetof(WBP_ComboBox_CM_C_Get_Menu_Anchor_Is_Open, ReturnValue) == 0x000000, "Member 'WBP_ComboBox_CM_C_Get_Menu_Anchor_Is_Open::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_Get_Menu_Anchor_Is_Open, CallFunc_IsOpen_ReturnValue) == 0x000001, "Member 'WBP_ComboBox_CM_C_Get_Menu_Anchor_Is_Open::CallFunc_IsOpen_ReturnValue' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.GetCurrentSelectedItem
// 0x0020 (0x0020 - 0x0000)
struct WBP_ComboBox_CM_C_GetCurrentSelectedItem final
{
public:
	class FText                                   Selected_Text;                                     // 0x0000(0x0018)(Parm, OutParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_GetCurrentSelectedItem) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_GetCurrentSelectedItem");
static_assert(sizeof(WBP_ComboBox_CM_C_GetCurrentSelectedItem) == 0x000020, "Wrong size on WBP_ComboBox_CM_C_GetCurrentSelectedItem");
static_assert(offsetof(WBP_ComboBox_CM_C_GetCurrentSelectedItem, Selected_Text) == 0x000000, "Member 'WBP_ComboBox_CM_C_GetCurrentSelectedItem::Selected_Text' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_GetCurrentSelectedItem, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'WBP_ComboBox_CM_C_GetCurrentSelectedItem::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.GetDesiredFocusTarget
// 0x0018 (0x0018 - 0x0000)
struct WBP_ComboBox_CM_C_GetDesiredFocusTarget final
{
public:
	class UWidget*                                Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Menu_Anchor_Is_Open_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1213[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_Output;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_GetDesiredFocusTarget");
static_assert(sizeof(WBP_ComboBox_CM_C_GetDesiredFocusTarget) == 0x000018, "Wrong size on WBP_ComboBox_CM_C_GetDesiredFocusTarget");
static_assert(offsetof(WBP_ComboBox_CM_C_GetDesiredFocusTarget, Output) == 0x000000, "Member 'WBP_ComboBox_CM_C_GetDesiredFocusTarget::Output' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_GetDesiredFocusTarget, CallFunc_Get_Menu_Anchor_Is_Open_ReturnValue) == 0x000008, "Member 'WBP_ComboBox_CM_C_GetDesiredFocusTarget::CallFunc_Get_Menu_Anchor_Is_Open_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_ComboBox_CM_C_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_Output) == 0x000010, "Member 'WBP_ComboBox_CM_C_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_Output' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.HandleOnOptionSelected
// 0x0020 (0x0020 - 0x0000)
struct WBP_ComboBox_CM_C_HandleOnOptionSelected final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1214[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ComboBox_CM_C_HandleOnOptionSelected) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_HandleOnOptionSelected");
static_assert(sizeof(WBP_ComboBox_CM_C_HandleOnOptionSelected) == 0x000020, "Wrong size on WBP_ComboBox_CM_C_HandleOnOptionSelected");
static_assert(offsetof(WBP_ComboBox_CM_C_HandleOnOptionSelected, Param_Index) == 0x000000, "Member 'WBP_ComboBox_CM_C_HandleOnOptionSelected::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_HandleOnOptionSelected, Text) == 0x000008, "Member 'WBP_ComboBox_CM_C_HandleOnOptionSelected::Text' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.OnFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_CM_C_OnFocused__DelegateSignature final
{
public:
	class UWidget*                                FocusWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_OnFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_OnFocused__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_CM_C_OnFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_CM_C_OnFocused__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_CM_C_OnFocused__DelegateSignature, FocusWidget) == 0x000000, "Member 'WBP_ComboBox_CM_C_OnFocused__DelegateSignature::FocusWidget' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ComboBox_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_ComboBox_CM_C_OnFocusLost");
static_assert(sizeof(WBP_ComboBox_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_ComboBox_CM_C_OnFocusLost");
static_assert(offsetof(WBP_ComboBox_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_ComboBox_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_ComboBox_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_ComboBox_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_ComboBox_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_ComboBox_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_ComboBox_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_ComboBox_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_ComboBox_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_ComboBox_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_ComboBox_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.OnMenuClose_Event
// 0x0001 (0x0001 - 0x0000)
struct WBP_ComboBox_CM_C_OnMenuClose_Event final
{
public:
	bool                                          bClosedByLostFocus;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_OnMenuClose_Event) == 0x000001, "Wrong alignment on WBP_ComboBox_CM_C_OnMenuClose_Event");
static_assert(sizeof(WBP_ComboBox_CM_C_OnMenuClose_Event) == 0x000001, "Wrong size on WBP_ComboBox_CM_C_OnMenuClose_Event");
static_assert(offsetof(WBP_ComboBox_CM_C_OnMenuClose_Event, bClosedByLostFocus) == 0x000000, "Member 'WBP_ComboBox_CM_C_OnMenuClose_Event::bClosedByLostFocus' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.OnMenuClosed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_CM_C_OnMenuClosed__DelegateSignature final
{
public:
	class UWBP_ComboBox_CM_C*                     ComboBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_OnMenuClosed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_OnMenuClosed__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_CM_C_OnMenuClosed__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_CM_C_OnMenuClosed__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_CM_C_OnMenuClosed__DelegateSignature, ComboBox) == 0x000000, "Member 'WBP_ComboBox_CM_C_OnMenuClosed__DelegateSignature::ComboBox' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.OnMenuCreated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_CM_C_OnMenuCreated__DelegateSignature final
{
public:
	class UWBP_ComboBox_Menu_CM_C*                MenuWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_OnMenuCreated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_OnMenuCreated__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_CM_C_OnMenuCreated__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_CM_C_OnMenuCreated__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_CM_C_OnMenuCreated__DelegateSignature, MenuWidget) == 0x000000, "Member 'WBP_ComboBox_CM_C_OnMenuCreated__DelegateSignature::MenuWidget' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.OnMenuOpenChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ComboBox_CM_C_OnMenuOpenChanged final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_OnMenuOpenChanged) == 0x000001, "Wrong alignment on WBP_ComboBox_CM_C_OnMenuOpenChanged");
static_assert(sizeof(WBP_ComboBox_CM_C_OnMenuOpenChanged) == 0x000001, "Wrong size on WBP_ComboBox_CM_C_OnMenuOpenChanged");
static_assert(offsetof(WBP_ComboBox_CM_C_OnMenuOpenChanged, bIsOpen) == 0x000000, "Member 'WBP_ComboBox_CM_C_OnMenuOpenChanged::bIsOpen' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.OnMenuOpened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_CM_C_OnMenuOpened__DelegateSignature final
{
public:
	class UWBP_ComboBox_CM_C*                     ComboBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_OnMenuOpened__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_CM_C_OnMenuOpened__DelegateSignature) == 0x000008, "Wrong size on WBP_ComboBox_CM_C_OnMenuOpened__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_CM_C_OnMenuOpened__DelegateSignature, ComboBox) == 0x000000, "Member 'WBP_ComboBox_CM_C_OnMenuOpened__DelegateSignature::ComboBox' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.OnOptionChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_ComboBox_CM_C_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1215[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ComboBox_CM_C_OnOptionChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_OnOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_CM_C_OnOptionChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_ComboBox_CM_C_OnOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_CM_C_OnOptionChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_ComboBox_CM_C_OnOptionChanged__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_OnOptionChanged__DelegateSignature, Text) == 0x000008, "Member 'WBP_ComboBox_CM_C_OnOptionChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ComboBox_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ComboBox_CM_C_PreConstruct");
static_assert(sizeof(WBP_ComboBox_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_ComboBox_CM_C_PreConstruct");
static_assert(offsetof(WBP_ComboBox_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ComboBox_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.SetCurrentOptionToIndex
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_CM_C_SetCurrentOptionToIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_SetCurrentOptionToIndex) == 0x000004, "Wrong alignment on WBP_ComboBox_CM_C_SetCurrentOptionToIndex");
static_assert(sizeof(WBP_ComboBox_CM_C_SetCurrentOptionToIndex) == 0x000008, "Wrong size on WBP_ComboBox_CM_C_SetCurrentOptionToIndex");
static_assert(offsetof(WBP_ComboBox_CM_C_SetCurrentOptionToIndex, Param_Index) == 0x000000, "Member 'WBP_ComboBox_CM_C_SetCurrentOptionToIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetCurrentOptionToIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000004, "Member 'WBP_ComboBox_CM_C_SetCurrentOptionToIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.SetNavigation
// 0x0058 (0x0058 - 0x0000)
struct WBP_ComboBox_CM_C_SetNavigation final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ComboBox_Menu_Option_CM_C*         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1216[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1217[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ComboBox_Menu_Option_CM_C*         CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1218[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ComboBox_Menu_Option_CM_C*         CallFunc_Array_Get_Item_2;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1219[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ComboBox_Menu_Option_CM_C*         CallFunc_Array_Get_Item_3;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_SetNavigation) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_SetNavigation");
static_assert(sizeof(WBP_ComboBox_CM_C_SetNavigation) == 0x000058, "Wrong size on WBP_ComboBox_CM_C_SetNavigation");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_ComboBox_CM_C_SetNavigation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_ComboBox_CM_C_SetNavigation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Array_Get_Item_2) == 0x000038, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Array_Get_Item_3) == 0x000048, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Array_Length_ReturnValue_2) == 0x000050, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetNavigation, CallFunc_Less_IntInt_ReturnValue_1) == 0x000054, "Member 'WBP_ComboBox_CM_C_SetNavigation::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.SetTextOptions
// 0x0018 (0x0018 - 0x0000)
struct WBP_ComboBox_CM_C_SetTextOptions final
{
public:
	TArray<class FText>                           Text_Options;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Selected_Option;                                   // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_SetTextOptions) == 0x000008, "Wrong alignment on WBP_ComboBox_CM_C_SetTextOptions");
static_assert(sizeof(WBP_ComboBox_CM_C_SetTextOptions) == 0x000018, "Wrong size on WBP_ComboBox_CM_C_SetTextOptions");
static_assert(offsetof(WBP_ComboBox_CM_C_SetTextOptions, Text_Options) == 0x000000, "Member 'WBP_ComboBox_CM_C_SetTextOptions::Text_Options' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetTextOptions, Selected_Option) == 0x000010, "Member 'WBP_ComboBox_CM_C_SetTextOptions::Selected_Option' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_CM_C_SetTextOptions, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000014, "Member 'WBP_ComboBox_CM_C_SetTextOptions::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.ShowFocusTip
// 0x0001 (0x0001 - 0x0000)
struct WBP_ComboBox_CM_C_ShowFocusTip final
{
public:
	bool                                          bIsShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_ShowFocusTip) == 0x000001, "Wrong alignment on WBP_ComboBox_CM_C_ShowFocusTip");
static_assert(sizeof(WBP_ComboBox_CM_C_ShowFocusTip) == 0x000001, "Wrong size on WBP_ComboBox_CM_C_ShowFocusTip");
static_assert(offsetof(WBP_ComboBox_CM_C_ShowFocusTip, bIsShow) == 0x000000, "Member 'WBP_ComboBox_CM_C_ShowFocusTip::bIsShow' has a wrong offset!");

// Function WBP_ComboBox_CM.WBP_ComboBox_CM_C.IsEmpty
// 0x0001 (0x0001 - 0x0000)
struct WBP_ComboBox_CM_C_IsEmpty final
{
public:
	bool                                          bIsEmpty;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_CM_C_IsEmpty) == 0x000001, "Wrong alignment on WBP_ComboBox_CM_C_IsEmpty");
static_assert(sizeof(WBP_ComboBox_CM_C_IsEmpty) == 0x000001, "Wrong size on WBP_ComboBox_CM_C_IsEmpty");
static_assert(offsetof(WBP_ComboBox_CM_C_IsEmpty, bIsEmpty) == 0x000000, "Member 'WBP_ComboBox_CM_C_IsEmpty::bIsEmpty' has a wrong offset!");

}

