#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RequestStatusIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_RequestStatusIndicator.WBP_RequestStatusIndicator_C.FormatTimespan
// 0x0138 (0x0138 - 0x0000)
struct WBP_RequestStatusIndicator_C_FormatTimespan final
{
public:
	struct FTimespan                              Timespan;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Result;                                            // 0x0008(0x0018)(Parm, OutParm)
	float                                         CallFunc_GetTotalHours_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinutes_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4259[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0050(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestStatusIndicator_C_FormatTimespan) == 0x000008, "Wrong alignment on WBP_RequestStatusIndicator_C_FormatTimespan");
static_assert(sizeof(WBP_RequestStatusIndicator_C_FormatTimespan) == 0x000138, "Wrong size on WBP_RequestStatusIndicator_C_FormatTimespan");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, Timespan) == 0x000000, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::Timespan' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, Result) == 0x000008, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::Result' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, CallFunc_GetTotalHours_ReturnValue) == 0x000020, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::CallFunc_GetTotalHours_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, CallFunc_GetMinutes_ReturnValue) == 0x000024, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::CallFunc_GetMinutes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, CallFunc_FTrunc_ReturnValue) == 0x000028, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, CallFunc_Max_ReturnValue) == 0x00002C, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, CallFunc_Max_ReturnValue_1) == 0x000030, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000050, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, K2Node_MakeArray_Array) == 0x000108, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_FormatTimespan, CallFunc_FTrunc_A_ImplicitCast) == 0x000130, "Member 'WBP_RequestStatusIndicator_C_FormatTimespan::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_RequestStatusIndicator.WBP_RequestStatusIndicator_C.UpdateRemainingTime
// 0x0008 (0x0008 - 0x0000)
struct WBP_RequestStatusIndicator_C_UpdateRemainingTime final
{
public:
	struct FTimespan                              Param_RemainingTime;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestStatusIndicator_C_UpdateRemainingTime) == 0x000008, "Wrong alignment on WBP_RequestStatusIndicator_C_UpdateRemainingTime");
static_assert(sizeof(WBP_RequestStatusIndicator_C_UpdateRemainingTime) == 0x000008, "Wrong size on WBP_RequestStatusIndicator_C_UpdateRemainingTime");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateRemainingTime, Param_RemainingTime) == 0x000000, "Member 'WBP_RequestStatusIndicator_C_UpdateRemainingTime::Param_RemainingTime' has a wrong offset!");

// Function WBP_RequestStatusIndicator.WBP_RequestStatusIndicator_C.UpdateStatus
// 0x0118 (0x0118 - 0x0000)
struct WBP_RequestStatusIndicator_C_UpdateStatus final
{
public:
	EInventoryRequestStatus                       Param_Status;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              Param_RemainingTime;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_FormatTimespan_Result;                    // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_TimespanTimespan_ReturnValue;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425B[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	class FText                                   CallFunc_FormatTimespan_Result_1;                  // 0x00B0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425C[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_3;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425D[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_4;                           // 0x00F0(0x0018)()
	bool                                          CallFunc_Greater_TimespanTimespan_ReturnValue;     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425E[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  K2Node_Select_Default_5;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RequestStatusIndicator_C_UpdateStatus) == 0x000008, "Wrong alignment on WBP_RequestStatusIndicator_C_UpdateStatus");
static_assert(sizeof(WBP_RequestStatusIndicator_C_UpdateStatus) == 0x000118, "Wrong size on WBP_RequestStatusIndicator_C_UpdateStatus");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Param_Status) == 0x000000, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Param_Status' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Param_RemainingTime) == 0x000008, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Param_RemainingTime' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Temp_byte_Variable) == 0x000010, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Temp_bool_Variable) == 0x000012, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Temp_byte_Variable_2) == 0x000013, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Temp_byte_Variable_3) == 0x000014, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Temp_bool_Variable_1) == 0x000015, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Temp_bool_Variable_2) == 0x000016, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Temp_bool_Variable_3) == 0x000017, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, CallFunc_FormatTimespan_Result) == 0x000018, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::CallFunc_FormatTimespan_Result' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, CallFunc_Less_TimespanTimespan_ReturnValue) == 0x000080, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::CallFunc_Less_TimespanTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, CallFunc_FormatTimespan_Result_1) == 0x0000B0, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::CallFunc_FormatTimespan_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, K2Node_Select_Default_1) == 0x0000C9, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, K2Node_Select_Default_2) == 0x0000D0, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, K2Node_Select_Default_3) == 0x0000D8, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Temp_bool_Variable_4) == 0x0000E0, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, K2Node_SwitchEnum_CmpSuccess) == 0x0000E1, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, CallFunc_MakeTimespan_ReturnValue) == 0x0000E8, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, K2Node_Select_Default_4) == 0x0000F0, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, CallFunc_Greater_TimespanTimespan_ReturnValue) == 0x000108, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::CallFunc_Greater_TimespanTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, Temp_bool_Variable_5) == 0x000109, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_RequestStatusIndicator_C_UpdateStatus, K2Node_Select_Default_5) == 0x000110, "Member 'WBP_RequestStatusIndicator_C_UpdateStatus::K2Node_Select_Default_5' has a wrong offset!");

}

