#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CarouselPagePip_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CarouselPagePip_CM.WBP_CarouselPagePip_CM_C.ExecuteUbergraph_WBP_CarouselPagePip_CM
// 0x0004 (0x0004 - 0x0000)
struct WBP_CarouselPagePip_CM_C_ExecuteUbergraph_WBP_CarouselPagePip_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarouselPagePip_CM_C_ExecuteUbergraph_WBP_CarouselPagePip_CM) == 0x000004, "Wrong alignment on WBP_CarouselPagePip_CM_C_ExecuteUbergraph_WBP_CarouselPagePip_CM");
static_assert(sizeof(WBP_CarouselPagePip_CM_C_ExecuteUbergraph_WBP_CarouselPagePip_CM) == 0x000004, "Wrong size on WBP_CarouselPagePip_CM_C_ExecuteUbergraph_WBP_CarouselPagePip_CM");
static_assert(offsetof(WBP_CarouselPagePip_CM_C_ExecuteUbergraph_WBP_CarouselPagePip_CM, EntryPoint) == 0x000000, "Member 'WBP_CarouselPagePip_CM_C_ExecuteUbergraph_WBP_CarouselPagePip_CM::EntryPoint' has a wrong offset!");

// Function WBP_CarouselPagePip_CM.WBP_CarouselPagePip_CM_C.OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CarouselPagePip_CM_C_OnClicked__DelegateSignature final
{
public:
	class UWBP_CarouselPageButton_CM_C*           TutorialPageButton;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarouselPagePip_CM_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CarouselPagePip_CM_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_CarouselPagePip_CM_C_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CarouselPagePip_CM_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_CarouselPagePip_CM_C_OnClicked__DelegateSignature, TutorialPageButton) == 0x000000, "Member 'WBP_CarouselPagePip_CM_C_OnClicked__DelegateSignature::TutorialPageButton' has a wrong offset!");

// Function WBP_CarouselPagePip_CM.WBP_CarouselPagePip_CM_C.SetIsSelected
// 0x0009 (0x0009 - 0x0000)
struct WBP_CarouselPagePip_CM_C_SetIsSelected final
{
public:
	bool                                          Param_Selected;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarouselPagePip_CM_C_SetIsSelected) == 0x000001, "Wrong alignment on WBP_CarouselPagePip_CM_C_SetIsSelected");
static_assert(sizeof(WBP_CarouselPagePip_CM_C_SetIsSelected) == 0x000009, "Wrong size on WBP_CarouselPagePip_CM_C_SetIsSelected");
static_assert(offsetof(WBP_CarouselPagePip_CM_C_SetIsSelected, Param_Selected) == 0x000000, "Member 'WBP_CarouselPagePip_CM_C_SetIsSelected::Param_Selected' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPagePip_CM_C_SetIsSelected, Temp_byte_Variable) == 0x000001, "Member 'WBP_CarouselPagePip_CM_C_SetIsSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPagePip_CM_C_SetIsSelected, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_CarouselPagePip_CM_C_SetIsSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPagePip_CM_C_SetIsSelected, Temp_bool_Variable) == 0x000003, "Member 'WBP_CarouselPagePip_CM_C_SetIsSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPagePip_CM_C_SetIsSelected, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_CarouselPagePip_CM_C_SetIsSelected::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPagePip_CM_C_SetIsSelected, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_CarouselPagePip_CM_C_SetIsSelected::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPagePip_CM_C_SetIsSelected, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_CarouselPagePip_CM_C_SetIsSelected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPagePip_CM_C_SetIsSelected, K2Node_Select_Default) == 0x000007, "Member 'WBP_CarouselPagePip_CM_C_SetIsSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CarouselPagePip_CM_C_SetIsSelected, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_CarouselPagePip_CM_C_SetIsSelected::K2Node_Select_Default_1' has a wrong offset!");

}

