#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemSlot_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.ExecuteUbergraph_WBP_ItemSlot_CM
// 0x05D0 (0x05D0 - 0x0000)
struct WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5200[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5201[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult_1;   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5202[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_UIManagerWidgetBase*             K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base;  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5203[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_UIManagerWidgetBase*             K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base_1; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5204[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ItemDragDrop*                    K2Node_CustomEvent_ItemDrag;                       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsDragging;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5205[0x1];                                     // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0080(0x0078)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry_1;                         // 0x00F8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0130(0x0078)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01A8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent_1;                       // 0x01E0(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation_1;                          // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0260(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSelected;                      // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5206[0x4];                                     // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ItemSlotStyle*                   K2Node_CustomEvent_Style;                          // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5207[0xF];                                     // 0x02F1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0300(0x00D0)(ConstParm)
	struct FSlateBrush                            K2Node_Select_Default_1;                           // 0x03D0(0x00D0)(ConstParm)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5208[0xC];                                     // 0x04A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default_2;                           // 0x04B0(0x00D0)(ConstParm)
	bool                                          K2Node_CustomEvent_bEmpty;                         // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0582(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5209[0x5];                                     // 0x0583(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVALUI_ItemDragDrop* ItemDrag, bool IsDragging)> K2Node_CreateDelegate_OutputDelegate;              // 0x05A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM) == 0x000010, "Wrong alignment on WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM");
static_assert(sizeof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM) == 0x0005D0, "Wrong size on WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, EntryPoint) == 0x000000, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, Temp_bool_Variable) == 0x000004, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, Temp_bool_Variable_2) == 0x000006, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, Temp_byte_Variable) == 0x000007, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, Temp_byte_Variable_1) == 0x000008, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, Temp_bool_Variable_3) == 0x000009, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, Temp_byte_Variable_2) == 0x00000A, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, Temp_byte_Variable_3) == 0x00000B, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_GetIsEnabled_ReturnValue) == 0x00000C, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, Temp_bool_Variable_4) == 0x000020, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_GetValeriaPlayerController_OutResult) == 0x000021, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000028, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_GetValeriaPlayerController_OutResult_1) == 0x000030, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_GetValeriaPlayerController_OutResult_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_GetValeriaPlayerController_ReturnValue_1) == 0x000038, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_GetValeriaPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000040, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_GetUIManagerWidget_ReturnValue_1) == 0x000048, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_GetUIManagerWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base) == 0x000050, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base_1) == 0x000060, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_SwitchEnum_CmpSuccess) == 0x000069, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_IsValid_ReturnValue) == 0x00006A, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_SwitchEnum_CmpSuccess_1) == 0x00006B, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_CustomEvent_ItemDrag) == 0x000070, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_CustomEvent_ItemDrag' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_CustomEvent_IsDragging) == 0x000078, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_CustomEvent_IsDragging' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Event_IsDesignTime) == 0x000079, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_IsValid_ReturnValue_1) == 0x00007A, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x00007C, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Event_MouseEvent_1) == 0x000080, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Event_MyGeometry_1) == 0x0000F8, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Event_MyGeometry_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Event_MouseEvent) == 0x000130, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Event_MyGeometry) == 0x0001A8, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Event_PointerEvent_1) == 0x0001E0, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Event_PointerEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Event_Operation_1) == 0x000258, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Event_Operation_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Event_PointerEvent) == 0x000260, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Event_Operation) == 0x0002D8, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_CustomEvent_bSelected) == 0x0002E0, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_CustomEvent_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_GetIsEnabled_ReturnValue_1) == 0x0002E1, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_GetIsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_Not_PreBool_ReturnValue) == 0x0002E2, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_BooleanAND_ReturnValue) == 0x0002E3, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_CustomEvent_Style) == 0x0002E8, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_CustomEvent_Style' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_IsValid_ReturnValue_2) == 0x0002F0, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Select_Default) == 0x000300, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Select_Default_1) == 0x0003D0, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x0004A0, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Select_Default_2) == 0x0004B0, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_CustomEvent_bEmpty) == 0x000580, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_CustomEvent_bEmpty' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Select_Default_3) == 0x000581, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_Select_Default_4) == 0x000582, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000588, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000590, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_PlayAnimationForward_ReturnValue) == 0x000598, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0005A0, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, K2Node_CreateDelegate_OutputDelegate) == 0x0005A8, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_PlayAnimation_ReturnValue) == 0x0005B8, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x0005C0, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x0005C4, "Member 'WBP_ItemSlot_CM_C_ExecuteUbergraph_WBP_ItemSlot_CM::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.HandleAnythingGotDragged
// 0x0010 (0x0010 - 0x0000)
struct WBP_ItemSlot_CM_C_HandleAnythingGotDragged final
{
public:
	class UVALUI_ItemDragDrop*                    ItemDrag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDragging;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_HandleAnythingGotDragged) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_HandleAnythingGotDragged");
static_assert(sizeof(WBP_ItemSlot_CM_C_HandleAnythingGotDragged) == 0x000010, "Wrong size on WBP_ItemSlot_CM_C_HandleAnythingGotDragged");
static_assert(offsetof(WBP_ItemSlot_CM_C_HandleAnythingGotDragged, ItemDrag) == 0x000000, "Member 'WBP_ItemSlot_CM_C_HandleAnythingGotDragged::ItemDrag' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_HandleAnythingGotDragged, IsDragging) == 0x000008, "Member 'WBP_ItemSlot_CM_C_HandleAnythingGotDragged::IsDragging' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.IsEmpty
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemSlot_CM_C_IsEmpty final
{
public:
	bool                                          Param_bEmpty;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_IsEmpty) == 0x000001, "Wrong alignment on WBP_ItemSlot_CM_C_IsEmpty");
static_assert(sizeof(WBP_ItemSlot_CM_C_IsEmpty) == 0x000001, "Wrong size on WBP_ItemSlot_CM_C_IsEmpty");
static_assert(offsetof(WBP_ItemSlot_CM_C_IsEmpty, Param_bEmpty) == 0x000000, "Member 'WBP_ItemSlot_CM_C_IsEmpty::Param_bEmpty' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.IsHoverStyleApplied
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemSlot_CM_C_IsHoverStyleApplied final
{
public:
	bool                                          Param_bHovered;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_IsHoverStyleApplied) == 0x000001, "Wrong alignment on WBP_ItemSlot_CM_C_IsHoverStyleApplied");
static_assert(sizeof(WBP_ItemSlot_CM_C_IsHoverStyleApplied) == 0x000001, "Wrong size on WBP_ItemSlot_CM_C_IsHoverStyleApplied");
static_assert(offsetof(WBP_ItemSlot_CM_C_IsHoverStyleApplied, Param_bHovered) == 0x000000, "Member 'WBP_ItemSlot_CM_C_IsHoverStyleApplied::Param_bHovered' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.IsSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemSlot_CM_C_IsSelected final
{
public:
	bool                                          Param_bSelected;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_IsSelected) == 0x000001, "Wrong alignment on WBP_ItemSlot_CM_C_IsSelected");
static_assert(sizeof(WBP_ItemSlot_CM_C_IsSelected) == 0x000001, "Wrong size on WBP_ItemSlot_CM_C_IsSelected");
static_assert(offsetof(WBP_ItemSlot_CM_C_IsSelected, Param_bSelected) == 0x000000, "Member 'WBP_ItemSlot_CM_C_IsSelected::Param_bSelected' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnDragDetected
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_ItemSlot_CM_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_520A[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_ItemDragDrop*                    K2Node_DynamicCast_AsVALUI_Item_Drag_Drop;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_520B[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_UIManagerWidgetBase*             K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base;  // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnDragDetected) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnDragDetected");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnDragDetected) == 0x0000F0, "Wrong size on WBP_ItemSlot_CM_C_OnDragDetected");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'WBP_ItemSlot_CM_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragDetected, Operation) == 0x0000B0, "Member 'WBP_ItemSlot_CM_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragDetected, CallFunc_GetValeriaPlayerController_OutResult) == 0x0000B8, "Member 'WBP_ItemSlot_CM_C_OnDragDetected::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragDetected, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x0000C0, "Member 'WBP_ItemSlot_CM_C_OnDragDetected::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragDetected, CallFunc_GetUIManagerWidget_ReturnValue) == 0x0000C8, "Member 'WBP_ItemSlot_CM_C_OnDragDetected::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragDetected, K2Node_DynamicCast_AsVALUI_Item_Drag_Drop) == 0x0000D0, "Member 'WBP_ItemSlot_CM_C_OnDragDetected::K2Node_DynamicCast_AsVALUI_Item_Drag_Drop' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragDetected, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'WBP_ItemSlot_CM_C_OnDragDetected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragDetected, K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base) == 0x0000E0, "Member 'WBP_ItemSlot_CM_C_OnDragDetected::K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragDetected, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'WBP_ItemSlot_CM_C_OnDragDetected::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragDetected, K2Node_SwitchEnum_CmpSuccess) == 0x0000E9, "Member 'WBP_ItemSlot_CM_C_OnDragDetected::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnDragEnter
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_ItemSlot_CM_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnDragEnter) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnDragEnter");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnDragEnter) == 0x0000B8, "Wrong size on WBP_ItemSlot_CM_C_OnDragEnter");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragEnter, MyGeometry) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnDragEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragEnter, PointerEvent) == 0x000038, "Member 'WBP_ItemSlot_CM_C_OnDragEnter::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragEnter, Operation) == 0x0000B0, "Member 'WBP_ItemSlot_CM_C_OnDragEnter::Operation' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnDragged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemSlot_CM_C_OnDragged__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnDragged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnDragged__DelegateSignature");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnDragged__DelegateSignature) == 0x000008, "Wrong size on WBP_ItemSlot_CM_C_OnDragged__DelegateSignature");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragged__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnDragged__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnDragLeave
// 0x0080 (0x0080 - 0x0000)
struct WBP_ItemSlot_CM_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnDragLeave) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnDragLeave");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnDragLeave) == 0x000080, "Wrong size on WBP_ItemSlot_CM_C_OnDragLeave");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDragLeave, Operation) == 0x000078, "Member 'WBP_ItemSlot_CM_C_OnDragLeave::Operation' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnDrop
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_ItemSlot_CM_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_520C[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ItemDragDrop*                    K2Node_DynamicCast_AsVALUI_Item_Drag_Drop;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnDrop) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnDrop");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnDrop) == 0x0000D0, "Wrong size on WBP_ItemSlot_CM_C_OnDrop");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDrop, MyGeometry) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDrop, PointerEvent) == 0x000038, "Member 'WBP_ItemSlot_CM_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDrop, Operation) == 0x0000B0, "Member 'WBP_ItemSlot_CM_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDrop, ReturnValue) == 0x0000B8, "Member 'WBP_ItemSlot_CM_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDrop, K2Node_DynamicCast_AsVALUI_Item_Drag_Drop) == 0x0000C0, "Member 'WBP_ItemSlot_CM_C_OnDrop::K2Node_DynamicCast_AsVALUI_Item_Drag_Drop' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WBP_ItemSlot_CM_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnGlobalDragDetected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ItemSlot_CM_C_OnGlobalDragDetected__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_ItemDragDrop*                    Operation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnGlobalDragDetected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnGlobalDragDetected__DelegateSignature");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnGlobalDragDetected__DelegateSignature) == 0x000010, "Wrong size on WBP_ItemSlot_CM_C_OnGlobalDragDetected__DelegateSignature");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnGlobalDragDetected__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnGlobalDragDetected__DelegateSignature::Param_Slot' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnGlobalDragDetected__DelegateSignature, Operation) == 0x000008, "Member 'WBP_ItemSlot_CM_C_OnGlobalDragDetected__DelegateSignature::Operation' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemSlot_CM_C_OnHovered__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_ItemSlot_CM_C_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnHovered__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnHovered__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnItemDropped__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ItemSlot_CM_C_OnItemDropped__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_ItemDragDrop*                    Operation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnItemDropped__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnItemDropped__DelegateSignature");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnItemDropped__DelegateSignature) == 0x000010, "Wrong size on WBP_ItemSlot_CM_C_OnItemDropped__DelegateSignature");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnItemDropped__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnItemDropped__DelegateSignature::Param_Slot' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnItemDropped__DelegateSignature, Operation) == 0x000008, "Member 'WBP_ItemSlot_CM_C_OnItemDropped__DelegateSignature::Operation' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnLeftClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemSlot_CM_C_OnLeftClicked__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnLeftClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnLeftClicked__DelegateSignature");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnLeftClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ItemSlot_CM_C_OnLeftClicked__DelegateSignature");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnLeftClicked__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnLeftClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnMouseButtonDown
// 0x0398 (0x0398 - 0x0000)
struct WBP_ItemSlot_CM_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_520D[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0170(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0228(0x00B8)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x02E0(0x00B8)()
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnMouseButtonDown");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnMouseButtonDown) == 0x000398, "Wrong size on WBP_ItemSlot_CM_C_OnMouseButtonDown");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonDown, Temp_bool_Variable) == 0x000168, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonDown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000170, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000228, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonDown, K2Node_Select_Default) == 0x0002E0, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonDown::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnMouseButtonUp
// 0x02F8 (0x02F8 - 0x0000)
struct WBP_ItemSlot_CM_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0168(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_520E[0x6];                                     // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0188(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0240(0x00B8)()
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnMouseButtonUp");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnMouseButtonUp) == 0x0002F8, "Wrong size on WBP_ItemSlot_CM_C_OnMouseButtonUp");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonUp, ReturnValue) == 0x0000B0, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonUp, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000168, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonUp::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000180, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonUp, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000181, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonUp::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonUp, CallFunc_Unhandled_ReturnValue) == 0x000188, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000240, "Member 'WBP_ItemSlot_CM_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_ItemSlot_CM_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnMouseEnter");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_ItemSlot_CM_C_OnMouseEnter");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_ItemSlot_CM_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_ItemSlot_CM_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnMouseLeave");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_ItemSlot_CM_C_OnMouseLeave");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnPreviewMouseButtonDown
// 0x02D8 (0x02D8 - 0x0000)
struct WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0168(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0220(0x00B8)()
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown) == 0x0002D8, "Wrong size on WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000168, "Member 'WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000220, "Member 'WBP_ItemSlot_CM_C_OnPreviewMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnRightClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemSlot_CM_C_OnRightClicked__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnRightClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnRightClicked__DelegateSignature");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnRightClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ItemSlot_CM_C_OnRightClicked__DelegateSignature");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnRightClicked__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnRightClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnStyleUpdated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemSlot_CM_C_OnStyleUpdated__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnStyleUpdated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnStyleUpdated__DelegateSignature");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnStyleUpdated__DelegateSignature) == 0x000008, "Wrong size on WBP_ItemSlot_CM_C_OnStyleUpdated__DelegateSignature");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnStyleUpdated__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnStyleUpdated__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemSlot_CM_C_OnUnhovered__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemSlot_CM_C_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_ItemSlot_CM_C_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_ItemSlot_CM_C_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_ItemSlot_CM_C_OnUnhovered__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_ItemSlot_CM_C_OnUnhovered__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemSlot_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemSlot_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ItemSlot_CM_C_PreConstruct");
static_assert(sizeof(WBP_ItemSlot_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_ItemSlot_CM_C_PreConstruct");
static_assert(offsetof(WBP_ItemSlot_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ItemSlot_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ItemSlot_CM.WBP_ItemSlot_CM_C.RespondToDrag
// 0x0008 (0x0008 - 0x0000)
