#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListItemButton_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.BndEvt__WBP_ListItemButton_CM_Button_Root_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_Button_Root_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_Button_Root_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_Button_Root_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_Button_Root_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_Button_Root_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_Button_Root_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_Button_Root_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ListItemButton_CM_C_BndEvt__WBP_ListItemButton_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.ExecuteUbergraph_WBP_ListItemButton_CM
// 0x0168 (0x0168 - 0x0000)
struct WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54AE[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0060(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0078)(ConstParm)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x015C(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM");
static_assert(sizeof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM) == 0x000168, "Wrong size on WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, EntryPoint) == 0x000000, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, K2Node_ComponentBoundEvent_Button_4) == 0x000008, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, K2Node_ComponentBoundEvent_Button_3) == 0x000010, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, K2Node_ComponentBoundEvent_Button_2) == 0x000018, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000020, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, K2Node_Event_MyGeometry) == 0x000028, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, K2Node_Event_MouseEvent_1) == 0x000060, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, K2Node_ComponentBoundEvent_Button) == 0x000150, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000158, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM, K2Node_Event_InFocusEvent) == 0x00015C, "Member 'WBP_ListItemButton_CM_C_ExecuteUbergraph_WBP_ListItemButton_CM::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListItemButton_CM_C_OnClicked__DelegateSignature final
{
public:
	class UWBP_ListItemButton_CM_C*               ListItemButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_ListItemButton_CM_C_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ListItemButton_CM_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnClicked__DelegateSignature, ListItemButton) == 0x000000, "Member 'WBP_ListItemButton_CM_C_OnClicked__DelegateSignature::ListItemButton' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListItemButton_CM_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ListItemButton_CM_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_ListItemButton_CM_C_OnFocusLost");
static_assert(sizeof(WBP_ListItemButton_CM_C_OnFocusLost) == 0x000008, "Wrong size on WBP_ListItemButton_CM_C_OnFocusLost");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_ListItemButton_CM_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_ListItemButton_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_ListItemButton_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_ListItemButton_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_ListItemButton_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_ListItemButton_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_ListItemButton_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_ListItemButton_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_ListItemButton_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListItemButton_CM_C_OnHovered__DelegateSignature final
{
public:
	class UWBP_ListItemButton_CM_C*               ListItemButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_ListItemButton_CM_C_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_ListItemButton_CM_C_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnHovered__DelegateSignature, ListItemButton) == 0x000000, "Member 'WBP_ListItemButton_CM_C_OnHovered__DelegateSignature::ListItemButton' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_ListItemButton_CM_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ListItemButton_CM_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_OnMouseEnter");
static_assert(sizeof(WBP_ListItemButton_CM_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_ListItemButton_CM_C_OnMouseEnter");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_ListItemButton_CM_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_ListItemButton_CM_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_ListItemButton_CM_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ListItemButton_CM_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_OnMouseLeave");
static_assert(sizeof(WBP_ListItemButton_CM_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_ListItemButton_CM_C_OnMouseLeave");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_ListItemButton_CM_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListItemButton_CM_C_OnPressed__DelegateSignature final
{
public:
	class UWBP_ListItemButton_CM_C*               ListItemButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_ListItemButton_CM_C_OnPressed__DelegateSignature) == 0x000008, "Wrong size on WBP_ListItemButton_CM_C_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnPressed__DelegateSignature, ListItemButton) == 0x000000, "Member 'WBP_ListItemButton_CM_C_OnPressed__DelegateSignature::ListItemButton' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ListItemButton_CM_C_OnUnhovered__DelegateSignature final
{
public:
	class UWBP_ListItemButton_CM_C*               ListItemButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_ListItemButton_CM_C_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_ListItemButton_CM_C_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_ListItemButton_CM_C_OnUnhovered__DelegateSignature, ListItemButton) == 0x000000, "Member 'WBP_ListItemButton_CM_C_OnUnhovered__DelegateSignature::ListItemButton' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListItemButton_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ListItemButton_CM_C_PreConstruct");
static_assert(sizeof(WBP_ListItemButton_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_ListItemButton_CM_C_PreConstruct");
static_assert(offsetof(WBP_ListItemButton_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ListItemButton_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.Set Button Enabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListItemButton_CM_C_Set_Button_Enabled final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_Set_Button_Enabled) == 0x000001, "Wrong alignment on WBP_ListItemButton_CM_C_Set_Button_Enabled");
static_assert(sizeof(WBP_ListItemButton_CM_C_Set_Button_Enabled) == 0x000001, "Wrong size on WBP_ListItemButton_CM_C_Set_Button_Enabled");
static_assert(offsetof(WBP_ListItemButton_CM_C_Set_Button_Enabled, IsEnabled) == 0x000000, "Member 'WBP_ListItemButton_CM_C_Set_Button_Enabled::IsEnabled' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.SetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_ListItemButton_CM_C_SetIsSelected final
{
public:
	bool                                          Param_bIsSelected;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_SetIsSelected) == 0x000001, "Wrong alignment on WBP_ListItemButton_CM_C_SetIsSelected");
static_assert(sizeof(WBP_ListItemButton_CM_C_SetIsSelected) == 0x000001, "Wrong size on WBP_ListItemButton_CM_C_SetIsSelected");
static_assert(offsetof(WBP_ListItemButton_CM_C_SetIsSelected, Param_bIsSelected) == 0x000000, "Member 'WBP_ListItemButton_CM_C_SetIsSelected::Param_bIsSelected' has a wrong offset!");

// Function WBP_ListItemButton_CM.WBP_ListItemButton_CM_C.UpdateSelectonStyle
// 0x0010 (0x0010 - 0x0000)
struct WBP_ListItemButton_CM_C_UpdateSelectonStyle final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54AF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ListItemButton_CM_C_UpdateSelectonStyle) == 0x000008, "Wrong alignment on WBP_ListItemButton_CM_C_UpdateSelectonStyle");
static_assert(sizeof(WBP_ListItemButton_CM_C_UpdateSelectonStyle) == 0x000010, "Wrong size on WBP_ListItemButton_CM_C_UpdateSelectonStyle");
static_assert(offsetof(WBP_ListItemButton_CM_C_UpdateSelectonStyle, Temp_bool_Variable) == 0x000000, "Member 'WBP_ListItemButton_CM_C_UpdateSelectonStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ListItemButton_CM_C_UpdateSelectonStyle, K2Node_Select_Default) == 0x000008, "Member 'WBP_ListItemButton_CM_C_UpdateSelectonStyle::K2Node_Select_Default' has a wrong offset!");

}

