#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PetsBonusReceived_ModalWidget_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ValeriaUI_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PetsBonusReceived_ModalWidget_CM.WBP_PetsBonusReceived_ModalWidget_CM_C
// 0x0090 (0x05E8 - 0x0558)
class UWBP_PetsBonusReceived_ModalWidget_CM_C final : public UVALUI_ModalWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HBox_Icons;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_PopupSecondary_02_CM_C*   WBP_Template_PopupSecondary_02_CM;                 // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnOpenCollectionsButtonClicked;                    // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Pet>> PetsReceived;                                      // 0x0580(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FVector2D                              Pet_Image_Size;                                    // 0x0590(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Pet_Image_Padding;                                 // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Pet> TempPet;                                           // 0x05B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGuid                                  TempPetId;                                         // 0x05D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PetsBonusReceived_ModalWidget_CM_WBP_Template_PopupSecondary_02_CM_K2Node_ComponentBoundEvent_2_Confirm__DelegateSignature();
	void BndEvt__WBP_PetsBonusReceived_ModalWidget_CM_WBP_Template_PopupSecondary_02_CM_K2Node_ComponentBoundEvent_3_Cancel__DelegateSignature();
	void CloseSelf(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue);
	void Construct();
	void ExecuteUbergraph_WBP_PetsBonusReceived_ModalWidget_CM(int32 EntryPoint, class UWBP_PetImage_C* CallFunc_Create_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Pet> CallFunc_Array_Get_Item, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const struct FGuid& CallFunc_GetItemIdFromItem_OutId, bool CallFunc_GetItemIdFromItem_ReturnValue, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void OnOpenCollectionsButtonClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PetsBonusReceived_ModalWidget_CM_C">();
	}
	static class UWBP_PetsBonusReceived_ModalWidget_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PetsBonusReceived_ModalWidget_CM_C>();
	}
};
static_assert(alignof(UWBP_PetsBonusReceived_ModalWidget_CM_C) == 0x000008, "Wrong alignment on UWBP_PetsBonusReceived_ModalWidget_CM_C");
static_assert(sizeof(UWBP_PetsBonusReceived_ModalWidget_CM_C) == 0x0005E8, "Wrong size on UWBP_PetsBonusReceived_ModalWidget_CM_C");
static_assert(offsetof(UWBP_PetsBonusReceived_ModalWidget_CM_C, UberGraphFrame) == 0x000558, "Member 'UWBP_PetsBonusReceived_ModalWidget_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PetsBonusReceived_ModalWidget_CM_C, HBox_Icons) == 0x000560, "Member 'UWBP_PetsBonusReceived_ModalWidget_CM_C::HBox_Icons' has a wrong offset!");
static_assert(offsetof(UWBP_PetsBonusReceived_ModalWidget_CM_C, WBP_Template_PopupSecondary_02_CM) == 0x000568, "Member 'UWBP_PetsBonusReceived_ModalWidget_CM_C::WBP_Template_PopupSecondary_02_CM' has a wrong offset!");
static_assert(offsetof(UWBP_PetsBonusReceived_ModalWidget_CM_C, OnOpenCollectionsButtonClicked) == 0x000570, "Member 'UWBP_PetsBonusReceived_ModalWidget_CM_C::OnOpenCollectionsButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_PetsBonusReceived_ModalWidget_CM_C, PetsReceived) == 0x000580, "Member 'UWBP_PetsBonusReceived_ModalWidget_CM_C::PetsReceived' has a wrong offset!");
static_assert(offsetof(UWBP_PetsBonusReceived_ModalWidget_CM_C, Pet_Image_Size) == 0x000590, "Member 'UWBP_PetsBonusReceived_ModalWidget_CM_C::Pet_Image_Size' has a wrong offset!");
static_assert(offsetof(UWBP_PetsBonusReceived_ModalWidget_CM_C, Pet_Image_Padding) == 0x0005A0, "Member 'UWBP_PetsBonusReceived_ModalWidget_CM_C::Pet_Image_Padding' has a wrong offset!");
static_assert(offsetof(UWBP_PetsBonusReceived_ModalWidget_CM_C, TempPet) == 0x0005B0, "Member 'UWBP_PetsBonusReceived_ModalWidget_CM_C::TempPet' has a wrong offset!");
static_assert(offsetof(UWBP_PetsBonusReceived_ModalWidget_CM_C, TempPetId) == 0x0005D8, "Member 'UWBP_PetsBonusReceived_ModalWidget_CM_C::TempPetId' has a wrong offset!");

}

