#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TIM_ChatInputBarContextMenu_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TIM_ChatInputBarContextMenu_CM.WBP_TIM_ChatInputBarContextMenu_CM_C
// 0x00E8 (0x03A8 - 0x02C0)
class UWBP_TIM_ChatInputBarContextMenu_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               BackButtonContainer;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BoldButtonContainer;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   Button_Back;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   Button_Bold;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   Button_Copy;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   Button_Cut;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   Button_Delete;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   Button_Italic;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   Button_Paste;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   Button_PlainText;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   Button_SelectAll;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   Button_Style;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ButtonPanelsSwitcher;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CopyButtonContainer;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CutButtonContainer;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DefaultButtons_Panel;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DeleteButtonContainer;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_113;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ItalicButtonContainer;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PasteButtonContainer;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PlainTextButtonContainer;                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SelectAllButtonContainer;                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               StyleButtonContainer;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           StyleButtons_Panel;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_ChatInputEditableText*           Editable_Rich_Text;                                // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMenuButtonPressed;                               // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_TIM_ChatInputBarContextMenu_Button_Back_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_TIM_ChatInputBarContextMenu_Button_Bold_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_TIM_ChatInputBarContextMenu_Button_Copy_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_TIM_ChatInputBarContextMenu_Button_Cut_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_TIM_ChatInputBarContextMenu_Button_Delete_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_TIM_ChatInputBarContextMenu_Button_Italic_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_TIM_ChatInputBarContextMenu_Button_Paste_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_TIM_ChatInputBarContextMenu_Button_PlainText_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_TIM_ChatInputBarContextMenu_Button_SelectAll_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_TIM_ChatInputBarContextMenu_Button_Style_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_TIM_ChatInputBarContextMenu_CM(int32 EntryPoint);
	void OnMenuButtonPressed__DelegateSignature();
	void SetEditableRichText(class UVALUI_ChatInputEditableText*& InEditableRichText);
	void UpdateAvailableButtons(bool CallFunc_AnyTextSelected_ReturnValue, class FText CallFunc_GetPlainText_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_TextIsEmpty_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TIM_ChatInputBarContextMenu_CM_C">();
	}
	static class UWBP_TIM_ChatInputBarContextMenu_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TIM_ChatInputBarContextMenu_CM_C>();
	}
};
static_assert(alignof(UWBP_TIM_ChatInputBarContextMenu_CM_C) == 0x000008, "Wrong alignment on UWBP_TIM_ChatInputBarContextMenu_CM_C");
static_assert(sizeof(UWBP_TIM_ChatInputBarContextMenu_CM_C) == 0x0003A8, "Wrong size on UWBP_TIM_ChatInputBarContextMenu_CM_C");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, BackButtonContainer) == 0x0002C8, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::BackButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, BoldButtonContainer) == 0x0002D0, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::BoldButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Button_Back) == 0x0002D8, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Button_Bold) == 0x0002E0, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Button_Bold' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Button_Copy) == 0x0002E8, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Button_Copy' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Button_Cut) == 0x0002F0, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Button_Cut' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Button_Delete) == 0x0002F8, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Button_Delete' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Button_Italic) == 0x000300, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Button_Italic' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Button_Paste) == 0x000308, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Button_Paste' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Button_PlainText) == 0x000310, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Button_PlainText' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Button_SelectAll) == 0x000318, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Button_SelectAll' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Button_Style) == 0x000320, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Button_Style' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, ButtonPanelsSwitcher) == 0x000328, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::ButtonPanelsSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, CopyButtonContainer) == 0x000330, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::CopyButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, CutButtonContainer) == 0x000338, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::CutButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, DefaultButtons_Panel) == 0x000340, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::DefaultButtons_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, DeleteButtonContainer) == 0x000348, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::DeleteButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Image_1) == 0x000350, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Image_113) == 0x000358, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Image_113' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, ItalicButtonContainer) == 0x000360, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::ItalicButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, PasteButtonContainer) == 0x000368, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::PasteButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, PlainTextButtonContainer) == 0x000370, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::PlainTextButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, SelectAllButtonContainer) == 0x000378, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::SelectAllButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, StyleButtonContainer) == 0x000380, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::StyleButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, StyleButtons_Panel) == 0x000388, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::StyleButtons_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, Editable_Rich_Text) == 0x000390, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::Editable_Rich_Text' has a wrong offset!");
static_assert(offsetof(UWBP_TIM_ChatInputBarContextMenu_CM_C, OnMenuButtonPressed) == 0x000398, "Member 'UWBP_TIM_ChatInputBarContextMenu_CM_C::OnMenuButtonPressed' has a wrong offset!");

}

