#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyRebindResultTips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "KeyRebinding_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KeyRebindResultTips.WBP_KeyRebindResultTips_C
// 0x0038 (0x02F8 - 0x02C0)
class UWBP_KeyRebindResultTips_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Notification_Basic_Error_C* Error_GlobalConflict;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_RichTextBlock_Styled*            Error_GlobalConflictText;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Notification_Basic_Error_C* Error_UnboundCoreAction;                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_RichTextBlock_Styled*            Error_UnboundCoreAction_Text;                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Notification_Basic_Error_C* WBP_Template_Notification_Basic_BoundFailedInvalidKeys; // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_KeyRebindResultTips(int32 EntryPoint, const struct FKeyRebind_DisplayResult& K2Node_Event_KeyRebindResultInfo);
	void Refresh_Key_Rebind_Result_Tips(const struct FKeyRebind_DisplayResult& ResultInfo, class UWidget* NewLocalVar, bool K2Node_SwitchEnum_CmpSuccess);
	void RefreshCoreActionTipsText(struct FKeyRebind_DisplayResult& ResultInfo, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue, class FText CallFunc_Format_ReturnValue_1, bool CallFunc_Array_IsNotEmpty_ReturnValue);
	void RefreshGlobalConflictTipsText(const struct FKeyRebind_DisplayResult& ResultInfo, const TMap<class UInputAction*, class FText>& InputActionsofGlobalGroup, EKeyRebind_BindingResultType Temp_byte_Variable, class FText Temp_text_Variable, class UInputAction* CallFunc_Array_Get_Item, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, class FText Temp_text_Variable_4, class FText Temp_text_Variable_5, class FText Temp_text_Variable_6, class FText Temp_text_Variable_7, const TMap<class UInputAction*, class FText>& K2Node_MakeVariable_MakeVariableOutput, bool Temp_bool_Variable, class FText CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class FText CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, bool Temp_bool_Variable_1, class FText K2Node_Select_Default, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class FText K2Node_Select_Default_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, class FText CallFunc_Format_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, class FText K2Node_Select_Default_2);
	void RefreshKeyRebindTips(const struct FKeyRebind_DisplayResult& KeyRebindResultInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KeyRebindResultTips_C">();
	}
	static class UWBP_KeyRebindResultTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KeyRebindResultTips_C>();
	}
};
static_assert(alignof(UWBP_KeyRebindResultTips_C) == 0x000008, "Wrong alignment on UWBP_KeyRebindResultTips_C");
static_assert(sizeof(UWBP_KeyRebindResultTips_C) == 0x0002F8, "Wrong size on UWBP_KeyRebindResultTips_C");
static_assert(offsetof(UWBP_KeyRebindResultTips_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_KeyRebindResultTips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindResultTips_C, Error_GlobalConflict) == 0x0002C8, "Member 'UWBP_KeyRebindResultTips_C::Error_GlobalConflict' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindResultTips_C, Error_GlobalConflictText) == 0x0002D0, "Member 'UWBP_KeyRebindResultTips_C::Error_GlobalConflictText' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindResultTips_C, Error_UnboundCoreAction) == 0x0002D8, "Member 'UWBP_KeyRebindResultTips_C::Error_UnboundCoreAction' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindResultTips_C, Error_UnboundCoreAction_Text) == 0x0002E0, "Member 'UWBP_KeyRebindResultTips_C::Error_UnboundCoreAction_Text' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindResultTips_C, WBP_Template_Notification_Basic_BoundFailedInvalidKeys) == 0x0002E8, "Member 'UWBP_KeyRebindResultTips_C::WBP_Template_Notification_Basic_BoundFailedInvalidKeys' has a wrong offset!");
static_assert(offsetof(UWBP_KeyRebindResultTips_C, WidgetSwitcher_0) == 0x0002F0, "Member 'UWBP_KeyRebindResultTips_C::WidgetSwitcher_0' has a wrong offset!");

}

