#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToolItem_CM

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.CanOpenTooltip
// 0x0002 (0x0002 - 0x0000)
struct WBP_ToolItem_CM_C_CanOpenTooltip final
{
public:
	bool                                          CanOpen;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_CanOpenTooltip) == 0x000001, "Wrong alignment on WBP_ToolItem_CM_C_CanOpenTooltip");
static_assert(sizeof(WBP_ToolItem_CM_C_CanOpenTooltip) == 0x000002, "Wrong size on WBP_ToolItem_CM_C_CanOpenTooltip");
static_assert(offsetof(WBP_ToolItem_CM_C_CanOpenTooltip, CanOpen) == 0x000000, "Member 'WBP_ToolItem_CM_C_CanOpenTooltip::CanOpen' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_CanOpenTooltip, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'WBP_ToolItem_CM_C_CanOpenTooltip::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.ExecuteUbergraph_WBP_ToolItem_CM
// 0x0130 (0x0130 - 0x0000)
struct WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BC6[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B8(0x0078)(ConstParm)
};
static_assert(alignof(WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM");
static_assert(sizeof(WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM) == 0x000130, "Wrong size on WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM");
static_assert(offsetof(WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM, EntryPoint) == 0x000000, "Member 'WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM, K2Node_Event_MouseEvent) == 0x0000B8, "Member 'WBP_ToolItem_CM_C_ExecuteUbergraph_WBP_ToolItem_CM::K2Node_Event_MouseEvent' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.GetItem
// 0x0060 (0x0060 - 0x0000)
struct WBP_ToolItem_CM_C_GetItem final
{
public:
	struct FValeriaItem                           Param_Item;                                        // 0x0000(0x0060)(Parm, OutParm)
};
static_assert(alignof(WBP_ToolItem_CM_C_GetItem) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_GetItem");
static_assert(sizeof(WBP_ToolItem_CM_C_GetItem) == 0x000060, "Wrong size on WBP_ToolItem_CM_C_GetItem");
static_assert(offsetof(WBP_ToolItem_CM_C_GetItem, Param_Item) == 0x000000, "Member 'WBP_ToolItem_CM_C_GetItem::Param_Item' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.GetPlayerItemAmount
// 0x0030 (0x0030 - 0x0000)
struct WBP_ToolItem_CM_C_GetPlayerItemAmount final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStarQualityConstraint                 Temp_struct_Variable;                              // 0x0004(0x0008)(ConstParm, NoDestructor)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC7[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC8[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_K2_GetItemAmountByType_ReturnValue;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_GetPlayerItemAmount) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_GetPlayerItemAmount");
static_assert(sizeof(WBP_ToolItem_CM_C_GetPlayerItemAmount) == 0x000030, "Wrong size on WBP_ToolItem_CM_C_GetPlayerItemAmount");
static_assert(offsetof(WBP_ToolItem_CM_C_GetPlayerItemAmount, Amount) == 0x000000, "Member 'WBP_ToolItem_CM_C_GetPlayerItemAmount::Amount' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_GetPlayerItemAmount, Temp_struct_Variable) == 0x000004, "Member 'WBP_ToolItem_CM_C_GetPlayerItemAmount::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_GetPlayerItemAmount, CallFunc_GetValeriaCharacter_OutResult) == 0x00000C, "Member 'WBP_ToolItem_CM_C_GetPlayerItemAmount::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_GetPlayerItemAmount, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_ToolItem_CM_C_GetPlayerItemAmount::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_GetPlayerItemAmount, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_ToolItem_CM_C_GetPlayerItemAmount::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_GetPlayerItemAmount, CallFunc_GetInventory_ReturnValue) == 0x000020, "Member 'WBP_ToolItem_CM_C_GetPlayerItemAmount::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_GetPlayerItemAmount, CallFunc_K2_GetItemAmountByType_ReturnValue) == 0x000028, "Member 'WBP_ToolItem_CM_C_GetPlayerItemAmount::CallFunc_K2_GetItemAmountByType_ReturnValue' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.GetStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_ToolItem_CM_C_GetStyle final
{
public:
	class UVALUI_ItemStyle*                       Param_Style;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_GetStyle) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_GetStyle");
static_assert(sizeof(WBP_ToolItem_CM_C_GetStyle) == 0x000008, "Wrong size on WBP_ToolItem_CM_C_GetStyle");
static_assert(offsetof(WBP_ToolItem_CM_C_GetStyle, Param_Style) == 0x000000, "Member 'WBP_ToolItem_CM_C_GetStyle::Param_Style' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.GetTooltipWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_ToolItem_CM_C_GetTooltipWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_GetTooltipWidget) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_GetTooltipWidget");
static_assert(sizeof(WBP_ToolItem_CM_C_GetTooltipWidget) == 0x000008, "Wrong size on WBP_ToolItem_CM_C_GetTooltipWidget");
static_assert(offsetof(WBP_ToolItem_CM_C_GetTooltipWidget, ReturnValue) == 0x000000, "Member 'WBP_ToolItem_CM_C_GetTooltipWidget::ReturnValue' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.OnDurabilityUpdated__DelegateSignature
// 0x0060 (0x0060 - 0x0000)
struct WBP_ToolItem_CM_C_OnDurabilityUpdated__DelegateSignature final
{
public:
	struct FValeriaItem                           Param_Item;                                        // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ToolItem_CM_C_OnDurabilityUpdated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_OnDurabilityUpdated__DelegateSignature");
static_assert(sizeof(WBP_ToolItem_CM_C_OnDurabilityUpdated__DelegateSignature) == 0x000060, "Wrong size on WBP_ToolItem_CM_C_OnDurabilityUpdated__DelegateSignature");
static_assert(offsetof(WBP_ToolItem_CM_C_OnDurabilityUpdated__DelegateSignature, Param_Item) == 0x000000, "Member 'WBP_ToolItem_CM_C_OnDurabilityUpdated__DelegateSignature::Param_Item' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_ToolItem_CM_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ToolItem_CM_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_OnMouseEnter");
static_assert(sizeof(WBP_ToolItem_CM_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_ToolItem_CM_C_OnMouseEnter");
static_assert(offsetof(WBP_ToolItem_CM_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_ToolItem_CM_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_ToolItem_CM_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_ToolItem_CM_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ToolItem_CM_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_OnMouseLeave");
static_assert(sizeof(WBP_ToolItem_CM_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_ToolItem_CM_C_OnMouseLeave");
static_assert(offsetof(WBP_ToolItem_CM_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_ToolItem_CM_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.OnWaterUpdated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ToolItem_CM_C_OnWaterUpdated__DelegateSignature final
{
public:
	double                                        WaterPercent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_ShouldDisplayWater;                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_OnWaterUpdated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_OnWaterUpdated__DelegateSignature");
static_assert(sizeof(WBP_ToolItem_CM_C_OnWaterUpdated__DelegateSignature) == 0x000010, "Wrong size on WBP_ToolItem_CM_C_OnWaterUpdated__DelegateSignature");
static_assert(offsetof(WBP_ToolItem_CM_C_OnWaterUpdated__DelegateSignature, WaterPercent) == 0x000000, "Member 'WBP_ToolItem_CM_C_OnWaterUpdated__DelegateSignature::WaterPercent' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_OnWaterUpdated__DelegateSignature, Param_ShouldDisplayWater) == 0x000008, "Member 'WBP_ToolItem_CM_C_OnWaterUpdated__DelegateSignature::Param_ShouldDisplayWater' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.OpenTooltip
// 0x0001 (0x0001 - 0x0000)
struct WBP_ToolItem_CM_C_OpenTooltip final
{
public:
	bool                                          CallFunc_CanOpenTooltip_CanOpen;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_OpenTooltip) == 0x000001, "Wrong alignment on WBP_ToolItem_CM_C_OpenTooltip");
static_assert(sizeof(WBP_ToolItem_CM_C_OpenTooltip) == 0x000001, "Wrong size on WBP_ToolItem_CM_C_OpenTooltip");
static_assert(offsetof(WBP_ToolItem_CM_C_OpenTooltip, CallFunc_CanOpenTooltip_CanOpen) == 0x000000, "Member 'WBP_ToolItem_CM_C_OpenTooltip::CallFunc_CanOpenTooltip_CanOpen' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.SetStyle
// 0x0010 (0x0010 - 0x0000)
struct WBP_ToolItem_CM_C_SetStyle final
{
public:
	class UVALUI_ItemStyle*                       NewStyle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_SetStyle) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_SetStyle");
static_assert(sizeof(WBP_ToolItem_CM_C_SetStyle) == 0x000010, "Wrong size on WBP_ToolItem_CM_C_SetStyle");
static_assert(offsetof(WBP_ToolItem_CM_C_SetStyle, NewStyle) == 0x000000, "Member 'WBP_ToolItem_CM_C_SetStyle::NewStyle' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_SetStyle, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'WBP_ToolItem_CM_C_SetStyle::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.SetTool
// 0x0068 (0x0068 - 0x0000)
struct WBP_ToolItem_CM_C_SetTool final
{
public:
	struct FValeriaItem                           NewItem;                                           // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Param_IsVisible;                                   // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateTool_AnythingVisible;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_SetTool) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_SetTool");
static_assert(sizeof(WBP_ToolItem_CM_C_SetTool) == 0x000068, "Wrong size on WBP_ToolItem_CM_C_SetTool");
static_assert(offsetof(WBP_ToolItem_CM_C_SetTool, NewItem) == 0x000000, "Member 'WBP_ToolItem_CM_C_SetTool::NewItem' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_SetTool, Param_IsVisible) == 0x000060, "Member 'WBP_ToolItem_CM_C_SetTool::Param_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_SetTool, CallFunc_UpdateTool_AnythingVisible) == 0x000061, "Member 'WBP_ToolItem_CM_C_SetTool::CallFunc_UpdateTool_AnythingVisible' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.UpdateCapacity
// 0x0010 (0x0010 - 0x0000)
struct WBP_ToolItem_CM_C_UpdateCapacity final
{
public:
	float                                         CallFunc_GetWaterPercent_percent;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWaterPercent_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC9[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CallDelegate_WaterPercent_ImplicitCast;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_UpdateCapacity) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_UpdateCapacity");
static_assert(sizeof(WBP_ToolItem_CM_C_UpdateCapacity) == 0x000010, "Wrong size on WBP_ToolItem_CM_C_UpdateCapacity");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateCapacity, CallFunc_GetWaterPercent_percent) == 0x000000, "Member 'WBP_ToolItem_CM_C_UpdateCapacity::CallFunc_GetWaterPercent_percent' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateCapacity, CallFunc_GetWaterPercent_ReturnValue) == 0x000004, "Member 'WBP_ToolItem_CM_C_UpdateCapacity::CallFunc_GetWaterPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateCapacity, K2Node_CallDelegate_WaterPercent_ImplicitCast) == 0x000008, "Member 'WBP_ToolItem_CM_C_UpdateCapacity::K2Node_CallDelegate_WaterPercent_ImplicitCast' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.UpdateMainIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_ToolItem_CM_C_UpdateMainIcon final
{
public:
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_UpdateMainIcon) == 0x000001, "Wrong alignment on WBP_ToolItem_CM_C_UpdateMainIcon");
static_assert(sizeof(WBP_ToolItem_CM_C_UpdateMainIcon) == 0x000001, "Wrong size on WBP_ToolItem_CM_C_UpdateMainIcon");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateMainIcon, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000000, "Member 'WBP_ToolItem_CM_C_UpdateMainIcon::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.UpdateStyle
// 0x0038 (0x0038 - 0x0000)
struct WBP_ToolItem_CM_C_UpdateStyle final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BCA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateTool_AnythingVisible;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BCB[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_UpdateStyle) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_UpdateStyle");
static_assert(sizeof(WBP_ToolItem_CM_C_UpdateStyle) == 0x000038, "Wrong size on WBP_ToolItem_CM_C_UpdateStyle");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateStyle, Temp_bool_Variable) == 0x000000, "Member 'WBP_ToolItem_CM_C_UpdateStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateStyle, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_ToolItem_CM_C_UpdateStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateStyle, Temp_byte_Variable) == 0x000002, "Member 'WBP_ToolItem_CM_C_UpdateStyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateStyle, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ToolItem_CM_C_UpdateStyle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateStyle, CallFunc_GetPathName_ReturnValue) == 0x000008, "Member 'WBP_ToolItem_CM_C_UpdateStyle::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateStyle, CallFunc_UpdateTool_AnythingVisible) == 0x000018, "Member 'WBP_ToolItem_CM_C_UpdateStyle::CallFunc_UpdateTool_AnythingVisible' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateStyle, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'WBP_ToolItem_CM_C_UpdateStyle::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateStyle, K2Node_Select_Default) == 0x000030, "Member 'WBP_ToolItem_CM_C_UpdateStyle::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.UpdateTool
// 0x0058 (0x0058 - 0x0000)
struct WBP_ToolItem_CM_C_UpdateTool final
{
public:
	bool                                          AnythingVisible;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BCC[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BCD[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_SoftObjectReference_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BCE[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateVisibility_bAnythingVisible;        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_UpdateTool) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_UpdateTool");
static_assert(sizeof(WBP_ToolItem_CM_C_UpdateTool) == 0x000058, "Wrong size on WBP_ToolItem_CM_C_UpdateTool");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, AnythingVisible) == 0x000000, "Member 'WBP_ToolItem_CM_C_UpdateTool::AnythingVisible' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, Temp_byte_Variable) == 0x000001, "Member 'WBP_ToolItem_CM_C_UpdateTool::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000008, "Member 'WBP_ToolItem_CM_C_UpdateTool::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, Temp_byte_Variable_1) == 0x000030, "Member 'WBP_ToolItem_CM_C_UpdateTool::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, Temp_bool_Variable) == 0x000031, "Member 'WBP_ToolItem_CM_C_UpdateTool::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000038, "Member 'WBP_ToolItem_CM_C_UpdateTool::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, CallFunc_NotEqual_SoftObjectReference_ReturnValue) == 0x000040, "Member 'WBP_ToolItem_CM_C_UpdateTool::CallFunc_NotEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000048, "Member 'WBP_ToolItem_CM_C_UpdateTool::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_ToolItem_CM_C_UpdateTool::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, CallFunc_UpdateVisibility_bAnythingVisible) == 0x000051, "Member 'WBP_ToolItem_CM_C_UpdateTool::CallFunc_UpdateVisibility_bAnythingVisible' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, K2Node_Select_Default) == 0x000052, "Member 'WBP_ToolItem_CM_C_UpdateTool::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateTool, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000053, "Member 'WBP_ToolItem_CM_C_UpdateTool::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_ToolItem_CM.WBP_ToolItem_CM_C.UpdateVisibility
// 0x0030 (0x0030 - 0x0000)
struct WBP_ToolItem_CM_C_UpdateVisibility final
{
public:
	bool                                          bAnythingVisible;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BCF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD0[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolItem_CM_C_UpdateVisibility) == 0x000008, "Wrong alignment on WBP_ToolItem_CM_C_UpdateVisibility");
static_assert(sizeof(WBP_ToolItem_CM_C_UpdateVisibility) == 0x000030, "Wrong size on WBP_ToolItem_CM_C_UpdateVisibility");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateVisibility, bAnythingVisible) == 0x000000, "Member 'WBP_ToolItem_CM_C_UpdateVisibility::bAnythingVisible' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateVisibility, Temp_real_Variable) == 0x000008, "Member 'WBP_ToolItem_CM_C_UpdateVisibility::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolItem_CM_C_UpdateVisibility, Temp_real_Variable_1) == 0x000010, "Member 'WBP_ToolItem_CM_C_UpdateVisibility::Temp_real_Variable_1' has a wrong offset!");
