#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StoreItemSlot_CM

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature final
{
public:
	class UWBP_ListItemButton_CM_C*               Param_ListItemButton;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature, Param_ListItemButton) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature::Param_ListItemButton' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_7_OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_7_OnUnhovered__DelegateSignature final
{
public:
	class UWBP_ListItemButton_CM_C*               Param_ListItemButton;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_7_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_7_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_7_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_7_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_7_OnUnhovered__DelegateSignature, Param_ListItemButton) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_7_OnUnhovered__DelegateSignature::Param_ListItemButton' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature final
{
public:
	class UWBP_ListItemButton_CM_C*               Param_ListItemButton;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature, Param_ListItemButton) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature::Param_ListItemButton' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature final
{
public:
	class UWBP_ListItemButton_CM_C*               Param_ListItemButton;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature) == 0x000008, "Wrong size on WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature, Param_ListItemButton) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_ListItemButton_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature::Param_ListItemButton' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.BndEvt__WBP_StoreItemSlot_CM_WBP_ItemSlot_K2Node_ComponentBoundEvent_5_OnLeftClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_WBP_ItemSlot_K2Node_ComponentBoundEvent_5_OnLeftClicked__DelegateSignature final
{
public:
	class UWBP_ItemSlot_CM_C*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_WBP_ItemSlot_K2Node_ComponentBoundEvent_5_OnLeftClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_WBP_ItemSlot_K2Node_ComponentBoundEvent_5_OnLeftClicked__DelegateSignature");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_WBP_ItemSlot_K2Node_ComponentBoundEvent_5_OnLeftClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_WBP_ItemSlot_K2Node_ComponentBoundEvent_5_OnLeftClicked__DelegateSignature");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_WBP_ItemSlot_K2Node_ComponentBoundEvent_5_OnLeftClicked__DelegateSignature, Param_Slot) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_BndEvt__WBP_StoreItemSlot_CM_WBP_ItemSlot_K2Node_ComponentBoundEvent_5_OnLeftClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_StoreItemSlot_CM_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_StoreItemSlot_CM_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_StoreItemSlot_CM_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_StoreItemSlot_CM_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_StoreItemSlot_CM_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_StoreItemSlot_CM_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.ExecuteUbergraph_WBP_StoreItemSlot_CM
// 0x0300 (0x0300 - 0x0000)
struct WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_435F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4360[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_VillagerStore_CM_C*                K2Node_DynamicCast_AsWBP_Villager_Store_CM;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4361[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4362[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_StoreItemSlot_ListItem_C*           K2Node_DynamicCast_AsBP_Store_Item_Slot_List_Item; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4363[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsHovering;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4364[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_ItemSlotStyle*                   Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_ItemSlotStyle*                   Temp_object_Variable_1;                            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_bSelected;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRecipe_IsRecipe;                        // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRecipe_IsRecipe_1;                      // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4365[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  Temp_object_Variable_2;                            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_ItemSlotStyle*                   K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  Temp_object_Variable_3;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4366[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  K2Node_Select_Default_1;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemSlot_CM_C*                     K2Node_ComponentBoundEvent_Slot;                   // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListItemButton_CM_C*               K2Node_ComponentBoundEvent_ListItemButton_3;       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListItemButton_CM_C*               K2Node_ComponentBoundEvent_ListItemButton_2;       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListItemButton_CM_C*               K2Node_ComponentBoundEvent_ListItemButton_1;       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ListItemButton_CM_C*               K2Node_ComponentBoundEvent_ListItemButton;         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStoreItem                             CallFunc_GetStoreItem_StoreItem;                   // 0x00E8(0x00F8)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetCostIcon_Icon;                         // 0x01E0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRecipeUnlocked_ReturnValue;             // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4367[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0210(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4368[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_2;                           // 0x0238(0x0018)()
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemOwned_ReturnValue;                  // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4369[0x6];                                     // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0260(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_436A[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_436B[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02D0(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x02E8(0x0018)()
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM) == 0x000300, "Wrong size on WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, EntryPoint) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, Temp_text_Variable) == 0x000008, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_GetOuterObject_ReturnValue) == 0x000028, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_DynamicCast_AsWBP_Villager_Store_CM) == 0x000030, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_DynamicCast_AsWBP_Villager_Store_CM' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_Event_ListItemObject) == 0x000040, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_Event_bIsSelected) == 0x000048, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_DynamicCast_AsBP_Store_Item_Slot_List_Item) == 0x000050, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_DynamicCast_AsBP_Store_Item_Slot_List_Item' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_GetOwningListView_ReturnValue) == 0x000060, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_GetListItemObject_ReturnValue) == 0x000068, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_DynamicCast_AsList_View) == 0x000070, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_CustomEvent_IsHovering) == 0x000079, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_CustomEvent_IsHovering' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_Event_IsDesignTime) == 0x00007A, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, Temp_bool_Variable) == 0x00007B, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, Temp_bool_Variable_1) == 0x00007C, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, Temp_object_Variable) == 0x000080, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, Temp_object_Variable_1) == 0x000088, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_IsSelected_bSelected) == 0x000090, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_IsSelected_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_Event_bIsExpanded) == 0x000091, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_IsRecipe_IsRecipe) == 0x000092, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_IsRecipe_IsRecipe' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_IsRecipe_IsRecipe_1) == 0x000093, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_IsRecipe_IsRecipe_1' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, Temp_bool_Variable_2) == 0x000094, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, Temp_object_Variable_2) == 0x000098, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_Select_Default) == 0x0000A0, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, Temp_object_Variable_3) == 0x0000A8, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, Temp_bool_Variable_3) == 0x0000B0, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_Select_Default_1) == 0x0000B8, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_ComponentBoundEvent_Slot) == 0x0000C0, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_ComponentBoundEvent_Slot' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_ComponentBoundEvent_ListItemButton_3) == 0x0000C8, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_ComponentBoundEvent_ListItemButton_3' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_ComponentBoundEvent_ListItemButton_2) == 0x0000D0, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_ComponentBoundEvent_ListItemButton_2' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_ComponentBoundEvent_ListItemButton_1) == 0x0000D8, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_ComponentBoundEvent_ListItemButton_1' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_ComponentBoundEvent_ListItemButton) == 0x0000E0, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_ComponentBoundEvent_ListItemButton' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_GetStoreItem_StoreItem) == 0x0000E8, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_GetStoreItem_StoreItem' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_GetCostIcon_Icon) == 0x0001E0, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_GetCostIcon_Icon' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_Not_PreBool_ReturnValue) == 0x000208, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000209, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_Not_PreBool_ReturnValue_1) == 0x00020A, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_IsRecipeUnlocked_ReturnValue) == 0x00020B, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_IsRecipeUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_Conv_IntToText_ReturnValue) == 0x000210, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000228, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000230, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_Select_Default_2) == 0x000238, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000250, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_DynamicCast_bSuccess_3) == 0x000258, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_IsItemOwned_ReturnValue) == 0x000259, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_IsItemOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_MakeStruct_FormatArgumentData) == 0x000260, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_BooleanAND_ReturnValue) == 0x0002B0, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_MakeArray_Array) == 0x0002B8, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_BooleanOR_ReturnValue) == 0x0002C8, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, CallFunc_Format_ReturnValue) == 0x0002D0, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM, K2Node_Select_Default_3) == 0x0002E8, "Member 'WBP_StoreItemSlot_CM_C_ExecuteUbergraph_WBP_StoreItemSlot_CM::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.GetStoreItem
// 0x0210 (0x0210 - 0x0000)
struct WBP_StoreItemSlot_CM_C_GetStoreItem final
{
public:
	struct FStoreItem                             StoreItem;                                         // 0x0000(0x00F8)(Parm, OutParm)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_436C[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_436D[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVillagerStoreComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStoreItem                             CallFunc_Array_Get_Item;                           // 0x0118(0x00F8)()
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_GetStoreItem) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_GetStoreItem");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_GetStoreItem) == 0x000210, "Wrong size on WBP_StoreItemSlot_CM_C_GetStoreItem");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_GetStoreItem, StoreItem) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_GetStoreItem::StoreItem' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_GetStoreItem, CallFunc_GetValeriaCharacter_OutResult) == 0x0000F8, "Member 'WBP_StoreItemSlot_CM_C_GetStoreItem::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_GetStoreItem, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000100, "Member 'WBP_StoreItemSlot_CM_C_GetStoreItem::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_GetStoreItem, K2Node_SwitchEnum_CmpSuccess) == 0x000108, "Member 'WBP_StoreItemSlot_CM_C_GetStoreItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_GetStoreItem, CallFunc_GetComponentByClass_ReturnValue) == 0x000110, "Member 'WBP_StoreItemSlot_CM_C_GetStoreItem::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_GetStoreItem, CallFunc_Array_Get_Item) == 0x000118, "Member 'WBP_StoreItemSlot_CM_C_GetStoreItem::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.GetTooltipWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_StoreItemSlot_CM_C_GetTooltipWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_GetTooltipWidget) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_GetTooltipWidget");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_GetTooltipWidget) == 0x000008, "Wrong size on WBP_StoreItemSlot_CM_C_GetTooltipWidget");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_GetTooltipWidget, ReturnValue) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_GetTooltipWidget::ReturnValue' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.HandleCustomNavigationRight
// 0x0030 (0x0030 - 0x0000)
struct WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_436E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_436F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_VillagerStore_CM_C*                K2Node_DynamicCast_AsWBP_Villager_Store_CM;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight) == 0x000030, "Wrong size on WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight, Param_Navigation) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight, ReturnValue) == 0x000008, "Member 'WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight, CallFunc_GetOuterObject_ReturnValue) == 0x000010, "Member 'WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight, K2Node_DynamicCast_AsWBP_Villager_Store_CM) == 0x000020, "Member 'WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight::K2Node_DynamicCast_AsWBP_Villager_Store_CM' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_StoreItemSlot_CM_C_HandleCustomNavigationRight::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.HandleHoverStateChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_StoreItemSlot_CM_C_HandleHoverStateChanged final
{
public:
	bool                                          New_Is_Hovering;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasHovering;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_HandleHoverStateChanged) == 0x000001, "Wrong alignment on WBP_StoreItemSlot_CM_C_HandleHoverStateChanged");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_HandleHoverStateChanged) == 0x000002, "Wrong size on WBP_StoreItemSlot_CM_C_HandleHoverStateChanged");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_HandleHoverStateChanged, New_Is_Hovering) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_HandleHoverStateChanged::New_Is_Hovering' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_HandleHoverStateChanged, WasHovering) == 0x000001, "Member 'WBP_StoreItemSlot_CM_C_HandleHoverStateChanged::WasHovering' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.IsRecipe
// 0x0108 (0x0108 - 0x0000)
struct WBP_StoreItemSlot_CM_C_IsRecipe final
{
public:
	bool                                          Param_IsRecipe;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4370[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStoreItem                             CallFunc_GetStoreItem_StoreItem;                   // 0x0008(0x00F8)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_IsRecipe) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_IsRecipe");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_IsRecipe) == 0x000108, "Wrong size on WBP_StoreItemSlot_CM_C_IsRecipe");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_IsRecipe, Param_IsRecipe) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_IsRecipe::Param_IsRecipe' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_IsRecipe, CallFunc_GetStoreItem_StoreItem) == 0x000008, "Member 'WBP_StoreItemSlot_CM_C_IsRecipe::CallFunc_GetStoreItem_StoreItem' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_IsRecipe, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000100, "Member 'WBP_StoreItemSlot_CM_C_IsRecipe::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.OnHoverStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_StoreItemSlot_CM_C_OnHoverStateChanged final
{
public:
	bool                                          IsHovering;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_OnHoverStateChanged) == 0x000001, "Wrong alignment on WBP_StoreItemSlot_CM_C_OnHoverStateChanged");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_OnHoverStateChanged) == 0x000001, "Wrong size on WBP_StoreItemSlot_CM_C_OnHoverStateChanged");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_OnHoverStateChanged, IsHovering) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_OnHoverStateChanged::IsHovering' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_StoreItemSlot_CM_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_OnListItemObjectSet");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_StoreItemSlot_CM_C_OnListItemObjectSet");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_StoreItemSlot_CM_C_OnSelected__DelegateSignature final
{
public:
	class UWBP_StoreItemSlot_CM_C*                ItemSlot;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_OnSelected__DelegateSignature");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_OnSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_StoreItemSlot_CM_C_OnSelected__DelegateSignature");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_OnSelected__DelegateSignature, ItemSlot) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_OnSelected__DelegateSignature::ItemSlot' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.OpenTooltip
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_StoreItemSlot_CM_C_OpenTooltip final
{
public:
	struct FStoreItem                             CallFunc_GetStoreItem_StoreItem;                   // 0x0000(0x00F8)()
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_OpenTooltip) == 0x000008, "Wrong alignment on WBP_StoreItemSlot_CM_C_OpenTooltip");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_OpenTooltip) == 0x0000F8, "Wrong size on WBP_StoreItemSlot_CM_C_OpenTooltip");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_OpenTooltip, CallFunc_GetStoreItem_StoreItem) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_OpenTooltip::CallFunc_GetStoreItem_StoreItem' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_StoreItemSlot_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_StoreItemSlot_CM_C_PreConstruct");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_StoreItemSlot_CM_C_PreConstruct");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.SetCustomNavigation
// 0x0010 (0x0010 - 0x0000)
struct WBP_StoreItemSlot_CM_C_SetCustomNavigation final
{
public:
	TDelegate<void(EUINavigation Navigation)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_SetCustomNavigation) == 0x000004, "Wrong alignment on WBP_StoreItemSlot_CM_C_SetCustomNavigation");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_SetCustomNavigation) == 0x000010, "Wrong size on WBP_StoreItemSlot_CM_C_SetCustomNavigation");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_SetCustomNavigation, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_SetCustomNavigation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.UpdatePriceBorder
// 0x0170 (0x0170 - 0x0000)
struct WBP_StoreItemSlot_CM_C_UpdatePriceBorder final
{
public:
	bool                                          ShouldShowBorder;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4371[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0014)()
	uint8                                         Pad_4372[0xC];                                     // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrushOutlineSettings             K2Node_MakeStruct_SlateBrushOutlineSettings;       // 0x0050(0x0040)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0090(0x00D0)()
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast_1;                // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_UpdatePriceBorder) == 0x000010, "Wrong alignment on WBP_StoreItemSlot_CM_C_UpdatePriceBorder");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_UpdatePriceBorder) == 0x000170, "Wrong size on WBP_StoreItemSlot_CM_C_UpdatePriceBorder");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdatePriceBorder, ShouldShowBorder) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_UpdatePriceBorder::ShouldShowBorder' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdatePriceBorder, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_StoreItemSlot_CM_C_UpdatePriceBorder::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdatePriceBorder, K2Node_MakeStruct_LinearColor) == 0x000010, "Member 'WBP_StoreItemSlot_CM_C_UpdatePriceBorder::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdatePriceBorder, K2Node_MakeStruct_LinearColor_1) == 0x000020, "Member 'WBP_StoreItemSlot_CM_C_UpdatePriceBorder::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdatePriceBorder, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'WBP_StoreItemSlot_CM_C_UpdatePriceBorder::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdatePriceBorder, K2Node_MakeStruct_SlateBrushOutlineSettings) == 0x000050, "Member 'WBP_StoreItemSlot_CM_C_UpdatePriceBorder::K2Node_MakeStruct_SlateBrushOutlineSettings' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdatePriceBorder, K2Node_MakeStruct_SlateBrush) == 0x000090, "Member 'WBP_StoreItemSlot_CM_C_UpdatePriceBorder::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdatePriceBorder, K2Node_MakeStruct_A_ImplicitCast) == 0x000160, "Member 'WBP_StoreItemSlot_CM_C_UpdatePriceBorder::K2Node_MakeStruct_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdatePriceBorder, K2Node_MakeStruct_A_ImplicitCast_1) == 0x000164, "Member 'WBP_StoreItemSlot_CM_C_UpdatePriceBorder::K2Node_MakeStruct_A_ImplicitCast_1' has a wrong offset!");

// Function WBP_StoreItemSlot_CM.WBP_StoreItemSlot_CM_C.UpdateRequirementBorder
// 0x0160 (0x0160 - 0x0000)
struct WBP_StoreItemSlot_CM_C_UpdateRequirementBorder final
{
public:
	bool                                          ShouldBeRed;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4373[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           RedColor;                                          // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BlueColor;                                         // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0034(0x0014)()
	uint8                                         Pad_4374[0x8];                                     // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrushOutlineSettings             K2Node_MakeStruct_SlateBrushOutlineSettings;       // 0x0050(0x0040)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0090(0x00D0)()
};
static_assert(alignof(WBP_StoreItemSlot_CM_C_UpdateRequirementBorder) == 0x000010, "Wrong alignment on WBP_StoreItemSlot_CM_C_UpdateRequirementBorder");
static_assert(sizeof(WBP_StoreItemSlot_CM_C_UpdateRequirementBorder) == 0x000160, "Wrong size on WBP_StoreItemSlot_CM_C_UpdateRequirementBorder");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdateRequirementBorder, ShouldBeRed) == 0x000000, "Member 'WBP_StoreItemSlot_CM_C_UpdateRequirementBorder::ShouldBeRed' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdateRequirementBorder, RedColor) == 0x000004, "Member 'WBP_StoreItemSlot_CM_C_UpdateRequirementBorder::RedColor' has a wrong offset!");
static_assert(offsetof(WBP_StoreItemSlot_CM_C_UpdateRequirementBorder, BlueColor) == 0x000014, "Member 'WBP_StoreItemSlot_CM_C_UpdateRequirementBorder::BlueColor' has a wrong offset!");
