#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FTUESettings_PF

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.BndEvt__WBP_FTUESettings_CM_Checkbox_EnableTips_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_CM_Checkbox_EnableTips_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_CM_Checkbox_EnableTips_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_CM_Checkbox_EnableTips_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_CM_Checkbox_EnableTips_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_CM_Checkbox_EnableTips_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_CM_Checkbox_EnableTips_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_CM_Checkbox_EnableTips_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.BndEvt__WBP_FTUESettings_PF_ListView_FTUEFlags_01_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_PF_ListView_FTUEFlags_01_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_PF_ListView_FTUEFlags_01_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_PF_ListView_FTUEFlags_01_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_PF_ListView_FTUEFlags_01_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_PF_ListView_FTUEFlags_01_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_PF_ListView_FTUEFlags_01_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_PF_ListView_FTUEFlags_01_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_PF_ListView_FTUEFlags_01_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_FTUESettings_PF_C_BndEvt__WBP_FTUESettings_PF_ListView_FTUEFlags_01_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.ExecuteUbergraph_WBP_FTUESettings_PF
// 0x0178 (0x0178 - 0x0000)
struct WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F5[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0018(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F6[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F7[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0098(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x00C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F8[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F9[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_TutorialFlagDefinition*            K2Node_DynamicCast_AsVAL_Tutorial_Flag_Definition; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55FA[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_TutorialFlagDefinition> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0118(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsFlagSet_ReturnValue;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55FB[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55FC[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_FTUEFlagListEntry_C*               K2Node_DynamicCast_AsWBP_FTUEFlag_List_Entry;      // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF) == 0x000008, "Wrong alignment on WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF");
static_assert(sizeof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF) == 0x000178, "Wrong size on WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, EntryPoint) == 0x000000, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_bool_Variable) == 0x000014, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000018, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000038, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00003C, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000040, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_object_Variable) == 0x000048, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000050, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_real_Variable) == 0x000058, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_real_Variable_1) == 0x000060, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_real_Variable_0) == 0x000068, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_real_Variable_1_0) == 0x000070, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_bool_Variable_1) == 0x000078, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_real_Variable_2) == 0x000080, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_real_Variable_3) == 0x000088, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_object_Variable_1) == 0x000090, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000098, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x0000B8, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x0000BC, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x0000C0, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_real_Variable_3_0) == 0x0000C8, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, Temp_real_Variable_2_0) == 0x0000D0, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000D8, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, CallFunc_AkEventGlobal_ReturnValue) == 0x0000DC, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, CallFunc_AkEventGlobal_ReturnValue_1) == 0x0000E0, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_ComponentBoundEvent_Checked) == 0x0000E4, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_ComponentBoundEvent_Checked' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000E8, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0000F0, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x0000F8, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000100, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_DynamicCast_AsVAL_Tutorial_Flag_Definition) == 0x000108, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_DynamicCast_AsVAL_Tutorial_Flag_Definition' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000118, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, CallFunc_IsFlagSet_ReturnValue) == 0x000140, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::CallFunc_IsFlagSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_CreateDelegate_OutputDelegate_1) == 0x000144, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, CallFunc_Not_PreBool_ReturnValue) == 0x000154, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_ComponentBoundEvent_Item) == 0x000158, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_ComponentBoundEvent_Widget) == 0x000160, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_DynamicCast_AsWBP_FTUEFlag_List_Entry) == 0x000168, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_DynamicCast_AsWBP_FTUEFlag_List_Entry' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'WBP_FTUESettings_PF_C_ExecuteUbergraph_WBP_FTUESettings_PF::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.Get Scroll Offset
// 0x0008 (0x0008 - 0x0000)
struct WBP_FTUESettings_PF_C_Get_Scroll_Offset final
{
public:
	float                                         Offset;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_of_End;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_Get_Scroll_Offset) == 0x000004, "Wrong alignment on WBP_FTUESettings_PF_C_Get_Scroll_Offset");
static_assert(sizeof(WBP_FTUESettings_PF_C_Get_Scroll_Offset) == 0x000008, "Wrong size on WBP_FTUESettings_PF_C_Get_Scroll_Offset");
static_assert(offsetof(WBP_FTUESettings_PF_C_Get_Scroll_Offset, Offset) == 0x000000, "Member 'WBP_FTUESettings_PF_C_Get_Scroll_Offset::Offset' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_Get_Scroll_Offset, Offset_of_End) == 0x000004, "Member 'WBP_FTUESettings_PF_C_Get_Scroll_Offset::Offset_of_End' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.HandleFTUEFlagsChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_FTUESettings_PF_C_HandleFTUEFlagsChanged final
{
public:
	class UVAL_TutorialFlagsManager*              FTUEFlagsManager;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_HandleFTUEFlagsChanged) == 0x000008, "Wrong alignment on WBP_FTUESettings_PF_C_HandleFTUEFlagsChanged");
static_assert(sizeof(WBP_FTUESettings_PF_C_HandleFTUEFlagsChanged) == 0x000008, "Wrong size on WBP_FTUESettings_PF_C_HandleFTUEFlagsChanged");
static_assert(offsetof(WBP_FTUESettings_PF_C_HandleFTUEFlagsChanged, FTUEFlagsManager) == 0x000000, "Member 'WBP_FTUESettings_PF_C_HandleFTUEFlagsChanged::FTUEFlagsManager' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_FTUESettings_PF_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.OnCheckmarkNavigationDown
// 0x0010 (0x0010 - 0x0000)
struct WBP_FTUESettings_PF_C_OnCheckmarkNavigationDown final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55FD[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_OnCheckmarkNavigationDown) == 0x000008, "Wrong alignment on WBP_FTUESettings_PF_C_OnCheckmarkNavigationDown");
static_assert(sizeof(WBP_FTUESettings_PF_C_OnCheckmarkNavigationDown) == 0x000010, "Wrong size on WBP_FTUESettings_PF_C_OnCheckmarkNavigationDown");
static_assert(offsetof(WBP_FTUESettings_PF_C_OnCheckmarkNavigationDown, Param_Navigation) == 0x000000, "Member 'WBP_FTUESettings_PF_C_OnCheckmarkNavigationDown::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_OnCheckmarkNavigationDown, ReturnValue) == 0x000008, "Member 'WBP_FTUESettings_PF_C_OnCheckmarkNavigationDown::ReturnValue' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.OnFocusedItemChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_FTUESettings_PF_C_OnFocusedItemChanged__DelegateSignature final
{
public:
	bool                                          IsFTUEFlag;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_OnFocusedItemChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_FTUESettings_PF_C_OnFocusedItemChanged__DelegateSignature");
static_assert(sizeof(WBP_FTUESettings_PF_C_OnFocusedItemChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_FTUESettings_PF_C_OnFocusedItemChanged__DelegateSignature");
static_assert(offsetof(WBP_FTUESettings_PF_C_OnFocusedItemChanged__DelegateSignature, IsFTUEFlag) == 0x000000, "Member 'WBP_FTUESettings_PF_C_OnFocusedItemChanged__DelegateSignature::IsFTUEFlag' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.PopulateFTUEFlagsList
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_FTUESettings_PF_C_PopulateFTUEFlagsList final
{
public:
	TArray<class UObject*>                        HalfFTUEFlagsArray_02;                             // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class UObject*>                        HalfFTUEFlagsArray_01;                             // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55FE[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<TSoftObjectPtr<class UVAL_TutorialFlagDefinition>> CallFunc_GetAllPossibleFlags_ReturnValue;          // 0x0038(0x0050)()
	TArray<TSoftObjectPtr<class UVAL_TutorialFlagDefinition>> CallFunc_Set_ToArray_Result;                       // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55FF[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_TutorialFlagDefinition> CallFunc_Array_Get_Item;                           // 0x00A0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5600[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList) == 0x000008, "Wrong alignment on WBP_FTUESettings_PF_C_PopulateFTUEFlagsList");
static_assert(sizeof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList) == 0x0000E0, "Wrong size on WBP_FTUESettings_PF_C_PopulateFTUEFlagsList");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, HalfFTUEFlagsArray_02) == 0x000000, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::HalfFTUEFlagsArray_02' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, HalfFTUEFlagsArray_01) == 0x000010, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::HalfFTUEFlagsArray_01' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000030, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, CallFunc_GetAllPossibleFlags_ReturnValue) == 0x000038, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::CallFunc_GetAllPossibleFlags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, CallFunc_Set_ToArray_Result) == 0x000088, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000D0, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_PopulateFTUEFlagsList, CallFunc_Array_Add_ReturnValue) == 0x0000D8, "Member 'WBP_FTUESettings_PF_C_PopulateFTUEFlagsList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.Set Scroll Offset
// 0x0004 (0x0004 - 0x0000)
struct WBP_FTUESettings_PF_C_Set_Scroll_Offset final
{
public:
	float                                         Offset;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_Set_Scroll_Offset) == 0x000004, "Wrong alignment on WBP_FTUESettings_PF_C_Set_Scroll_Offset");
static_assert(sizeof(WBP_FTUESettings_PF_C_Set_Scroll_Offset) == 0x000004, "Wrong size on WBP_FTUESettings_PF_C_Set_Scroll_Offset");
static_assert(offsetof(WBP_FTUESettings_PF_C_Set_Scroll_Offset, Offset) == 0x000000, "Member 'WBP_FTUESettings_PF_C_Set_Scroll_Offset::Offset' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.SetNavigation
// 0x0010 (0x0010 - 0x0000)
struct WBP_FTUESettings_PF_C_SetNavigation final
{
public:
	TDelegate<void(EUINavigation Navigation)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_SetNavigation) == 0x000004, "Wrong alignment on WBP_FTUESettings_PF_C_SetNavigation");
static_assert(sizeof(WBP_FTUESettings_PF_C_SetNavigation) == 0x000010, "Wrong size on WBP_FTUESettings_PF_C_SetNavigation");
static_assert(offsetof(WBP_FTUESettings_PF_C_SetNavigation, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_FTUESettings_PF_C_SetNavigation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.SynchronizeState
// 0x0050 (0x0050 - 0x0000)
struct WBP_FTUESettings_PF_C_SynchronizeState final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5601[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsTutorialEnabled_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5602[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_FTUEFlagListEntry_C*               K2Node_DynamicCast_AsWBP_FTUEFlag_List_Entry;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5603[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_SynchronizeState) == 0x000008, "Wrong alignment on WBP_FTUESettings_PF_C_SynchronizeState");
static_assert(sizeof(WBP_FTUESettings_PF_C_SynchronizeState) == 0x000050, "Wrong size on WBP_FTUESettings_PF_C_SynchronizeState");
static_assert(offsetof(WBP_FTUESettings_PF_C_SynchronizeState, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_FTUESettings_PF_C_SynchronizeState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_SynchronizeState, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_FTUESettings_PF_C_SynchronizeState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_SynchronizeState, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_FTUESettings_PF_C_SynchronizeState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_SynchronizeState, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'WBP_FTUESettings_PF_C_SynchronizeState::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_SynchronizeState, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000018, "Member 'WBP_FTUESettings_PF_C_SynchronizeState::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_SynchronizeState, CallFunc_IsTutorialEnabled_ReturnValue) == 0x000028, "Member 'WBP_FTUESettings_PF_C_SynchronizeState::CallFunc_IsTutorialEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_SynchronizeState, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_FTUESettings_PF_C_SynchronizeState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_SynchronizeState, K2Node_DynamicCast_AsWBP_FTUEFlag_List_Entry) == 0x000038, "Member 'WBP_FTUESettings_PF_C_SynchronizeState::K2Node_DynamicCast_AsWBP_FTUEFlag_List_Entry' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_SynchronizeState, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_FTUESettings_PF_C_SynchronizeState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_SynchronizeState, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WBP_FTUESettings_PF_C_SynchronizeState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FTUESettings_PF_C_SynchronizeState, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_FTUESettings_PF_C_SynchronizeState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_FTUESettings_PF.WBP_FTUESettings_PF_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_FTUESettings_PF_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FTUESettings_PF_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_FTUESettings_PF_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_FTUESettings_PF_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_FTUESettings_PF_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_FTUESettings_PF_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_FTUESettings_PF_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

