#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dynamic2DDropShadow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Dynamic2DDropShadow.WBP_Dynamic2DDropShadow_C.ExecuteUbergraph_WBP_Dynamic2DDropShadow
// 0x0210 (0x0210 - 0x0000)
struct WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C4[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C5[0xF];                                     // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Copy_ReturnValue;                           // 0x0030(0x00D0)()
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C6[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_SetFieldsInStruct_StructOut;                // 0x0110(0x00D0)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x01E0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow) == 0x000010, "Wrong alignment on WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow");
static_assert(sizeof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow) == 0x000210, "Wrong size on WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow, EntryPoint) == 0x000000, "Member 'WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000018, "Member 'WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow, K2Node_Copy_ReturnValue) == 0x000030, "Member 'WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow::K2Node_Copy_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow, K2Node_DynamicCast_AsTexture_2D) == 0x000100, "Member 'WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow, K2Node_SetFieldsInStruct_StructOut) == 0x000110, "Member 'WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0001E0, "Member 'WBP_Dynamic2DDropShadow_C_ExecuteUbergraph_WBP_Dynamic2DDropShadow::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");

// Function WBP_Dynamic2DDropShadow.WBP_Dynamic2DDropShadow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Dynamic2DDropShadow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dynamic2DDropShadow_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Dynamic2DDropShadow_C_PreConstruct");
static_assert(sizeof(WBP_Dynamic2DDropShadow_C_PreConstruct) == 0x000001, "Wrong size on WBP_Dynamic2DDropShadow_C_PreConstruct");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Dynamic2DDropShadow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Dynamic2DDropShadow.WBP_Dynamic2DDropShadow_C.SetImageTexture
// 0x0040 (0x0040 - 0x0000)
struct WBP_Dynamic2DDropShadow_C_SetImageTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              NewSoftTexture;                                    // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dynamic2DDropShadow_C_SetImageTexture) == 0x000008, "Wrong alignment on WBP_Dynamic2DDropShadow_C_SetImageTexture");
static_assert(sizeof(WBP_Dynamic2DDropShadow_C_SetImageTexture) == 0x000040, "Wrong size on WBP_Dynamic2DDropShadow_C_SetImageTexture");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_SetImageTexture, NewSoftTexture) == 0x000000, "Member 'WBP_Dynamic2DDropShadow_C_SetImageTexture::NewSoftTexture' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_SetImageTexture, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000028, "Member 'WBP_Dynamic2DDropShadow_C_SetImageTexture::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_SetImageTexture, K2Node_DynamicCast_AsTexture_2D) == 0x000030, "Member 'WBP_Dynamic2DDropShadow_C_SetImageTexture::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_SetImageTexture, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_Dynamic2DDropShadow_C_SetImageTexture::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Dynamic2DDropShadow.WBP_Dynamic2DDropShadow_C.SetShadowTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Dynamic2DDropShadow_C_SetShadowTexture final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dynamic2DDropShadow_C_SetShadowTexture) == 0x000008, "Wrong alignment on WBP_Dynamic2DDropShadow_C_SetShadowTexture");
static_assert(sizeof(WBP_Dynamic2DDropShadow_C_SetShadowTexture) == 0x000008, "Wrong size on WBP_Dynamic2DDropShadow_C_SetShadowTexture");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_SetShadowTexture, Texture) == 0x000000, "Member 'WBP_Dynamic2DDropShadow_C_SetShadowTexture::Texture' has a wrong offset!");

// Function WBP_Dynamic2DDropShadow.WBP_Dynamic2DDropShadow_C.UpdateDropShadow
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Dynamic2DDropShadow_C_UpdateDropShadow final
{
public:
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C7[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
};
static_assert(alignof(WBP_Dynamic2DDropShadow_C_UpdateDropShadow) == 0x000010, "Wrong alignment on WBP_Dynamic2DDropShadow_C_UpdateDropShadow");
static_assert(sizeof(WBP_Dynamic2DDropShadow_C_UpdateDropShadow) == 0x0000E0, "Wrong size on WBP_Dynamic2DDropShadow_C_UpdateDropShadow");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_UpdateDropShadow, K2Node_DynamicCast_AsTexture_2D) == 0x000000, "Member 'WBP_Dynamic2DDropShadow_C_UpdateDropShadow::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_UpdateDropShadow, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'WBP_Dynamic2DDropShadow_C_UpdateDropShadow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_UpdateDropShadow, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_Dynamic2DDropShadow_C_UpdateDropShadow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dynamic2DDropShadow_C_UpdateDropShadow, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'WBP_Dynamic2DDropShadow_C_UpdateDropShadow::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

}

