#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoginRetryPanel_PF

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoginRetryPanel_PF.WBP_LoginRetryPanel_PF_C
// 0x0050 (0x0460 - 0x0410)
class UWBP_LoginRetryPanel_PF_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Retry_CM;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Container;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeftArrow;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RightArrow;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Error;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Header;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Notification_Basic_Error_C* WBP_Template_Notification_Basic_Error;             // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnRetryClicked;                                    // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_LoginRetryPanel_PF_Button_Retry_CM_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_LoginRetryPanel_PF(int32 EntryPoint);
	void OnRetryClicked__DelegateSignature();
	void UpdateContentText(class FText New_Text, bool bUseDefaultText, class FText DefaultText, bool Temp_bool_Variable, bool CallFunc_TextIsEmpty_ReturnValue, class FText K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoginRetryPanel_PF_C">();
	}
	static class UWBP_LoginRetryPanel_PF_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoginRetryPanel_PF_C>();
	}
};
static_assert(alignof(UWBP_LoginRetryPanel_PF_C) == 0x000008, "Wrong alignment on UWBP_LoginRetryPanel_PF_C");
static_assert(sizeof(UWBP_LoginRetryPanel_PF_C) == 0x000460, "Wrong size on UWBP_LoginRetryPanel_PF_C");
static_assert(offsetof(UWBP_LoginRetryPanel_PF_C, UberGraphFrame) == 0x000410, "Member 'UWBP_LoginRetryPanel_PF_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoginRetryPanel_PF_C, Button_Retry_CM) == 0x000418, "Member 'UWBP_LoginRetryPanel_PF_C::Button_Retry_CM' has a wrong offset!");
static_assert(offsetof(UWBP_LoginRetryPanel_PF_C, HBox_Container) == 0x000420, "Member 'UWBP_LoginRetryPanel_PF_C::HBox_Container' has a wrong offset!");
static_assert(offsetof(UWBP_LoginRetryPanel_PF_C, Image_LeftArrow) == 0x000428, "Member 'UWBP_LoginRetryPanel_PF_C::Image_LeftArrow' has a wrong offset!");
static_assert(offsetof(UWBP_LoginRetryPanel_PF_C, Image_RightArrow) == 0x000430, "Member 'UWBP_LoginRetryPanel_PF_C::Image_RightArrow' has a wrong offset!");
static_assert(offsetof(UWBP_LoginRetryPanel_PF_C, Text_Error) == 0x000438, "Member 'UWBP_LoginRetryPanel_PF_C::Text_Error' has a wrong offset!");
static_assert(offsetof(UWBP_LoginRetryPanel_PF_C, Text_Header) == 0x000440, "Member 'UWBP_LoginRetryPanel_PF_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UWBP_LoginRetryPanel_PF_C, WBP_Template_Notification_Basic_Error) == 0x000448, "Member 'UWBP_LoginRetryPanel_PF_C::WBP_Template_Notification_Basic_Error' has a wrong offset!");
static_assert(offsetof(UWBP_LoginRetryPanel_PF_C, OnRetryClicked) == 0x000450, "Member 'UWBP_LoginRetryPanel_PF_C::OnRetryClicked' has a wrong offset!");

}

