#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InstanceSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "CommonUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InstanceSelector.WBP_InstanceSelector_C
// 0x0068 (0x0478 - 0x0410)
class UWBP_InstanceSelector_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_EditableTextBox_Styled*          CustomIpBox;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        InstanceDropDown;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Button_Styled*                   RefreshButton;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              SearchLANToggle;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnRefreshClicked;                                  // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnConnectClicked;                                  // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnInstanceSelected;                                // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FBlueprintSessionResult>        SessionSearchResults;                              // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__InstanceDropDown_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__RefreshButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SearchLANToggle_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void Construct();
	void ExecuteUbergraph_WBP_InstanceSelector(int32 EntryPoint, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, TArray<struct FBlueprintSessionResult>& K2Node_CustomEvent_Results_1, TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate, TArray<struct FBlueprintSessionResult>& K2Node_CustomEvent_Results, TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_1, TArray<struct FBlueprintSessionResult>& Temp_struct_Variable, const class FString& K2Node_ComponentBoundEvent_SelectedItem, ESelectInfo K2Node_ComponentBoundEvent_SelectionType, bool CallFunc_EqualEqual_StrStr_ReturnValue, ESlateVisibility K2Node_Select_Default, class APlayerController* CallFunc_GetPlayerController_ReturnValue, bool K2Node_ComponentBoundEvent_bIsChecked, TArray<struct FBlueprintSessionResult>& K2Node_MakeArray_Array, bool CallFunc_IsChecked_ReturnValue, class UFindSessionsCallbackProxy* CallFunc_FindSessions_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void GetSelectedInstanceOption(struct FBlueprintSessionResult* Session, const class FString& SelectedOption, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable, bool CallFunc_Not_PreBool_ReturnValue, TArray<class FString>& CallFunc_ParseIntoArray_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, const class FString& CallFunc_Array_Get_Item, int32 Temp_int_Loop_Counter_Variable, const struct FBlueprintSessionResult& CallFunc_Array_Get_Item_1, const class FString& CallFunc_GetSessionIdString_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class FText CallFunc_GetText_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, const struct FBlueprintSessionResult& CallFunc_CreateSessionResult_ReturnValue, const class FString& CallFunc_GetSelectedOption_ReturnValue);
	void OnConnectClicked__DelegateSignature();
	void OnFailure_EBFCCC514C136190829303A6BDEDEDA4(TArray<struct FBlueprintSessionResult>& Results);
	void OnInstanceSelected__DelegateSignature();
	void OnRefreshClicked__DelegateSignature();
	void OnSuccess_EBFCCC514C136190829303A6BDEDEDA4(TArray<struct FBlueprintSessionResult>& Results);
	void RequestRefreshActiveGameServers();
	void UpdateInstanceOptionList(TArray<struct FBlueprintSessionResult>& SessionResults, const class FString& PreviousSelectedOption, int32 Temp_int_Array_Index_Variable, const struct FBlueprintSessionResult& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const class FString& CallFunc_GetSessionIdString_ReturnValue, const class FString& CallFunc_GetServerName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool CallFunc_IsEmpty_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, const class FString& CallFunc_GetSelectedOption_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InstanceSelector_C">();
	}
	static class UWBP_InstanceSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InstanceSelector_C>();
	}
};
static_assert(alignof(UWBP_InstanceSelector_C) == 0x000008, "Wrong alignment on UWBP_InstanceSelector_C");
static_assert(sizeof(UWBP_InstanceSelector_C) == 0x000478, "Wrong size on UWBP_InstanceSelector_C");
static_assert(offsetof(UWBP_InstanceSelector_C, UberGraphFrame) == 0x000410, "Member 'UWBP_InstanceSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InstanceSelector_C, CustomIpBox) == 0x000418, "Member 'UWBP_InstanceSelector_C::CustomIpBox' has a wrong offset!");
static_assert(offsetof(UWBP_InstanceSelector_C, InstanceDropDown) == 0x000420, "Member 'UWBP_InstanceSelector_C::InstanceDropDown' has a wrong offset!");
static_assert(offsetof(UWBP_InstanceSelector_C, RefreshButton) == 0x000428, "Member 'UWBP_InstanceSelector_C::RefreshButton' has a wrong offset!");
static_assert(offsetof(UWBP_InstanceSelector_C, SearchLANToggle) == 0x000430, "Member 'UWBP_InstanceSelector_C::SearchLANToggle' has a wrong offset!");
static_assert(offsetof(UWBP_InstanceSelector_C, OnRefreshClicked) == 0x000438, "Member 'UWBP_InstanceSelector_C::OnRefreshClicked' has a wrong offset!");
static_assert(offsetof(UWBP_InstanceSelector_C, OnConnectClicked) == 0x000448, "Member 'UWBP_InstanceSelector_C::OnConnectClicked' has a wrong offset!");
static_assert(offsetof(UWBP_InstanceSelector_C, OnInstanceSelected) == 0x000458, "Member 'UWBP_InstanceSelector_C::OnInstanceSelected' has a wrong offset!");
static_assert(offsetof(UWBP_InstanceSelector_C, SessionSearchResults) == 0x000468, "Member 'UWBP_InstanceSelector_C::SessionSearchResults' has a wrong offset!");

}

