#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrafterRecipe_RadialCountdown_Staged

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CrafterRecipe_RadialCountdown_Staged.WBP_CrafterRecipe_RadialCountdown_Staged_C.ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged
// 0x0068 (0x0068 - 0x0000)
struct WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6190[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged) == 0x000004, "Wrong alignment on WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged");
static_assert(sizeof(WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged) == 0x000068, "Wrong size on WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged, EntryPoint) == 0x000000, "Member 'WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged, K2Node_Event_IsDesignTime) == 0x000024, "Member 'WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged, K2Node_Event_MyGeometry) == 0x000028, "Member 'WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged, K2Node_Event_InDeltaTime) == 0x000060, "Member 'WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000064, "Member 'WBP_CrafterRecipe_RadialCountdown_Staged_C_ExecuteUbergraph_WBP_CrafterRecipe_RadialCountdown_Staged::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_CrafterRecipe_RadialCountdown_Staged.WBP_CrafterRecipe_RadialCountdown_Staged_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CrafterRecipe_RadialCountdown_Staged_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipe_RadialCountdown_Staged_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CrafterRecipe_RadialCountdown_Staged_C_PreConstruct");
static_assert(sizeof(WBP_CrafterRecipe_RadialCountdown_Staged_C_PreConstruct) == 0x000001, "Wrong size on WBP_CrafterRecipe_RadialCountdown_Staged_C_PreConstruct");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdown_Staged_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CrafterRecipe_RadialCountdown_Staged_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CrafterRecipe_RadialCountdown_Staged.WBP_CrafterRecipe_RadialCountdown_Staged_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CrafterRecipe_RadialCountdown_Staged_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterRecipe_RadialCountdown_Staged_C_Tick) == 0x000004, "Wrong alignment on WBP_CrafterRecipe_RadialCountdown_Staged_C_Tick");
static_assert(sizeof(WBP_CrafterRecipe_RadialCountdown_Staged_C_Tick) == 0x00003C, "Wrong size on WBP_CrafterRecipe_RadialCountdown_Staged_C_Tick");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdown_Staged_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CrafterRecipe_RadialCountdown_Staged_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CrafterRecipe_RadialCountdown_Staged_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CrafterRecipe_RadialCountdown_Staged_C_Tick::InDeltaTime' has a wrong offset!");

}

