#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonUIButtonPrompt

#include "Basic.hpp"

#include "F_CommonUIButtonPrompt_structs.hpp"
#include "SlateCore_structs.hpp"
#include "S6Core_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.ExecuteUbergraph_WBP_CommonUIButtonPrompt
// 0x0030 (0x0030 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4820[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt) == 0x000030, "Wrong size on WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt, EntryPoint) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt, K2Node_CustomEvent_bNewInputType) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt, CallFunc_GetPlatformType_ReturnValue) == 0x000019, "Member 'WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt, CallFunc_GetCurrentInputType_ReturnValue) == 0x000029, "Member 'WBP_CommonUIButtonPrompt_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.GetCurrentUIButtonPromptArray
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray final
{
public:
	TArray<struct FF_CommonUIButtonPrompt>        ButtonPromptArray;                                 // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FF_CommonUIButtonPrompt>        PromptArray;                                       // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4821[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4822[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4823[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        K2Node_DynamicCast_AsWBP_Common_UIButton_Prompt_Item; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4824[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CommonUIButtonPrompt                CallFunc_GetCurrentPromptInfo_NewParam;            // 0x0068(0x0040)(HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4825[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray) == 0x0000B8, "Wrong size on WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, ButtonPromptArray) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::ButtonPromptArray' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, PromptArray) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::PromptArray' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, CallFunc_GetAllChildren_ReturnValue) == 0x000030, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, K2Node_DynamicCast_AsWBP_Common_UIButton_Prompt_Item) == 0x000058, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::K2Node_DynamicCast_AsWBP_Common_UIButton_Prompt_Item' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, CallFunc_GetCurrentPromptInfo_NewParam) == 0x000068, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::CallFunc_GetCurrentPromptInfo_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, CallFunc_GetVisibility_ReturnValue) == 0x0000A8, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, CallFunc_Array_Add_ReturnValue) == 0x0000AC, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000B0, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000B1, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'WBP_CommonUIButtonPrompt_C_GetCurrentUIButtonPromptArray::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.GetPromptItemByIA
// 0x0080 (0x0080 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_GetPromptItemByIA final
{
public:
	class UInputAction*                           Input_Action;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHold;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4826[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        PromptItem;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4827[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UInputAction*, class UWBP_CommonUIButtonPromptItem_C*> K2Node_Select_Default;                             // 0x0020(0x0050)(ContainsInstancedReference)
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_Map_Find_Value;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_GetPromptItemByIA) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_GetPromptItemByIA");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_GetPromptItemByIA) == 0x000080, "Wrong size on WBP_CommonUIButtonPrompt_C_GetPromptItemByIA");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetPromptItemByIA, Input_Action) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_GetPromptItemByIA::Input_Action' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetPromptItemByIA, IsHold) == 0x000008, "Member 'WBP_CommonUIButtonPrompt_C_GetPromptItemByIA::IsHold' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetPromptItemByIA, PromptItem) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_C_GetPromptItemByIA::PromptItem' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetPromptItemByIA, Temp_bool_Variable) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_C_GetPromptItemByIA::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetPromptItemByIA, K2Node_Select_Default) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_C_GetPromptItemByIA::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetPromptItemByIA, CallFunc_Map_Find_Value) == 0x000070, "Member 'WBP_CommonUIButtonPrompt_C_GetPromptItemByIA::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetPromptItemByIA, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'WBP_CommonUIButtonPrompt_C_GetPromptItemByIA::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.GetSpecialPromptItem
// 0x0028 (0x0028 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem final
{
public:
	class FString                                 SpecialName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        PromptItem;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem) == 0x000028, "Wrong size on WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem, SpecialName) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem::SpecialName' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem, PromptItem) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem::PromptItem' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem, CallFunc_Map_Find_Value) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_C_GetSpecialPromptItem::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.HandleOnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_HandleOnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_HandleOnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_CommonUIButtonPrompt_C_HandleOnInputMethodChanged");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_HandleOnInputMethodChanged) == 0x000001, "Wrong size on WBP_CommonUIButtonPrompt_C_HandleOnInputMethodChanged");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_HandleOnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_HandleOnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.InitUIButtonPromptByArray
// 0x0098 (0x0098 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray final
{
public:
	TArray<struct FF_CommonUIButtonPrompt>        ItemInfos;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4828[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4829[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_Select_Default;                             // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482A[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CommonUIButtonPrompt                CallFunc_Array_Get_Item;                           // 0x0050(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray) == 0x000098, "Wrong size on WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, ItemInfos) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::ItemInfos' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000014, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, Temp_bool_Variable) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000030, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, K2Node_Select_Default) == 0x000038, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray, CallFunc_IsEmpty_ReturnValue) == 0x000091, "Member 'WBP_CommonUIButtonPrompt_C_InitUIButtonPromptByArray::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.IsPromptItemVisible
// 0x0020 (0x0020 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_IsPromptItemVisible final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsVisible;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_GetPromptItemByIA_PromptItem;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_IsPromptItemVisible) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_IsPromptItemVisible");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_IsPromptItemVisible) == 0x000020, "Wrong size on WBP_CommonUIButtonPrompt_C_IsPromptItemVisible");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_IsPromptItemVisible, InputAction) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_IsPromptItemVisible::InputAction' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_IsPromptItemVisible, Param_IsVisible) == 0x000008, "Member 'WBP_CommonUIButtonPrompt_C_IsPromptItemVisible::Param_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_IsPromptItemVisible, CallFunc_GetPromptItemByIA_PromptItem) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_C_IsPromptItemVisible::CallFunc_GetPromptItemByIA_PromptItem' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_IsPromptItemVisible, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_C_IsPromptItemVisible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_IsPromptItemVisible, CallFunc_IsVisible_ReturnValue) == 0x000019, "Member 'WBP_CommonUIButtonPrompt_C_IsPromptItemVisible::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CommonUIButtonPrompt_C_PreConstruct");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_PreConstruct) == 0x000001, "Wrong size on WBP_CommonUIButtonPrompt_C_PreConstruct");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.RefreshCurrentButtonPrompt
// 0x0058 (0x0058 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt final
{
public:
	TArray<struct FF_CommonUIButtonPrompt>        Prompt_Infos;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482D[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        K2Node_DynamicCast_AsWBP_Common_UIButton_Prompt_Item; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482E[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt) == 0x000058, "Wrong size on WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt, Prompt_Infos) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt::Prompt_Infos' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt, CallFunc_IsEmpty_ReturnValue) == 0x000038, "Member 'WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt, K2Node_DynamicCast_AsWBP_Common_UIButton_Prompt_Item) == 0x000040, "Member 'WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt::K2Node_DynamicCast_AsWBP_Common_UIButton_Prompt_Item' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_CommonUIButtonPrompt_C_RefreshCurrentButtonPrompt::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.SetAllPromptItemVisibility
// 0x0040 (0x0040 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482F[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4830[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4831[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility) == 0x000040, "Wrong size on WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, IsShow) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::IsShow' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, Temp_bool_Variable) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, K2Node_Select_Default) == 0x000028, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_CommonUIButtonPrompt_C_SetAllPromptItemVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.SetBackgroundBoderStyle
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_SetBackgroundBoderStyle final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_SetBackgroundBoderStyle) == 0x000010, "Wrong alignment on WBP_CommonUIButtonPrompt_C_SetBackgroundBoderStyle");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_SetBackgroundBoderStyle) == 0x0000D0, "Wrong size on WBP_CommonUIButtonPrompt_C_SetBackgroundBoderStyle");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetBackgroundBoderStyle, InBrush) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_SetBackgroundBoderStyle::InBrush' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.SetBackgroundColor
// 0x0014 (0x0014 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_SetBackgroundColor final
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_SetBackgroundColor) == 0x000004, "Wrong alignment on WBP_CommonUIButtonPrompt_C_SetBackgroundColor");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_SetBackgroundColor) == 0x000014, "Wrong size on WBP_CommonUIButtonPrompt_C_SetBackgroundColor");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetBackgroundColor, Color) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_SetBackgroundColor::Color' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetBackgroundColor, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000004, "Member 'WBP_CommonUIButtonPrompt_C_SetBackgroundColor::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.SetButtonPromptsToCenter
// 0x0008 (0x0008 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_SetButtonPromptsToCenter final
{
public:
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_SetButtonPromptsToCenter) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_SetButtonPromptsToCenter");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_SetButtonPromptsToCenter) == 0x000008, "Wrong size on WBP_CommonUIButtonPrompt_C_SetButtonPromptsToCenter");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetButtonPromptsToCenter, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_SetButtonPromptsToCenter::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.SetButtonPromptsVisibility
// 0x0006 (0x0006 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility final
{
public:
	ECommonInputType                              Input_Type;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility) == 0x000001, "Wrong alignment on WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility) == 0x000006, "Wrong size on WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility, Input_Type) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility::Input_Type' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility, Temp_byte_Variable) == 0x000003, "Member 'WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility, K2Node_Select_Default) == 0x000005, "Member 'WBP_CommonUIButtonPrompt_C_SetButtonPromptsVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.SetDescriptionByIA
// 0x0038 (0x0038 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_SetDescriptionByIA final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsHold;                                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4832[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_GetPromptItemByIA_PromptItem;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_SetDescriptionByIA) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_SetDescriptionByIA");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_SetDescriptionByIA) == 0x000038, "Wrong size on WBP_CommonUIButtonPrompt_C_SetDescriptionByIA");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetDescriptionByIA, InputAction) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_SetDescriptionByIA::InputAction' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetDescriptionByIA, Description) == 0x000008, "Member 'WBP_CommonUIButtonPrompt_C_SetDescriptionByIA::Description' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetDescriptionByIA, IsHold) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_C_SetDescriptionByIA::IsHold' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetDescriptionByIA, CallFunc_GetPromptItemByIA_PromptItem) == 0x000028, "Member 'WBP_CommonUIButtonPrompt_C_SetDescriptionByIA::CallFunc_GetPromptItemByIA_PromptItem' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetDescriptionByIA, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_CommonUIButtonPrompt_C_SetDescriptionByIA::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.SetPromptItemVisibilityByIA
// 0x0020 (0x0020 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShow;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHold;                                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4833[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_GetPromptItemByIA_PromptItem;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA) == 0x000020, "Wrong size on WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA, InputAction) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA::InputAction' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA, IsShow) == 0x000008, "Member 'WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA::IsShow' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA, IsHold) == 0x000009, "Member 'WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA::IsHold' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA, Temp_bool_Variable) == 0x00000A, "Member 'WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA, CallFunc_GetPromptItemByIA_PromptItem) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA::CallFunc_GetPromptItemByIA_PromptItem' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA, Temp_byte_Variable) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA, K2Node_Select_Default) == 0x00001A, "Member 'WBP_CommonUIButtonPrompt_C_SetPromptItemVisibilityByIA::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt.WBP_CommonUIButtonPrompt_C.Update UIButton Prompt by Array
// 0x0030 (0x0030 - 0x0000)
struct WBP_CommonUIButtonPrompt_C_Update_UIButton_Prompt_by_Array final
{
public:
	TArray<struct FF_CommonUIButtonPrompt>        PromptInfos;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4834[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_C_Update_UIButton_Prompt_by_Array) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_C_Update_UIButton_Prompt_by_Array");
static_assert(sizeof(WBP_CommonUIButtonPrompt_C_Update_UIButton_Prompt_by_Array) == 0x000030, "Wrong size on WBP_CommonUIButtonPrompt_C_Update_UIButton_Prompt_by_Array");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_Update_UIButton_Prompt_by_Array, PromptInfos) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_C_Update_UIButton_Prompt_by_Array::PromptInfos' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_C_Update_UIButton_Prompt_by_Array, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_C_Update_UIButton_Prompt_by_Array::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
