#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyRebind_Button

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_KeyRebind_Button.WBP_KeyRebind_Button_C.BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_KeyRebind_Button.WBP_KeyRebind_Button_C.BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_KeyRebind_Button_C_BndEvt__WBP_KeyRebindButton_Gamepad_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_KeyRebind_Button.WBP_KeyRebind_Button_C.ExecuteUbergraph_WBP_KeyRebind_Button
// 0x0028 (0x0028 - 0x0000)
struct WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54E5[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0020(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button) == 0x000008, "Wrong alignment on WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button");
static_assert(sizeof(WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button) == 0x000028, "Wrong size on WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button");
static_assert(offsetof(WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button, EntryPoint) == 0x000000, "Member 'WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000008, "Member 'WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button, K2Node_ComponentBoundEvent_Button_1) == 0x000010, "Member 'WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button, K2Node_Event_InFocusEvent) == 0x000020, "Member 'WBP_KeyRebind_Button_C_ExecuteUbergraph_WBP_KeyRebind_Button::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_KeyRebind_Button.WBP_KeyRebind_Button_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct WBP_KeyRebind_Button_C_Initialize final
{
public:
	TArray<struct FKey>                           InUnBoundKeys;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_KeyRebind_Button_C_Initialize) == 0x000008, "Wrong alignment on WBP_KeyRebind_Button_C_Initialize");
static_assert(sizeof(WBP_KeyRebind_Button_C_Initialize) == 0x000010, "Wrong size on WBP_KeyRebind_Button_C_Initialize");
static_assert(offsetof(WBP_KeyRebind_Button_C_Initialize, InUnBoundKeys) == 0x000000, "Member 'WBP_KeyRebind_Button_C_Initialize::InUnBoundKeys' has a wrong offset!");

// Function WBP_KeyRebind_Button.WBP_KeyRebind_Button_C.OnFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyRebind_Button_C_OnFocused__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebind_Button_C_OnFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_KeyRebind_Button_C_OnFocused__DelegateSignature");
static_assert(sizeof(WBP_KeyRebind_Button_C_OnFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_KeyRebind_Button_C_OnFocused__DelegateSignature");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnFocused__DelegateSignature, Widget) == 0x000000, "Member 'WBP_KeyRebind_Button_C_OnFocused__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_KeyRebind_Button.WBP_KeyRebind_Button_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyRebind_Button_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_KeyRebind_Button_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_KeyRebind_Button_C_OnFocusLost");
static_assert(sizeof(WBP_KeyRebind_Button_C_OnFocusLost) == 0x000008, "Wrong size on WBP_KeyRebind_Button_C_OnFocusLost");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_KeyRebind_Button_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_KeyRebind_Button.WBP_KeyRebind_Button_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_KeyRebind_Button_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_KeyRebind_Button_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_KeyRebind_Button_C_OnFocusReceived");
static_assert(sizeof(WBP_KeyRebind_Button_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_KeyRebind_Button_C_OnFocusReceived");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_KeyRebind_Button_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_KeyRebind_Button_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_KeyRebind_Button_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_KeyRebind_Button_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_KeyRebind_Button.WBP_KeyRebind_Button_C.OnKeyDown
// 0x02C8 (0x02C8 - 0x0000)
struct WBP_KeyRebind_Button_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0148(0x00B8)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54E6[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54E7[0x6];                                     // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0210(0x00B8)()
};
static_assert(alignof(WBP_KeyRebind_Button_C_OnKeyDown) == 0x000008, "Wrong alignment on WBP_KeyRebind_Button_C_OnKeyDown");
static_assert(sizeof(WBP_KeyRebind_Button_C_OnKeyDown) == 0x0002C8, "Wrong size on WBP_KeyRebind_Button_C_OnKeyDown");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'WBP_KeyRebind_Button_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'WBP_KeyRebind_Button_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'WBP_KeyRebind_Button_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'WBP_KeyRebind_Button_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000148, "Member 'WBP_KeyRebind_Button_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnKeyDown, CallFunc_Array_Contains_ReturnValue) == 0x000200, "Member 'WBP_KeyRebind_Button_C_OnKeyDown::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnKeyDown, CallFunc_AkEventGlobal_ReturnValue) == 0x000204, "Member 'WBP_KeyRebind_Button_C_OnKeyDown::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnKeyDown, CallFunc_IsHovered_ReturnValue) == 0x000208, "Member 'WBP_KeyRebind_Button_C_OnKeyDown::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnKeyDown, CallFunc_BooleanAND_ReturnValue) == 0x000209, "Member 'WBP_KeyRebind_Button_C_OnKeyDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000210, "Member 'WBP_KeyRebind_Button_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_KeyRebind_Button.WBP_KeyRebind_Button_C.OnLostFocus__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyRebind_Button_C_OnLostFocus__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebind_Button_C_OnLostFocus__DelegateSignature) == 0x000008, "Wrong alignment on WBP_KeyRebind_Button_C_OnLostFocus__DelegateSignature");
static_assert(sizeof(WBP_KeyRebind_Button_C_OnLostFocus__DelegateSignature) == 0x000008, "Wrong size on WBP_KeyRebind_Button_C_OnLostFocus__DelegateSignature");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnLostFocus__DelegateSignature, Widget) == 0x000000, "Member 'WBP_KeyRebind_Button_C_OnLostFocus__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_KeyRebind_Button.WBP_KeyRebind_Button_C.OnMouseButtonDown
// 0x0300 (0x0300 - 0x0000)
struct WBP_KeyRebind_Button_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0168(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54E8[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0188(0x00B8)()
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54E9[0x6];                                     // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0248(0x00B8)()
};
static_assert(alignof(WBP_KeyRebind_Button_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_KeyRebind_Button_C_OnMouseButtonDown");
static_assert(sizeof(WBP_KeyRebind_Button_C_OnMouseButtonDown) == 0x000300, "Wrong size on WBP_KeyRebind_Button_C_OnMouseButtonDown");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_KeyRebind_Button_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_KeyRebind_Button_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_KeyRebind_Button_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000168, "Member 'WBP_KeyRebind_Button_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnMouseButtonDown, CallFunc_AkEventGlobal_ReturnValue) == 0x000180, "Member 'WBP_KeyRebind_Button_C_OnMouseButtonDown::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnMouseButtonDown, CallFunc_Array_Contains_ReturnValue) == 0x000184, "Member 'WBP_KeyRebind_Button_C_OnMouseButtonDown::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000188, "Member 'WBP_KeyRebind_Button_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnMouseButtonDown, CallFunc_IsHovered_ReturnValue) == 0x000240, "Member 'WBP_KeyRebind_Button_C_OnMouseButtonDown::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnMouseButtonDown, CallFunc_BooleanAND_ReturnValue) == 0x000241, "Member 'WBP_KeyRebind_Button_C_OnMouseButtonDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000248, "Member 'WBP_KeyRebind_Button_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_KeyRebind_Button.WBP_KeyRebind_Button_C.Refresh Image
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_KeyRebind_Button_C_Refresh_Image final
{
public:
	struct FSlateBrush                            SourceIconBrush;                                   // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSlateBrush                            ChordIconBrush;                                    // 0x00D0(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                CallFunc_GetBrushResource_ReturnValue;             // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBrushResource_ReturnValue_1;           // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54EA[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetBrushResource_ReturnValue_2;           // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBrushResource_ReturnValue_3;           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyRebind_Button_C_Refresh_Image) == 0x000010, "Wrong alignment on WBP_KeyRebind_Button_C_Refresh_Image");
static_assert(sizeof(WBP_KeyRebind_Button_C_Refresh_Image) == 0x0001D0, "Wrong size on WBP_KeyRebind_Button_C_Refresh_Image");
static_assert(offsetof(WBP_KeyRebind_Button_C_Refresh_Image, SourceIconBrush) == 0x000000, "Member 'WBP_KeyRebind_Button_C_Refresh_Image::SourceIconBrush' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_Refresh_Image, ChordIconBrush) == 0x0000D0, "Member 'WBP_KeyRebind_Button_C_Refresh_Image::ChordIconBrush' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_Refresh_Image, CallFunc_GetBrushResource_ReturnValue) == 0x0001A0, "Member 'WBP_KeyRebind_Button_C_Refresh_Image::CallFunc_GetBrushResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_Refresh_Image, CallFunc_GetBrushResource_ReturnValue_1) == 0x0001A8, "Member 'WBP_KeyRebind_Button_C_Refresh_Image::CallFunc_GetBrushResource_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_Refresh_Image, CallFunc_IsValid_ReturnValue) == 0x0001B0, "Member 'WBP_KeyRebind_Button_C_Refresh_Image::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_Refresh_Image, CallFunc_GetBrushResource_ReturnValue_2) == 0x0001B8, "Member 'WBP_KeyRebind_Button_C_Refresh_Image::CallFunc_GetBrushResource_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_Refresh_Image, CallFunc_GetBrushResource_ReturnValue_3) == 0x0001C0, "Member 'WBP_KeyRebind_Button_C_Refresh_Image::CallFunc_GetBrushResource_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_KeyRebind_Button_C_Refresh_Image, CallFunc_IsValid_ReturnValue_1) == 0x0001C8, "Member 'WBP_KeyRebind_Button_C_Refresh_Image::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

