#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_ConnectionRequestsList_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C.BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(sizeof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong size on WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_4_OnCustomNavigationGroupInitialized__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C.BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature");
static_assert(sizeof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature) == 0x000008, "Wrong size on WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_CustomNavigationGroup_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C.BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_0_OnListItemsChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_0_OnListItemsChanged__DelegateSignature final
{
public:
	TArray<class UObject*>                        AddedItems;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UObject*>                        RemovedItems;                                      // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_0_OnListItemsChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_0_OnListItemsChanged__DelegateSignature");
static_assert(sizeof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_0_OnListItemsChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_0_OnListItemsChanged__DelegateSignature");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_0_OnListItemsChanged__DelegateSignature, AddedItems) == 0x000000, "Member 'WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_0_OnListItemsChanged__DelegateSignature::AddedItems' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_0_OnListItemsChanged__DelegateSignature, RemovedItems) == 0x000010, "Member 'WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_0_OnListItemsChanged__DelegateSignature::RemovedItems' has a wrong offset!");

// Function WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C.BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C.BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(sizeof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Social_ConnectionRequestsList_CM_C_BndEvt__WBP_Social_ConnectionRequestsList_CM_ListView_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C.ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM
// 0x0068 (0x0068 - 0x0000)
struct WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C1[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup_1;             // 0x0028(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup;               // 0x0030(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array_1;                          // 0x0038(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UObject*>                        K2Node_ComponentBoundEvent_AddedItems;             // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TArray<class UObject*>                        K2Node_ComponentBoundEvent_RemovedItems;           // 0x0058(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM) == 0x000008, "Wrong alignment on WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM");
static_assert(sizeof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM) == 0x000068, "Wrong size on WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM, EntryPoint) == 0x000000, "Member 'WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM, K2Node_ComponentBoundEvent_Widget_1) == 0x000018, "Member 'WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM, K2Node_ComponentBoundEvent_Widget) == 0x000020, "Member 'WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM, K2Node_ComponentBoundEvent_NavGroup_1) == 0x000028, "Member 'WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM::K2Node_ComponentBoundEvent_NavGroup_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM, K2Node_ComponentBoundEvent_NavGroup) == 0x000030, "Member 'WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM::K2Node_ComponentBoundEvent_NavGroup' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM, K2Node_MakeArray_Array_1) == 0x000038, "Member 'WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM, K2Node_ComponentBoundEvent_AddedItems) == 0x000048, "Member 'WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM::K2Node_ComponentBoundEvent_AddedItems' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM, K2Node_ComponentBoundEvent_RemovedItems) == 0x000058, "Member 'WBP_Social_ConnectionRequestsList_CM_C_ExecuteUbergraph_WBP_Social_ConnectionRequestsList_CM::K2Node_ComponentBoundEvent_RemovedItems' has a wrong offset!");

// Function WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C.GetFocusedItem
// 0x0048 (0x0048 - 0x0000)
struct WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem final
{
public:
	class UUserWidget*                            FocusedWidget;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C2[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C3[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C4[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFocusedDescendants_ReturnValue;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C5[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFocusedDescendants_ReturnValue_1;      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue_1;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem) == 0x000008, "Wrong alignment on WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem");
static_assert(sizeof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem) == 0x000048, "Wrong size on WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, FocusedWidget) == 0x000000, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::FocusedWidget' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000018, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_HasAnyUserFocus_ReturnValue) == 0x000038, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_HasFocusedDescendants_ReturnValue) == 0x000039, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_HasFocusedDescendants_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_HasFocusedDescendants_ReturnValue_1) == 0x000043, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_HasFocusedDescendants_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_HasAnyUserFocus_ReturnValue_1) == 0x000044, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_HasAnyUserFocus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem, CallFunc_BooleanOR_ReturnValue_1) == 0x000045, "Member 'WBP_Social_ConnectionRequestsList_CM_C_GetFocusedItem::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C.OnRequestsCountChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Social_ConnectionRequestsList_CM_C_OnRequestsCountChanged__DelegateSignature final
{
public:
	class UWBP_Social_ConnectionRequestsList_CM_C* Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_ConnectionRequestsList_CM_C_OnRequestsCountChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_ConnectionRequestsList_CM_C_OnRequestsCountChanged__DelegateSignature");
static_assert(sizeof(WBP_Social_ConnectionRequestsList_CM_C_OnRequestsCountChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_Social_ConnectionRequestsList_CM_C_OnRequestsCountChanged__DelegateSignature");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_OnRequestsCountChanged__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Social_ConnectionRequestsList_CM_C_OnRequestsCountChanged__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_OnRequestsCountChanged__DelegateSignature, Count) == 0x000008, "Member 'WBP_Social_ConnectionRequestsList_CM_C_OnRequestsCountChanged__DelegateSignature::Count' has a wrong offset!");

// Function WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_ConnectionRequestsList_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_ConnectionRequestsList_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Social_ConnectionRequestsList_CM_C_PreConstruct");
static_assert(sizeof(WBP_Social_ConnectionRequestsList_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_Social_ConnectionRequestsList_CM_C_PreConstruct");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Social_ConnectionRequestsList_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C.RefreshListView
// 0x0020 (0x0020 - 0x0000)
struct WBP_Social_ConnectionRequestsList_CM_C_RefreshListView final
{
public:
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0000(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_ConnectionRequestsList_CM_C_RefreshListView) == 0x000008, "Wrong alignment on WBP_Social_ConnectionRequestsList_CM_C_RefreshListView");
static_assert(sizeof(WBP_Social_ConnectionRequestsList_CM_C_RefreshListView) == 0x000020, "Wrong size on WBP_Social_ConnectionRequestsList_CM_C_RefreshListView");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_RefreshListView, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000000, "Member 'WBP_Social_ConnectionRequestsList_CM_C_RefreshListView::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_RefreshListView, CallFunc_GetNumItems_ReturnValue) == 0x000010, "Member 'WBP_Social_ConnectionRequestsList_CM_C_RefreshListView::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_RefreshListView, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_Social_ConnectionRequestsList_CM_C_RefreshListView::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_RefreshListView, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Social_ConnectionRequestsList_CM_C_RefreshListView::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_RefreshListView, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000019, "Member 'WBP_Social_ConnectionRequestsList_CM_C_RefreshListView::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_RefreshListView, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'WBP_Social_ConnectionRequestsList_CM_C_RefreshListView::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Social_ConnectionRequestsList_CM.WBP_Social_ConnectionRequestsList_CM_C.SetItems
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Social_ConnectionRequestsList_CM_C_SetItems final
{
public:
	TArray<class UObject*>                        Items;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C6[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C7[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C8[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_ConnectionRequestsList_CM_C_SetItems) == 0x000008, "Wrong alignment on WBP_Social_ConnectionRequestsList_CM_C_SetItems");
static_assert(sizeof(WBP_Social_ConnectionRequestsList_CM_C_SetItems) == 0x0000B0, "Wrong size on WBP_Social_ConnectionRequestsList_CM_C_SetItems");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_SetItems, Items) == 0x000000, "Member 'WBP_Social_ConnectionRequestsList_CM_C_SetItems::Items' has a wrong offset!");
static_assert(offsetof(WBP_Social_ConnectionRequestsList_CM_C_SetItems, Temp_byte_Variable) == 0x000010, "Member 'WBP_Social_ConnectionRequestsList_CM_C_SetItems::Temp_byte_Variable' has a wrong offset!");
