#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_CharacterContextMenu_CM

#include "Basic.hpp"

#include "S6Core_structs.hpp"
#include "UMG_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Social_CharacterContextMenu_CM.WBP_Social_CharacterContextMenu_CM_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_CharacterContextMenu_CM_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_CharacterContextMenu_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_Social_CharacterContextMenu_CM_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_Social_CharacterContextMenu_CM_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_Social_CharacterContextMenu_CM_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_Social_CharacterContextMenu_CM_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_Social_CharacterContextMenu_CM.WBP_Social_CharacterContextMenu_CM_C.ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM
// 0x04D0 (0x04D0 - 0x0000)
struct WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXSXPlatform_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46F1[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWBP_Guild_Transfer_Ownership_Confirmation_Modal_CM; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46F2[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46F3[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46F4[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWBP_Guild_Transfer_Ownership_Confirmation_Modal_PF; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46F5[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46F6[0x5];                                     // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Temp_struct_Variable;                              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOSSVAL_CharacterNameAndId>     Temp_struct_Variable_1;                            // 0x00C0(0x0010)(ReferenceParm)
	TDelegate<void(class FName CharacterName, bool bMuted)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CharacterName, bool bMuted)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_4;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId;                      // 0x010C(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46F7[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOSSVAL_CharacterNameAndId>     K2Node_CustomEvent_Names;                          // 0x0120(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(struct FUniqueNetIdRepl& BlockedNetId, bool bBlocked)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FUniqueNetIdRepl& BlockedNetId, bool bBlocked)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId, TArray<struct FOSSVAL_CharacterNameAndId>& Names)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportPlayerModalDialog_CM_C*      CallFunc_Create_ReturnValue;                       // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportPlayerModalDialog_CM_C*      CallFunc_Create_ReturnValue_1;                     // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportPlayerModalDialog_PF_C*      CallFunc_Create_ReturnValue_2;                     // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ReportPlayerModalDialog_PF_C*      CallFunc_Create_ReturnValue_3;                     // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_5;    // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_6;    // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Block_ModalDialogue_CM_C*          CallFunc_Create_ReturnValue_4;                     // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Block_ModalDialogue_PF_C*          CallFunc_Create_ReturnValue_5;                     // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_2;         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_7;    // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_NewUserId;                      // 0x01D8(0x0030)(HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& RemovedPlayerCharacterId)> Temp_delegate_Variable;                            // 0x0208(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& RemovedPlayerCharacterId)> Temp_delegate_Variable_1;                          // 0x0218(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_5;              // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46F8[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Guild_TransferOwnershipConfirmation_Modal_CM_C* CallFunc_Create_ReturnValue_6;                     // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Guild_TransferOwnershipConfirmation_Modal_PF_C* CallFunc_Create_ReturnValue_7;                     // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_3;         // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_6;              // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_7;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_8;    // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RescindFriendshipWithPlayer_ReturnValue;  // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46F9[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_9;    // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_AccountId_1;                    // 0x0270(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_SocialBlockError                         CallFunc_RequestBlockUser_ReturnValue;             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46FA[0x2];                                     // 0x0282(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue;                    // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_1;                  // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue_1;                  // 0x0296(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_2;                  // 0x0297(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& AccountId)>      K2Node_CreateDelegate_OutputDelegate_9;            // 0x0298(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue_2;                  // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46FB[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46FC[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Kick_ModalDialogue_CM_C*           CallFunc_Create_ReturnValue_8;                     // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Kick_ModalDialogue_PF_C*           CallFunc_Create_ReturnValue_9;                     // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_4;         // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_3;                  // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue_3;                  // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46FD[0x6];                                     // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_5;            // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Kick_ModalDialogue_CM_C*           CallFunc_Create_ReturnValue_10;                    // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x02F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Kick_ModalDialogue_PF_C*           CallFunc_Create_ReturnValue_11;                    // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_5;         // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_4;                  // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue_4;                  // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0313(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_5;                  // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46FE[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_BorderStyle*                     K2Node_Select_Default;                             // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue_5;                  // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46FF[0x5];                                     // 0x0323(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue;         // 0x0328(0x00B0)()
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x03D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4700[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOSSVAL_GetCharacterNamesByAccountIdProxy* CallFunc_GetCharacterNamesByAccountId_ReturnValue; // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4701[0x5];                                     // 0x03FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue_1;       // 0x0400(0x00B0)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_6;            // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4702[0x4];                                     // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_10;   // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowPlatformProfileUI_ReturnValue;        // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM) == 0x000008, "Wrong alignment on WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM");
static_assert(sizeof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM) == 0x0004D0, "Wrong size on WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, EntryPoint) == 0x000000, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsXSXPlatform_ReturnValue) == 0x000004, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsXSXPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, Temp_class_Variable) == 0x000010, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000018, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_ClassDynamicCast_AsWBP_Guild_Transfer_Ownership_Confirmation_Modal_CM) == 0x000020, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_ClassDynamicCast_AsWBP_Guild_Transfer_Ownership_Confirmation_Modal_CM' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_ClassDynamicCast_bSuccess) == 0x000028, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000030, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetCurrentInputType_ReturnValue) == 0x000038, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, Temp_bool_Variable) == 0x00004C, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CustomEvent_Loaded) == 0x000050, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, Temp_class_Variable_1) == 0x000058, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_ClassDynamicCast_AsWBP_Guild_Transfer_Ownership_Confirmation_Modal_PF) == 0x000060, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_ClassDynamicCast_AsWBP_Guild_Transfer_Ownership_Confirmation_Modal_PF' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_ClassDynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x000070, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, Temp_bool_Variable_1) == 0x000078, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, Temp_byte_Variable) == 0x000079, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, Temp_byte_Variable_1) == 0x00007A, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_4) == 0x000080, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CustomEvent_Loaded_1) == 0x000088, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, Temp_struct_Variable) == 0x0000A0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, Temp_struct_Variable_1) == 0x0000C0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x0000F0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Conv_StringToName_ReturnValue) == 0x0000F4, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x0000FC, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x000100, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_AkEventGlobal_ReturnValue_3) == 0x000104, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_AkEventGlobal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_AkEventGlobal_ReturnValue_4) == 0x000108, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_AkEventGlobal_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CustomEvent_AccountId) == 0x00010C, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CustomEvent_AccountId' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CustomEvent_Names) == 0x000120, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CustomEvent_Names' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CreateDelegate_OutputDelegate_5) == 0x000130, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CreateDelegate_OutputDelegate_6) == 0x000140, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CreateDelegate_OutputDelegate_7) == 0x000150, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x000160, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000168, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue) == 0x000170, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue_1) == 0x000178, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue_2) == 0x000180, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000188, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue_3) == 0x000190, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetUIManagerWidget_ReturnValue_1) == 0x000198, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetUIManagerWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_5) == 0x0001A0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_6) == 0x0001A8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0001B0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue_4) == 0x0001B8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue_5) == 0x0001C0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetUIManagerWidget_ReturnValue_2) == 0x0001C8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetUIManagerWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_7) == 0x0001D0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CustomEvent_NewUserId) == 0x0001D8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CustomEvent_NewUserId' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, Temp_delegate_Variable) == 0x000208, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, Temp_delegate_Variable_1) == 0x000218, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetOwningPlayer_ReturnValue_3) == 0x000228, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetOwningPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_AkEventGlobal_ReturnValue_5) == 0x000230, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_AkEventGlobal_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue_6) == 0x000238, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue_7) == 0x000240, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetUIManagerWidget_ReturnValue_3) == 0x000248, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetUIManagerWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_AkEventGlobal_ReturnValue_6) == 0x000250, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_AkEventGlobal_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_AkEventGlobal_ReturnValue_7) == 0x000254, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_AkEventGlobal_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_8) == 0x000258, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_RescindFriendshipWithPlayer_ReturnValue) == 0x000260, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_RescindFriendshipWithPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue_9) == 0x000268, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CustomEvent_AccountId_1) == 0x000270, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CustomEvent_AccountId_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_RequestBlockUser_ReturnValue) == 0x000280, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_RequestBlockUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsConsole_ReturnValue) == 0x000281, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CreateDelegate_OutputDelegate_8) == 0x000284, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsDesktop_ReturnValue) == 0x000294, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsDesktop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsConsole_ReturnValue_1) == 0x000295, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsConsole_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsDesktop_ReturnValue_1) == 0x000296, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsDesktop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsConsole_ReturnValue_2) == 0x000297, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsConsole_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CreateDelegate_OutputDelegate_9) == 0x000298, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsDesktop_ReturnValue_2) == 0x0002A8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsDesktop_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetOwningPlayer_ReturnValue_4) == 0x0002B0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetOwningPlayer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_MakeLiteralByte_ReturnValue) == 0x0002B8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue_8) == 0x0002C0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue_9) == 0x0002C8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetUIManagerWidget_ReturnValue_4) == 0x0002D0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetUIManagerWidget_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsConsole_ReturnValue_3) == 0x0002D8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsConsole_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsDesktop_ReturnValue_3) == 0x0002D9, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsDesktop_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetOwningPlayer_ReturnValue_5) == 0x0002E0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetOwningPlayer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue_10) == 0x0002E8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CreateDelegate_OutputDelegate_10) == 0x0002F0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_Create_ReturnValue_11) == 0x000300, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_Create_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetUIManagerWidget_ReturnValue_5) == 0x000308, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetUIManagerWidget_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsConsole_ReturnValue_4) == 0x000310, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsConsole_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsDesktop_ReturnValue_4) == 0x000311, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsDesktop_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_CustomEvent_bNewInputType) == 0x000312, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000313, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsConsole_ReturnValue_5) == 0x000314, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsConsole_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, K2Node_Select_Default) == 0x000318, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsDesktop_ReturnValue_5) == 0x000320, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsDesktop_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000321, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetPlatformType_ReturnValue) == 0x000322, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetPresenceForUserId_ReturnValue) == 0x000328, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetPresenceForUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetAccountId_ReturnValue) == 0x0003D8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0003E8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetCharacterNamesByAccountId_ReturnValue) == 0x0003F0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetCharacterNamesByAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0003F8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_BooleanAND_ReturnValue) == 0x0003F9, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_IsValid_ReturnValue) == 0x0003FA, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetPresenceForUserId_ReturnValue_1) == 0x000400, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetPresenceForUserId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetOwningPlayer_ReturnValue_6) == 0x0004B0, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetOwningPlayer_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM, CallFunc_GetPlayerControllerID_ReturnValue) == 0x0004B8, "Member 'WBP_Social_CharacterContextMenu_CM_C_ExecuteUbergraph_WBP_Social_CharacterContextMenu_CM::CallFunc_GetPlayerControllerID_ReturnValue' has a wrong offset!");
