#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoginScreen_PF

#include "Basic.hpp"

#include "S6Core_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoginScreen_PF.WBP_LoginScreen_PF_C.BndEvt__WBP_LoginFlow_PF_Button_CreateAccount_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoginScreen_PF_C_BndEvt__WBP_LoginFlow_PF_Button_CreateAccount_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_PF_C_BndEvt__WBP_LoginFlow_PF_Button_CreateAccount_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginScreen_PF_C_BndEvt__WBP_LoginFlow_PF_Button_CreateAccount_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_LoginScreen_PF_C_BndEvt__WBP_LoginFlow_PF_Button_CreateAccount_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_LoginScreen_PF_C_BndEvt__WBP_LoginFlow_PF_Button_CreateAccount_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_LoginScreen_PF_C_BndEvt__WBP_LoginFlow_PF_Button_CreateAccount_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_LoginScreen_PF_C_BndEvt__WBP_LoginFlow_PF_Button_CreateAccount_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_LoginScreen_PF.WBP_LoginScreen_PF_C.ExecuteUbergraph_WBP_LoginScreen_PF
// 0x0040 (0x0040 - 0x0000)
struct WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52BD[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF) == 0x000008, "Wrong alignment on WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF");
static_assert(sizeof(WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF) == 0x000040, "Wrong size on WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF");
static_assert(offsetof(WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF, EntryPoint) == 0x000000, "Member 'WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000010, "Member 'WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF, CallFunc_GetPlatformType_ReturnValue) == 0x000018, "Member 'WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF, CallFunc_SelectString_ReturnValue) == 0x000020, "Member 'WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'WBP_LoginScreen_PF_C_ExecuteUbergraph_WBP_LoginScreen_PF::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function WBP_LoginScreen_PF.WBP_LoginScreen_PF_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoginScreen_PF_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginScreen_PF_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_LoginScreen_PF_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_LoginScreen_PF_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_LoginScreen_PF_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_LoginScreen_PF_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_LoginScreen_PF_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

