#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PhotoCameraScreen_Console

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "PhotographyRuntime_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PhotoCameraScreen_Console.WBP_PhotoCameraScreen_Console_C
// 0x0160 (0x06E8 - 0x0588)
class UWBP_PhotoCameraScreen_Console_C final : public UVALUI_PhotoCameraScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0588(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DevelopPhoto;                                      // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              CaptureButton;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_Capturing;                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionZoomOut;                               // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPrompt_C*            CommonUIButtonPrompt;                              // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ToolBar;                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FlashEffect;                                 // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RecentPhoto;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ViewFinderFrame;                             // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ZoomIn;                                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ZoomOut;                                     // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              RecentPhotoButton;                                 // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Slider_Styled*                   Slider_Magnification;                              // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              ToggleViewButton;                                  // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FKey                                   LookModeMouseButton;                               // 0x0618(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UWBP_PopinCalloutWidget_C*              Menu_Content;                                      // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_TutorialFlagDefinition> FTUEFlag_Capture;                                  // 0x0638(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_TutorialFlagDefinition> FTUEFlag_Review;                                   // 0x0660(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             GalleryOpened;                                     // 0x0688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bBeganScreenClick;                                 // 0x0698(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B0D[0x7];                                     // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   StrBack;                                           // 0x06A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StrMoveCharacter;                                  // 0x06B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StrLookAround;                                     // 0x06D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ApplyMagnification(float CallFunc_GetValue_ReturnValue, float CallFunc_GetValue_ReturnValue_1, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue, float CallFunc_GetValue_ReturnValue_2, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue_1, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsInSelfieMode_bWantsSelfieMode, float CallFunc_GetValue_ReturnValue_3, double CallFunc_MapRangeClamped_ReturnValue, double CallFunc_MapRangeClamped_ReturnValue_1, double CallFunc_MapRangeClamped_Value_ImplicitCast, double CallFunc_MapRangeClamped_Value_ImplicitCast_1, double CallFunc_AudioZoomRTPC_Zoom_ImplicitCast, double CallFunc_MapRangeClamped_OutRangeA_ImplicitCast, double CallFunc_MapRangeClamped_OutRangeA_ImplicitCast_1, double CallFunc_MapRangeClamped_OutRangeB_ImplicitCast, double CallFunc_MapRangeClamped_OutRangeB_ImplicitCast_1, double CallFunc_AudioZoomRTPC_Zoom_ImplicitCast_1, double CallFunc_MapRangeClamped_InRangeB_ImplicitCast, double CallFunc_MapRangeClamped_InRangeA_ImplicitCast, float CallFunc_SetFPSPhotoModeFOV_Value_ImplicitCast, double CallFunc_MapRangeClamped_InRangeB_ImplicitCast_1, double CallFunc_MapRangeClamped_InRangeA_ImplicitCast_1, float CallFunc_SetSelfieModeDollyDistance_Value_ImplicitCast);
	void AudioZoomRTPC(double Zoom, class APawn* Pawn, bool CallFunc_IsLocallyControlled_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue);
	void BndEvt__Slider_96_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__WBP_PhotoCameraScreen_CM_CaptureButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PhotoCameraScreen_CM_RecentPhotoButton_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PhotoCameraScreen_CM_ToggleViewButton_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	bool BP_OnHandleBackAction();
	void CapturePhoto(int32 CallFunc_AkEventGlobal_ReturnValue, class UVAL_PhotographyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, const struct FGuid& CallFunc_CreateCapturedPhotograph_ReturnValue);
	void CloseState();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_PhotoCameraScreen_Console(int32 EntryPoint, class UVAL_PhotographyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_5, float K2Node_EnhancedInputActionEvent_ElapsedTime_5, float K2Node_EnhancedInputActionEvent_TriggeredTime_5, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_5, class UInputAction* Temp_object_Variable, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, double Temp_real_Variable, double Temp_real_Variable_1, double Temp_real_Variable_0, double Temp_real_Variable_1_0, bool Temp_bool_Variable, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_4, float K2Node_EnhancedInputActionEvent_ElapsedTime_4, float K2Node_EnhancedInputActionEvent_TriggeredTime_4, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_4, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_1, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_3, float K2Node_EnhancedInputActionEvent_ElapsedTime_3, float K2Node_EnhancedInputActionEvent_TriggeredTime_3, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_3, class UInputAction* Temp_object_Variable_1, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_2, double Temp_real_Variable_2, double Temp_real_Variable_3, double Temp_real_Variable_2_0, double Temp_real_Variable_3_0, double Temp_real_Variable_3_1, double Temp_real_Variable_2_1, bool Temp_bool_Variable_1, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_2, float K2Node_EnhancedInputActionEvent_ElapsedTime_2, float K2Node_EnhancedInputActionEvent_TriggeredTime_2, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_2, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_3, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_1, float K2Node_EnhancedInputActionEvent_ElapsedTime_1, float K2Node_EnhancedInputActionEvent_TriggeredTime_1, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_1, class UInputAction* Temp_object_Variable_2, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_4, double Temp_real_Variable_4, double Temp_real_Variable_5, double Temp_real_Variable_4_0, double Temp_real_Variable_5_0, double Temp_real_Variable_5_1, double Temp_real_Variable_4_1, bool Temp_bool_Variable_2, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_5, class UInputAction* Temp_object_Variable_3, double Temp_real_Variable_6, double Temp_real_Variable_6_0, double Temp_real_Variable_7, bool Temp_bool_Variable_3, double Temp_real_Variable_7_0, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class AVAL_PlayerCameraManager* K2Node_DynamicCast_AsVAL_Player_Camera_Manager, bool K2Node_DynamicCast_bSuccess, class AVAL_PlayerCameraManager* K2Node_DynamicCast_AsVAL_Player_Camera_Manager_1, bool K2Node_DynamicCast_bSuccess_1, bool Temp_bool_Variable_4, TDelegate<void(class UVAL_PhotographyManager* PhotographyManager)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(class UVAL_PhotographyManager* PhotographyManager, class UVAL_CapturedPhotograph* CapturedPhotograph)> K2Node_CreateDelegate_OutputDelegate_1, float K2Node_ComponentBoundEvent_Value, TDelegate<void(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction)> K2Node_CreateDelegate_OutputDelegate_2, int32 CallFunc_AkEventGlobal_ReturnValue, const struct FGuid& CallFunc_RegisterInputActionBinding_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, double Temp_real_Variable_8, double Temp_real_Variable_9, class UInputAction* Temp_object_Variable_4, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_6, float K2Node_EnhancedInputActionEvent_ElapsedTime_6, float K2Node_EnhancedInputActionEvent_TriggeredTime_6, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_6, double Temp_real_Variable_9_0, double Temp_real_Variable_8_0, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_6, class US6UI_StateViewModel* CallFunc_GetViewModel_ReturnValue, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, const struct FS6UI_InputMode& CallFunc_CreateInputMode_GameAndUI_ReturnValue, class ABP_ValeriaCharacter_C* K2Node_DynamicCast_AsBP_Valeria_Character, bool K2Node_DynamicCast_bSuccess_2, bool K2Node_SwitchEnum_CmpSuccess, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult_1, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_1, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, class ABP_ValeriaCharacter_C* K2Node_DynamicCast_AsBP_Valeria_Character_1, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_CanStartTutorialForFlag_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_3, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_2, class AVAL_PlayerCameraManager* K2Node_DynamicCast_AsVAL_Player_Camera_Manager_2, bool K2Node_DynamicCast_bSuccess_4, int32 CallFunc_AkEventGlobal_ReturnValue_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_3, bool CallFunc_Not_PreBool_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, class UVALUI_UIManagerWidgetBase* K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base, bool K2Node_DynamicCast_bSuccess_5, const struct FGuid& K2Node_MakeStruct_Guid, int32 CallFunc_AkEventGlobal_ReturnValue_3, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_4, class UVAL_PhotographyManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_5, bool CallFunc_CanStartTutorialForFlag_ReturnValue_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_2, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, int32 CallFunc_AkEventGlobal_ReturnValue_4, bool K2Node_Event_IsDesignTime, const struct FColor& K2Node_MakeStruct_Color, const struct FFocusEvent& K2Node_Event_InFocusEvent);
	void GalleryOpened__DelegateSignature();
	void GetDesiredUIInputMode(uint8* UIInputMode, bool* bWantsCursor);
	void HandleCameraZoom(double ZoomValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_FMod_Remainder, int32 CallFunc_FMod_ReturnValue, float CallFunc_GetValue_ReturnValue, double CallFunc_Multiply_IntFloat_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_FClamp_ReturnValue, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast, double CallFunc_FMod_Divisor_ImplicitCast, double CallFunc_Multiply_IntFloat_B_ImplicitCast, double CallFunc_FClamp_Min_ImplicitCast, double CallFunc_FClamp_Max_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast, float CallFunc_SetValue_InValue_ImplicitCast);
	void HandleCaptureTaken(class UVAL_PhotographyManager* PhotographyManager, class UVAL_CapturedPhotograph* CapturedPhotograph, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void HandleInputAction_UIBack_Triggered(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* InputAction);
	void HandleStartingCapture(class UVAL_PhotographyManager* PhotographyManager);
	void InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SecondaryAction_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_6(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void IsInSelfieMode(bool* bWantsSelfieMode, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AVAL_PlayerCameraManager* K2Node_DynamicCast_AsVAL_Player_Camera_Manager, bool K2Node_DynamicCast_bSuccess);
	class UUserWidget* On_MenuAnchor_Popin_Capture_GetUserMenuContent_0(class APlayerController* CallFunc_GetPlayerController_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM, bool K2Node_DynamicCast_bSuccess, class UWBP_FTUEPopin_CM_C* CallFunc_Redirect_FTUEPopin_Type_FTUEPopin, class UPanelSlot* CallFunc_SetContent_ReturnValue, bool CallFunc_IsValid_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate);
	class UUserWidget* On_MenuAnchor_Popin_Review_GetUserMenuContent_0(class APlayerController* CallFunc_GetPlayerController_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM, bool K2Node_DynamicCast_bSuccess, class UWBP_FTUEPopin_CM_C* CallFunc_Redirect_FTUEPopin_Type_FTUEPopin, class UPanelSlot* CallFunc_SetContent_ReturnValue, bool CallFunc_IsValid_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt_1, const struct FF_CommonUIButtonPrompt& K2Node_MakeStruct_F_CommonUIButtonPrompt_2, TArray<struct FF_CommonUIButtonPrompt>& K2Node_MakeArray_Array, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnInitialized();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_Handled_ReturnValue, const struct FKey& CallFunc_PointerEvent_GetEffectingButton_ReturnValue, const struct FKey& CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1, bool CallFunc_IsInSelfieMode_bWantsSelfieMode, bool CallFunc_EqualEqual_KeyKey_ReturnValue, const struct FEventReply& CallFunc_Handled_ReturnValue_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, const struct FEventReply& CallFunc_Handled_ReturnValue_2, const struct FEventReply& CallFunc_CaptureMouseWithHighPrecision_ReturnValue);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FKey& CallFunc_PointerEvent_GetEffectingButton_ReturnValue, const struct FKey& CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1, const struct FEventReply& CallFunc_Handled_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, const struct FEventReply& CallFunc_ReleaseMouseCapture_ReturnValue, const struct FEventReply& CallFunc_Handled_ReturnValue_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, const struct FEventReply& CallFunc_Handled_ReturnValue_2);
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_Unhandled_ReturnValue, bool CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue, bool CallFunc_IsInSelfieMode_bWantsSelfieMode, const struct FEventReply& CallFunc_Handled_ReturnValue, bool CallFunc_HasMouseCapture_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, float CallFunc_PointerEvent_GetWheelDelta_ReturnValue, const struct FEventReply& CallFunc_Handled_ReturnValue, float CallFunc_GetValue_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_FMod_Remainder, int32 CallFunc_FMod_ReturnValue, double CallFunc_Multiply_IntFloat_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_FClamp_ReturnValue, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, double CallFunc_FClamp_Min_ImplicitCast, double CallFunc_FClamp_Max_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast, double CallFunc_FMod_Divisor_ImplicitCast, double CallFunc_Multiply_IntFloat_B_ImplicitCast, float CallFunc_SetValue_InValue_ImplicitCast);
	void PreConstruct(bool IsDesignTime);
	void TryShowFTUE_Capture();
	void TryShowFTUEReview();
	void UpdateInputLegend();
	void UpdateMagnificationSlider(bool Temp_bool_Variable, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue, class AValeriaCharacter* K2Node_DynamicCast_AsValeria_Character, bool K2Node_DynamicCast_bSuccess, float CallFunc_GetFPSPhotoModeFOV_ReturnValue, float CallFunc_GetSelfieModeDollyDistance_ReturnValue, double CallFunc_MapRangeClamped_ReturnValue, bool CallFunc_IsInSelfieMode_bWantsSelfieMode, double CallFunc_MapRangeClamped_ReturnValue_1, double K2Node_Select_Default, double CallFunc_MapRangeClamped_OutRangeB_ImplicitCast, double CallFunc_MapRangeClamped_OutRangeA_ImplicitCast, double CallFunc_MapRangeClamped_OutRangeB_ImplicitCast_1, double CallFunc_MapRangeClamped_OutRangeA_ImplicitCast_1, double CallFunc_MapRangeClamped_Value_ImplicitCast, double CallFunc_MapRangeClamped_InRangeA_ImplicitCast, double CallFunc_MapRangeClamped_InRangeB_ImplicitCast, double CallFunc_MapRangeClamped_Value_ImplicitCast_1, double CallFunc_MapRangeClamped_InRangeA_ImplicitCast_1, double CallFunc_MapRangeClamped_InRangeB_ImplicitCast_1, float CallFunc_SetValue_InValue_ImplicitCast);
	void WBP_PhotoCameraScreen_AutoGenFunc(class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue);
	void WBP_PhotoCameraScreen_AutoGenFunc1(class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PhotoCameraScreen_Console_C">();
	}
	static class UWBP_PhotoCameraScreen_Console_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PhotoCameraScreen_Console_C>();
	}
};
static_assert(alignof(UWBP_PhotoCameraScreen_Console_C) == 0x000008, "Wrong alignment on UWBP_PhotoCameraScreen_Console_C");
static_assert(sizeof(UWBP_PhotoCameraScreen_Console_C) == 0x0006E8, "Wrong size on UWBP_PhotoCameraScreen_Console_C");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, UberGraphFrame) == 0x000588, "Member 'UWBP_PhotoCameraScreen_Console_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, DevelopPhoto) == 0x000590, "Member 'UWBP_PhotoCameraScreen_Console_C::DevelopPhoto' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, CaptureButton) == 0x000598, "Member 'UWBP_PhotoCameraScreen_Console_C::CaptureButton' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, CircularThrobber_Capturing) == 0x0005A0, "Member 'UWBP_PhotoCameraScreen_Console_C::CircularThrobber_Capturing' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, CommonActionZoomOut) == 0x0005A8, "Member 'UWBP_PhotoCameraScreen_Console_C::CommonActionZoomOut' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, CommonUIButtonPrompt) == 0x0005B0, "Member 'UWBP_PhotoCameraScreen_Console_C::CommonUIButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, HorizontalBox_ToolBar) == 0x0005B8, "Member 'UWBP_PhotoCameraScreen_Console_C::HorizontalBox_ToolBar' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, Image_3) == 0x0005C0, "Member 'UWBP_PhotoCameraScreen_Console_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, Image_4) == 0x0005C8, "Member 'UWBP_PhotoCameraScreen_Console_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, Image_5) == 0x0005D0, "Member 'UWBP_PhotoCameraScreen_Console_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, Image_FlashEffect) == 0x0005D8, "Member 'UWBP_PhotoCameraScreen_Console_C::Image_FlashEffect' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, Image_RecentPhoto) == 0x0005E0, "Member 'UWBP_PhotoCameraScreen_Console_C::Image_RecentPhoto' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, Image_ViewFinderFrame) == 0x0005E8, "Member 'UWBP_PhotoCameraScreen_Console_C::Image_ViewFinderFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, Image_ZoomIn) == 0x0005F0, "Member 'UWBP_PhotoCameraScreen_Console_C::Image_ZoomIn' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, Image_ZoomOut) == 0x0005F8, "Member 'UWBP_PhotoCameraScreen_Console_C::Image_ZoomOut' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, RecentPhotoButton) == 0x000600, "Member 'UWBP_PhotoCameraScreen_Console_C::RecentPhotoButton' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, Slider_Magnification) == 0x000608, "Member 'UWBP_PhotoCameraScreen_Console_C::Slider_Magnification' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, ToggleViewButton) == 0x000610, "Member 'UWBP_PhotoCameraScreen_Console_C::ToggleViewButton' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, LookModeMouseButton) == 0x000618, "Member 'UWBP_PhotoCameraScreen_Console_C::LookModeMouseButton' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, Menu_Content) == 0x000630, "Member 'UWBP_PhotoCameraScreen_Console_C::Menu_Content' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, FTUEFlag_Capture) == 0x000638, "Member 'UWBP_PhotoCameraScreen_Console_C::FTUEFlag_Capture' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, FTUEFlag_Review) == 0x000660, "Member 'UWBP_PhotoCameraScreen_Console_C::FTUEFlag_Review' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, GalleryOpened) == 0x000688, "Member 'UWBP_PhotoCameraScreen_Console_C::GalleryOpened' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, bBeganScreenClick) == 0x000698, "Member 'UWBP_PhotoCameraScreen_Console_C::bBeganScreenClick' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, StrBack) == 0x0006A0, "Member 'UWBP_PhotoCameraScreen_Console_C::StrBack' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, StrMoveCharacter) == 0x0006B8, "Member 'UWBP_PhotoCameraScreen_Console_C::StrMoveCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoCameraScreen_Console_C, StrLookAround) == 0x0006D0, "Member 'UWBP_PhotoCameraScreen_Console_C::StrLookAround' has a wrong offset!");

}

