#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_PopupMain_02

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Template_PopupMain_02.WBP_Template_PopupMain_02_C.ExecuteUbergraph_WBP_Template_PopupMain_02
// 0x0008 (0x0008 - 0x0000)
struct WBP_Template_PopupMain_02_C_ExecuteUbergraph_WBP_Template_PopupMain_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_PopupMain_02_C_ExecuteUbergraph_WBP_Template_PopupMain_02) == 0x000004, "Wrong alignment on WBP_Template_PopupMain_02_C_ExecuteUbergraph_WBP_Template_PopupMain_02");
static_assert(sizeof(WBP_Template_PopupMain_02_C_ExecuteUbergraph_WBP_Template_PopupMain_02) == 0x000008, "Wrong size on WBP_Template_PopupMain_02_C_ExecuteUbergraph_WBP_Template_PopupMain_02");
static_assert(offsetof(WBP_Template_PopupMain_02_C_ExecuteUbergraph_WBP_Template_PopupMain_02, EntryPoint) == 0x000000, "Member 'WBP_Template_PopupMain_02_C_ExecuteUbergraph_WBP_Template_PopupMain_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_02_C_ExecuteUbergraph_WBP_Template_PopupMain_02, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Template_PopupMain_02_C_ExecuteUbergraph_WBP_Template_PopupMain_02::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_Template_PopupMain_02.WBP_Template_PopupMain_02_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Template_PopupMain_02_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_PopupMain_02_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Template_PopupMain_02_C_PreConstruct");
static_assert(sizeof(WBP_Template_PopupMain_02_C_PreConstruct) == 0x000001, "Wrong size on WBP_Template_PopupMain_02_C_PreConstruct");
static_assert(offsetof(WBP_Template_PopupMain_02_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Template_PopupMain_02_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Template_PopupMain_02.WBP_Template_PopupMain_02_C.SetContentSettings
// 0x0028 (0x0028 - 0x0000)
struct WBP_Template_PopupMain_02_C_SetContentSettings final
{
public:
	struct FMargin                                Param_ContentPadding;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerticalAlignment                            Param_VAlign_Content;                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Param_HAlign_Content;                              // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4376[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_PopupMain_02_C_SetContentSettings) == 0x000008, "Wrong alignment on WBP_Template_PopupMain_02_C_SetContentSettings");
static_assert(sizeof(WBP_Template_PopupMain_02_C_SetContentSettings) == 0x000028, "Wrong size on WBP_Template_PopupMain_02_C_SetContentSettings");
static_assert(offsetof(WBP_Template_PopupMain_02_C_SetContentSettings, Param_ContentPadding) == 0x000000, "Member 'WBP_Template_PopupMain_02_C_SetContentSettings::Param_ContentPadding' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_02_C_SetContentSettings, Param_VAlign_Content) == 0x000010, "Member 'WBP_Template_PopupMain_02_C_SetContentSettings::Param_VAlign_Content' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_02_C_SetContentSettings, Param_HAlign_Content) == 0x000011, "Member 'WBP_Template_PopupMain_02_C_SetContentSettings::Param_HAlign_Content' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_02_C_SetContentSettings, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000018, "Member 'WBP_Template_PopupMain_02_C_SetContentSettings::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_02_C_SetContentSettings, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_Template_PopupMain_02_C_SetContentSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Template_PopupMain_02.WBP_Template_PopupMain_02_C.SetHeaderText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Template_PopupMain_02_C_SetHeaderText final
{
public:
	class FText                                   Param_HeaderText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Template_PopupMain_02_C_SetHeaderText) == 0x000008, "Wrong alignment on WBP_Template_PopupMain_02_C_SetHeaderText");
static_assert(sizeof(WBP_Template_PopupMain_02_C_SetHeaderText) == 0x000018, "Wrong size on WBP_Template_PopupMain_02_C_SetHeaderText");
static_assert(offsetof(WBP_Template_PopupMain_02_C_SetHeaderText, Param_HeaderText) == 0x000000, "Member 'WBP_Template_PopupMain_02_C_SetHeaderText::Param_HeaderText' has a wrong offset!");

// Function WBP_Template_PopupMain_02.WBP_Template_PopupMain_02_C.SetTabSettings
// 0x0020 (0x0020 - 0x0000)
struct WBP_Template_PopupMain_02_C_SetTabSettings final
{
public:
	struct FMargin                                Param_TabPadding;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Template_PopupMain_02_C_SetTabSettings) == 0x000008, "Wrong alignment on WBP_Template_PopupMain_02_C_SetTabSettings");
static_assert(sizeof(WBP_Template_PopupMain_02_C_SetTabSettings) == 0x000020, "Wrong size on WBP_Template_PopupMain_02_C_SetTabSettings");
static_assert(offsetof(WBP_Template_PopupMain_02_C_SetTabSettings, Param_TabPadding) == 0x000000, "Member 'WBP_Template_PopupMain_02_C_SetTabSettings::Param_TabPadding' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_02_C_SetTabSettings, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000010, "Member 'WBP_Template_PopupMain_02_C_SetTabSettings::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Template_PopupMain_02_C_SetTabSettings, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_Template_PopupMain_02_C_SetTabSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

