#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SavedLoadoutsWheelChoice

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.Exchange Saved Loadout
// 0x0018 (0x0018 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_Exchange_Saved_Loadout final
{
public:
	class UWBP_SavedLoadoutsWheelChoice_C*        Exchanged_Wheel_Choice;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  OldLoadoutId;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_Exchange_Saved_Loadout) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_Exchange_Saved_Loadout");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_Exchange_Saved_Loadout) == 0x000018, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_Exchange_Saved_Loadout");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Exchange_Saved_Loadout, Exchanged_Wheel_Choice) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_Exchange_Saved_Loadout::Exchanged_Wheel_Choice' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Exchange_Saved_Loadout, OldLoadoutId) == 0x000008, "Member 'WBP_SavedLoadoutsWheelChoice_C_Exchange_Saved_Loadout::OldLoadoutId' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice
// 0x1418 (0x1418 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E16[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_CharacterPreviewer*                CallFunc_GetCharacterPreviewer_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E17[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAL_CharacterPreviewer*                CallFunc_GetCharacterPreviewer_ReturnValue_1;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVAL_CharacterPreviewer* CharacterPreviewer, const struct FGuid& RequestID, class UTextureRenderTarget2D* PreviewTexture)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_PointerEvent_2;                       // 0x0030(0x0078)(ConstParm)
	class UDragDropOperation*                     K2Node_Event_Operation_2;                          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00B8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent_1;                       // 0x00F0(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation_1;                          // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0170(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E18[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E19[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationLoadout     CallFunc_Map_Find_Value;                           // 0x0210(0x0900)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0B10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1A[0x7];                                     // 0x0B11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_RenderFullBodyPreviewParameters   K2Node_MakeStruct_VAL_RenderFullBodyPreviewParameters; // 0x0B18(0x0900)()
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice) == 0x001418, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, EntryPoint) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, CallFunc_GetCharacterPreviewer_ReturnValue) == 0x000008, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::CallFunc_GetCharacterPreviewer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, CallFunc_IsValid_Guid_ReturnValue) == 0x000010, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, CallFunc_GetCharacterPreviewer_ReturnValue_1) == 0x000018, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::CallFunc_GetCharacterPreviewer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, K2Node_Event_PointerEvent_2) == 0x000030, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::K2Node_Event_PointerEvent_2' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, K2Node_Event_Operation_2) == 0x0000A8, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::K2Node_Event_Operation_2' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B0, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, K2Node_Event_MyGeometry) == 0x0000B8, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, K2Node_Event_PointerEvent_1) == 0x0000F0, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::K2Node_Event_PointerEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, K2Node_Event_Operation_1) == 0x000168, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::K2Node_Event_Operation_1' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, K2Node_Event_PointerEvent) == 0x000170, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, K2Node_Event_Operation) == 0x0001E8, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, CallFunc_GetValeriaCharacter_OutResult) == 0x0001F0, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, CallFunc_GetValeriaCharacter_ReturnValue) == 0x0001F8, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, K2Node_SwitchEnum_CmpSuccess) == 0x000200, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, CallFunc_GetCharacterCustomizationComponent_ReturnValue) == 0x000208, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::CallFunc_GetCharacterCustomizationComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, CallFunc_Map_Find_Value) == 0x000210, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, CallFunc_Map_Find_ReturnValue) == 0x000B10, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice, K2Node_MakeStruct_VAL_RenderFullBodyPreviewParameters) == 0x000B18, "Member 'WBP_SavedLoadoutsWheelChoice_C_ExecuteUbergraph_WBP_SavedLoadoutsWheelChoice::K2Node_MakeStruct_VAL_RenderFullBodyPreviewParameters' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.GetDisplayedTexture
// 0x0058 (0x0058 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_GetDisplayedTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0030(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_GetDisplayedTexture) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_GetDisplayedTexture");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_GetDisplayedTexture) == 0x000058, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_GetDisplayedTexture");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_GetDisplayedTexture, Texture) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_GetDisplayedTexture::Texture' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_GetDisplayedTexture, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x000028, "Member 'WBP_SavedLoadoutsWheelChoice_C_GetDisplayedTexture::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_GetDisplayedTexture, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000030, "Member 'WBP_SavedLoadoutsWheelChoice_C_GetDisplayedTexture::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.HandleHovered
// 0x0010 (0x0010 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_HandleHovered final
{
public:
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_HandleHovered) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_HandleHovered");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_HandleHovered) == 0x000010, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_HandleHovered");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_HandleHovered, CallFunc_AkEventGlobal_ReturnValue) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_HandleHovered::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_HandleHovered, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_SavedLoadoutsWheelChoice_C_HandleHovered::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.HandleRenderRequestFinished
// 0x0028 (0x0028 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished final
{
public:
	class AVAL_CharacterPreviewer*                CharacterPreviewer;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  RequestID;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 PreviewTexture;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished) == 0x000028, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished, CharacterPreviewer) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished::CharacterPreviewer' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished, RequestID) == 0x000008, "Member 'WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished::RequestID' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished, PreviewTexture) == 0x000018, "Member 'WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished::PreviewTexture' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished, CallFunc_EqualEqual_GuidGuid_ReturnValue) == 0x000020, "Member 'WBP_SavedLoadoutsWheelChoice_C_HandleRenderRequestFinished::CallFunc_EqualEqual_GuidGuid_ReturnValue' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.HandleUnhovered
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_HandleUnhovered final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_HandleUnhovered) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_HandleUnhovered");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_HandleUnhovered) == 0x000008, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_HandleUnhovered");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_HandleUnhovered, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_HandleUnhovered::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.HasValidLoadoutId
// 0x0002 (0x0002 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_HasValidLoadoutId final
{
public:
	bool                                          bHasValidLoadoutId;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_HasValidLoadoutId) == 0x000001, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_HasValidLoadoutId");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_HasValidLoadoutId) == 0x000002, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_HasValidLoadoutId");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_HasValidLoadoutId, bHasValidLoadoutId) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_HasValidLoadoutId::bHasValidLoadoutId' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_HasValidLoadoutId, CallFunc_IsValid_Guid_ReturnValue) == 0x000001, "Member 'WBP_SavedLoadoutsWheelChoice_C_HasValidLoadoutId::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.Initialize
// 0x0910 (0x0910 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_Initialize final
{
public:
	struct FGuid                                  Param_LoadoutId;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationLoadout     Loadout;                                           // 0x0010(0x0900)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_Initialize) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_Initialize");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_Initialize) == 0x000910, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_Initialize");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Initialize, Param_LoadoutId) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_Initialize::Param_LoadoutId' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Initialize, Loadout) == 0x000010, "Member 'WBP_SavedLoadoutsWheelChoice_C_Initialize::Loadout' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.NewLoadoutAssigned__DelegateSignature
// 0x0014 (0x0014 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_NewLoadoutAssigned__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Param_LoadoutId;                                   // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_NewLoadoutAssigned__DelegateSignature) == 0x000004, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_NewLoadoutAssigned__DelegateSignature");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_NewLoadoutAssigned__DelegateSignature) == 0x000014, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_NewLoadoutAssigned__DelegateSignature");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_NewLoadoutAssigned__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_NewLoadoutAssigned__DelegateSignature::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_NewLoadoutAssigned__DelegateSignature, Param_LoadoutId) == 0x000004, "Member 'WBP_SavedLoadoutsWheelChoice_C_NewLoadoutAssigned__DelegateSignature::Param_LoadoutId' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.OnDragCancelled
// 0x0080 (0x0080 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_OnDragCancelled final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_OnDragCancelled) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_OnDragCancelled");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_OnDragCancelled) == 0x000080, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_OnDragCancelled");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragCancelled, PointerEvent) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragCancelled::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragCancelled, Operation) == 0x000078, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragCancelled::Operation' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.OnDragDetected
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SavedLoadoutDrag_C*                 CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetDisplayedTexture_Texture;              // 0x00C0(0x0028)(HasGetValueTypeHash)
	class UWBP_SavedLoadout_Drag_C*               CallFunc_Create_ReturnValue;                       // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_OnDragDetected) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_OnDragDetected");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_OnDragDetected) == 0x0000F0, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_OnDragDetected");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragDetected, Operation) == 0x0000B0, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000B8, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragDetected, CallFunc_GetDisplayedTexture_Texture) == 0x0000C0, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragDetected::CallFunc_GetDisplayedTexture_Texture' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x0000E8, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.OnDragEnter
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_OnDragEnter) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_OnDragEnter");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_OnDragEnter) == 0x0000B8, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_OnDragEnter");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragEnter, MyGeometry) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragEnter, PointerEvent) == 0x000038, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragEnter::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragEnter, Operation) == 0x0000B0, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragEnter::Operation' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.OnDragLeave
// 0x0080 (0x0080 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_OnDragLeave) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_OnDragLeave");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_OnDragLeave) == 0x000080, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_OnDragLeave");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDragLeave, Operation) == 0x000078, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDragLeave::Operation' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.OnDrop
// 0x0108 (0x0108 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1C[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  OldLoadoutId;                                      // 0x00BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1D[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            SavedLoadoutWidgetReference;                       // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_SavedLoadoutDrag_C*                 K2Node_DynamicCast_AsBP_Saved_Loadout_Drag;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1E[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SavedLoadoutsWheelChoice_C*        K2Node_DynamicCast_AsWBP_Saved_Loadouts_Wheel_Choice; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1F[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TileEntry_SavedLoadout_C*          K2Node_DynamicCast_AsWBP_Tile_Entry_Saved_Loadout; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_OnDrop) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_OnDrop");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_OnDrop) == 0x000108, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_OnDrop");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, MyGeometry) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, PointerEvent) == 0x000038, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, Operation) == 0x0000B0, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, ReturnValue) == 0x0000B8, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, OldLoadoutId) == 0x0000BC, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::OldLoadoutId' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, SavedLoadoutWidgetReference) == 0x0000D0, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::SavedLoadoutWidgetReference' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, K2Node_DynamicCast_AsBP_Saved_Loadout_Drag) == 0x0000D8, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::K2Node_DynamicCast_AsBP_Saved_Loadout_Drag' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, K2Node_DynamicCast_AsWBP_Saved_Loadouts_Wheel_Choice) == 0x0000E8, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::K2Node_DynamicCast_AsWBP_Saved_Loadouts_Wheel_Choice' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, K2Node_DynamicCast_AsWBP_Tile_Entry_Saved_Loadout) == 0x0000F8, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::K2Node_DynamicCast_AsWBP_Tile_Entry_Saved_Loadout' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnDrop, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000101, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnDrop::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.OnMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0168(0x00B8)()
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown) == 0x000220, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000168, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.OnPreviewMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0168(0x00B8)()
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown) == 0x000220, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000168, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnPreviewMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.OnSavedLoadoutWheelChoiceFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_OnSavedLoadoutWheelChoiceFocused__DelegateSignature final
{
public:
	class UWBP_SavedLoadoutsWheelChoice_C*        NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_OnSavedLoadoutWheelChoiceFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_OnSavedLoadoutWheelChoiceFocused__DelegateSignature");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_OnSavedLoadoutWheelChoiceFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_OnSavedLoadoutWheelChoiceFocused__DelegateSignature");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnSavedLoadoutWheelChoiceFocused__DelegateSignature, NewParam) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnSavedLoadoutWheelChoiceFocused__DelegateSignature::NewParam' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.OnSelect__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_OnSelect__DelegateSignature final
{
public:
	class UWBP_SavedLoadoutsWheelChoice_C*        Selected_Wheel_Choice;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_OnSelect__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_OnSelect__DelegateSignature");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_OnSelect__DelegateSignature) == 0x000008, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_OnSelect__DelegateSignature");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_OnSelect__DelegateSignature, Selected_Wheel_Choice) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_OnSelect__DelegateSignature::Selected_Wheel_Choice' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.Set Assigned Loadout
// 0x0038 (0x0038 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout final
{
public:
	struct FGuid                                  Param_LoadoutId;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   CharCustComp;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClearAssignedSavedLoadout_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AssignSavedLoadoutToWheel_ReturnValue;    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E20[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E21[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout) == 0x000038, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout, Param_LoadoutId) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout::Param_LoadoutId' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout, CharCustComp) == 0x000010, "Member 'WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout::CharCustComp' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout, CallFunc_ClearAssignedSavedLoadout_ReturnValue) == 0x000018, "Member 'WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout::CallFunc_ClearAssignedSavedLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout, CallFunc_IsValid_Guid_ReturnValue) == 0x000019, "Member 'WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout, CallFunc_AssignSavedLoadoutToWheel_ReturnValue) == 0x00001A, "Member 'WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout::CallFunc_AssignSavedLoadoutToWheel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout, CallFunc_GetValeriaCharacter_OutResult) == 0x00001B, "Member 'WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000020, "Member 'WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout, CallFunc_GetCharacterCustomizationComponent_ReturnValue) == 0x000030, "Member 'WBP_SavedLoadoutsWheelChoice_C_Set_Assigned_Loadout::CallFunc_GetCharacterCustomizationComponent_ReturnValue' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.SetSelectedTip
// 0x0004 (0x0004 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip) == 0x000001, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip) == 0x000004, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip, Temp_bool_Variable) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip, Temp_byte_Variable) == 0x000001, "Member 'WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip, K2Node_Select_Default) == 0x000003, "Member 'WBP_SavedLoadoutsWheelChoice_C_SetSelectedTip::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SavedLoadoutsWheelChoice.WBP_SavedLoadoutsWheelChoice_C.Update
// 0x0930 (0x0930 - 0x0000)
struct WBP_SavedLoadoutsWheelChoice_C_Update final
{
public:
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E22[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   CallFunc_GetCharacterCustomizationComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetLoadoutIdForAssignedSlot_ReturnValue;  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationLoadout     CallFunc_Map_Find_Value;                           // 0x0028(0x0900)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0929(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavedLoadoutsWheelChoice_C_Update) == 0x000008, "Wrong alignment on WBP_SavedLoadoutsWheelChoice_C_Update");
static_assert(sizeof(WBP_SavedLoadoutsWheelChoice_C_Update) == 0x000930, "Wrong size on WBP_SavedLoadoutsWheelChoice_C_Update");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Update, CallFunc_GetValeriaCharacter_OutResult) == 0x000000, "Member 'WBP_SavedLoadoutsWheelChoice_C_Update::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_SavedLoadoutsWheelChoice_C_Update, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_SavedLoadoutsWheelChoice_C_Update::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
