#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphics_Settings_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Graphics_Settings_CM.WBP_Graphics_Settings_CM_C
// 0x0030 (0x0540 - 0x0510)
class UWBP_Graphics_Settings_CM_C final : public UCommonActivatableWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActivatableWidgetSwitcher*       CommonSwitcher;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_ButtonTab_Secondary_02_CM_C* TabSelector_CM;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GraphicsSettings_Advanced_CM_C*    WBP_GraphicsSettings_Advanced_CM;                  // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GraphicsSettings_Quality_CM_C*     WBP_GraphicsSettings_Quality_CM;                   // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GraphicsSettings_Window_CM_C*      WBP_GraphicsSettings_Window_CM;                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Graphics_Settings_CM_TabSelector_CM_K2Node_ComponentBoundEvent_1_On_Tab_Selection_Changed__DelegateSignature(int32 Tab_Selection);
	void Construct();
	void DiscardChanges();
	void Display_GamePad_Icon(bool IsShowIcon);
	void ExecuteUbergraph_WBP_Graphics_Settings_CM(int32 EntryPoint, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_1, float K2Node_EnhancedInputActionEvent_ElapsedTime_1, float K2Node_EnhancedInputActionEvent_TriggeredTime_1, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_1, class UInputAction* Temp_object_Variable, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, double Temp_real_Variable, double Temp_real_Variable_1, double Temp_real_Variable_0, double Temp_real_Variable_1_0, bool Temp_bool_Variable, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_1, class UInputAction* Temp_object_Variable_1, double Temp_real_Variable_2, double Temp_real_Variable_2_0, double Temp_real_Variable_3, bool Temp_bool_Variable_1, double Temp_real_Variable_3_0, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate, int32 K2Node_ComponentBoundEvent_Tab_Selection, ECommonInputType K2Node_CustomEvent_bNewInputType, bool K2Node_SwitchEnum_CmpSuccess_1, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1);
	void HasUnappliedWindowChanges(bool* Value, bool CallFunc_DoesWindowSettingsHasUnappliedChanges_Value);
	void InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void IsRestartSuggested(bool* Value, bool CallFunc_BooleanOR_ReturnValue);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void ResetRestartSuggestion();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Graphics_Settings_CM_C">();
	}
	static class UWBP_Graphics_Settings_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Graphics_Settings_CM_C>();
	}
};
static_assert(alignof(UWBP_Graphics_Settings_CM_C) == 0x000008, "Wrong alignment on UWBP_Graphics_Settings_CM_C");
static_assert(sizeof(UWBP_Graphics_Settings_CM_C) == 0x000540, "Wrong size on UWBP_Graphics_Settings_CM_C");
static_assert(offsetof(UWBP_Graphics_Settings_CM_C, UberGraphFrame) == 0x000510, "Member 'UWBP_Graphics_Settings_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_Settings_CM_C, CommonSwitcher) == 0x000518, "Member 'UWBP_Graphics_Settings_CM_C::CommonSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_Settings_CM_C, TabSelector_CM) == 0x000520, "Member 'UWBP_Graphics_Settings_CM_C::TabSelector_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_Settings_CM_C, WBP_GraphicsSettings_Advanced_CM) == 0x000528, "Member 'UWBP_Graphics_Settings_CM_C::WBP_GraphicsSettings_Advanced_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_Settings_CM_C, WBP_GraphicsSettings_Quality_CM) == 0x000530, "Member 'UWBP_Graphics_Settings_CM_C::WBP_GraphicsSettings_Quality_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_Settings_CM_C, WBP_GraphicsSettings_Window_CM) == 0x000538, "Member 'UWBP_Graphics_Settings_CM_C::WBP_GraphicsSettings_Window_CM' has a wrong offset!");

}

