#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IADescription

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_IADescription.WBP_IADescription_C.ExecuteUbergraph_WBP_IADescription
// 0x0004 (0x0004 - 0x0000)
struct WBP_IADescription_C_ExecuteUbergraph_WBP_IADescription final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IADescription_C_ExecuteUbergraph_WBP_IADescription) == 0x000004, "Wrong alignment on WBP_IADescription_C_ExecuteUbergraph_WBP_IADescription");
static_assert(sizeof(WBP_IADescription_C_ExecuteUbergraph_WBP_IADescription) == 0x000004, "Wrong size on WBP_IADescription_C_ExecuteUbergraph_WBP_IADescription");
static_assert(offsetof(WBP_IADescription_C_ExecuteUbergraph_WBP_IADescription, EntryPoint) == 0x000000, "Member 'WBP_IADescription_C_ExecuteUbergraph_WBP_IADescription::EntryPoint' has a wrong offset!");

// Function WBP_IADescription.WBP_IADescription_C.Setup Input Action
// 0x0010 (0x0010 - 0x0000)
struct WBP_IADescription_C_Setup_Input_Action final
{
public:
	class UInputAction*                           In_InputAction;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputMappingContext*                   In_DefaultIMC;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IADescription_C_Setup_Input_Action) == 0x000008, "Wrong alignment on WBP_IADescription_C_Setup_Input_Action");
static_assert(sizeof(WBP_IADescription_C_Setup_Input_Action) == 0x000010, "Wrong size on WBP_IADescription_C_Setup_Input_Action");
static_assert(offsetof(WBP_IADescription_C_Setup_Input_Action, In_InputAction) == 0x000000, "Member 'WBP_IADescription_C_Setup_Input_Action::In_InputAction' has a wrong offset!");
static_assert(offsetof(WBP_IADescription_C_Setup_Input_Action, In_DefaultIMC) == 0x000008, "Member 'WBP_IADescription_C_Setup_Input_Action::In_DefaultIMC' has a wrong offset!");

}

