#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SavedLoadouts_Wheel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S6UICore_classes.hpp"
#include "Palia_structs.hpp"
#include "S6Core_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SavedLoadouts_Wheel.WBP_SavedLoadouts_Wheel_C
// 0x09C0 (0x0EE0 - 0x0520)
class UWBP_SavedLoadouts_Wheel_C final : public US6UI_InputActionHandlingUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BackgroundCircle;                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Cooldown;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Cooldown;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ToolWheelUtilityButton_C*          SavedLoadoutCancelButton_Center;                   // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Cooldown;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RadialMenuWheel_Circular_C*        WBP_RadialMenuWheel_Circular;                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavedLoadoutsWheelChoice_C*        WBP_SavedLoadoutsWheelChoice;                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavedLoadoutsWheelChoice_C*        WBP_SavedLoadoutsWheelChoice_1;                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavedLoadoutsWheelChoice_C*        WBP_SavedLoadoutsWheelChoice_36;                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavedLoadoutsWheelChoice_C*        WBP_SavedLoadoutsWheelChoice_168;                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavedLoadoutsWheelChoice_C*        WBP_SavedLoadoutsWheelChoice_239;                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavedLoadoutsWheelChoice_C*        WBP_SavedLoadoutsWheelChoice_288;                  // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavedLoadoutsWheelChoice_C*        WBP_SavedLoadoutsWheelChoice_343;                  // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavedLoadoutsWheelChoice_C*        WBP_SavedLoadoutsWheelChoice_390;                  // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Wants_to_Select;                                   // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelecting;                                       // 0x0599(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5233[0x6];                                     // 0x059A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CooldownMaterialInstance;                          // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocked;                                         // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5234[0x3];                                     // 0x05A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CooldownLength;                                    // 0x05AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CooldownUpdateTimerHandle;                         // 0x05B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CooldownTotalTimerHandle;                          // 0x05B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        RadialSelectVectorX;                               // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRadialSelectUpdate;                              // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5235[0x7];                                     // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RadialSelectVectorY;                               // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationComponent*   CachedCharCustComp;                                // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationLoadout     CachedLoadout;                                     // 0x05E0(0x0900)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WBP_SavedLoadouts_Wheel_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_0_OnChoiceHovered__DelegateSignature(class UWidget* Widget);
	void BndEvt__WBP_SavedLoadouts_Wheel_WBP_RadialMenuWheel_Circular_K2Node_ComponentBoundEvent_1_OnChoiceUnhovered__DelegateSignature(class UWidget* Widget);
	void Completed_0EE233124A87DF9DDECF7A95E6D95681();
	void Construct();
	bool DeadzoneCheck(double DeadzoneAmount, ERedirectsPlatform CallFunc_GetPlatformType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, double CallFunc_Abs_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, double CallFunc_Abs_ReturnValue_1, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue);
	void ExecuteUbergraph_WBP_SavedLoadouts_Wheel(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_1, float K2Node_EnhancedInputActionEvent_ElapsedTime_1, float K2Node_EnhancedInputActionEvent_TriggeredTime_1, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_1, class UInputAction* Temp_object_Variable, double CallFunc_Conv_InputActionValueToAxis1D_ReturnValue, double Temp_real_Variable, double Temp_real_Variable_1, double Temp_real_Variable_0, double Temp_real_Variable_1_0, double Temp_real_Variable_2, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, double CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1, class UInputAction* Temp_object_Variable_1, double Temp_real_Variable_3, double Temp_real_Variable_3_0, double Temp_real_Variable_4, double Temp_real_Variable_5, double Temp_real_Variable_4_0, class UWidget* CallFunc_FinishSelecting_SelectedWidget, bool CallFunc_FinishSelecting_SelectionCancelled, class UWBP_SavedLoadoutsWheelChoice_C* K2Node_DynamicCast_AsWBP_Saved_Loadouts_Wheel_Choice, bool K2Node_DynamicCast_bSuccess, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class UVAL_CharacterCustomizationComponent* CallFunc_GetCharacterCustomizationComponent_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UVALUI_MainHUDWidget* K2Node_Event_MainWidget, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, class UWidget* K2Node_ComponentBoundEvent_Widget_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, class UWBP_SavedLoadoutsWheelChoice_C* K2Node_DynamicCast_AsWBP_Saved_Loadouts_Wheel_Choice_1, bool K2Node_DynamicCast_bSuccess_1, class UWidget* K2Node_ComponentBoundEvent_Widget, class UWBP_SavedLoadoutsWheelChoice_C* K2Node_DynamicCast_AsWBP_Saved_Loadouts_Wheel_Choice_2, bool K2Node_DynamicCast_bSuccess_2, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_DeadzoneCheck_ReturnValue, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult_1, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_1, class UVAL_CharacterCustomizationComponent* CallFunc_GetCharacterCustomizationComponent_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_ClearAllAssignedSavedLoadouts_ReturnValue, struct FVAL_CharacterCustomizationLoadout& CallFunc_GetLoadout_ReturnValue, const struct FVAL_CharacterCustomizationLoadout& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, TArray<class FName>& CallFunc_GetDifferencesBetweenLoadouts_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_4, class UVAL_ApplyCustomizationsToActorProxy* CallFunc_ApplyCustomizationsToActor_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void Failed_0EE233124A87DF9DDECF7A95E6D95681();
	void FinishSelecting();
	void InpActEvt_IA_RadialMenuNavigate_X_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_RadialMenuNavigate_Y_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void Interrupted_0EE233124A87DF9DDECF7A95E6D95681();
	void LockWheel();
	void OnInitialized();
	void PlayOutfitChangeAnimation(const struct FPlayEmoteOptionalParams& K2Node_MakeStruct_PlayEmoteOptionalParams, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UValeriaEmoteComponent* CallFunc_GetEmoteComponent_ReturnValue, bool CallFunc_PlayEmoteByAsset_ReturnValue);
	void StartCooldown(int32 CallFunc_FTrunc_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, double CallFunc_FTrunc_A_ImplicitCast);
	void StartSelecting(class UVALUI_MainHUDWidget* MainWidget);
	void StopSelecting();
	void Stubbed_0EE233124A87DF9DDECF7A95E6D95681();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ToggleCooldownVisibility(bool bTryToShow, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void UnlockWheel();
	void UpdateAllWheelSlots(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllSlotWidgets_Widgets, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UWBP_SavedLoadoutsWheelChoice_C* K2Node_DynamicCast_AsWBP_Saved_Loadouts_Wheel_Choice, bool K2Node_DynamicCast_bSuccess);
	void UpdateCooldown(float CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue, int32 CallFunc_FCeil_ReturnValue, float CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_1, class FText CallFunc_Conv_IntToText_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Divide_DoubleDouble_B_ImplicitCast, double CallFunc_FCeil_A_ImplicitCast, double CallFunc_Divide_DoubleDouble_A_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SavedLoadouts_Wheel_C">();
	}
	static class UWBP_SavedLoadouts_Wheel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SavedLoadouts_Wheel_C>();
	}
};
static_assert(alignof(UWBP_SavedLoadouts_Wheel_C) == 0x000008, "Wrong alignment on UWBP_SavedLoadouts_Wheel_C");
static_assert(sizeof(UWBP_SavedLoadouts_Wheel_C) == 0x000EE0, "Wrong size on UWBP_SavedLoadouts_Wheel_C");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, UberGraphFrame) == 0x000520, "Member 'UWBP_SavedLoadouts_Wheel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, Image_BackgroundCircle) == 0x000528, "Member 'UWBP_SavedLoadouts_Wheel_C::Image_BackgroundCircle' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, Image_Cooldown) == 0x000530, "Member 'UWBP_SavedLoadouts_Wheel_C::Image_Cooldown' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, Overlay_Cooldown) == 0x000538, "Member 'UWBP_SavedLoadouts_Wheel_C::Overlay_Cooldown' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, SavedLoadoutCancelButton_Center) == 0x000540, "Member 'UWBP_SavedLoadouts_Wheel_C::SavedLoadoutCancelButton_Center' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, Text_Cooldown) == 0x000548, "Member 'UWBP_SavedLoadouts_Wheel_C::Text_Cooldown' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, WBP_RadialMenuWheel_Circular) == 0x000550, "Member 'UWBP_SavedLoadouts_Wheel_C::WBP_RadialMenuWheel_Circular' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, WBP_SavedLoadoutsWheelChoice) == 0x000558, "Member 'UWBP_SavedLoadouts_Wheel_C::WBP_SavedLoadoutsWheelChoice' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, WBP_SavedLoadoutsWheelChoice_1) == 0x000560, "Member 'UWBP_SavedLoadouts_Wheel_C::WBP_SavedLoadoutsWheelChoice_1' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, WBP_SavedLoadoutsWheelChoice_36) == 0x000568, "Member 'UWBP_SavedLoadouts_Wheel_C::WBP_SavedLoadoutsWheelChoice_36' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, WBP_SavedLoadoutsWheelChoice_168) == 0x000570, "Member 'UWBP_SavedLoadouts_Wheel_C::WBP_SavedLoadoutsWheelChoice_168' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, WBP_SavedLoadoutsWheelChoice_239) == 0x000578, "Member 'UWBP_SavedLoadouts_Wheel_C::WBP_SavedLoadoutsWheelChoice_239' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, WBP_SavedLoadoutsWheelChoice_288) == 0x000580, "Member 'UWBP_SavedLoadouts_Wheel_C::WBP_SavedLoadoutsWheelChoice_288' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, WBP_SavedLoadoutsWheelChoice_343) == 0x000588, "Member 'UWBP_SavedLoadouts_Wheel_C::WBP_SavedLoadoutsWheelChoice_343' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, WBP_SavedLoadoutsWheelChoice_390) == 0x000590, "Member 'UWBP_SavedLoadouts_Wheel_C::WBP_SavedLoadoutsWheelChoice_390' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, Wants_to_Select) == 0x000598, "Member 'UWBP_SavedLoadouts_Wheel_C::Wants_to_Select' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, IsSelecting) == 0x000599, "Member 'UWBP_SavedLoadouts_Wheel_C::IsSelecting' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, CooldownMaterialInstance) == 0x0005A0, "Member 'UWBP_SavedLoadouts_Wheel_C::CooldownMaterialInstance' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, bIsLocked) == 0x0005A8, "Member 'UWBP_SavedLoadouts_Wheel_C::bIsLocked' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, CooldownLength) == 0x0005AC, "Member 'UWBP_SavedLoadouts_Wheel_C::CooldownLength' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, CooldownUpdateTimerHandle) == 0x0005B0, "Member 'UWBP_SavedLoadouts_Wheel_C::CooldownUpdateTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, CooldownTotalTimerHandle) == 0x0005B8, "Member 'UWBP_SavedLoadouts_Wheel_C::CooldownTotalTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, RadialSelectVectorX) == 0x0005C0, "Member 'UWBP_SavedLoadouts_Wheel_C::RadialSelectVectorX' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, IsRadialSelectUpdate) == 0x0005C8, "Member 'UWBP_SavedLoadouts_Wheel_C::IsRadialSelectUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, RadialSelectVectorY) == 0x0005D0, "Member 'UWBP_SavedLoadouts_Wheel_C::RadialSelectVectorY' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, CachedCharCustComp) == 0x0005D8, "Member 'UWBP_SavedLoadouts_Wheel_C::CachedCharCustComp' has a wrong offset!");
static_assert(offsetof(UWBP_SavedLoadouts_Wheel_C, CachedLoadout) == 0x0005E0, "Member 'UWBP_SavedLoadouts_Wheel_C::CachedLoadout' has a wrong offset!");

}

