#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemRequest_FulfillConfirmationModal_Console

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemRequest_FulfillConfirmationModal_Console.WBP_ItemRequest_FulfillConfirmationModal_Console_C.BindEventsOnConstruct
// 0x0020 (0x0020 - 0x0000)
struct WBP_ItemRequest_FulfillConfirmationModal_Console_C_BindEventsOnConstruct final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_BindEventsOnConstruct) == 0x000004, "Wrong alignment on WBP_ItemRequest_FulfillConfirmationModal_Console_C_BindEventsOnConstruct");
static_assert(sizeof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_BindEventsOnConstruct) == 0x000020, "Wrong size on WBP_ItemRequest_FulfillConfirmationModal_Console_C_BindEventsOnConstruct");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_BindEventsOnConstruct, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_BindEventsOnConstruct::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_BindEventsOnConstruct, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_BindEventsOnConstruct::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_ItemRequest_FulfillConfirmationModal_Console.WBP_ItemRequest_FulfillConfirmationModal_Console_C.ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console
// 0x0018 (0x0018 - 0x0000)
struct WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5252[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console) == 0x000008, "Wrong alignment on WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console");
static_assert(sizeof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console) == 0x000018, "Wrong size on WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console, EntryPoint) == 0x000000, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_ExecuteUbergraph_WBP_ItemRequest_FulfillConfirmationModal_Console::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_ItemRequest_FulfillConfirmationModal_Console.WBP_ItemRequest_FulfillConfirmationModal_Console_C.FillDesignTimeInfo
// 0x0020 (0x0020 - 0x0000)
struct WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo final
{
public:
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5253[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo) == 0x000008, "Wrong alignment on WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo");
static_assert(sizeof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo) == 0x000020, "Wrong size on WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000000, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000008, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000010, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_FillDesignTimeInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ItemRequest_FulfillConfirmationModal_Console.WBP_ItemRequest_FulfillConfirmationModal_Console_C.Initialize
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize final
{
public:
	class UVAL_ItemTypeDefinitionAsset*           ItemDefinition;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5254[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemAmountInX_ByType_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5255[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0118(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0130(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0180(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0190(0x0018)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5256[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize) == 0x000008, "Wrong alignment on WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize");
static_assert(sizeof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize) == 0x0001C8, "Wrong size on WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, ItemDefinition) == 0x000000, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::ItemDefinition' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, CallFunc_GetValeriaCharacter_OutResult) == 0x000008, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, CallFunc_GetItemAmountInX_ByType_ReturnValue) == 0x000018, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::CallFunc_GetItemAmountInX_ByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, K2Node_SwitchEnum_CmpSuccess) == 0x00001C, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000098, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, K2Node_MakeArray_Array_1) == 0x000108, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, CallFunc_Format_ReturnValue_1) == 0x000118, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, K2Node_MakeStruct_FormatArgumentData_2) == 0x000130, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, K2Node_MakeArray_Array_2) == 0x000180, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, CallFunc_Format_ReturnValue_2) == 0x000190, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0001A8, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0001B0, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, K2Node_DynamicCast_AsItem_Type_Definition) == 0x0001B8, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ItemRequest_FulfillConfirmationModal_Console.WBP_ItemRequest_FulfillConfirmationModal_Console_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemRequest_FulfillConfirmationModal_Console_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ItemRequest_FulfillConfirmationModal_Console_C_PreConstruct");
static_assert(sizeof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_PreConstruct) == 0x000001, "Wrong size on WBP_ItemRequest_FulfillConfirmationModal_Console_C_PreConstruct");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ItemRequest_FulfillConfirmationModal_Console.WBP_ItemRequest_FulfillConfirmationModal_Console_C.UnbindEventsOnDestruct
// 0x0020 (0x0020 - 0x0000)
struct WBP_ItemRequest_FulfillConfirmationModal_Console_C_UnbindEventsOnDestruct final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_UnbindEventsOnDestruct) == 0x000004, "Wrong alignment on WBP_ItemRequest_FulfillConfirmationModal_Console_C_UnbindEventsOnDestruct");
static_assert(sizeof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_UnbindEventsOnDestruct) == 0x000020, "Wrong size on WBP_ItemRequest_FulfillConfirmationModal_Console_C_UnbindEventsOnDestruct");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_UnbindEventsOnDestruct, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_UnbindEventsOnDestruct::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ItemRequest_FulfillConfirmationModal_Console_C_UnbindEventsOnDestruct, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_ItemRequest_FulfillConfirmationModal_Console_C_UnbindEventsOnDestruct::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

