#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadioSlider_Template_02_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "BP_RadioSliderPregisteredElement_structs.hpp"
#include "Engine_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RadioSlider_Template_02_CM.WBP_RadioSlider_Template_02_CM_C
// 0x0120 (0x03E0 - 0x02C0)
class UWBP_RadioSlider_Template_02_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_Border_Styled*                   Border_Slider;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_LeftArrow;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_RightArrow;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputAction_LB;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputAction_LT;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputAction_RB;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputAction_RT;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_RadioSlider*                     RadioSlider;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FBP_RadioSliderPregisteredElement> PregisteredElements;                               // 0x0308(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             OnSliderMoved;                                     // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVALUI_RadioSliderPaginationSettings   PaginationSettings;                                // 0x0328(0x0098)(Edit, BlueprintVisible)
	struct FMargin                                ElementPadding;                                    // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         SelectedIndex;                                     // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Page_Index;                                        // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PrimaryIA_;                                        // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_RadioSlider_01_VALUI_RadioSlider_22_K2Node_ComponentBoundEvent_0_OnElementWidgetCreated__DelegateSignature(class UUserWidget* ElementWidget, int32 ElementIndex);
	void BndEvt__WBP_RadioSlider_Template_01_RadioSlider_K2Node_ComponentBoundEvent_2_OnSliderChanged__DelegateSignature(class UUserWidget* PreviousElementWidget, int32 PreviousElementIndex, class UUserWidget* NewElementWidget, int32 NewElementIndex);
	void BndEvt__WBP_RadioSlider_Template_01_RadioSlider_K2Node_ComponentBoundEvent_4_OnPageChanged__DelegateSignature(int32 PageIndex, int32 TotalNumPages);
	void BndEvt__WBP_RadioSlider_Template_02_CM_Button_LeftArrow_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_RadioSlider_Template_02_CM_Button_LeftArrow_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_RadioSlider_Template_02_CM_Button_LeftArrow_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_RadioSlider_Template_02_CM_Button_RightArrow_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_RadioSlider_Template_02_CM_Button_RightArrow_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_RadioSlider_Template_02_CM_Button_RightArrow_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void DoSelected(bool IsForward, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 CallFunc_GetCurrentIndex_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Clamp_ReturnValue, int32 CallFunc_Clamp_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue);
	void ExecuteUbergraph_WBP_RadioSlider_Template_02_CM(int32 EntryPoint, bool CallFunc_IsMobilePlatform_ReturnValue, class UUserWidget* K2Node_ComponentBoundEvent_PreviousElementWidget, int32 K2Node_ComponentBoundEvent_PreviousElementIndex, class UUserWidget* K2Node_ComponentBoundEvent_NewElementWidget, int32 K2Node_ComponentBoundEvent_NewElementIndex, int32 K2Node_ComponentBoundEvent_PageIndex, int32 K2Node_ComponentBoundEvent_TotalNumPages, TDelegate<void(class UWBP_RadioSlider_Icon_CM_C* Widget)> K2Node_CreateDelegate_OutputDelegate, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_2, class UUserWidget* K2Node_ComponentBoundEvent_ElementWidget, int32 K2Node_ComponentBoundEvent_ElementIndex, bool K2Node_Event_IsDesignTime, bool CallFunc_Array_IsValidIndex_ReturnValue, class UWBP_RadioSlider_Icon_CM_C* K2Node_DynamicCast_AsWBP_Radio_Slider_Icon_CM, bool K2Node_DynamicCast_bSuccess, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_5, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_4, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_3, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_2, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, int32 CallFunc_AkEventGlobal_ReturnValue_3, bool CallFunc_IsVisible_ReturnValue);
	void GetElementAt(int32 Param_Index, struct FBP_RadioSliderPregisteredElement* Element, const struct FBP_RadioSliderPregisteredElement& CallFunc_Array_Get_Item);
	void GetNumberOfElements(int32* NumElements, int32 CallFunc_Array_Length_ReturnValue);
	void GetSelectedElement(struct FBP_RadioSliderPregisteredElement* Selected, const struct FBP_RadioSliderPregisteredElement& CallFunc_Array_Get_Item);
	void HandleOnButtonClicked(class UWBP_RadioSlider_Icon_CM_C* Widget, int32 CallFunc_GetIndexFromWidget_Index, bool CallFunc_GetIndexFromWidget_ReturnValue);
	void OnSliderMoved__DelegateSignature(class UUserWidget* ElementWidget, const struct FBP_RadioSliderPregisteredElement& ElementData);
	void PreConstruct(bool IsDesignTime);
	void SetActiveElement(int32 NewIndex);
	void SetArrowsInterior(const struct FMargin& K2Node_MakeStruct_Margin, class UHorizontalBoxSlot* CallFunc_SlotAsHorizontalBoxSlot_ReturnValue, const struct FMargin& K2Node_MakeStruct_Margin_1, class UHorizontalBoxSlot* CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1);
	void Update_Pagination_Button_Visibility(ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool CallFunc_IsConsole_ReturnValue, int32 CallFunc_GetTotalNumPages_ReturnValue, int32 CallFunc_GetCurrentPageIndex_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool Temp_bool_Variable_1, ESlateVisibility K2Node_Select_Default, ESlateVisibility K2Node_Select_Default_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RadioSlider_Template_02_CM_C">();
	}
	static class UWBP_RadioSlider_Template_02_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RadioSlider_Template_02_CM_C>();
	}
};
static_assert(alignof(UWBP_RadioSlider_Template_02_CM_C) == 0x000008, "Wrong alignment on UWBP_RadioSlider_Template_02_CM_C");
static_assert(sizeof(UWBP_RadioSlider_Template_02_CM_C) == 0x0003E0, "Wrong size on UWBP_RadioSlider_Template_02_CM_C");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_RadioSlider_Template_02_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, Border_Slider) == 0x0002C8, "Member 'UWBP_RadioSlider_Template_02_CM_C::Border_Slider' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, Button_LeftArrow) == 0x0002D0, "Member 'UWBP_RadioSlider_Template_02_CM_C::Button_LeftArrow' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, Button_RightArrow) == 0x0002D8, "Member 'UWBP_RadioSlider_Template_02_CM_C::Button_RightArrow' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, InputAction_LB) == 0x0002E0, "Member 'UWBP_RadioSlider_Template_02_CM_C::InputAction_LB' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, InputAction_LT) == 0x0002E8, "Member 'UWBP_RadioSlider_Template_02_CM_C::InputAction_LT' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, InputAction_RB) == 0x0002F0, "Member 'UWBP_RadioSlider_Template_02_CM_C::InputAction_RB' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, InputAction_RT) == 0x0002F8, "Member 'UWBP_RadioSlider_Template_02_CM_C::InputAction_RT' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, RadioSlider) == 0x000300, "Member 'UWBP_RadioSlider_Template_02_CM_C::RadioSlider' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, PregisteredElements) == 0x000308, "Member 'UWBP_RadioSlider_Template_02_CM_C::PregisteredElements' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, OnSliderMoved) == 0x000318, "Member 'UWBP_RadioSlider_Template_02_CM_C::OnSliderMoved' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, PaginationSettings) == 0x000328, "Member 'UWBP_RadioSlider_Template_02_CM_C::PaginationSettings' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, ElementPadding) == 0x0003C0, "Member 'UWBP_RadioSlider_Template_02_CM_C::ElementPadding' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, SelectedIndex) == 0x0003D0, "Member 'UWBP_RadioSlider_Template_02_CM_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, Page_Index) == 0x0003D4, "Member 'UWBP_RadioSlider_Template_02_CM_C::Page_Index' has a wrong offset!");
static_assert(offsetof(UWBP_RadioSlider_Template_02_CM_C, PrimaryIA_) == 0x0003D8, "Member 'UWBP_RadioSlider_Template_02_CM_C::PrimaryIA_' has a wrong offset!");

}

