#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EscapeMenu_CM

#include "Basic.hpp"

#include "S6UICore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.ActivateOpenWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_EscapeMenu_CM_C_ActivateOpenWidget final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5632[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget_1;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_ActivateOpenWidget) == 0x000008, "Wrong alignment on WBP_EscapeMenu_CM_C_ActivateOpenWidget");
static_assert(sizeof(WBP_EscapeMenu_CM_C_ActivateOpenWidget) == 0x000030, "Wrong size on WBP_EscapeMenu_CM_C_ActivateOpenWidget");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ActivateOpenWidget, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_ActivateOpenWidget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ActivateOpenWidget, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_EscapeMenu_CM_C_ActivateOpenWidget::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ActivateOpenWidget, K2Node_DynamicCast_AsCommon_Activatable_Widget) == 0x000010, "Member 'WBP_EscapeMenu_CM_C_ActivateOpenWidget::K2Node_DynamicCast_AsCommon_Activatable_Widget' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ActivateOpenWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_EscapeMenu_CM_C_ActivateOpenWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ActivateOpenWidget, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_EscapeMenu_CM_C_ActivateOpenWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ActivateOpenWidget, K2Node_DynamicCast_AsCommon_Activatable_Widget_1) == 0x000020, "Member 'WBP_EscapeMenu_CM_C_ActivateOpenWidget::K2Node_DynamicCast_AsCommon_Activatable_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ActivateOpenWidget, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WBP_EscapeMenu_CM_C_ActivateOpenWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.BP_OnHandleBackAction
// 0x0028 (0x0028 - 0x0000)
struct WBP_EscapeMenu_CM_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5633[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5634[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on WBP_EscapeMenu_CM_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_EscapeMenu_CM_C_BP_OnHandleBackAction) == 0x000028, "Wrong size on WBP_EscapeMenu_CM_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_EscapeMenu_CM_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_BP_OnHandleBackAction, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_EscapeMenu_CM_C_BP_OnHandleBackAction::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_BP_OnHandleBackAction, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_EscapeMenu_CM_C_BP_OnHandleBackAction::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_BP_OnHandleBackAction, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000018, "Member 'WBP_EscapeMenu_CM_C_BP_OnHandleBackAction::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_BP_OnHandleBackAction, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000020, "Member 'WBP_EscapeMenu_CM_C_BP_OnHandleBackAction::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.CanClose
// 0x0003 (0x0003 - 0x0000)
struct WBP_EscapeMenu_CM_C_CanClose final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ES6UI_ModalWidgetState                        CallFunc_GetModalWidgetState_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_CanClose) == 0x000001, "Wrong alignment on WBP_EscapeMenu_CM_C_CanClose");
static_assert(sizeof(WBP_EscapeMenu_CM_C_CanClose) == 0x000003, "Wrong size on WBP_EscapeMenu_CM_C_CanClose");
static_assert(offsetof(WBP_EscapeMenu_CM_C_CanClose, ReturnValue) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_CanClose::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_CanClose, CallFunc_GetModalWidgetState_ReturnValue) == 0x000001, "Member 'WBP_EscapeMenu_CM_C_CanClose::CallFunc_GetModalWidgetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_CanClose, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_EscapeMenu_CM_C_CanClose::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.CloseEscapeMenu
// 0x0010 (0x0010 - 0x0000)
struct WBP_EscapeMenu_CM_C_CloseEscapeMenu final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_CloseEscapeMenu) == 0x000008, "Wrong alignment on WBP_EscapeMenu_CM_C_CloseEscapeMenu");
static_assert(sizeof(WBP_EscapeMenu_CM_C_CloseEscapeMenu) == 0x000010, "Wrong size on WBP_EscapeMenu_CM_C_CloseEscapeMenu");
static_assert(offsetof(WBP_EscapeMenu_CM_C_CloseEscapeMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_CloseEscapeMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_CloseEscapeMenu, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'WBP_EscapeMenu_CM_C_CloseEscapeMenu::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.DisplayKeyRebindPrompt
// 0x0001 (0x0001 - 0x0000)
struct WBP_EscapeMenu_CM_C_DisplayKeyRebindPrompt final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_DisplayKeyRebindPrompt) == 0x000001, "Wrong alignment on WBP_EscapeMenu_CM_C_DisplayKeyRebindPrompt");
static_assert(sizeof(WBP_EscapeMenu_CM_C_DisplayKeyRebindPrompt) == 0x000001, "Wrong size on WBP_EscapeMenu_CM_C_DisplayKeyRebindPrompt");
static_assert(offsetof(WBP_EscapeMenu_CM_C_DisplayKeyRebindPrompt, bIsVisible) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_DisplayKeyRebindPrompt::bIsVisible' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.ExecuteUbergraph_WBP_EscapeMenu_CM
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5635[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5636[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5637[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetVersionString_ReturnValue;             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidVersionString_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5638[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_StateViewModel*                   CallFunc_GetViewModel_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_MainHUDViewModel*                K2Node_DynamicCast_AsVALUI_Main_HUDView_Model;     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5639[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_StateViewModel*                   CallFunc_GetViewModel_ReturnValue_1;               // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_MainHUDViewModel*                K2Node_DynamicCast_AsVALUI_Main_HUDView_Model_1;   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_563A[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0104(0x0014)()
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_563B[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsActivated)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsVisible;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_563C[0x3];                                     // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x013C(0x0014)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_563D[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_563E[0x2];                                     // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaPlayerController*               K2Node_DynamicCast_AsValeria_Player_Controller;    // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_563F[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM) == 0x000008, "Wrong alignment on WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM");
static_assert(sizeof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM) == 0x0001A0, "Wrong size on WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, EntryPoint) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, Temp_bool_Variable) == 0x000004, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000048, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, Temp_object_Variable) == 0x000050, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, Temp_real_Variable) == 0x000058, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, Temp_real_Variable_0) == 0x000060, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, Temp_real_Variable_1) == 0x000068, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, Temp_bool_Variable_1) == 0x000070, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, Temp_real_Variable_1_0) == 0x000078, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetVersionString_ReturnValue) == 0x000080, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetVersionString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000090, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_IsValidVersionString_ReturnValue) == 0x000098, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_IsValidVersionString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetCurrentInputType_ReturnValue) == 0x000099, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B8, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetUIManagerWidget_ReturnValue) == 0x0000C0, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000C8, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetUIManagerWidget_ReturnValue_1) == 0x0000D0, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetUIManagerWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetViewModel_ReturnValue) == 0x0000D8, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetViewModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_DynamicCast_AsVALUI_Main_HUDView_Model) == 0x0000E0, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_DynamicCast_AsVALUI_Main_HUDView_Model' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetViewModel_ReturnValue_1) == 0x0000F0, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetViewModel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_DynamicCast_AsVALUI_Main_HUDView_Model_1) == 0x0000F8, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_DynamicCast_AsVALUI_Main_HUDView_Model_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_MakeStruct_SlateColor) == 0x000104, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_CustomEvent_bNewInputType) == 0x000118, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000120, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_CustomEvent_bIsVisible) == 0x000138, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_CustomEvent_bIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_MakeStruct_SlateColor_1) == 0x00013C, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, Temp_byte_Variable) == 0x000150, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000154, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x000164, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, Temp_byte_Variable_1) == 0x000174, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_Select_Default) == 0x000175, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetPlayerController_ReturnValue) == 0x000178, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_DynamicCast_AsValeria_Player_Controller) == 0x000180, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_DynamicCast_AsValeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, K2Node_DynamicCast_bSuccess_2) == 0x000188, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_GetActiveWidget_ReturnValue) == 0x000190, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000198, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000199, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM, CallFunc_BooleanAND_ReturnValue) == 0x00019A, "Member 'WBP_EscapeMenu_CM_C_ExecuteUbergraph_WBP_EscapeMenu_CM::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.HandleAnnouncementsFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_CM_C_HandleAnnouncementsFinished final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_HandleAnnouncementsFinished) == 0x000008, "Wrong alignment on WBP_EscapeMenu_CM_C_HandleAnnouncementsFinished");
static_assert(sizeof(WBP_EscapeMenu_CM_C_HandleAnnouncementsFinished) == 0x000008, "Wrong size on WBP_EscapeMenu_CM_C_HandleAnnouncementsFinished");
static_assert(offsetof(WBP_EscapeMenu_CM_C_HandleAnnouncementsFinished, Widget) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_HandleAnnouncementsFinished::Widget' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.HandleOnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_EscapeMenu_CM_C_HandleOnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_HandleOnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_EscapeMenu_CM_C_HandleOnInputMethodChanged");
static_assert(sizeof(WBP_EscapeMenu_CM_C_HandleOnInputMethodChanged) == 0x000001, "Wrong size on WBP_EscapeMenu_CM_C_HandleOnInputMethodChanged");
static_assert(offsetof(WBP_EscapeMenu_CM_C_HandleOnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_HandleOnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.HandleStartClosing_BP
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_CM_C_HandleStartClosing_BP final
{
public:
	bool                                          bPermitLatentClosing;                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutHasLatentClosingLogic;                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5640[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_HandleStartClosing_BP) == 0x000004, "Wrong alignment on WBP_EscapeMenu_CM_C_HandleStartClosing_BP");
static_assert(sizeof(WBP_EscapeMenu_CM_C_HandleStartClosing_BP) == 0x000008, "Wrong size on WBP_EscapeMenu_CM_C_HandleStartClosing_BP");
static_assert(offsetof(WBP_EscapeMenu_CM_C_HandleStartClosing_BP, bPermitLatentClosing) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_HandleStartClosing_BP::bPermitLatentClosing' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_HandleStartClosing_BP, bOutHasLatentClosingLogic) == 0x000001, "Member 'WBP_EscapeMenu_CM_C_HandleStartClosing_BP::bOutHasLatentClosingLogic' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_HandleStartClosing_BP, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_EscapeMenu_CM_C_HandleStartClosing_BP::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.HandleStartOpening_BP
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_CM_C_HandleStartOpening_BP final
{
public:
	bool                                          bOutHasLatentOpeningLogic;                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5641[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_HandleStartOpening_BP) == 0x000004, "Wrong alignment on WBP_EscapeMenu_CM_C_HandleStartOpening_BP");
static_assert(sizeof(WBP_EscapeMenu_CM_C_HandleStartOpening_BP) == 0x000008, "Wrong size on WBP_EscapeMenu_CM_C_HandleStartOpening_BP");
static_assert(offsetof(WBP_EscapeMenu_CM_C_HandleStartOpening_BP, bOutHasLatentOpeningLogic) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_HandleStartOpening_BP::bOutHasLatentOpeningLogic' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_HandleStartOpening_BP, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_EscapeMenu_CM_C_HandleStartOpening_BP::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_EscapeMenu_CM_C_InpActEvt_IA_ToggleApplicationMenu_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.OnKeyDown
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_EscapeMenu_CM_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5642[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5643[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5644[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0228(0x00B8)()
};
static_assert(alignof(WBP_EscapeMenu_CM_C_OnKeyDown) == 0x000008, "Wrong alignment on WBP_EscapeMenu_CM_C_OnKeyDown");
static_assert(sizeof(WBP_EscapeMenu_CM_C_OnKeyDown) == 0x0002E0, "Wrong size on WBP_EscapeMenu_CM_C_OnKeyDown");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'WBP_EscapeMenu_CM_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'WBP_EscapeMenu_CM_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'WBP_EscapeMenu_CM_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnKeyDown, CallFunc_GetActiveWidget_ReturnValue) == 0x000148, "Member 'WBP_EscapeMenu_CM_C_OnKeyDown::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000150, "Member 'WBP_EscapeMenu_CM_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnKeyDown, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000158, "Member 'WBP_EscapeMenu_CM_C_OnKeyDown::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnKeyDown, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000160, "Member 'WBP_EscapeMenu_CM_C_OnKeyDown::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'WBP_EscapeMenu_CM_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnKeyDown, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000220, "Member 'WBP_EscapeMenu_CM_C_OnKeyDown::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000228, "Member 'WBP_EscapeMenu_CM_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.OnMouseButtonDown
// 0x02D8 (0x02D8 - 0x0000)
struct WBP_EscapeMenu_CM_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
	struct FEventReply                            CallFunc_SetUserFocus_ReturnValue;                 // 0x0220(0x00B8)()
};
static_assert(alignof(WBP_EscapeMenu_CM_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_EscapeMenu_CM_C_OnMouseButtonDown");
static_assert(sizeof(WBP_EscapeMenu_CM_C_OnMouseButtonDown) == 0x0002D8, "Wrong size on WBP_EscapeMenu_CM_C_OnMouseButtonDown");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_EscapeMenu_CM_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_EscapeMenu_CM_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'WBP_EscapeMenu_CM_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_OnMouseButtonDown, CallFunc_SetUserFocus_ReturnValue) == 0x000220, "Member 'WBP_EscapeMenu_CM_C_OnMouseButtonDown::CallFunc_SetUserFocus_ReturnValue' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.SetHelpHotKeysVisibility
// 0x0006 (0x0006 - 0x0000)
struct WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility final
{
public:
	ECommonInputType                              Input_Method;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility) == 0x000001, "Wrong alignment on WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility");
static_assert(sizeof(WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility) == 0x000006, "Wrong size on WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility");
static_assert(offsetof(WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility, Input_Method) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility::Input_Method' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility, Temp_byte_Variable) == 0x000003, "Member 'WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility, K2Node_Select_Default) == 0x000005, "Member 'WBP_EscapeMenu_CM_C_SetHelpHotKeysVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.ShowAnnouncements
// 0x0028 (0x0028 - 0x0000)
struct WBP_EscapeMenu_CM_C_ShowAnnouncements final
{
public:
	TDelegate<void(class UWidget* Widget)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_AnnouncementsModalDialog_CM_C*     CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_ShowAnnouncements) == 0x000008, "Wrong alignment on WBP_EscapeMenu_CM_C_ShowAnnouncements");
static_assert(sizeof(WBP_EscapeMenu_CM_C_ShowAnnouncements) == 0x000028, "Wrong size on WBP_EscapeMenu_CM_C_ShowAnnouncements");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ShowAnnouncements, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_ShowAnnouncements::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ShowAnnouncements, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_EscapeMenu_CM_C_ShowAnnouncements::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ShowAnnouncements, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_EscapeMenu_CM_C_ShowAnnouncements::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EscapeMenu_CM_C_ShowAnnouncements, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000020, "Member 'WBP_EscapeMenu_CM_C_ShowAnnouncements::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_EscapeMenu_CM.WBP_EscapeMenu_CM_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_EscapeMenu_CM_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EscapeMenu_CM_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_EscapeMenu_CM_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_EscapeMenu_CM_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_EscapeMenu_CM_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_EscapeMenu_CM_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_EscapeMenu_CM_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

