#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BodyType_CM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_BodyType_CM.WBP_BodyType_CM_C.BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_BodyType_CM.WBP_BodyType_CM_C.BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_BodyType_CM_C_BndEvt__WBP_BodyType_CM_Button_BodyType_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_BodyType_CM.WBP_BodyType_CM_C.ExecuteUbergraph_WBP_BodyType_CM
// 0x0020 (0x0020 - 0x0000)
struct WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5652[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5653[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM) == 0x000008, "Wrong alignment on WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM");
static_assert(sizeof(WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM) == 0x000020, "Wrong size on WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM");
static_assert(offsetof(WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM, EntryPoint) == 0x000000, "Member 'WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000010, "Member 'WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_BodyType_CM_C_ExecuteUbergraph_WBP_BodyType_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");

// Function WBP_BodyType_CM.WBP_BodyType_CM_C.OnButtonTypeButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BodyType_CM_C_OnButtonTypeButtonClicked__DelegateSignature final
{
public:
	class UWBP_BodyType_CM_C*                     BodyTypeButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BodyType_CM_C_OnButtonTypeButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_BodyType_CM_C_OnButtonTypeButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_BodyType_CM_C_OnButtonTypeButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_BodyType_CM_C_OnButtonTypeButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_BodyType_CM_C_OnButtonTypeButtonClicked__DelegateSignature, BodyTypeButton) == 0x000000, "Member 'WBP_BodyType_CM_C_OnButtonTypeButtonClicked__DelegateSignature::BodyTypeButton' has a wrong offset!");

// Function WBP_BodyType_CM.WBP_BodyType_CM_C.SetActive
// 0x0014 (0x0014 - 0x0000)
struct WBP_BodyType_CM_C_SetActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5654[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BodyType_CM_C_SetActive) == 0x000004, "Wrong alignment on WBP_BodyType_CM_C_SetActive");
static_assert(sizeof(WBP_BodyType_CM_C_SetActive) == 0x000014, "Wrong size on WBP_BodyType_CM_C_SetActive");
static_assert(offsetof(WBP_BodyType_CM_C_SetActive, IsActive) == 0x000000, "Member 'WBP_BodyType_CM_C_SetActive::IsActive' has a wrong offset!");
static_assert(offsetof(WBP_BodyType_CM_C_SetActive, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WBP_BodyType_CM_C_SetActive::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function WBP_BodyType_CM.WBP_BodyType_CM_C.SetBodyType
// 0x0058 (0x0058 - 0x0000)
struct WBP_BodyType_CM_C_SetBodyType final
{
public:
	EVAL_CharacterBodyType                        BodyType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5655[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0008(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5656[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Map_Find_Value_1;                         // 0x0028(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BodyType_CM_C_SetBodyType) == 0x000008, "Wrong alignment on WBP_BodyType_CM_C_SetBodyType");
static_assert(sizeof(WBP_BodyType_CM_C_SetBodyType) == 0x000058, "Wrong size on WBP_BodyType_CM_C_SetBodyType");
static_assert(offsetof(WBP_BodyType_CM_C_SetBodyType, BodyType) == 0x000000, "Member 'WBP_BodyType_CM_C_SetBodyType::BodyType' has a wrong offset!");
static_assert(offsetof(WBP_BodyType_CM_C_SetBodyType, CallFunc_Map_Find_Value) == 0x000008, "Member 'WBP_BodyType_CM_C_SetBodyType::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_BodyType_CM_C_SetBodyType, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'WBP_BodyType_CM_C_SetBodyType::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BodyType_CM_C_SetBodyType, CallFunc_Map_Find_Value_1) == 0x000028, "Member 'WBP_BodyType_CM_C_SetBodyType::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_BodyType_CM_C_SetBodyType, CallFunc_Map_Find_ReturnValue_1) == 0x000050, "Member 'WBP_BodyType_CM_C_SetBodyType::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

}

