#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerNamePlate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.ExecuteUbergraph_WBP_PlayerNamePlate
// 0x0418 (0x0418 - 0x0000)
struct WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_437C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_437D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_437E[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_437F[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_CustomEvent_Character_1;                    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<struct FUniqueNetIdRepl>                 K2Node_CustomEvent_PlayerCharacterIds;             // 0x00B8(0x0050)()
	TDelegate<void(TSet<struct FUniqueNetIdRepl>& BlockedUsers)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDebugInfoComponent*                    K2Node_CustomEvent_DebugInfo;                      // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_5;    // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDebugInfoComponent*                    CallFunc_GetDebugInfoComponent_ReturnValue;        // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      K2Node_CustomEvent_Character;                      // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaCharacterEvent                        K2Node_CustomEvent_Event;                          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4380[0x2];                                     // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaCharacter* Character, EValeriaCharacterEvent Event)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDebugInfoComponent* DebugInfo)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x014C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem, struct FUniqueNetIdRepl& AffectedUserNetId)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4381[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FUniqueNetIdRepl>                 K2Node_CustomEvent_BlockedUsers;                   // 0x0180(0x0050)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4382[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDebugInfoComponent*                    CallFunc_GetDebugInfoComponent_ReturnValue_1;      // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem, struct FUniqueNetIdRepl& AffectedUserNetId)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue_6;    // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4383[0x3];                                     // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AValeriaCharacter* Character, EValeriaCharacterEvent Event)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x01FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDebugInfoComponent* DebugInfo)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x020C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4384[0x4];                                     // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetCharacterNetId_NetId;                  // 0x0220(0x0030)(HasGetValueTypeHash)
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x0250(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVAL_PartyManagerState                        K2Node_CustomEvent_state_1;                        // 0x0260(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4385[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PartyMember                       K2Node_CustomEvent_Member_3;                       // 0x0268(0x0050)(ConstParm, HasGetValueTypeHash)
	TDelegate<void(const TSet<struct FUniqueNetIdRepl>& PlayerCharacterIds)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x02B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVAL_PartyMember                       K2Node_CustomEvent_Member_2;                       // 0x02C8(0x0050)(ConstParm, HasGetValueTypeHash)
	struct FVAL_PartyMember                       K2Node_CustomEvent_Member_1;                       // 0x0318(0x0050)(ConstParm, HasGetValueTypeHash)
	struct FVAL_PartyMember                       K2Node_CustomEvent_Member;                         // 0x0368(0x0050)(ConstParm, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x03B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_18;           // 0x03C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_19;           // 0x03D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_20;           // 0x03E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVAL_PartyManagerState                        K2Node_CustomEvent_state;                          // 0x03F8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4386[0x3];                                     // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_21;           // 0x03FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4387[0x4];                                     // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate");
static_assert(sizeof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate) == 0x000418, "Wrong size on WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, EntryPoint) == 0x000000, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000020, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000030, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x000050, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_3) == 0x000068, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_4) == 0x000078, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_5) == 0x000088, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_6) == 0x000098, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_Character_1) == 0x0000A8, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_GetLocalPlayerSubsystem_ReturnValue_4) == 0x0000B0, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_GetLocalPlayerSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_PlayerCharacterIds) == 0x0000B8, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_PlayerCharacterIds' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_7) == 0x000108, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_DebugInfo) == 0x000118, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_DebugInfo' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_GetLocalPlayerSubsystem_ReturnValue_5) == 0x000120, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_GetLocalPlayerSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_GetDebugInfoComponent_ReturnValue) == 0x000128, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_GetDebugInfoComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_Character) == 0x000130, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_Event) == 0x000138, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_Event' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_IsValid_ReturnValue_2) == 0x000139, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_8) == 0x00013C, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_9) == 0x00014C, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_10) == 0x00015C, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_11) == 0x00016C, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_BlockedUsers) == 0x000180, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_BlockedUsers' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_IsValid_ReturnValue_3) == 0x0001D0, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_GetDebugInfoComponent_ReturnValue_1) == 0x0001D8, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_GetDebugInfoComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_12) == 0x0001E0, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_GetLocalPlayerSubsystem_ReturnValue_6) == 0x0001F0, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_GetLocalPlayerSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_IsValid_ReturnValue_4) == 0x0001F8, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_13) == 0x0001FC, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_14) == 0x00020C, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_GetCharacterNetId_NetId) == 0x000220, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_GetCharacterNetId_NetId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_15) == 0x000250, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_state_1) == 0x000260, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_state_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_Member_3) == 0x000268, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_Member_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_16) == 0x0002B8, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_Member_2) == 0x0002C8, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_Member_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_Member_1) == 0x000318, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_Member_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_Member) == 0x000368, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_Member' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_17) == 0x0003B8, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_18) == 0x0003C8, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_19) == 0x0003D8, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_20) == 0x0003E8, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CustomEvent_state) == 0x0003F8, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CustomEvent_state' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_21) == 0x0003FC, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000410, "Member 'WBP_PlayerNamePlate_C_ExecuteUbergraph_WBP_PlayerNamePlate::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.GetCharacterNetId
// 0x0060 (0x0060 - 0x0000)
struct WBP_PlayerNamePlate_C_GetCharacterNetId final
{
public:
	struct FUniqueNetIdRepl                       NetId;                                             // 0x0000(0x0030)(Parm, OutParm, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetIdFromPlayerState_ReturnValue;      // 0x0030(0x0030)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_GetCharacterNetId) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_GetCharacterNetId");
static_assert(sizeof(WBP_PlayerNamePlate_C_GetCharacterNetId) == 0x000060, "Wrong size on WBP_PlayerNamePlate_C_GetCharacterNetId");
static_assert(offsetof(WBP_PlayerNamePlate_C_GetCharacterNetId, NetId) == 0x000000, "Member 'WBP_PlayerNamePlate_C_GetCharacterNetId::NetId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_GetCharacterNetId, CallFunc_GetNetIdFromPlayerState_ReturnValue) == 0x000030, "Member 'WBP_PlayerNamePlate_C_GetCharacterNetId::CallFunc_GetNetIdFromPlayerState_ReturnValue' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.Handle On Game User Settings UI Needs Update
// 0x0088 (0x0088 - 0x0000)
struct WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update final
{
public:
	struct FUniqueNetIdRepl                       CallFunc_GetCharacterNetId_NetId;                  // 0x0000(0x0030)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetCharacterNetId_NetId_1;                // 0x0030(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4388[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update");
static_assert(sizeof(WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update) == 0x000088, "Wrong size on WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update, CallFunc_GetCharacterNetId_NetId) == 0x000000, "Member 'WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update::CallFunc_GetCharacterNetId_NetId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update, CallFunc_GetCharacterNetId_NetId_1) == 0x000030, "Member 'WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update::CallFunc_GetCharacterNetId_NetId_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000061, "Member 'WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000080, "Member 'WBP_PlayerNamePlate_C_Handle_On_Game_User_Settings_UI_Needs_Update::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.Handle User Membership Changed
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_PlayerNamePlate_C_Handle_User_Membership_Changed final
{
public:
	class UVAL_PlayerGuildSubsystem*              PlayerGuildManager;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       AffectedUserNetId;                                 // 0x0008(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetCharacterNetId_NetId;                  // 0x0040(0x0030)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x0070(0x0030)(HasGetValueTypeHash)
	TSet<struct FUniqueNetIdRepl>                 K2Node_MakeSet_Set;                                // 0x00A0(0x0050)(ConstParm)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_Handle_User_Membership_Changed) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_Handle_User_Membership_Changed");
static_assert(sizeof(WBP_PlayerNamePlate_C_Handle_User_Membership_Changed) == 0x0000F8, "Wrong size on WBP_PlayerNamePlate_C_Handle_User_Membership_Changed");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_User_Membership_Changed, PlayerGuildManager) == 0x000000, "Member 'WBP_PlayerNamePlate_C_Handle_User_Membership_Changed::PlayerGuildManager' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_User_Membership_Changed, AffectedUserNetId) == 0x000008, "Member 'WBP_PlayerNamePlate_C_Handle_User_Membership_Changed::AffectedUserNetId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_User_Membership_Changed, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000038, "Member 'WBP_PlayerNamePlate_C_Handle_User_Membership_Changed::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_User_Membership_Changed, CallFunc_GetCharacterNetId_NetId) == 0x000040, "Member 'WBP_PlayerNamePlate_C_Handle_User_Membership_Changed::CallFunc_GetCharacterNetId_NetId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_User_Membership_Changed, CallFunc_GetNetId_ReturnValue) == 0x000070, "Member 'WBP_PlayerNamePlate_C_Handle_User_Membership_Changed::CallFunc_GetNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_User_Membership_Changed, K2Node_MakeSet_Set) == 0x0000A0, "Member 'WBP_PlayerNamePlate_C_Handle_User_Membership_Changed::K2Node_MakeSet_Set' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_Handle_User_Membership_Changed, CallFunc_Set_Contains_ReturnValue) == 0x0000F0, "Member 'WBP_PlayerNamePlate_C_Handle_User_Membership_Changed::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.HandleBlockListChanged
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerNamePlate_C_HandleBlockListChanged final
{
public:
	TSet<struct FUniqueNetIdRepl>                 BlockedUsers;                                      // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PlayerNamePlate_C_HandleBlockListChanged) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_HandleBlockListChanged");
static_assert(sizeof(WBP_PlayerNamePlate_C_HandleBlockListChanged) == 0x000050, "Wrong size on WBP_PlayerNamePlate_C_HandleBlockListChanged");
static_assert(offsetof(WBP_PlayerNamePlate_C_HandleBlockListChanged, BlockedUsers) == 0x000000, "Member 'WBP_PlayerNamePlate_C_HandleBlockListChanged::BlockedUsers' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.HandleCharacterChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerNamePlate_C_HandleCharacterChanged final
{
public:
	class AValeriaCharacter*                      Param_Character;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaCharacterEvent                        Event;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_HandleCharacterChanged) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_HandleCharacterChanged");
static_assert(sizeof(WBP_PlayerNamePlate_C_HandleCharacterChanged) == 0x000010, "Wrong size on WBP_PlayerNamePlate_C_HandleCharacterChanged");
static_assert(offsetof(WBP_PlayerNamePlate_C_HandleCharacterChanged, Param_Character) == 0x000000, "Member 'WBP_PlayerNamePlate_C_HandleCharacterChanged::Param_Character' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_HandleCharacterChanged, Event) == 0x000008, "Member 'WBP_PlayerNamePlate_C_HandleCharacterChanged::Event' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.HandleDebugInfoChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerNamePlate_C_HandleDebugInfoChanged final
{
public:
	class UDebugInfoComponent*                    DebugInfo;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_HandleDebugInfoChanged) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_HandleDebugInfoChanged");
static_assert(sizeof(WBP_PlayerNamePlate_C_HandleDebugInfoChanged) == 0x000008, "Wrong size on WBP_PlayerNamePlate_C_HandleDebugInfoChanged");
static_assert(offsetof(WBP_PlayerNamePlate_C_HandleDebugInfoChanged, DebugInfo) == 0x000000, "Member 'WBP_PlayerNamePlate_C_HandleDebugInfoChanged::DebugInfo' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.HandleFriendshipChanged
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerNamePlate_C_HandleFriendshipChanged final
{
public:
	TSet<struct FUniqueNetIdRepl>                 PlayerCharacterIds;                                // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PlayerNamePlate_C_HandleFriendshipChanged) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_HandleFriendshipChanged");
static_assert(sizeof(WBP_PlayerNamePlate_C_HandleFriendshipChanged) == 0x000050, "Wrong size on WBP_PlayerNamePlate_C_HandleFriendshipChanged");
static_assert(offsetof(WBP_PlayerNamePlate_C_HandleFriendshipChanged, PlayerCharacterIds) == 0x000000, "Member 'WBP_PlayerNamePlate_C_HandleFriendshipChanged::PlayerCharacterIds' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.HandleOnPartyStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerNamePlate_C_HandleOnPartyStateChanged final
{
public:
	EVAL_PartyManagerState                        State;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_HandleOnPartyStateChanged) == 0x000001, "Wrong alignment on WBP_PlayerNamePlate_C_HandleOnPartyStateChanged");
static_assert(sizeof(WBP_PlayerNamePlate_C_HandleOnPartyStateChanged) == 0x000001, "Wrong size on WBP_PlayerNamePlate_C_HandleOnPartyStateChanged");
static_assert(offsetof(WBP_PlayerNamePlate_C_HandleOnPartyStateChanged, State) == 0x000000, "Member 'WBP_PlayerNamePlate_C_HandleOnPartyStateChanged::State' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.IsBlocked
// 0x0048 (0x0048 - 0x0000)
struct WBP_PlayerNamePlate_C_IsBlocked final
{
public:
	bool                                          bBlocked;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4389[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetCharacterNetId_NetId;                  // 0x0008(0x0030)(HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUserBlocked_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_IsBlocked) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_IsBlocked");
static_assert(sizeof(WBP_PlayerNamePlate_C_IsBlocked) == 0x000048, "Wrong size on WBP_PlayerNamePlate_C_IsBlocked");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsBlocked, bBlocked) == 0x000000, "Member 'WBP_PlayerNamePlate_C_IsBlocked::bBlocked' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsBlocked, CallFunc_GetCharacterNetId_NetId) == 0x000008, "Member 'WBP_PlayerNamePlate_C_IsBlocked::CallFunc_GetCharacterNetId_NetId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsBlocked, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000038, "Member 'WBP_PlayerNamePlate_C_IsBlocked::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsBlocked, CallFunc_IsUserBlocked_ReturnValue) == 0x000040, "Member 'WBP_PlayerNamePlate_C_IsBlocked::CallFunc_IsUserBlocked_ReturnValue' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.IsFriend
// 0x0048 (0x0048 - 0x0000)
struct WBP_PlayerNamePlate_C_IsFriend final
{
public:
	bool                                          bFriend;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_438A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetCharacterNetId_NetId;                  // 0x0008(0x0030)(HasGetValueTypeHash)
	class UVAL_FriendsManager*                    CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFriend_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_IsFriend) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_IsFriend");
static_assert(sizeof(WBP_PlayerNamePlate_C_IsFriend) == 0x000048, "Wrong size on WBP_PlayerNamePlate_C_IsFriend");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsFriend, bFriend) == 0x000000, "Member 'WBP_PlayerNamePlate_C_IsFriend::bFriend' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsFriend, CallFunc_GetCharacterNetId_NetId) == 0x000008, "Member 'WBP_PlayerNamePlate_C_IsFriend::CallFunc_GetCharacterNetId_NetId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsFriend, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000038, "Member 'WBP_PlayerNamePlate_C_IsFriend::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsFriend, CallFunc_IsFriend_ReturnValue) == 0x000040, "Member 'WBP_PlayerNamePlate_C_IsFriend::CallFunc_IsFriend_ReturnValue' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.IsInParty
// 0x0060 (0x0060 - 0x0000)
struct WBP_PlayerNamePlate_C_IsInParty final
{
public:
	bool                                          bInParty;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLeader;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_438B[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetCharacterNetId_NetId;                  // 0x0008(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_438C[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FUniqueNetIdRepl>               CallFunc_GetAllPartyMemberIds_ReturnValue;         // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_IsInParty) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_IsInParty");
static_assert(sizeof(WBP_PlayerNamePlate_C_IsInParty) == 0x000060, "Wrong size on WBP_PlayerNamePlate_C_IsInParty");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsInParty, bInParty) == 0x000000, "Member 'WBP_PlayerNamePlate_C_IsInParty::bInParty' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsInParty, bLeader) == 0x000001, "Member 'WBP_PlayerNamePlate_C_IsInParty::bLeader' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsInParty, CallFunc_GetCharacterNetId_NetId) == 0x000008, "Member 'WBP_PlayerNamePlate_C_IsInParty::CallFunc_GetCharacterNetId_NetId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsInParty, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_PlayerNamePlate_C_IsInParty::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsInParty, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'WBP_PlayerNamePlate_C_IsInParty::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsInParty, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000040, "Member 'WBP_PlayerNamePlate_C_IsInParty::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsInParty, CallFunc_GetAllPartyMemberIds_ReturnValue) == 0x000048, "Member 'WBP_PlayerNamePlate_C_IsInParty::CallFunc_GetAllPartyMemberIds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsInParty, CallFunc_Array_Contains_ReturnValue) == 0x000058, "Member 'WBP_PlayerNamePlate_C_IsInParty::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsInParty, CallFunc_EqualEqual_ReturnValue) == 0x000059, "Member 'WBP_PlayerNamePlate_C_IsInParty::CallFunc_EqualEqual_ReturnValue' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.IsNeighbor
// 0x02C8 (0x02C8 - 0x0000)
struct WBP_PlayerNamePlate_C_IsNeighbor final
{
public:
	bool                                          bNeighbor;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar_0;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_438D[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetCharacterNetId_NetId;                  // 0x0008(0x0030)(HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetNetId_ReturnValue;                     // 0x0048(0x0030)(HasGetValueTypeHash)
	class UVAL_PlayerGuildSubsystem*              CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetUserMembership_bOutHasMembership;   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_438E[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PlayerGuild                       CallFunc_TryGetUserMembership_PlayerGuild;         // 0x0088(0x0118)()
	bool                                          CallFunc_TryGetUserMembership_ReturnValue;         // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetUserMembership_bOutHasMembership_1; // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_438F[0x6];                                     // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PlayerGuild                       CallFunc_TryGetUserMembership_PlayerGuild_1;       // 0x01A8(0x0118)()
	bool                                          CallFunc_TryGetUserMembership_ReturnValue_1;       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue;          // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_IsNeighbor) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_IsNeighbor");
static_assert(sizeof(WBP_PlayerNamePlate_C_IsNeighbor) == 0x0002C8, "Wrong size on WBP_PlayerNamePlate_C_IsNeighbor");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, bNeighbor) == 0x000000, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::bNeighbor' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, NewLocalVar_0) == 0x000001, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_GetCharacterNetId_NetId) == 0x000008, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_GetCharacterNetId_NetId' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000038, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000040, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_GetNetId_ReturnValue) == 0x000048, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_GetNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000078, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_TryGetUserMembership_bOutHasMembership) == 0x000080, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_TryGetUserMembership_bOutHasMembership' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_TryGetUserMembership_PlayerGuild) == 0x000088, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_TryGetUserMembership_PlayerGuild' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_TryGetUserMembership_ReturnValue) == 0x0001A0, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_TryGetUserMembership_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_TryGetUserMembership_bOutHasMembership_1) == 0x0001A1, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_TryGetUserMembership_bOutHasMembership_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_TryGetUserMembership_PlayerGuild_1) == 0x0001A8, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_TryGetUserMembership_PlayerGuild_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_TryGetUserMembership_ReturnValue_1) == 0x0002C0, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_TryGetUserMembership_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_IsNeighbor, CallFunc_EqualEqual_GuidGuid_ReturnValue) == 0x0002C1, "Member 'WBP_PlayerNamePlate_C_IsNeighbor::CallFunc_EqualEqual_GuidGuid_ReturnValue' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.OnMemberAdded_Event
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerNamePlate_C_OnMemberAdded_Event final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_OnMemberAdded_Event) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_OnMemberAdded_Event");
static_assert(sizeof(WBP_PlayerNamePlate_C_OnMemberAdded_Event) == 0x000050, "Wrong size on WBP_PlayerNamePlate_C_OnMemberAdded_Event");
static_assert(offsetof(WBP_PlayerNamePlate_C_OnMemberAdded_Event, Member) == 0x000000, "Member 'WBP_PlayerNamePlate_C_OnMemberAdded_Event::Member' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.OnMemberKicked_Event
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerNamePlate_C_OnMemberKicked_Event final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_OnMemberKicked_Event) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_OnMemberKicked_Event");
static_assert(sizeof(WBP_PlayerNamePlate_C_OnMemberKicked_Event) == 0x000050, "Wrong size on WBP_PlayerNamePlate_C_OnMemberKicked_Event");
static_assert(offsetof(WBP_PlayerNamePlate_C_OnMemberKicked_Event, Member) == 0x000000, "Member 'WBP_PlayerNamePlate_C_OnMemberKicked_Event::Member' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.OnMemberPromoted_Event
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerNamePlate_C_OnMemberPromoted_Event final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_OnMemberPromoted_Event) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_OnMemberPromoted_Event");
static_assert(sizeof(WBP_PlayerNamePlate_C_OnMemberPromoted_Event) == 0x000050, "Wrong size on WBP_PlayerNamePlate_C_OnMemberPromoted_Event");
static_assert(offsetof(WBP_PlayerNamePlate_C_OnMemberPromoted_Event, Member) == 0x000000, "Member 'WBP_PlayerNamePlate_C_OnMemberPromoted_Event::Member' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.OnMemberRemoved_Event
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerNamePlate_C_OnMemberRemoved_Event final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_OnMemberRemoved_Event) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_OnMemberRemoved_Event");
static_assert(sizeof(WBP_PlayerNamePlate_C_OnMemberRemoved_Event) == 0x000050, "Wrong size on WBP_PlayerNamePlate_C_OnMemberRemoved_Event");
static_assert(offsetof(WBP_PlayerNamePlate_C_OnMemberRemoved_Event, Member) == 0x000000, "Member 'WBP_PlayerNamePlate_C_OnMemberRemoved_Event::Member' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.OnPartyStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerNamePlate_C_OnPartyStateChanged final
{
public:
	EVAL_PartyManagerState                        State;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_OnPartyStateChanged) == 0x000001, "Wrong alignment on WBP_PlayerNamePlate_C_OnPartyStateChanged");
static_assert(sizeof(WBP_PlayerNamePlate_C_OnPartyStateChanged) == 0x000001, "Wrong size on WBP_PlayerNamePlate_C_OnPartyStateChanged");
static_assert(offsetof(WBP_PlayerNamePlate_C_OnPartyStateChanged, State) == 0x000000, "Member 'WBP_PlayerNamePlate_C_OnPartyStateChanged::State' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.SetPlayerCharacter
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerNamePlate_C_SetPlayerCharacter final
{
public:
	class AValeriaCharacter*                      Param_Character;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_SetPlayerCharacter) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_SetPlayerCharacter");
static_assert(sizeof(WBP_PlayerNamePlate_C_SetPlayerCharacter) == 0x000008, "Wrong size on WBP_PlayerNamePlate_C_SetPlayerCharacter");
static_assert(offsetof(WBP_PlayerNamePlate_C_SetPlayerCharacter, Param_Character) == 0x000000, "Member 'WBP_PlayerNamePlate_C_SetPlayerCharacter::Param_Character' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.UpdateCheatIcon
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerNamePlate_C_UpdateCheatIcon final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4390[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDebugInfoComponent*                    CallFunc_GetDebugInfoComponent_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreCheatsEnabled_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerNamePlate_C_UpdateCheatIcon) == 0x000008, "Wrong alignment on WBP_PlayerNamePlate_C_UpdateCheatIcon");
static_assert(sizeof(WBP_PlayerNamePlate_C_UpdateCheatIcon) == 0x000018, "Wrong size on WBP_PlayerNamePlate_C_UpdateCheatIcon");
static_assert(offsetof(WBP_PlayerNamePlate_C_UpdateCheatIcon, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_PlayerNamePlate_C_UpdateCheatIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_UpdateCheatIcon, CallFunc_GetDebugInfoComponent_ReturnValue) == 0x000008, "Member 'WBP_PlayerNamePlate_C_UpdateCheatIcon::CallFunc_GetDebugInfoComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerNamePlate_C_UpdateCheatIcon, CallFunc_AreCheatsEnabled_ReturnValue) == 0x000010, "Member 'WBP_PlayerNamePlate_C_UpdateCheatIcon::CallFunc_AreCheatsEnabled_ReturnValue' has a wrong offset!");

// Function WBP_PlayerNamePlate.WBP_PlayerNamePlate_C.UpdateFromAffiliations
// 0x0228 (0x0228 - 0x0000)
struct WBP_PlayerNamePlate_C_UpdateFromAffiliations final
{
public:
	class UVALUI_TextBlockStyle*                  DesiredTextBlockStyle;                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetCharacterNetId_NetId;                  // 0x0008(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4391[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
