#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GardenPlate

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_GardenPlate.WBP_GardenPlate_C.EquippedInUse
// 0x0010 (0x0010 - 0x0000)
struct WBP_GardenPlate_C_EquippedInUse final
{
public:
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsUsingEquipped;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GardenPlate_C_EquippedInUse) == 0x000008, "Wrong alignment on WBP_GardenPlate_C_EquippedInUse");
static_assert(sizeof(WBP_GardenPlate_C_EquippedInUse) == 0x000010, "Wrong size on WBP_GardenPlate_C_EquippedInUse");
static_assert(offsetof(WBP_GardenPlate_C_EquippedInUse, EquipmentComponent) == 0x000000, "Member 'WBP_GardenPlate_C_EquippedInUse::EquipmentComponent' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_EquippedInUse, bIsUsingEquipped) == 0x000008, "Member 'WBP_GardenPlate_C_EquippedInUse::bIsUsingEquipped' has a wrong offset!");

// Function WBP_GardenPlate.WBP_GardenPlate_C.ExecuteUbergraph_WBP_GardenPlate
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_shouldShow;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617D[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617E[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_UIManagerWidgetBase* UIManagerWidgetBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              K2Node_CustomEvent_UIManagerWidgetBase;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaPlayerController_OutResult;     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_617F[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6180[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6181[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6182[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool ShouldShow)>              K2Node_CreateDelegate_OutputDelegate_2;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6183[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEquipmentComponent* EquipmentComponent, bool bIsUsingEquipped)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6184[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentComponent*                    K2Node_CustomEvent_EquipmentComponent;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsUsingEquipped;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6185[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6186[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate) == 0x000008, "Wrong alignment on WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate");
static_assert(sizeof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate) == 0x0000E8, "Wrong size on WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, EntryPoint) == 0x000000, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_IsValid_ReturnValue_3) == 0x000007, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_CustomEvent_shouldShow) == 0x000008, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_CustomEvent_shouldShow' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_TextIsEmpty_ReturnValue) == 0x000028, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_AkEventGlobal_ReturnValue) == 0x00002C, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_CustomEvent_UIManagerWidgetBase) == 0x000040, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_CustomEvent_UIManagerWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_GetValeriaPlayerController_OutResult) == 0x000048, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_GetValeriaPlayerController_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000050, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, Temp_byte_Variable) == 0x000058, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000060, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_GetEquipment_ReturnValue) == 0x000068, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000070, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, Temp_bool_Variable) == 0x000079, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, Temp_byte_Variable_1) == 0x00007A, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, Temp_bool_Variable_1) == 0x00007B, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_Select_Default) == 0x00008C, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000090, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, Temp_byte_Variable_2) == 0x000098, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_CreateDelegate_OutputDelegate_2) == 0x00009C, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, Temp_byte_Variable_3) == 0x0000AC, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B0, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_Select_Default_1) == 0x0000C0, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_CustomEvent_EquipmentComponent) == 0x0000C8, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_CustomEvent_EquipmentComponent' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_CustomEvent_bIsUsingEquipped) == 0x0000D0, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_CustomEvent_bIsUsingEquipped' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_GetValeriaCharacter_OutResult) == 0x0000D1, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_GetValeriaCharacter_ReturnValue_1) == 0x0000D8, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_GetValeriaCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000E0, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate, CallFunc_AkEventGlobal_ReturnValue_1) == 0x0000E4, "Member 'WBP_GardenPlate_C_ExecuteUbergraph_WBP_GardenPlate::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");

// Function WBP_GardenPlate.WBP_GardenPlate_C.InputModeRefreshed
// 0x0008 (0x0008 - 0x0000)
struct WBP_GardenPlate_C_InputModeRefreshed final
{
public:
	class US6UI_UIManagerWidgetBase*              UIManagerWidgetBase;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GardenPlate_C_InputModeRefreshed) == 0x000008, "Wrong alignment on WBP_GardenPlate_C_InputModeRefreshed");
static_assert(sizeof(WBP_GardenPlate_C_InputModeRefreshed) == 0x000008, "Wrong size on WBP_GardenPlate_C_InputModeRefreshed");
static_assert(offsetof(WBP_GardenPlate_C_InputModeRefreshed, UIManagerWidgetBase) == 0x000000, "Member 'WBP_GardenPlate_C_InputModeRefreshed::UIManagerWidgetBase' has a wrong offset!");

// Function WBP_GardenPlate.WBP_GardenPlate_C.OnGardenInspectToggle
// 0x0001 (0x0001 - 0x0000)
struct WBP_GardenPlate_C_OnGardenInspectToggle final
{
public:
	bool                                          ShouldShow;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GardenPlate_C_OnGardenInspectToggle) == 0x000001, "Wrong alignment on WBP_GardenPlate_C_OnGardenInspectToggle");
static_assert(sizeof(WBP_GardenPlate_C_OnGardenInspectToggle) == 0x000001, "Wrong size on WBP_GardenPlate_C_OnGardenInspectToggle");
static_assert(offsetof(WBP_GardenPlate_C_OnGardenInspectToggle, ShouldShow) == 0x000000, "Member 'WBP_GardenPlate_C_OnGardenInspectToggle::ShouldShow' has a wrong offset!");

// Function WBP_GardenPlate.WBP_GardenPlate_C.Set Water Droplet Progress
// 0x0010 (0x0010 - 0x0000)
struct WBP_GardenPlate_C_Set_Water_Droplet_Progress final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldBeVisible;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsVisible;                                   // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GardenPlate_C_Set_Water_Droplet_Progress) == 0x000008, "Wrong alignment on WBP_GardenPlate_C_Set_Water_Droplet_Progress");
static_assert(sizeof(WBP_GardenPlate_C_Set_Water_Droplet_Progress) == 0x000010, "Wrong size on WBP_GardenPlate_C_Set_Water_Droplet_Progress");
static_assert(offsetof(WBP_GardenPlate_C_Set_Water_Droplet_Progress, Progress) == 0x000000, "Member 'WBP_GardenPlate_C_Set_Water_Droplet_Progress::Progress' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_Set_Water_Droplet_Progress, ShouldBeVisible) == 0x000008, "Member 'WBP_GardenPlate_C_Set_Water_Droplet_Progress::ShouldBeVisible' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_Set_Water_Droplet_Progress, Param_IsVisible) == 0x000009, "Member 'WBP_GardenPlate_C_Set_Water_Droplet_Progress::Param_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_Set_Water_Droplet_Progress, Temp_byte_Variable) == 0x00000A, "Member 'WBP_GardenPlate_C_Set_Water_Droplet_Progress::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_Set_Water_Droplet_Progress, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00000B, "Member 'WBP_GardenPlate_C_Set_Water_Droplet_Progress::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_Set_Water_Droplet_Progress, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'WBP_GardenPlate_C_Set_Water_Droplet_Progress::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_Set_Water_Droplet_Progress, Temp_byte_Variable_1) == 0x00000D, "Member 'WBP_GardenPlate_C_Set_Water_Droplet_Progress::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_Set_Water_Droplet_Progress, Temp_bool_Variable) == 0x00000E, "Member 'WBP_GardenPlate_C_Set_Water_Droplet_Progress::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GardenPlate_C_Set_Water_Droplet_Progress, K2Node_Select_Default) == 0x00000F, "Member 'WBP_GardenPlate_C_Set_Water_Droplet_Progress::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GardenPlate.WBP_GardenPlate_C.SetGardenBuffInfo
// 0x0040 (0x0040 - 0x0000)
struct WBP_GardenPlate_C_SetGardenBuffInfo final
{
public:
	struct FGardenTileBuffInfo                    GardenBuff;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_GardenPlate_C_SetGardenBuffInfo) == 0x000008, "Wrong alignment on WBP_GardenPlate_C_SetGardenBuffInfo");
static_assert(sizeof(WBP_GardenPlate_C_SetGardenBuffInfo) == 0x000040, "Wrong size on WBP_GardenPlate_C_SetGardenBuffInfo");
static_assert(offsetof(WBP_GardenPlate_C_SetGardenBuffInfo, GardenBuff) == 0x000000, "Member 'WBP_GardenPlate_C_SetGardenBuffInfo::GardenBuff' has a wrong offset!");

}

