#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory_CM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_Inventory_CM.WBP_Inventory_CM_C.CreateBagsForBagTypes
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_Inventory_CM_C_CreateBagsForBagTypes final
{
public:
	TArray<struct FGameplayTag>                   BagTypes;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UVerticalBox*                           BagsVerticalBox;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 LastUsedBagIndicesRef;                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         BagIndex;                                          // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589F[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_InventorySlot_CM_C*>        InventorySlots;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UWBP_InventoryBag_CM_C*                 FirstInventoryBag;                                 // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxNumBagsAllowedForBagTypes_ReturnValue; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A0[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A1[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLockedRowBackgroundImageSize_ImageSize; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                CallFunc_GetUnlockedRowPadding_Padding;            // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                CallFunc_GetLockedRowPadding_Padding;              // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class US6UI_CustomNavigationGroup*            CallFunc_GetNavGroupForIndex_NavGroup;             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A2[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventoryBag_CM_C*                 K2Node_DynamicCast_AsWBP_Inventory_Bag_CM;         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A3[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_InventorySlot_CM_C*>        CallFunc_GetAllSlots_Slots;                        // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A4[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWidget* Widget)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_InventorySlot_CM_C* Slot)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_InventorySlot_CM_C* Slot, class UWBP_InventoryBag_CM_C* Bag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_InventorySlot_CM_C* Slot, class UWBP_InventoryBag_CM_C* Bag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetBagIndicesMatchingBagTypes_ReturnValue; // 0x0130(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Identical_ReturnValue;              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A5[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A6[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A7[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LockedRow_C*                       CallFunc_Create_ReturnValue;                       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A8[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 CallFunc_Create_ReturnValue_1;                     // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_InventoryBag_CM_C* Bag, class UWBP_InventorySlot_CM_C* Slot)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_InventoryBag_CM_C* Bag, class UWBP_InventorySlot_CM_C* Slot)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_CM_C_CreateBagsForBagTypes) == 0x000008, "Wrong alignment on WBP_Inventory_CM_C_CreateBagsForBagTypes");
static_assert(sizeof(WBP_Inventory_CM_C_CreateBagsForBagTypes) == 0x0001A8, "Wrong size on WBP_Inventory_CM_C_CreateBagsForBagTypes");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, BagTypes) == 0x000000, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::BagTypes' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, BagsVerticalBox) == 0x000010, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::BagsVerticalBox' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, LastUsedBagIndicesRef) == 0x000018, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::LastUsedBagIndicesRef' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, BagIndex) == 0x000028, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::BagIndex' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, InventorySlots) == 0x000030, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::InventorySlots' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, FirstInventoryBag) == 0x000040, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::FirstInventoryBag' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, Temp_int_Array_Index_Variable) == 0x000048, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_GetMaxNumBagsAllowedForBagTypes_ReturnValue) == 0x000050, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_GetMaxNumBagsAllowedForBagTypes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, Temp_int_Variable) == 0x000054, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Subtract_IntInt_ReturnValue) == 0x000058, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_GetLockedRowBackgroundImageSize_ImageSize) == 0x000068, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_GetLockedRowBackgroundImageSize_ImageSize' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_GetUnlockedRowPadding_Padding) == 0x000078, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_GetUnlockedRowPadding_Padding' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_GetLockedRowPadding_Padding) == 0x000088, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_GetLockedRowPadding_Padding' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_GetNavGroupForIndex_NavGroup) == 0x000098, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_GetNavGroupForIndex_NavGroup' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_GetAllChildren_ReturnValue) == 0x0000A0, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Array_Length_ReturnValue_1) == 0x0000B8, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, K2Node_DynamicCast_AsWBP_Inventory_Bag_CM) == 0x0000C0, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::K2Node_DynamicCast_AsWBP_Inventory_Bag_CM' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_GetAllSlots_Slots) == 0x0000D0, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_GetAllSlots_Slots' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, Temp_int_Array_Index_Variable_1) == 0x0000E0, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_IsValid_ReturnValue) == 0x0000E4, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F8, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, K2Node_CreateDelegate_OutputDelegate_2) == 0x000108, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, K2Node_CreateDelegate_OutputDelegate_3) == 0x000118, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, Temp_int_Loop_Counter_Variable) == 0x000128, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00012C, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_GetBagIndicesMatchingBagTypes_ReturnValue) == 0x000130, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_GetBagIndicesMatchingBagTypes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Array_Get_Item_1) == 0x000140, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Array_Length_ReturnValue_2) == 0x000144, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000148, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Array_Identical_ReturnValue) == 0x00014C, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Array_Identical_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Max_ReturnValue) == 0x000150, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000154, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, Temp_int_Loop_Counter_Variable_1) == 0x000158, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Create_ReturnValue) == 0x000160, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000168, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Less_IntInt_ReturnValue) == 0x000170, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Add_IntInt_ReturnValue_1) == 0x000174, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_Create_ReturnValue_1) == 0x000178, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000180, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, K2Node_CreateDelegate_OutputDelegate_4) == 0x000188, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_CreateBagsForBagTypes, K2Node_CreateDelegate_OutputDelegate_5) == 0x000198, "Member 'WBP_Inventory_CM_C_CreateBagsForBagTypes::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function WBP_Inventory_CM.WBP_Inventory_CM_C.ExecuteUbergraph_WBP_Inventory_CM
// 0x0170 (0x0170 - 0x0000)
struct WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A9[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    K2Node_CustomEvent_Inventory;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 K2Node_CustomEvent_Bag_2;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                K2Node_CustomEvent_Slot_4;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                K2Node_CustomEvent_Slot_3;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 K2Node_CustomEvent_Bag_1;                          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                K2Node_CustomEvent_Slot_2;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 K2Node_CustomEvent_Bag;                            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                K2Node_CustomEvent_Slot_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                K2Node_CustomEvent_Slot;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58AA[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventoryBag_CM_C*                 K2Node_CustomEvent_Bag_3;                          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                K2Node_CustomEvent_Slot_5;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58AB[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Tab_Selection)>          K2Node_CreateDelegate_OutputDelegate_2;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Tab_Selection;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           CallFunc_GetVerticalBoxByIndex_VBox;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Tab_Selection)>          K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 CallFunc_Map_Find_Value;                           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58AC[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventorySlot_CM_C*                CallFunc_GetFirstInventorySlot_FirstSlot;          // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58AD[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FValeriaItem& Item)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58AE[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           K2Node_CustomEvent_Item;                           // 0x00E8(0x0060)()
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMainBag_bMainBag;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58AF[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasQuestBag_bQuestBag;                    // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAmmoBag_bAmmoBag;                      // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B0[0x3];                                     // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventorySlot_CM_C*                CallFunc_Initialize_Inventory_Focus_Output;        // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM) == 0x000008, "Wrong alignment on WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM");
static_assert(sizeof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM) == 0x000170, "Wrong size on WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, EntryPoint) == 0x000000, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Inventory) == 0x000018, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Bag_2) == 0x000020, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Bag_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Slot_4) == 0x000028, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Slot_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Slot_3) == 0x000030, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Slot_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Bag_1) == 0x000038, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Bag_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Slot_2) == 0x000040, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Slot_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Bag) == 0x000048, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Bag' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Slot_1) == 0x000050, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Slot) == 0x000058, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Slot' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Bag_3) == 0x000068, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Bag_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Slot_5) == 0x000070, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Slot_5' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_Event_IsDesignTime) == 0x000088, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x00008C, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Tab_Selection) == 0x00009C, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Tab_Selection' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_GetVerticalBoxByIndex_VBox) == 0x0000A0, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_GetVerticalBoxByIndex_VBox' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A8, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_Map_Find_Value) == 0x0000B8, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_Map_Find_ReturnValue) == 0x0000C0, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_IsValid_ReturnValue_3) == 0x0000C1, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_GetFirstInventorySlot_FirstSlot) == 0x0000C8, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_GetFirstInventorySlot_FirstSlot' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_IsValid_ReturnValue_4) == 0x0000D0, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000D4, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_CustomEvent_Item) == 0x0000E8, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000148, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_HasMainBag_bMainBag) == 0x000150, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_HasMainBag_bMainBag' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000158, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_IsValid_ReturnValue_5) == 0x000161, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, K2Node_SwitchEnum_CmpSuccess) == 0x000162, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_HasQuestBag_bQuestBag) == 0x000163, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_HasQuestBag_bQuestBag' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_HasAmmoBag_bAmmoBag) == 0x000164, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_HasAmmoBag_bAmmoBag' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM, CallFunc_Initialize_Inventory_Focus_Output) == 0x000168, "Member 'WBP_Inventory_CM_C_ExecuteUbergraph_WBP_Inventory_CM::CallFunc_Initialize_Inventory_Focus_Output' has a wrong offset!");

// Function WBP_Inventory_CM.WBP_Inventory_CM_C.Get Best Default Bag Widget Switcher Index
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index final
{
public:
	int32                                         WidgetSwitcherIndex;                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasOtherBag_OtherBag;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasQuestBag_bQuestBag;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAmmoBag_bAmmoBag;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMainBag_bMainBag;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index) == 0x000004, "Wrong alignment on WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index");
static_assert(sizeof(WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index) == 0x000008, "Wrong size on WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index");
static_assert(offsetof(WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index, WidgetSwitcherIndex) == 0x000000, "Member 'WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index::WidgetSwitcherIndex' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index, CallFunc_HasOtherBag_OtherBag) == 0x000004, "Member 'WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index::CallFunc_HasOtherBag_OtherBag' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index, CallFunc_HasQuestBag_bQuestBag) == 0x000005, "Member 'WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index::CallFunc_HasQuestBag_bQuestBag' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index, CallFunc_HasAmmoBag_bAmmoBag) == 0x000006, "Member 'WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index::CallFunc_HasAmmoBag_bAmmoBag' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index, CallFunc_HasMainBag_bMainBag) == 0x000007, "Member 'WBP_Inventory_CM_C_Get_Best_Default_Bag_Widget_Switcher_Index::CallFunc_HasMainBag_bMainBag' has a wrong offset!");

// Function WBP_Inventory_CM.WBP_Inventory_CM_C.GetActiveInventoryDefaultSlot
// 0x0028 (0x0028 - 0x0000)
struct WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot final
{
public:
	class UWBP_InventorySlot_CM_C*                ActiveInventoryDefaultSlot;                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B1[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventoryBag_CM_C*                 CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B2[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventorySlot_CM_C*                CallFunc_GetFirstInventorySlot_FirstSlot;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot) == 0x000008, "Wrong alignment on WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot");
static_assert(sizeof(WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot) == 0x000028, "Wrong size on WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot");
static_assert(offsetof(WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot, ActiveInventoryDefaultSlot) == 0x000000, "Member 'WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot::ActiveInventoryDefaultSlot' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000008, "Member 'WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot, CallFunc_GetFirstInventorySlot_FirstSlot) == 0x000020, "Member 'WBP_Inventory_CM_C_GetActiveInventoryDefaultSlot::CallFunc_GetFirstInventorySlot_FirstSlot' has a wrong offset!");

// Function WBP_Inventory_CM.WBP_Inventory_CM_C.GetAllBagVerticalBoxes
// 0x0030 (0x0030 - 0x0000)
struct WBP_Inventory_CM_C_GetAllBagVerticalBoxes final
{
public:
	TArray<class UVerticalBox*>                   AllBagVerticalBoxes;                               // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UVerticalBox*>                   NewBagVerticalBoxes;                               // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_CM_C_GetAllBagVerticalBoxes) == 0x000008, "Wrong alignment on WBP_Inventory_CM_C_GetAllBagVerticalBoxes");
static_assert(sizeof(WBP_Inventory_CM_C_GetAllBagVerticalBoxes) == 0x000030, "Wrong size on WBP_Inventory_CM_C_GetAllBagVerticalBoxes");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllBagVerticalBoxes, AllBagVerticalBoxes) == 0x000000, "Member 'WBP_Inventory_CM_C_GetAllBagVerticalBoxes::AllBagVerticalBoxes' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllBagVerticalBoxes, NewBagVerticalBoxes) == 0x000010, "Member 'WBP_Inventory_CM_C_GetAllBagVerticalBoxes::NewBagVerticalBoxes' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllBagVerticalBoxes, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'WBP_Inventory_CM_C_GetAllBagVerticalBoxes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllBagVerticalBoxes, CallFunc_Array_Add_ReturnValue_1) == 0x000024, "Member 'WBP_Inventory_CM_C_GetAllBagVerticalBoxes::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllBagVerticalBoxes, CallFunc_Array_Add_ReturnValue_2) == 0x000028, "Member 'WBP_Inventory_CM_C_GetAllBagVerticalBoxes::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllBagVerticalBoxes, CallFunc_Array_Add_ReturnValue_3) == 0x00002C, "Member 'WBP_Inventory_CM_C_GetAllBagVerticalBoxes::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");

// Function WBP_Inventory_CM.WBP_Inventory_CM_C.GetAllNavGroups
// 0x0030 (0x0030 - 0x0000)
struct WBP_Inventory_CM_C_GetAllNavGroups final
{
public:
	TArray<class US6UI_CustomNavigationGroup*>    AllNavGroups;                                      // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class US6UI_CustomNavigationGroup*>    NavGroups;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_CM_C_GetAllNavGroups) == 0x000008, "Wrong alignment on WBP_Inventory_CM_C_GetAllNavGroups");
static_assert(sizeof(WBP_Inventory_CM_C_GetAllNavGroups) == 0x000030, "Wrong size on WBP_Inventory_CM_C_GetAllNavGroups");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllNavGroups, AllNavGroups) == 0x000000, "Member 'WBP_Inventory_CM_C_GetAllNavGroups::AllNavGroups' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllNavGroups, NavGroups) == 0x000010, "Member 'WBP_Inventory_CM_C_GetAllNavGroups::NavGroups' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllNavGroups, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'WBP_Inventory_CM_C_GetAllNavGroups::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllNavGroups, CallFunc_Array_Add_ReturnValue_1) == 0x000024, "Member 'WBP_Inventory_CM_C_GetAllNavGroups::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllNavGroups, CallFunc_Array_Add_ReturnValue_2) == 0x000028, "Member 'WBP_Inventory_CM_C_GetAllNavGroups::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllNavGroups, CallFunc_Array_Add_ReturnValue_3) == 0x00002C, "Member 'WBP_Inventory_CM_C_GetAllNavGroups::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");

// Function WBP_Inventory_CM.WBP_Inventory_CM_C.GetAllSlots
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Inventory_CM_C_GetAllSlots final
{
public:
	TArray<class UWBP_InventorySlot_CM_C*>        Slots;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWBP_InventorySlot_CM_C*>        Result;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UVerticalBox*>                   CallFunc_GetAllBagVerticalBoxes_AllBagVerticalBoxes; // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UVerticalBox*                           CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B3[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B4[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 K2Node_DynamicCast_AsWBP_Inventory_Bag_CM;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B5[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_InventorySlot_CM_C*>        CallFunc_GetAllSlots_Slots;                        // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_CM_C_GetAllSlots) == 0x000008, "Wrong alignment on WBP_Inventory_CM_C_GetAllSlots");
static_assert(sizeof(WBP_Inventory_CM_C_GetAllSlots) == 0x0000A0, "Wrong size on WBP_Inventory_CM_C_GetAllSlots");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, Slots) == 0x000000, "Member 'WBP_Inventory_CM_C_GetAllSlots::Slots' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, Result) == 0x000010, "Member 'WBP_Inventory_CM_C_GetAllSlots::Result' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_Inventory_CM_C_GetAllSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_Inventory_CM_C_GetAllSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_Inventory_CM_C_GetAllSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'WBP_Inventory_CM_C_GetAllSlots::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'WBP_Inventory_CM_C_GetAllSlots::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'WBP_Inventory_CM_C_GetAllSlots::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, CallFunc_GetAllBagVerticalBoxes_AllBagVerticalBoxes) == 0x000038, "Member 'WBP_Inventory_CM_C_GetAllSlots::CallFunc_GetAllBagVerticalBoxes_AllBagVerticalBoxes' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Inventory_CM_C_GetAllSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_Inventory_CM_C_GetAllSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, CallFunc_GetAllChildren_ReturnValue) == 0x000058, "Member 'WBP_Inventory_CM_C_GetAllSlots::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Inventory_CM_C_GetAllSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'WBP_Inventory_CM_C_GetAllSlots::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, K2Node_DynamicCast_AsWBP_Inventory_Bag_CM) == 0x000078, "Member 'WBP_Inventory_CM_C_GetAllSlots::K2Node_DynamicCast_AsWBP_Inventory_Bag_CM' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_Inventory_CM_C_GetAllSlots::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, CallFunc_Array_Length_ReturnValue_1) == 0x000084, "Member 'WBP_Inventory_CM_C_GetAllSlots::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, CallFunc_GetAllSlots_Slots) == 0x000088, "Member 'WBP_Inventory_CM_C_GetAllSlots::CallFunc_GetAllSlots_Slots' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_CM_C_GetAllSlots, CallFunc_Less_IntInt_ReturnValue_1) == 0x000098, "Member 'WBP_Inventory_CM_C_GetAllSlots::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Inventory_CM.WBP_Inventory_CM_C.GetAllSlotsForBorderNavigationType
// 0x0048 (0x0048 - 0x0000)
struct WBP_Inventory_CM_C_GetAllSlotsForBorderNavigationType final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_InventorySlot_CM_C*>        InventorySlots;                                    // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWBP_InventorySlot_CM_C*>        ValidInventorySlots;                               // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
