#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ComboBox_Menu_Option_02_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ComboBox_Menu_Option_02_CM.WBP_ComboBox_Menu_Option_02_CM_C
// 0x0050 (0x0310 - 0x02C0)
class UWBP_ComboBox_Menu_Option_02_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_checkmark;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Option;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              WBP_Template_Button_CM;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_WBP_ComboBox_Menu_Option_02_CM_C;            // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4C7E[0x4];                                     // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnOptionSelected;                                  // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UVALUI_TextBlockStyle*                  UnselectedStyle;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  SelectedStyle;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ComboBox_Menu_Option_02_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_ComboBox_Menu_Option_02_CM(int32 EntryPoint, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class FText CallFunc_GetText_ReturnValue);
	void OnOptionSelected__DelegateSignature(int32 Param_Index, class FText Text);
	void SetSelected(bool Param_IsSelected, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, ESlateVisibility K2Node_Select_Default, class UVALUI_TextBlockStyle* K2Node_Select_Default_1);
	void SetTextBlockStyles(class UVALUI_TextBlockStyle* Param_UnselectedStyle, class UVALUI_TextBlockStyle* Param_SelectedStyle, bool Temp_bool_Variable, class UVALUI_TextBlockStyle* K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ComboBox_Menu_Option_02_CM_C">();
	}
	static class UWBP_ComboBox_Menu_Option_02_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ComboBox_Menu_Option_02_CM_C>();
	}
};
static_assert(alignof(UWBP_ComboBox_Menu_Option_02_CM_C) == 0x000008, "Wrong alignment on UWBP_ComboBox_Menu_Option_02_CM_C");
static_assert(sizeof(UWBP_ComboBox_Menu_Option_02_CM_C) == 0x000310, "Wrong size on UWBP_ComboBox_Menu_Option_02_CM_C");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_02_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ComboBox_Menu_Option_02_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_02_CM_C, Image_checkmark) == 0x0002C8, "Member 'UWBP_ComboBox_Menu_Option_02_CM_C::Image_checkmark' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_02_CM_C, TextBlock_Option) == 0x0002D0, "Member 'UWBP_ComboBox_Menu_Option_02_CM_C::TextBlock_Option' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_02_CM_C, WBP_Template_Button_CM) == 0x0002D8, "Member 'UWBP_ComboBox_Menu_Option_02_CM_C::WBP_Template_Button_CM' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_02_CM_C, Index_WBP_ComboBox_Menu_Option_02_CM_C) == 0x0002E0, "Member 'UWBP_ComboBox_Menu_Option_02_CM_C::Index_WBP_ComboBox_Menu_Option_02_CM_C' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_02_CM_C, OnOptionSelected) == 0x0002E8, "Member 'UWBP_ComboBox_Menu_Option_02_CM_C::OnOptionSelected' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_02_CM_C, UnselectedStyle) == 0x0002F8, "Member 'UWBP_ComboBox_Menu_Option_02_CM_C::UnselectedStyle' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_02_CM_C, SelectedStyle) == 0x000300, "Member 'UWBP_ComboBox_Menu_Option_02_CM_C::SelectedStyle' has a wrong offset!");
static_assert(offsetof(UWBP_ComboBox_Menu_Option_02_CM_C, IsSelected) == 0x000308, "Member 'UWBP_ComboBox_Menu_Option_02_CM_C::IsSelected' has a wrong offset!");

}

