#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MatchmakingQueue_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MatchmakingQueue_CM.WBP_MatchmakingQueue_CM_C
// 0x0048 (0x0308 - 0x02C0)
class UWBP_MatchmakingQueue_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CloseButton_CM_C*                  Button_DeleteQueueRequest;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_MatchmakingQueue;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_MatchmakingQueue;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AnimatedLoading_Chapaa_C*          WBP_AnimatedLoading_Chapaa;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          InitializedNumber;                                 // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5217[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QueueNumber;                                       // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDeleteQueueButtonClicked;                        // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsInternalRequest;                                 // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowCancelButton;                                  // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ObtainedZeroNumberInitially;                       // 0x0302(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MatchmakingQueue_CM_Button_DeleteQueueRequest_K2Node_ComponentBoundEvent_2_OnButtonClicked__DelegateSignature();
	void Construct();
	void DisplayMatchmakingQueueNumber(int32 Number, int32 NewMatchmakingNumber, bool CallFunc_Greater_IntInt_ReturnValue, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool CallFunc_Less_IntInt_ReturnValue, bool Temp_bool_Variable, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_2, int64 CallFunc_Conv_IntToInt64_ReturnValue, ESlateVisibility K2Node_Select_Default, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue);
	void ExecuteUbergraph_WBP_MatchmakingQueue_CM(int32 EntryPoint, struct FOSSVAL_MatchmakingResult& K2Node_CustomEvent_Result, TDelegate<void(struct FOSSVAL_MatchmakingResult& Result)> K2Node_CreateDelegate_OutputDelegate, const struct FOSSVAL_MatchmakingResult& Temp_struct_Variable, int32 K2Node_Event_Number, class ULocalPlayer* CallFunc_GetOwningLocalPlayer_ReturnValue, class UVAL_AsyncAction_MatchmakingDeleteRequest* CallFunc_DeleteMatchmakingRequest_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool K2Node_Event_IsDesignTime);
	void OnDeleteQueueButtonClicked__DelegateSignature();
	void OnResultObtained_48D6A75C430B95A3FDB3FFB1703F163C(struct FOSSVAL_MatchmakingResult& Result);
	void PreConstruct(bool IsDesignTime);
	void Reset();
	void ResetQueue();
	void UpdateNumber(int32 Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MatchmakingQueue_CM_C">();
	}
	static class UWBP_MatchmakingQueue_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MatchmakingQueue_CM_C>();
	}
};
static_assert(alignof(UWBP_MatchmakingQueue_CM_C) == 0x000008, "Wrong alignment on UWBP_MatchmakingQueue_CM_C");
static_assert(sizeof(UWBP_MatchmakingQueue_CM_C) == 0x000308, "Wrong size on UWBP_MatchmakingQueue_CM_C");
static_assert(offsetof(UWBP_MatchmakingQueue_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_MatchmakingQueue_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MatchmakingQueue_CM_C, Button_DeleteQueueRequest) == 0x0002C8, "Member 'UWBP_MatchmakingQueue_CM_C::Button_DeleteQueueRequest' has a wrong offset!");
static_assert(offsetof(UWBP_MatchmakingQueue_CM_C, Overlay_MatchmakingQueue) == 0x0002D0, "Member 'UWBP_MatchmakingQueue_CM_C::Overlay_MatchmakingQueue' has a wrong offset!");
static_assert(offsetof(UWBP_MatchmakingQueue_CM_C, Text_MatchmakingQueue) == 0x0002D8, "Member 'UWBP_MatchmakingQueue_CM_C::Text_MatchmakingQueue' has a wrong offset!");
static_assert(offsetof(UWBP_MatchmakingQueue_CM_C, WBP_AnimatedLoading_Chapaa) == 0x0002E0, "Member 'UWBP_MatchmakingQueue_CM_C::WBP_AnimatedLoading_Chapaa' has a wrong offset!");
static_assert(offsetof(UWBP_MatchmakingQueue_CM_C, InitializedNumber) == 0x0002E8, "Member 'UWBP_MatchmakingQueue_CM_C::InitializedNumber' has a wrong offset!");
static_assert(offsetof(UWBP_MatchmakingQueue_CM_C, QueueNumber) == 0x0002EC, "Member 'UWBP_MatchmakingQueue_CM_C::QueueNumber' has a wrong offset!");
static_assert(offsetof(UWBP_MatchmakingQueue_CM_C, OnDeleteQueueButtonClicked) == 0x0002F0, "Member 'UWBP_MatchmakingQueue_CM_C::OnDeleteQueueButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_MatchmakingQueue_CM_C, IsInternalRequest) == 0x000300, "Member 'UWBP_MatchmakingQueue_CM_C::IsInternalRequest' has a wrong offset!");
static_assert(offsetof(UWBP_MatchmakingQueue_CM_C, ShowCancelButton) == 0x000301, "Member 'UWBP_MatchmakingQueue_CM_C::ShowCancelButton' has a wrong offset!");
static_assert(offsetof(UWBP_MatchmakingQueue_CM_C, ObtainedZeroNumberInitially) == 0x000302, "Member 'UWBP_MatchmakingQueue_CM_C::ObtainedZeroNumberInitially' has a wrong offset!");

}

