#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadingScreenBlack

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_LoadingScreenBlack.WBP_LoadingScreenBlack_C.ExecuteUbergraph_WBP_LoadingScreenBlack
// 0x0060 (0x0060 - 0x0000)
struct WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FadeTimeInSeconds;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FadeTimeInSeconds_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CFB[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CallDelegate_Duration_ImplicitCast;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CFC[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CallDelegate_Duration_ImplicitCast_1;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast_1; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack) == 0x000008, "Wrong alignment on WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack");
static_assert(sizeof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack) == 0x000060, "Wrong size on WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, EntryPoint) == 0x000000, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, K2Node_Event_FadeTimeInSeconds) == 0x000004, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::K2Node_Event_FadeTimeInSeconds' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, K2Node_Event_FadeTimeInSeconds_1) == 0x000018, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::K2Node_Event_FadeTimeInSeconds_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000028, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, K2Node_CallDelegate_Duration_ImplicitCast) == 0x000030, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::K2Node_CallDelegate_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000038, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast) == 0x000040, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, K2Node_CallDelegate_Duration_ImplicitCast_1) == 0x000048, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::K2Node_CallDelegate_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000050, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack, CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast_1) == 0x000058, "Member 'WBP_LoadingScreenBlack_C_ExecuteUbergraph_WBP_LoadingScreenBlack::CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast_1' has a wrong offset!");

// Function WBP_LoadingScreenBlack.WBP_LoadingScreenBlack_C.FadeFromBlackToNone
// 0x0004 (0x0004 - 0x0000)
struct WBP_LoadingScreenBlack_C_FadeFromBlackToNone final
{
public:
	float                                         FadeTimeInSeconds;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadingScreenBlack_C_FadeFromBlackToNone) == 0x000004, "Wrong alignment on WBP_LoadingScreenBlack_C_FadeFromBlackToNone");
static_assert(sizeof(WBP_LoadingScreenBlack_C_FadeFromBlackToNone) == 0x000004, "Wrong size on WBP_LoadingScreenBlack_C_FadeFromBlackToNone");
static_assert(offsetof(WBP_LoadingScreenBlack_C_FadeFromBlackToNone, FadeTimeInSeconds) == 0x000000, "Member 'WBP_LoadingScreenBlack_C_FadeFromBlackToNone::FadeTimeInSeconds' has a wrong offset!");

// Function WBP_LoadingScreenBlack.WBP_LoadingScreenBlack_C.FadeFromNoneToBlack
// 0x0004 (0x0004 - 0x0000)
struct WBP_LoadingScreenBlack_C_FadeFromNoneToBlack final
{
public:
	float                                         FadeTimeInSeconds;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadingScreenBlack_C_FadeFromNoneToBlack) == 0x000004, "Wrong alignment on WBP_LoadingScreenBlack_C_FadeFromNoneToBlack");
static_assert(sizeof(WBP_LoadingScreenBlack_C_FadeFromNoneToBlack) == 0x000004, "Wrong size on WBP_LoadingScreenBlack_C_FadeFromNoneToBlack");
static_assert(offsetof(WBP_LoadingScreenBlack_C_FadeFromNoneToBlack, FadeTimeInSeconds) == 0x000000, "Member 'WBP_LoadingScreenBlack_C_FadeFromNoneToBlack::FadeTimeInSeconds' has a wrong offset!");

// Function WBP_LoadingScreenBlack.WBP_LoadingScreenBlack_C.OnBlackToNoneAnimationPlayed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoadingScreenBlack_C_OnBlackToNoneAnimationPlayed__DelegateSignature final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadingScreenBlack_C_OnBlackToNoneAnimationPlayed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoadingScreenBlack_C_OnBlackToNoneAnimationPlayed__DelegateSignature");
static_assert(sizeof(WBP_LoadingScreenBlack_C_OnBlackToNoneAnimationPlayed__DelegateSignature) == 0x000008, "Wrong size on WBP_LoadingScreenBlack_C_OnBlackToNoneAnimationPlayed__DelegateSignature");
static_assert(offsetof(WBP_LoadingScreenBlack_C_OnBlackToNoneAnimationPlayed__DelegateSignature, Duration) == 0x000000, "Member 'WBP_LoadingScreenBlack_C_OnBlackToNoneAnimationPlayed__DelegateSignature::Duration' has a wrong offset!");

// Function WBP_LoadingScreenBlack.WBP_LoadingScreenBlack_C.OnNoneToBlackAnimationPlayed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoadingScreenBlack_C_OnNoneToBlackAnimationPlayed__DelegateSignature final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadingScreenBlack_C_OnNoneToBlackAnimationPlayed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoadingScreenBlack_C_OnNoneToBlackAnimationPlayed__DelegateSignature");
static_assert(sizeof(WBP_LoadingScreenBlack_C_OnNoneToBlackAnimationPlayed__DelegateSignature) == 0x000008, "Wrong size on WBP_LoadingScreenBlack_C_OnNoneToBlackAnimationPlayed__DelegateSignature");
static_assert(offsetof(WBP_LoadingScreenBlack_C_OnNoneToBlackAnimationPlayed__DelegateSignature, Duration) == 0x000000, "Member 'WBP_LoadingScreenBlack_C_OnNoneToBlackAnimationPlayed__DelegateSignature::Duration' has a wrong offset!");

// Function WBP_LoadingScreenBlack.WBP_LoadingScreenBlack_C.GetFadeFromBlackAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoadingScreenBlack_C_GetFadeFromBlackAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoadingScreenBlack_C_GetFadeFromBlackAnimation) == 0x000008, "Wrong alignment on WBP_LoadingScreenBlack_C_GetFadeFromBlackAnimation");
static_assert(sizeof(WBP_LoadingScreenBlack_C_GetFadeFromBlackAnimation) == 0x000008, "Wrong size on WBP_LoadingScreenBlack_C_GetFadeFromBlackAnimation");
static_assert(offsetof(WBP_LoadingScreenBlack_C_GetFadeFromBlackAnimation, ReturnValue) == 0x000000, "Member 'WBP_LoadingScreenBlack_C_GetFadeFromBlackAnimation::ReturnValue' has a wrong offset!");

}

