#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterSelectorHUD_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Palia_structs.hpp"
#include "ValeriaDTOs_structs.hpp"
#include "S6UICore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Engine_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "S6Core_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterSelectorHUD_CM.WBP_CharacterSelectorHUD_CM_C.BndEvt__WBP_CharacterSelectorHUD_CM_DebugButton_Unlink_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_DebugButton_Unlink_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_DebugButton_Unlink_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_DebugButton_Unlink_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_DebugButton_Unlink_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_DebugButton_Unlink_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_DebugButton_Unlink_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_DebugButton_Unlink_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterSelectorHUD_CM.WBP_CharacterSelectorHUD_CM_C.BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterSelectorHUD_CM.WBP_CharacterSelectorHUD_CM_C.BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_ExitButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterSelectorHUD_CM.WBP_CharacterSelectorHUD_CM_C.BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterSelectorHUD_CM.WBP_CharacterSelectorHUD_CM_C.BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_OptionsButton_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterSelectorHUD_CM.WBP_CharacterSelectorHUD_CM_C.BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_173_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_173_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_173_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_173_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_173_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_173_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_173_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_173_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterSelectorHUD_CM.WBP_CharacterSelectorHUD_CM_C.BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_CM_WBP_Template_Button_CM_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterSelectorHUD_CM.WBP_CharacterSelectorHUD_CM_C.BndEvt__WBP_CharacterSelectorHUD_ServerTypeSelector_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_ServerTypeSelector_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_ServerTypeSelector_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_ServerTypeSelector_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_ServerTypeSelector_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_ServerTypeSelector_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_ServerTypeSelector_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_ServerTypeSelector_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_ServerTypeSelector_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_CharacterSelectorHUD_CM_C_BndEvt__WBP_CharacterSelectorHUD_ServerTypeSelector_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_CharacterSelectorHUD_CM.WBP_CharacterSelectorHUD_CM_C.DisplayMatchmakingQueueActive
// 0x0018 (0x0018 - 0x0000)
struct WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWindowsPlatform_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3398[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive) == 0x000008, "Wrong alignment on WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive");
static_assert(sizeof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive) == 0x000018, "Wrong size on WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive, IsActive) == 0x000000, "Member 'WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive::IsActive' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive, Temp_byte_Variable) == 0x000001, "Member 'WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive, Temp_bool_Variable) == 0x000003, "Member 'WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive, CallFunc_IsWindowsPlatform_ReturnValue) == 0x000004, "Member 'WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive::CallFunc_IsWindowsPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive, K2Node_Select_Default) == 0x000008, "Member 'WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive, K2Node_Select_Default_1) == 0x000010, "Member 'WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueActive::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_CharacterSelectorHUD_CM.WBP_CharacterSelectorHUD_CM_C.DisplayMatchmakingQueueNumber
// 0x0004 (0x0004 - 0x0000)
struct WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueNumber final
{
public:
	int32                                         Number;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueNumber) == 0x000004, "Wrong alignment on WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueNumber");
static_assert(sizeof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueNumber) == 0x000004, "Wrong size on WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueNumber");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueNumber, Number) == 0x000000, "Member 'WBP_CharacterSelectorHUD_CM_C_DisplayMatchmakingQueueNumber::Number' has a wrong offset!");

// Function WBP_CharacterSelectorHUD_CM.WBP_CharacterSelectorHUD_CM_C.ExecuteUbergraph_WBP_CharacterSelectorHUD_CM
// 0x0550 (0x0550 - 0x0000)
struct WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3399[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339A[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Temp_string_Variable;                              // 0x0040(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  K2Node_CustomEvent_ModalWidget;                    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CrossplayNotification_Console_C*   K2Node_DynamicCast_AsWBP_Crossplay_Notification_Console; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339B[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339C[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bQueryResult;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339D[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bQueryResult)>            K2Node_CreateDelegate_OutputDelegate_5;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339E[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOSSVAL_AsyncActionQueryUserPrivileges* CallFunc_QueryUserPrivileges_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339F[0x2];                                     // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName SessionName)>      K2Node_CreateDelegate_OutputDelegate_6;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A0[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintSessionResult                CallFunc_GetSelectedInstanceOption_Session;        // 0x0100(0x0120)()
	TDelegate<void(const class FString& CharacterName, int32 LocalUserNum, const struct FGuid& CharacterId)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ETravelManagerStatus NewStatus)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0230(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A1[0x3];                                     // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A2[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0268(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A3[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02D0(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A4[0x6];                                     // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsS6UI_Modal_Widget_Base;  // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A5[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A6[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0320(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A7[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0338(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A8[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_RedirectModalType_ReturnValue;            // 0x0388(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x03C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue_1;         // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_RedirectModalType_ReturnValue_1;          // 0x03E0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UTravelManager*                         CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_ModalWidgetBase*                  CallFunc_Create_ReturnValue;                       // 0x0418(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0420(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsExpanded_ReturnValue;                // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A9[0x3];                                     // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x042C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AA[0x4];                                     // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0440(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AB[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_4;    // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0458(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0460(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ServerType;                     // 0x0468(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0488(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AC[0x4];                                     // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsS6UI_Modal_Widget_Base_1; // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AD[0x6];                                     // 0x04B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_ModalWidgetBase*                  CallFunc_Create_ReturnValue_1;                     // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AE[0x3];                                     // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXSXPlatform_ReturnValue;                // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS5Platform_ReturnValue;                // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AF[0x4];                                     // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_AsyncAction_OpenModal*            CallFunc_OpenModal_ReturnValue;                    // 0x04E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x04E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B0[0x7];                                     // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_2; // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_3; // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B1[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0518(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B2[0x7];                                     // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM) == 0x000008, "Wrong alignment on WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM");
static_assert(sizeof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM) == 0x000550, "Wrong size on WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, EntryPoint) == 0x000000, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000038, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, Temp_string_Variable) == 0x000040, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CustomEvent_ModalWidget) == 0x000060, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CustomEvent_ModalWidget' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, Temp_object_Variable) == 0x000078, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_DynamicCast_AsWBP_Crossplay_Notification_Console) == 0x000090, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_DynamicCast_AsWBP_Crossplay_Notification_Console' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CreateDelegate_OutputDelegate_3) == 0x00009C, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B0, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B8, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CustomEvent_bQueryResult) == 0x0000C8, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CustomEvent_bQueryResult' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000CC, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, Temp_bool_Variable) == 0x0000DC, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_QueryUserPrivileges_ReturnValue) == 0x0000E0, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_QueryUserPrivileges_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, Temp_bool_Has_Been_Initd_Variable) == 0x0000E9, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000EC, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_GetSelectedInstanceOption_Session) == 0x000100, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_GetSelectedInstanceOption_Session' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CreateDelegate_OutputDelegate_7) == 0x000220, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CreateDelegate_OutputDelegate_8) == 0x000230, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_ComponentBoundEvent_SelectedItem) == 0x000240, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_ComponentBoundEvent_SelectionType) == 0x000250, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, Temp_int_Variable) == 0x000254, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000258, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000260, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_MakeStruct_FormatArgumentData) == 0x000268, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_MakeArray_Array) == 0x0002B8, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_IsEmpty_ReturnValue) == 0x0002C8, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_Format_ReturnValue) == 0x0002D0, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_Not_PreBool_ReturnValue) == 0x0002E8, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, Temp_bool_IsClosed_Variable) == 0x0002E9, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, Temp_class_Variable) == 0x0002F0, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_ClassDynamicCast_AsS6UI_Modal_Widget_Base) == 0x0002F8, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_ClassDynamicCast_AsS6UI_Modal_Widget_Base' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_ClassDynamicCast_bSuccess) == 0x000300, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_GetPlayerController_ReturnValue) == 0x000308, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000310, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x000314, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x000318, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CustomEvent_Loaded) == 0x000320, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_AkEventGlobal_ReturnValue_3) == 0x000328, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_AkEventGlobal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000330, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_CreateDelegate_OutputDelegate_9) == 0x000338, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_Event_IsDesignTime) == 0x000348, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_ComponentBoundEvent_Button_6) == 0x000350, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM, K2Node_ComponentBoundEvent_Button_5) == 0x000358, "Member 'WBP_CharacterSelectorHUD_CM_C_ExecuteUbergraph_WBP_CharacterSelectorHUD_CM::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
